[
  {
    "id": 3607,
    "surahId": 34,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِی لَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِ وَلَهُ ٱلۡحَمۡدُ فِی ٱلۡـَٔاخِرَةِۚ وَهُوَ ٱلۡحَكِیمُ ٱلۡخَبِیرُ\n",
    "translations": {
      "en": "ALL PRAISE is due to God, to whom all that is in the heavens and all that is on earth belongs; and to Him will be due all praise in the life to come. For He alone is truly wise, all-aware:",
      "ms": "Segala puji tertentu bagi Allah yang memiliki dan menguasai segala yang ada di langit dan yang ada di bumi, dan bagiNyalah juga segala puji di akhirat; dan Dia lah sahaja Yang Maha Bijaksana, lagi Maha Mendalam pengetahuanNya.",
      "id": "Segala puji bagi Allah yang memiliki apa yang di langit dan apa yang di bumi dan bagi-Nya (pula) segala puji di akhirat. Dan Dialah Yang Maha Bijaksana lagi Maha Mengetahui.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِی لَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِ وَلَهُ ٱلۡحَمۡدُ فِی ٱلۡـَٔاخِرَةِۚ وَهُوَ ٱلۡحَكِیمُ ٱلۡخَبِیرُ\n"
    }
  },
  {
    "id": 3608,
    "surahId": 34,
    "ayahNumber": 2,
    "arabicText": "یَعۡلَمُ مَا یَلِجُ فِی ٱلۡأَرۡضِ وَمَا یَخۡرُجُ مِنۡهَا وَمَا یَنزِلُ مِنَ ٱلسَّمَاۤءِ وَمَا یَعۡرُجُ فِیهَاۚ وَهُوَ ٱلرَّحِیمُ ٱلۡغَفُورُ\n",
    "translations": {
      "en": "He knows all that enters the earth, and all that comes out of it, as well as all that descends from the skies, and all that ascends to them. And He alone is a dispenser of grace, truly-forgiving.",
      "ms": "Ia mengetahui apa yang masuk ke bumi serta apa yang keluar daripadanya, dan apa yang turun dari langit serta apa yang naik kepadanya; dan Dia lah jua yang Maha Mengasihani, lagi Maha Pengampun.",
      "id": "Dia mengetahui apa yang masuk ke dalam bumi, apa yang ke luar daripadanya, apa yang turun dari langit dan apa yang naik kepadanya. Dan Dialah Yang Maha Penyayang lagi Maha Pengampun.",
      "ar": "یَعۡلَمُ مَا یَلِجُ فِی ٱلۡأَرۡضِ وَمَا یَخۡرُجُ مِنۡهَا وَمَا یَنزِلُ مِنَ ٱلسَّمَاۤءِ وَمَا یَعۡرُجُ فِیهَاۚ وَهُوَ ٱلرَّحِیمُ ٱلۡغَفُورُ\n"
    }
  },
  {
    "id": 3609,
    "surahId": 34,
    "ayahNumber": 3,
    "arabicText": "وَقَالَ ٱلَّذِینَ كَفَرُوا۟ لَا تَأۡتِینَا ٱلسَّاعَةُۖ قُلۡ بَلَىٰ وَرَبِّی لَتَأۡتِیَنَّكُمۡ عَـٰلِمِ ٱلۡغَیۡبِۖ لَا یَعۡزُبُ عَنۡهُ مِثۡقَالُ ذَرَّةࣲ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَلَا فِی ٱلۡأَرۡضِ وَلَاۤ أَصۡغَرُ مِن ذَ ٰ⁠لِكَ وَلَاۤ أَكۡبَرُ إِلَّا فِی كِتَـٰبࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "And yet, they who are bent on denying the truth assert, “Never will the Last Hour come upon us!” Say: “Nay, by my Sustainer! By Him who knows all that is beyond the reach of a created being’s perception: it will most certainly come upon you!” Not an atom’s weight [of whatever there is] in the heavens or on earth escapes His knowledge; and neither is there anything smaller than that, or larger, but is recorded in [His] clear decree,",
      "ms": "Dan orang-orang yang kafir berkata:\" Hari kiamat itu tidak akan datang kepada kami\". Katakanlah (wahai Muhammad): \"Bahkan (tetap datang). Demi Tuhanku yang mengetahui segala perkara yang ghaib, hari kiamat itu sesungguhnya akan datang kepada kamu\". Tiada tersembunyi dari pengetahuanNya barang seberat debu yang ada di langit atau di bumi, dan tidak ada yang lebih kecil dari itu atau yang lebih besar melainkan semuanya tertulis di dalam Kitab yang terang nyata.",
      "id": "Dan orang-orang yang kafir berkata: \"Hari berbangkit itu tidak akan datang kepada kami\". Katakanlah: \"Pasti datang, demi Tuhanku Yang Mengetahui yang ghaib, sesungguhnya kiamat itu pasti akan datang kepadamu. Tidak ada tersembunyi daripada-Nya sebesar zarrahpun yang ada di langit dan yang ada di bumi dan tidak ada (pula) yang lebih kecil dari itu dan yang lebih besar, melainkan tersebut dalam Kitab yang nyata (Lauh Mahfuzh)\",",
      "ar": "وَقَالَ ٱلَّذِینَ كَفَرُوا۟ لَا تَأۡتِینَا ٱلسَّاعَةُۖ قُلۡ بَلَىٰ وَرَبِّی لَتَأۡتِیَنَّكُمۡ عَـٰلِمِ ٱلۡغَیۡبِۖ لَا یَعۡزُبُ عَنۡهُ مِثۡقَالُ ذَرَّةࣲ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَلَا فِی ٱلۡأَرۡضِ وَلَاۤ أَصۡغَرُ مِن ذَ ٰ⁠لِكَ وَلَاۤ أَكۡبَرُ إِلَّا فِی كِتَـٰبࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 3610,
    "surahId": 34,
    "ayahNumber": 4,
    "arabicText": "لِّیَجۡزِیَ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِۚ أُو۟لَـٰۤىِٕكَ لَهُم مَّغۡفِرَةࣱ وَرِزۡقࣱ كَرِیمࣱ\n",
    "translations": {
      "en": "to the end that He may reward those who believe and do right­eous deeds: [for] it is they whom forgiveness of sins awaits, and a most excellent sustenance",
      "ms": "(Kedatangan hari kiamat itu) supaya Tuhan membalas orang-orang yang beriman dan beramal soleh; mereka itu akan beroleh keampunan dan limpah kurnia yang mulia.",
      "id": "supaya Allah memberi balasan kepada orang-orang yang beriman dan mengerjakan amal yang saleh. Mereka itu adalah orang-orang yang baginya ampunan dan rezeki yang mulia.",
      "ar": "لِّیَجۡزِیَ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِۚ أُو۟لَـٰۤىِٕكَ لَهُم مَّغۡفِرَةࣱ وَرِزۡقࣱ كَرِیمࣱ\n"
    }
  },
  {
    "id": 3611,
    "surahId": 34,
    "ayahNumber": 5,
    "arabicText": "وَٱلَّذِینَ سَعَوۡ فِیۤ ءَایَـٰتِنَا مُعَـٰجِزِینَ أُو۟لَـٰۤىِٕكَ لَهُمۡ عَذَابࣱ مِّن رِّجۡزٍ أَلِیمࣱ\n",
    "translations": {
      "en": "whereas for those who strive against Our messages, seeking to defeat their purpose, there is grievous suffering in store as an outcome of [their] vileness.",
      "ms": "Dan (sebaliknya) orang-orang yang berusaha menentang dan membatalkan ayat-ayat keterangan Kami sambil menyangka dapat melepaskan diri (dari hukuman Kami), - mereka itu akan beroleh azab dari jenis azab seksa yang tidak terperi sakitnya.",
      "id": "Dan orang-orang yang berusaha untuk (menentang) ayat-ayat Kami dengan anggapan mereka dapat melemahkan (menggagalkan azab Kami), mereka itu memperoleh azab, yaitu (jenis) azab yang pedih.",
      "ar": "وَٱلَّذِینَ سَعَوۡ فِیۤ ءَایَـٰتِنَا مُعَـٰجِزِینَ أُو۟لَـٰۤىِٕكَ لَهُمۡ عَذَابࣱ مِّن رِّجۡزٍ أَلِیمࣱ\n"
    }
  },
  {
    "id": 3612,
    "surahId": 34,
    "ayahNumber": 6,
    "arabicText": "وَیَرَى ٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ ٱلَّذِیۤ أُنزِلَ إِلَیۡكَ مِن رَّبِّكَ هُوَ ٱلۡحَقَّ وَیَهۡدِیۤ إِلَىٰ صِرَ ٰ⁠طِ ٱلۡعَزِیزِ ٱلۡحَمِیدِ\n",
    "translations": {
      "en": "NOW THEY who are endowed with [innate] knowl­edge are well aware that whatever has been be­stowed upon thee from on high by thy Sustainer is indeed the truth, and that it guides onto the way that leads to the Almighty, the One to whom all praise is due!",
      "ms": "Dan orang-orang yang diberi ilmu pengetahuan, mengetahui (dengan yakin, bahawa keterangan-keterangan) yang diturunkan kepadamu dari Tuhanmu (mengenai hari kiamat dan lain-lainnya) itulah yang benar serta yang memimpin ke jalan Allah Yang Maha Kuasa, lagi Maha Terpuji.",
      "id": "Dan orang-orang yang diberi ilmu (Ahli Kitab) berpendapat bahwa wahyu yang diturunkan kepadamu dari Tuhanmu itulah yang benar dan menunjuki (manusia) kepada jalan Tuhan Yang Maha Perkasa lagi Maha Terpuji.",
      "ar": "وَیَرَى ٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ ٱلَّذِیۤ أُنزِلَ إِلَیۡكَ مِن رَّبِّكَ هُوَ ٱلۡحَقَّ وَیَهۡدِیۤ إِلَىٰ صِرَ ٰ⁠طِ ٱلۡعَزِیزِ ٱلۡحَمِیدِ\n"
    }
  },
  {
    "id": 3613,
    "surahId": 34,
    "ayahNumber": 7,
    "arabicText": "وَقَالَ ٱلَّذِینَ كَفَرُوا۟ هَلۡ نَدُلُّكُمۡ عَلَىٰ رَجُلࣲ یُنَبِّئُكُمۡ إِذَا مُزِّقۡتُمۡ كُلَّ مُمَزَّقٍ إِنَّكُمۡ لَفِی خَلۡقࣲ جَدِیدٍ\n",
    "translations": {
      "en": "As against this, they who are bent on denying the truth say [unto all who are of like mind]: “Shall we point out to you a man who will tell you that [after your death,] when you will have been scattered in countless fragments, you shall - lo and behold! - be [restored to life] in a new act of creation?",
      "ms": "Dan orang-orang yang kafir pula berkata (sesama sendiri secara mengejek-ejek): \"Mahukah, kami tunjukkan kepada kamu seorang lelaki yang memberitakan kepada kamu: ` (Bahawa apabila kamu dihancurkan sehancur-hanurnya sesudah mati), sesungguhnya kamu akan dihidupkan semula dalam bentuk kejadian yang baru? '",
      "id": "Dan orang-orang kafir berkata (kepada teman-temannya). \"Maukah kamu kami tunjukkan kepadamu seorang laki-laki yang memberitakan kepadamu bahwa apabila badanmu telah hancur sehancur-hancurnya, sesungguhnya kamu benar-benar (akan dibangkitkan kembali) dalam ciptaan yang baru?",
      "ar": "وَقَالَ ٱلَّذِینَ كَفَرُوا۟ هَلۡ نَدُلُّكُمۡ عَلَىٰ رَجُلࣲ یُنَبِّئُكُمۡ إِذَا مُزِّقۡتُمۡ كُلَّ مُمَزَّقٍ إِنَّكُمۡ لَفِی خَلۡقࣲ جَدِیدٍ\n"
    }
  },
  {
    "id": 3614,
    "surahId": 34,
    "ayahNumber": 8,
    "arabicText": "أَفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَم بِهِۦ جِنَّةُۢۗ بَلِ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ فِی ٱلۡعَذَابِ وَٱلضَّلَـٰلِ ٱلۡبَعِیدِ\n",
    "translations": {
      "en": "Does he [knowingly] attribute his own lying inventions to God - or is he a madman?” Nay, [there is no madness in this Prophet -] but they who will not believe in the life to come are [bound to lose themselves] in suffering and in a profound aberration.",
      "ms": "\"Adakah ia berdusta terhadap Allah, atau ia kena penyakit gila?\" (Tidak ada satupun) bahkan orang-orang yang tidak percaya kepada hari akhirat tetap beroleh (di sana) azab seksa yang seburuk-buruknya dan (di sini) tetap berada dalam kesesatan yang jauh terpesong.",
      "id": "Apakah dia mengada-adakan kebohongan terhadap Allah ataukah ada padanya penyakit gila?\" (Tidak), tetapi orang-orang yang tidak beriman kepada negeri akhirat berada dalam siksaan dan kesesatan yang jauh.",
      "ar": "أَفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَم بِهِۦ جِنَّةُۢۗ بَلِ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ فِی ٱلۡعَذَابِ وَٱلضَّلَـٰلِ ٱلۡبَعِیدِ\n"
    }
  },
  {
    "id": 3615,
    "surahId": 34,
    "ayahNumber": 9,
    "arabicText": "أَفَلَمۡ یَرَوۡا۟ إِلَىٰ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُم مِّنَ ٱلسَّمَاۤءِ وَٱلۡأَرۡضِۚ إِن نَّشَأۡ نَخۡسِفۡ بِهِمُ ٱلۡأَرۡضَ أَوۡ نُسۡقِطۡ عَلَیۡهِمۡ كِسَفࣰا مِّنَ ٱلسَّمَاۤءِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّكُلِّ عَبۡدࣲ مُّنِیبࣲ\n",
    "translations": {
      "en": "Are they, then, not aware of how little of the sky and the earth lies open before them, and how much is hidden from them? [or that,] if We so willed, We could cause the earth to swallow them, or cause fragments of the sky to fall down upon them? In all this, behold, there is a message indeed for every servant [of God] who is wont to turn unto Him [in repentance].",
      "ms": "(Setelah mereka mengejek-ejek dan membuat tuduhan-tuduhan itu) tidakkah mereka melihat apa yang ada di hadapan mereka dan yang ada di belakang mereka dari langit dan bumi (dapatkah mereka melarikan diri)? Jika Kami kehendaki nescaya Kami timbuskan mereka di bumi, atau Kami gugurkan atas mereka ketul-ketul dan serpihan-serpihan dari langit (yang akan membinasakan mereka). Sesungguhnya yang demikian mengandungi satu tanda (yang memberi keinsafan) bagi tiap-tiap hamba Allah yang mahu kembali kepadanya (dengan taat dan berbakti).",
      "id": "Maka apakah mereka tidak melihat langit dan bumi yang ada di hadapan dan di belakang mereka? Jika Kami menghendaki, niscaya Kami benamkan mereka di bumi atau Kami jatuhkan kepada mereka gumpalan dari langit. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda (kekuasaan Tuhan) bagi setiap hamba yang kembali (kepada-Nya).",
      "ar": "أَفَلَمۡ یَرَوۡا۟ إِلَىٰ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُم مِّنَ ٱلسَّمَاۤءِ وَٱلۡأَرۡضِۚ إِن نَّشَأۡ نَخۡسِفۡ بِهِمُ ٱلۡأَرۡضَ أَوۡ نُسۡقِطۡ عَلَیۡهِمۡ كِسَفࣰا مِّنَ ٱلسَّمَاۤءِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّكُلِّ عَبۡدࣲ مُّنِیبࣲ\n"
    }
  },
  {
    "id": 3616,
    "surahId": 34,
    "ayahNumber": 10,
    "arabicText": "۞ وَلَقَدۡ ءَاتَیۡنَا دَاوُۥدَ مِنَّا فَضۡلࣰاۖ یَـٰجِبَالُ أَوِّبِی مَعَهُۥ وَٱلطَّیۡرَۖ وَأَلَنَّا لَهُ ٱلۡحَدِیدَ\n",
    "translations": {
      "en": "AND [thus], indeed, did We grace David with Our favour: “O you mountains! Sing with him the praise of God! And [likewise] you birds!” And We softened all sharpness in him,",
      "ms": "Dan demi sesungguhnya, Kami telah memberikan kepada Nabi Daud limpah kurnia dari Kami (sambil Kami berfirman): \"Hai gunung-ganang, ulang-ulangilah mengucap tasbih bersama-sama dengan Nabi Daud, dan wahai burung-burung (bertasbihlah bersama-sama dengannya)!\" Dan juga telah melembutkan besi baginya;",
      "id": "Dan sesungguhnya telah Kami berikan kepada Daud kurnia dari Kami. (Kami berfirman): \"Hai gunung-gunung dan burung-burung, bertasbihlah berulang-ulang bersama Daud\", dan Kami telah melunakkan besi untuknya,",
      "ar": "۞ وَلَقَدۡ ءَاتَیۡنَا دَاوُۥدَ مِنَّا فَضۡلࣰاۖ یَـٰجِبَالُ أَوِّبِی مَعَهُۥ وَٱلطَّیۡرَۖ وَأَلَنَّا لَهُ ٱلۡحَدِیدَ\n"
    }
  },
  {
    "id": 3617,
    "surahId": 34,
    "ayahNumber": 11,
    "arabicText": "أَنِ ٱعۡمَلۡ سَـٰبِغَـٰتࣲ وَقَدِّرۡ فِی ٱلسَّرۡدِۖ وَٱعۡمَلُوا۟ صَـٰلِحًاۖ إِنِّی بِمَا تَعۡمَلُونَ بَصِیرࣱ\n",
    "translations": {
      "en": "[and inspired him thus:] “Do good deeds lavishly, without stint, and give deep thought to their steady flow.” And [thus should you all, O believers,] do righteous deeds: for, verily, I see all that you do!",
      "ms": "(Serta Kami wahyukan kepadanya): \"Buatlah baju-baju besi yang luas labuh, dan sempurnakanlah jalinannya sekadar yang dikehendaki; dan kerjakanlah kamu (wahai Daud dan umatmu) amal-amal yang soleh, sesungguhnya Aku Maha Melihat akan segala yang kamu kerjakan\".",
      "id": "(yaitu) buatlah baju besi yang besar-besar dan ukurlah anyamannya; dan kerjakanlah amalan yang saleh. Sesungguhnya Aku melihat apa yang kamu kerjakan.",
      "ar": "أَنِ ٱعۡمَلۡ سَـٰبِغَـٰتࣲ وَقَدِّرۡ فِی ٱلسَّرۡدِۖ وَٱعۡمَلُوا۟ صَـٰلِحًاۖ إِنِّی بِمَا تَعۡمَلُونَ بَصِیرࣱ\n"
    }
  },
  {
    "id": 3618,
    "surahId": 34,
    "ayahNumber": 12,
    "arabicText": "وَلِسُلَیۡمَـٰنَ ٱلرِّیحَ غُدُوُّهَا شَهۡرࣱ وَرَوَاحُهَا شَهۡرࣱۖ وَأَسَلۡنَا لَهُۥ عَیۡنَ ٱلۡقِطۡرِۖ وَمِنَ ٱلۡجِنِّ مَن یَعۡمَلُ بَیۡنَ یَدَیۡهِ بِإِذۡنِ رَبِّهِۦۖ وَمَن یَزِغۡ مِنۡهُمۡ عَنۡ أَمۡرِنَا نُذِقۡهُ مِنۡ عَذَابِ ٱلسَّعِیرِ\n",
    "translations": {
      "en": "AND UNTO Solomon [We made subservient] the wind: its morning course [covered the distance of] a month’s journey, and its evening course, a month’s journey. And We caused a fountain of molten copper to flow at his behest; and [even] among the invisible beings there were some that had [been constrained] to labour for him by his Sustainer’s leave and whichever of them deviated from Our command, him would We let taste suffering through a blazing flame -:",
      "ms": "Dan Kami kurniakan kepada Nabi Sulaiman kuasa menggunakan angin untuk perjalanannya: sepagi perjalanannya adalah menyamai perjalanan biasa sebulan, dan sepetang perjalanannya adalah menyamai perjalanan biasa sebulan; dan Kami alirkan baginya matair dari tembaga; dan (Kami mudahkan) sebahagian dari jin untuk bekerja di hadapannya dengan izin Tuhannya. Dan sesiapa dari jin itu yang menyeleweng dari perintah Kami, Kami akan merasakannya (pukulan) dari azab api neraka.",
      "id": "Dan Kami (tundukkan) angin bagi Sulaiman, yang perjalanannya di waktu pagi sama dengan perjalanan sebulan dan perjalanannya di waktu sore sama dengan perjalanan sebulan (pula) dan Kami alirkan cairan tembaga baginya. Dan sebahagian dari jin ada yang bekerja di hadapannya (di bawah kekuasaannya) dengan izin Tuhannya. Dan siapa yang menyimpang di antara mereka dari perintah Kami, Kami rasakan kepadanya azab neraka yang apinya menyala-nyala.",
      "ar": "وَلِسُلَیۡمَـٰنَ ٱلرِّیحَ غُدُوُّهَا شَهۡرࣱ وَرَوَاحُهَا شَهۡرࣱۖ وَأَسَلۡنَا لَهُۥ عَیۡنَ ٱلۡقِطۡرِۖ وَمِنَ ٱلۡجِنِّ مَن یَعۡمَلُ بَیۡنَ یَدَیۡهِ بِإِذۡنِ رَبِّهِۦۖ وَمَن یَزِغۡ مِنۡهُمۡ عَنۡ أَمۡرِنَا نُذِقۡهُ مِنۡ عَذَابِ ٱلسَّعِیرِ\n"
    }
  },
  {
    "id": 3619,
    "surahId": 34,
    "ayahNumber": 13,
    "arabicText": "یَعۡمَلُونَ لَهُۥ مَا یَشَاۤءُ مِن مَّحَـٰرِیبَ وَتَمَـٰثِیلَ وَجِفَانࣲ كَٱلۡجَوَابِ وَقُدُورࣲ رَّاسِیَـٰتٍۚ ٱعۡمَلُوۤا۟ ءَالَ دَاوُۥدَ شُكۡرࣰاۚ وَقَلِیلࣱ مِّنۡ عِبَادِیَ ٱلشَّكُورُ\n",
    "translations": {
      "en": "they made for him whatever he wished of sanctuaries, and statues, and basins as [large as] great watering - troughs, and cauldrons firmly anchored. [And We said:] “Labour, O David’s people, in gratitude [towards Me] and [remember that] few are the truly grateful [even] among My servants!”",
      "ms": "Golongan jin itu membuat untuk Nabi Sulaiman apa yang ia kehendaki dari bangunan-bangunan yang tinggi, dan patung-patung, dan pinggan-pinggan hidangan yang besar seperti kolam, serta periuk-periuk besar yang tetap di atas tukunya. (Setelah itu Kami perintahkan): \"Beramalah kamu wahai keluarga Daud untuk bersyukur!\" Dan sememangnya sedikit sekali di antara hamba-hambaKu yang bersyukur.",
      "id": "Para jin itu membuat untuk Sulaiman apa yang dikehendakinya dari gedung-gedung yang tinggi dan patung-patung dan piring-piring yang (besarnya) seperti kolam dan periuk yang tetap (berada di atas tungku). Bekerjalah hai keluarga Daud untuk bersyukur (kepada Allah). Dan sedikit sekali dari hamba-hamba-Ku yang berterima kasih.",
      "ar": "یَعۡمَلُونَ لَهُۥ مَا یَشَاۤءُ مِن مَّحَـٰرِیبَ وَتَمَـٰثِیلَ وَجِفَانࣲ كَٱلۡجَوَابِ وَقُدُورࣲ رَّاسِیَـٰتٍۚ ٱعۡمَلُوۤا۟ ءَالَ دَاوُۥدَ شُكۡرࣰاۚ وَقَلِیلࣱ مِّنۡ عِبَادِیَ ٱلشَّكُورُ\n"
    }
  },
  {
    "id": 3620,
    "surahId": 34,
    "ayahNumber": 14,
    "arabicText": "فَلَمَّا قَضَیۡنَا عَلَیۡهِ ٱلۡمَوۡتَ مَا دَلَّهُمۡ عَلَىٰ مَوۡتِهِۦۤ إِلَّا دَاۤبَّةُ ٱلۡأَرۡضِ تَأۡكُلُ مِنسَأَتَهُۥۖ فَلَمَّا خَرَّ تَبَیَّنَتِ ٱلۡجِنُّ أَن لَّوۡ كَانُوا۟ یَعۡلَمُونَ ٱلۡغَیۡبَ مَا لَبِثُوا۟ فِی ٱلۡعَذَابِ ٱلۡمُهِینِ\n",
    "translations": {
      "en": "Yet [even Solomon had to die; but] when We decreed that he should die, nothing showed them that he was dead except an earthworm that gnawed away his staff. And when he fell to the ground, those invisible beings [subservient to him] saw clearly that, had they but understood the reality which was be­yond the reach of their perception, they would not have continued [to toil] in the shameful suffering [of servitude]",
      "ms": "Setelah Kami tetapkan berlakunya kematian Nabi Sulaiman, tidak ada yang menunjukkan kepada mereka tentang kematiannya melainkan semut putih (anai-anai) yang telah memakan tongkatnya. Maka apabila ia tumbang, ternyatalah kepada golongan jin itu, bahawa kalaulah mereka sedia, mengetahui perkara yang ghaib nescaya mereka tidak tinggal sedemikian lamanya di dalam azab (kerja berat) yang menghina.",
      "id": "Maka tatkala Kami telah menetapkan kematian Sulaiman, tidak ada yang menunjukkan kepada mereka kematiannya itu kecuali rayap yang memakan tongkatnya. Maka tatkala ia telah tersungkur, tahulah jin itu bahwa kalau sekiranya mereka mengetahui yang ghaib tentulah mereka tidak akan tetap dalam siksa yang menghinakan.",
      "ar": "فَلَمَّا قَضَیۡنَا عَلَیۡهِ ٱلۡمَوۡتَ مَا دَلَّهُمۡ عَلَىٰ مَوۡتِهِۦۤ إِلَّا دَاۤبَّةُ ٱلۡأَرۡضِ تَأۡكُلُ مِنسَأَتَهُۥۖ فَلَمَّا خَرَّ تَبَیَّنَتِ ٱلۡجِنُّ أَن لَّوۡ كَانُوا۟ یَعۡلَمُونَ ٱلۡغَیۡبَ مَا لَبِثُوا۟ فِی ٱلۡعَذَابِ ٱلۡمُهِینِ\n"
    }
  },
  {
    "id": 3621,
    "surahId": 34,
    "ayahNumber": 15,
    "arabicText": "لَقَدۡ كَانَ لِسَبَإࣲ فِی مَسۡكَنِهِمۡ ءَایَةࣱۖ جَنَّتَانِ عَن یَمِینࣲ وَشِمَالࣲۖ كُلُوا۟ مِن رِّزۡقِ رَبِّكُمۡ وَٱشۡكُرُوا۟ لَهُۥۚ بَلۡدَةࣱ طَیِّبَةࣱ وَرَبٌّ غَفُورࣱ\n",
    "translations": {
      "en": "INDEED, in [the luxuriant beauty of] their homeland, the people of Sheba had an evidence [of God’s grace] two [vast expanses of] gardens, to the right and to the left, [calling out to them, as it were:] “Eat of what your Sustainer has provided for you, and render thanks unto Him: a land most goodly, and a Sustainer much-forgiving!”",
      "ms": "Demi sesungguhnya, adalah bagi penduduk negeri Saba', satu tanda (yang membuktikan kemurahan Allah) yang terdapat di tempat tinggal mereka, iaitu: dua kumpulan kebun (yang luas lagi subur), yang terletak di sebelah kanan dan di sebelah kiri (kampung mereka). (Lalu dikatakan kepada mereka): \"Makanlah dari rezeki pemberian Tuhan kamu dan bersyukurlah kepadaNya; (negeri kamu ini adalah) negeri yang baik (aman dan makmur), dan (Tuhan kamu adalah) Tuhan yang Maha Pengampun!.",
      "id": "Sesungguhnya bagi kaum Saba' ada tanda (kekuasaan Tuhan) di tempat kediaman mereka yaitu dua buah kebun di sebelah kanan dan di sebelah kiri. (kepada mereka dikatakan): \"Makanlah olehmu dari rezeki yang (dianugerahkan) Tuhanmu dan bersyukurlah kamu kepada-Nya. (Negerimu) adalah negeri yang baik dan (Tuhanmu) adalah Tuhan Yang Maha Pengampun\".",
      "ar": "لَقَدۡ كَانَ لِسَبَإࣲ فِی مَسۡكَنِهِمۡ ءَایَةࣱۖ جَنَّتَانِ عَن یَمِینࣲ وَشِمَالࣲۖ كُلُوا۟ مِن رِّزۡقِ رَبِّكُمۡ وَٱشۡكُرُوا۟ لَهُۥۚ بَلۡدَةࣱ طَیِّبَةࣱ وَرَبٌّ غَفُورࣱ\n"
    }
  },
  {
    "id": 3622,
    "surahId": 34,
    "ayahNumber": 16,
    "arabicText": "فَأَعۡرَضُوا۟ فَأَرۡسَلۡنَا عَلَیۡهِمۡ سَیۡلَ ٱلۡعَرِمِ وَبَدَّلۡنَـٰهُم بِجَنَّتَیۡهِمۡ جَنَّتَیۡنِ ذَوَاتَیۡ أُكُلٍ خَمۡطࣲ وَأَثۡلࣲ وَشَیۡءࣲ مِّن سِدۡرࣲ قَلِیلࣲ\n",
    "translations": {
      "en": "But they turned away [from Us], and so We let loose upon them a flood that overwhelmed the dams, and changed their two [expanses of luxuriant] gardens into a couple of gardens yielding bitter fruit, and tamarisks, and some few [wild] lote-trees:",
      "ms": "Maka mereka berpaling ingkar, lalu Kami hantarkan kepada mereka banjir yang membinasakan, dan Kami gantikan dua kumpulan kebun mereka (yang subur) itu dengan dua kumpulan kebun yang berisi dengan pohon-pohon yang pahit buahnya, dan pohon-pohon yang jarang berbuah, serta sedikit pohon-pohon bidara.",
      "id": "Tetapi mereka berpaling, maka Kami datangkan kepada mereka banjir yang besar dan Kami ganti kedua kebun mereka dengan dua kebun yang ditumbuhi (pohon-pohon) yang berbuah pahit, pohon Atsl dan sedikit dari pohon Sidr.",
      "ar": "فَأَعۡرَضُوا۟ فَأَرۡسَلۡنَا عَلَیۡهِمۡ سَیۡلَ ٱلۡعَرِمِ وَبَدَّلۡنَـٰهُم بِجَنَّتَیۡهِمۡ جَنَّتَیۡنِ ذَوَاتَیۡ أُكُلٍ خَمۡطࣲ وَأَثۡلࣲ وَشَیۡءࣲ مِّن سِدۡرࣲ قَلِیلࣲ\n"
    }
  },
  {
    "id": 3623,
    "surahId": 34,
    "ayahNumber": 17,
    "arabicText": "ذَ ٰ⁠لِكَ جَزَیۡنَـٰهُم بِمَا كَفَرُوا۟ۖ وَهَلۡ نُجَـٰزِیۤ إِلَّا ٱلۡكَفُورَ\n",
    "translations": {
      "en": "thus We requited them for their having denied the truth. But do We ever requite [thus] any but the utterly ingrate?",
      "ms": "Demikianlah Kami membalas mereka disebabkan kekufuran mereka; dan sebenarnya Kami tidak menimpakan balasan yang demikian melainkan kepada orang-orang yang amat kufur.",
      "id": "Demikianlah Kami memberi balasan kepada mereka karena kekafiran mereka. Dan Kami tidak menjatuhkan azab (yang demikian itu), melainkan hanya kepada orang-orang yang sangat kafir.",
      "ar": "ذَ ٰ⁠لِكَ جَزَیۡنَـٰهُم بِمَا كَفَرُوا۟ۖ وَهَلۡ نُجَـٰزِیۤ إِلَّا ٱلۡكَفُورَ\n"
    }
  },
  {
    "id": 3624,
    "surahId": 34,
    "ayahNumber": 18,
    "arabicText": "وَجَعَلۡنَا بَیۡنَهُمۡ وَبَیۡنَ ٱلۡقُرَى ٱلَّتِی بَـٰرَكۡنَا فِیهَا قُرࣰى ظَـٰهِرَةࣰ وَقَدَّرۡنَا فِیهَا ٱلسَّیۡرَۖ سِیرُوا۟ فِیهَا لَیَالِیَ وَأَیَّامًا ءَامِنِینَ\n",
    "translations": {
      "en": "Now [before their downfall,] We had placed between them and the cities which We had blessed [many] towns within sight of one another; and thus We had made traveling easy [for them, as if to say]: “Travel safely in this [land], by night or by day!”",
      "ms": "Dan - di antara tempat tinggal mereka (di negeri Yaman) dengan bandar-bandar (di daerah negeri Syam) yang Kami limpahkan berkat kepadanya (dengan kemakmuran), - Kami adakan beberapa buah bandar yang jelas kelihatan (kepada orang-orang yang melalui jalan itu), dan Kami tentukan jarak perjalanan di antaranya (sekadar yang dapat dijadikan tempat-tempat persinggahan), (serta dikatakan kepada mereka): \" Berjalanlah kamu di bandar-bandar itu pada bila-bila masa yang kamu suka, malam dan siang, dalam keadaan yang aman\".",
      "id": "Dan Kami jadikan antara mereka dan antara negeri-negeri yang Kami limpahkan berkat kepadanya, beberapa negeri yang berdekatan dan Kami tetapkan antara negeri-negeri itu (jarak-jarak) perjalanan. Berjalanlah kamu di kota-kota itu pada malam hari dan siang hari dengan dengan aman.",
      "ar": "وَجَعَلۡنَا بَیۡنَهُمۡ وَبَیۡنَ ٱلۡقُرَى ٱلَّتِی بَـٰرَكۡنَا فِیهَا قُرࣰى ظَـٰهِرَةࣰ وَقَدَّرۡنَا فِیهَا ٱلسَّیۡرَۖ سِیرُوا۟ فِیهَا لَیَالِیَ وَأَیَّامًا ءَامِنِینَ\n"
    }
  },
  {
    "id": 3625,
    "surahId": 34,
    "ayahNumber": 19,
    "arabicText": "فَقَالُوا۟ رَبَّنَا بَـٰعِدۡ بَیۡنَ أَسۡفَارِنَا وَظَلَمُوۤا۟ أَنفُسَهُمۡ فَجَعَلۡنَـٰهُمۡ أَحَادِیثَ وَمَزَّقۡنَـٰهُمۡ كُلَّ مُمَزَّقٍۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّكُلِّ صَبَّارࣲ شَكُورࣲ\n",
    "translations": {
      "en": "But now they would say, “Long has our Sus­tainer made the distance between our journey- stages!” - for they had sinned against themselves. And in the end We caused them to become [one of those] tales [of things long past], and scattered them in countless fragments. Herein, behold, there are messages indeed for all who are wholly patient in adversity and deeply grate­ful [to God].",
      "ms": "(Maka kamakmuran dan kemudahan itu menjadikan mereka sombong dan kufur) lalu berkata: \"Wahai Tuhan kami, jauhkanlah jarak perjalanan kami (di antara sebuah bandar dengan yang lain)\", dan mereka berlaku zalim kepada diri mereka sendiri; lalu Kami jadikan (kisah perbuatan derhaka) mereka: buah mulut orang ramai, serta kami pecah belahkan mereka berkecai-kecai. Sesungguhnya kisah mereka yang tersebut mengandungi tanda-tanda (yang besar pengajarannya bagi tiap-tiap seorang (mukmin) yang sentiasa bersikap sabar, lagi sentiasa bersyukur.",
      "id": "Maka mereka berkata: \"Ya Tuhan kami jauhkanlah jarak perjalanan kami\", dan mereka menganiaya diri mereka sendiri; maka Kami jadikan mereka buah mulut dan Kami hancurkan mereka sehancur-hancurnya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda kekuasaan Allah bagi setiap orang yang sabar lagi bersyukur.",
      "ar": "فَقَالُوا۟ رَبَّنَا بَـٰعِدۡ بَیۡنَ أَسۡفَارِنَا وَظَلَمُوۤا۟ أَنفُسَهُمۡ فَجَعَلۡنَـٰهُمۡ أَحَادِیثَ وَمَزَّقۡنَـٰهُمۡ كُلَّ مُمَزَّقٍۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّكُلِّ صَبَّارࣲ شَكُورࣲ\n"
    }
  },
  {
    "id": 3626,
    "surahId": 34,
    "ayahNumber": 20,
    "arabicText": "وَلَقَدۡ صَدَّقَ عَلَیۡهِمۡ إِبۡلِیسُ ظَنَّهُۥ فَٱتَّبَعُوهُ إِلَّا فَرِیقࣰا مِّنَ ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "Now, indeed, Iblis did prove that his opinion of them had been right: for [when he called them,] they followed him - all but some of the believers [among them].",
      "ms": "Dan sesungguhnya Iblis telah dapati sangkaannya tepat terhadap mereka, iaitu mereka menurutnya, kecuali sebahagian dari orang-orang yang beriman (yang tidak terpedaya kepada hasutannya).",
      "id": "Dan sesungguhnya iblis telah dapat membuktikan kebenaran sangkaannya terhadap mereka lalu mereka mengikutinya, kecuali sebahagian orang-orang yang beriman.",
      "ar": "وَلَقَدۡ صَدَّقَ عَلَیۡهِمۡ إِبۡلِیسُ ظَنَّهُۥ فَٱتَّبَعُوهُ إِلَّا فَرِیقࣰا مِّنَ ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 3627,
    "surahId": 34,
    "ayahNumber": 21,
    "arabicText": "وَمَا كَانَ لَهُۥ عَلَیۡهِم مِّن سُلۡطَـٰنٍ إِلَّا لِنَعۡلَمَ مَن یُؤۡمِنُ بِٱلۡـَٔاخِرَةِ مِمَّنۡ هُوَ مِنۡهَا فِی شَكࣲّۗ وَرَبُّكَ عَلَىٰ كُلِّ شَیۡءٍ حَفِیظࣱ\n",
    "translations": {
      "en": "And yet, he had no power at all over them: [for if We allow him to tempt man,] it is only to the end that We might make a clear distinction between those who [truly] believe in the life to come and those who are in doubt thereof: for thy Sustainer watches over all things.",
      "ms": "Dan sememangnya tiadalah bagi Iblis sebarang kuasa untuk menyesatkan mereka, melainkan untuk menjadi ujian bagi melahirkan pengetahuan Kami tentang siapakah yang benar-benar beriman kepada hari akhirat dan siapa pula yang ragu-ragu terhadapnya. Dan (ingatlah) Tuhanmu sentiasa mengawal serta mengawasi tiap-tiap sesuatu.",
      "id": "Dan tidak adalah kekuasaan iblis terhadap mereka, melainkan hanyalah agar Kami dapat membedakan siapa yang beriman kepada adanya kehidupan akhirat dari siapa yang ragu-ragu tentang itu. Dan Tuhanmu Maha Memelihara segala sesuatu.",
      "ar": "وَمَا كَانَ لَهُۥ عَلَیۡهِم مِّن سُلۡطَـٰنٍ إِلَّا لِنَعۡلَمَ مَن یُؤۡمِنُ بِٱلۡـَٔاخِرَةِ مِمَّنۡ هُوَ مِنۡهَا فِی شَكࣲّۗ وَرَبُّكَ عَلَىٰ كُلِّ شَیۡءٍ حَفِیظࣱ\n"
    }
  },
  {
    "id": 3628,
    "surahId": 34,
    "ayahNumber": 22,
    "arabicText": "قُلِ ٱدۡعُوا۟ ٱلَّذِینَ زَعَمۡتُم مِّن دُونِ ٱللَّهِ لَا یَمۡلِكُونَ مِثۡقَالَ ذَرَّةࣲ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَلَا فِی ٱلۡأَرۡضِ وَمَا لَهُمۡ فِیهِمَا مِن شِرۡكࣲ وَمَا لَهُۥ مِنۡهُم مِّن ظَهِیرࣲ\n",
    "translations": {
      "en": "SAY: “Call upon those [beings] whom you imagine [to be endowed with divine powers] beside God: they have not an atom’s weight of power either in the heavens or on earth, nor have they any share in [governing] either, nor does He [choose to] have any helper from among them.”",
      "ms": "Katakanlah (wahai Muhammad kepada kaum musyrik): \"Serukanlah makhluk-makhluk yang kamu dakwakan sebagai tuhan selain dari Allah; mereka tidak memiliki kuasa seberat debu pun di langit dan di bumi, dan mereka tiada sebarang bahagian perkongsian (dengan Allah) dalam (mencipta dan mentadbirkan) langit dan bumi, dan Allah pula tidak mendapat sebarang pertolongan dari mereka\".",
      "id": "Katakanlah: \"Serulah mereka yang kamu anggap (sebagai tuhan) selain Allah, mereka tidak memiliki (kekuasaan) seberat zarrahpun di langit dan di bumi, dan mereka tidak mempunyai suatu sahampun dalam (penciptaan) langit dan bumi dan sekali-kali tidak ada di antara mereka yang menjadi pembantu bagi-Nya.",
      "ar": "قُلِ ٱدۡعُوا۟ ٱلَّذِینَ زَعَمۡتُم مِّن دُونِ ٱللَّهِ لَا یَمۡلِكُونَ مِثۡقَالَ ذَرَّةࣲ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَلَا فِی ٱلۡأَرۡضِ وَمَا لَهُمۡ فِیهِمَا مِن شِرۡكࣲ وَمَا لَهُۥ مِنۡهُم مِّن ظَهِیرࣲ\n"
    }
  },
  {
    "id": 3629,
    "surahId": 34,
    "ayahNumber": 23,
    "arabicText": "وَلَا تَنفَعُ ٱلشَّفَـٰعَةُ عِندَهُۥۤ إِلَّا لِمَنۡ أَذِنَ لَهُۥۚ حَتَّىٰۤ إِذَا فُزِّعَ عَن قُلُوبِهِمۡ قَالُوا۟ مَاذَا قَالَ رَبُّكُمۡۖ قَالُوا۟ ٱلۡحَقَّۖ وَهُوَ ٱلۡعَلِیُّ ٱلۡكَبِیرُ\n",
    "translations": {
      "en": "And, before Him, intercession can be of no avail [to any] save one in whose case He may have granted leave [there for]: so much so that when the terror [of the Last Hour] is lifted from their hearts, they [who have been resurrected] will ask [one an­other], “What has your Sustainer decreed [for you]?” - [to which] the others will answer, “Whatever is true and deserved - for He alone is exalted, great!”",
      "ms": "Dan tidak berfaedah syafaat di sisi Allah kecuali bagi orang yang telah diizinkan Allah, (maka orang-orang yang hendak memohon syafaat terpaksa menunggu izin itu dengan penuh perasaan takut dan bimbang) sehingga apabila dihapuskan Allah perasaan takut dari hati mereka (dengan pemberian izin itu) bersukarialah mereka dengan bertanya-tanyaan sesama sendiri: \"Apakah yang telah dititahkan oleh Tuhan kamu?\" Sebahagian di antara mereka menjawab: \"Tuhan telah menitahkan kebenaran\"; dan Dia lah jua Yang Maha Tinggi keadaanNya, lagi Maha Besar kekuasaanNya.",
      "id": "Dan tiadalah berguna syafa'at di sisi Allah melainkan bagi orang yang telah diizinkan-Nya memperoleh syafa'at itu, sehingga apabila telah dihilangkan ketakutan dari hati mereka, mereka berkata \"Apakah yang telah difirmankan oleh Tuhan-mu?\" Mereka menjawab: (Perkataan) yang benar\", dan Dialah Yang Maha Tinggi lagi Maha Besar.",
      "ar": "وَلَا تَنفَعُ ٱلشَّفَـٰعَةُ عِندَهُۥۤ إِلَّا لِمَنۡ أَذِنَ لَهُۥۚ حَتَّىٰۤ إِذَا فُزِّعَ عَن قُلُوبِهِمۡ قَالُوا۟ مَاذَا قَالَ رَبُّكُمۡۖ قَالُوا۟ ٱلۡحَقَّۖ وَهُوَ ٱلۡعَلِیُّ ٱلۡكَبِیرُ\n"
    }
  },
  {
    "id": 3630,
    "surahId": 34,
    "ayahNumber": 24,
    "arabicText": "۞ قُلۡ مَن یَرۡزُقُكُم مِّنَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ قُلِ ٱللَّهُۖ وَإِنَّاۤ أَوۡ إِیَّاكُمۡ لَعَلَىٰ هُدًى أَوۡ فِی ضَلَـٰلࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "Say: “Who is it that provides for you sus­tenance out of the heavens and the earth?” Say: “It is God. And, behold, either we [who believe in Him] or you [who deny His oneness] are on the right path, or have clearly gone astray!”",
      "ms": "Bertanyalah (wahai Muhammad kepada orang-orang musyrik itu): \"Siapakah yang memberi rezeki kepada kamu dari langit dan bumi?\" Terangkanlah jawabnya: \"Ialah Allah; dan sesungguhnya (tiap-tiap satu golongan), sama ada golongan kami ahli tauhid atau golongan kamu ahli syirik - (tidak sunyi daripada salah satu dari dua keadaan): keadaan tetapnya di atas hidayah petunjuk atau tenggelamnya dalam kesesatan yang jelas nyata \".",
      "id": "Katakanlah: \"Siapakan yang memberi rezeki kepadamu dari langit dan dari bumi?\" Katakanlah: \"Allah\", dan sesungguhnya kami atau kamu (orang-orang musyrik), pasti berada dalam kebenaran atau dalam kesesatan yang nyata.",
      "ar": "۞ قُلۡ مَن یَرۡزُقُكُم مِّنَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ قُلِ ٱللَّهُۖ وَإِنَّاۤ أَوۡ إِیَّاكُمۡ لَعَلَىٰ هُدًى أَوۡ فِی ضَلَـٰلࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 3631,
    "surahId": 34,
    "ayahNumber": 25,
    "arabicText": "قُل لَّا تُسۡـَٔلُونَ عَمَّاۤ أَجۡرَمۡنَا وَلَا نُسۡـَٔلُ عَمَّا تَعۡمَلُونَ\n",
    "translations": {
      "en": "Say: “Neither shall you be called to account for whatever we may have become guilty of, nor shall we be called to account for whatever you are doing.”",
      "ms": "(Oleh itu) katakanlah (wahyu Muhammad): \"Kamu tidak akan bertanggungjawab tentang kesalahan yang kami lakukan, dan kami pula tidak akan bertanggungjawab tentang apa yang kamu kerjakan\".",
      "id": "Katakanlah: \"Kamu tidak akan ditanya (bertanggung jawab) tentang dosa yang kami perbuat dan kami tidak akan ditanya (pula) tentang apa yang kamu perbuat\".",
      "ar": "قُل لَّا تُسۡـَٔلُونَ عَمَّاۤ أَجۡرَمۡنَا وَلَا نُسۡـَٔلُ عَمَّا تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 3632,
    "surahId": 34,
    "ayahNumber": 26,
    "arabicText": "قُلۡ یَجۡمَعُ بَیۡنَنَا رَبُّنَا ثُمَّ یَفۡتَحُ بَیۡنَنَا بِٱلۡحَقِّ وَهُوَ ٱلۡفَتَّاحُ ٱلۡعَلِیمُ\n",
    "translations": {
      "en": "Say: “Our Sustainer will bring us all together [on Judgment Day], and then He will lay open the truth between us, in justice - for He alone is the One who opens all truth, the All-Knowing!”",
      "ms": "Katakanlah lagi:\" Tuhan kita akan menghimpunkan Kita semua (pada hari kiamat), kemudian Ia akan menyelesaikan perselisihan yang ada di antara kita dengan penyelesaian yang benar; dan Dia lah jua Hakim yang seadil-adilnya, lagi Yang Maha Mengetahui segala-galanya\".",
      "id": "Katakanlah: \"Tuhan kita akan mengumpulkan kita semua, kemudian Dia memberi keputusan antara kita dengan benar. Dan Dialah Maha Pemberi keputusan lagi Maha Mengetahui\".",
      "ar": "قُلۡ یَجۡمَعُ بَیۡنَنَا رَبُّنَا ثُمَّ یَفۡتَحُ بَیۡنَنَا بِٱلۡحَقِّ وَهُوَ ٱلۡفَتَّاحُ ٱلۡعَلِیمُ\n"
    }
  },
  {
    "id": 3633,
    "surahId": 34,
    "ayahNumber": 27,
    "arabicText": "قُلۡ أَرُونِیَ ٱلَّذِینَ أَلۡحَقۡتُم بِهِۦ شُرَكَاۤءَۖ كَلَّاۚ بَلۡ هُوَ ٱللَّهُ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n",
    "translations": {
      "en": "Say: “Point out to me those [beings] that you have joined with Him [in your minds] as partners [in His divinity]! Nay - nay, but He [alone] is God, the Almighty, the Wise!”",
      "ms": "Katakanlah lagi: \"Tunjukkanlah kepadaku sifat-sifat ketuhanan yang ada pada makhluk-makhluk yang kamu hubungkan dengan Allah sebagai sekutu-sekutuNya. Tidak ada pada sesuatu makhluk pun sifat-sifat itu, bahkan yang mempunyai sifat-sifat ketuhanan ialah Allah Yang Maha Kuasa, lagi Maha Bijaksana\".",
      "id": "Katakanlah: \"Perlihatkanlah kepadaku sembah-sembahan yang kamu hubungkan dengan Dia sebagai sekutu-sekutu-Nya, sekali-kali tidak mungkin! Sebenarnya Dialah Allah Yang Maha Perkasa lagi Maha Bijaksana.",
      "ar": "قُلۡ أَرُونِیَ ٱلَّذِینَ أَلۡحَقۡتُم بِهِۦ شُرَكَاۤءَۖ كَلَّاۚ بَلۡ هُوَ ٱللَّهُ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n"
    }
  },
  {
    "id": 3634,
    "surahId": 34,
    "ayahNumber": 28,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَـٰكَ إِلَّا كَاۤفَّةࣰ لِّلنَّاسِ بَشِیرࣰا وَنَذِیرࣰا وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "NOW [as for thee, O Muhammad,] We have not sent thee otherwise than to mankind at large, to be a herald of glad tidings and a warner; but most people do not understand [this],",
      "ms": "Dan tiadalah Kami mengutusmu (wahai Muhammad) melainkan untuk umat manusia seluruhnya, sebagai Rasul pembawa berita gembira (kepada orang-orang yang beriman), dan pemberi amaran (kepada orang-orang yang ingkar); akan tetapi kebanyakan manusia tidak mengetahui (hakikat itu).",
      "id": "Dan Kami tidak mengutus kamu, melainkan kepada umat manusia seluruhnya sebagai pembawa berita gembira dan sebagai pemberi peringatan, tetapi kebanyakan manusia tiada mengetahui.",
      "ar": "وَمَاۤ أَرۡسَلۡنَـٰكَ إِلَّا كَاۤفَّةࣰ لِّلنَّاسِ بَشِیرࣰا وَنَذِیرࣰا وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 3635,
    "surahId": 34,
    "ayahNumber": 29,
    "arabicText": "وَیَقُولُونَ مَتَىٰ هَـٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "and so they ask, “When is this promise [of resurrection and judgment] to be fulfilled? [Answer this, O you who believe in it,] if you are men of truth!”",
      "ms": "Dan mereka (yang ingkar) bertanya: \"Bilakah berlakunya azab yang telah dijanjikan itu, jika betul kamu orang-orang yang benar?\"",
      "id": "Dan mereka berkata: \"Kapankah (datangnya) janji ini, jika kamu adalah orang-orang yang benar?\".",
      "ar": "وَیَقُولُونَ مَتَىٰ هَـٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 3636,
    "surahId": 34,
    "ayahNumber": 30,
    "arabicText": "قُل لَّكُم مِّیعَادُ یَوۡمࣲ لَّا تَسۡتَـٔۡخِرُونَ عَنۡهُ سَاعَةࣰ وَلَا تَسۡتَقۡدِمُونَ\n",
    "translations": {
      "en": "Say: “There has been appointed for you a Day, which you can neither delay nor advance by a single moment.”",
      "ms": "Jawablah (wahai Muhammad): \"Untuk kamu disediakan satu hari yang kamu tidak dapat melambatkannya sesaat pun, dan tidak pula kamu dapat menyegerakannya\".",
      "id": "Katakanlah: \"Bagimu ada hari yang telah dijanjikan (hari kiamat) yang tiada dapat kamu minta mundur daripadanya barang sesaatpun dan tidak (pula) kamu dapat meminta supaya diajukan\".",
      "ar": "قُل لَّكُم مِّیعَادُ یَوۡمࣲ لَّا تَسۡتَـٔۡخِرُونَ عَنۡهُ سَاعَةࣰ وَلَا تَسۡتَقۡدِمُونَ\n"
    }
  },
  {
    "id": 3637,
    "surahId": 34,
    "ayahNumber": 31,
    "arabicText": "وَقَالَ ٱلَّذِینَ كَفَرُوا۟ لَن نُّؤۡمِنَ بِهَـٰذَا ٱلۡقُرۡءَانِ وَلَا بِٱلَّذِی بَیۡنَ یَدَیۡهِۗ وَلَوۡ تَرَىٰۤ إِذِ ٱلظَّـٰلِمُونَ مَوۡقُوفُونَ عِندَ رَبِّهِمۡ یَرۡجِعُ بَعۡضُهُمۡ إِلَىٰ بَعۡضٍ ٱلۡقَوۡلَ یَقُولُ ٱلَّذِینَ ٱسۡتُضۡعِفُوا۟ لِلَّذِینَ ٱسۡتَكۡبَرُوا۟ لَوۡلَاۤ أَنتُمۡ لَكُنَّا مُؤۡمِنِینَ\n",
    "translations": {
      "en": "And [yet,] those who are bent on denying the truth do say, “We shall never believe in this Qur’an, and neither in whatever there still remains of earlier revelations!” But if thou couldst only see [how it will be on Judgment Day,] when these evildoers shall be made to stand before their Sustainer, hurling reproaches back and forth at one another! Those [of them] who had been weak [on earth] will say unto those who had gloried in their arrogance: “Had it not been for you, we would certainly have been believers!”",
      "ms": "Dan orang-orang yang kafir berkata: Kami tidak akan beriman sama sekali kepada Al-Quran ini dan tidak juga kepada Kitab-kitab ugama yang terdahulu daripadanya\". Dan (sungguh ngeri) kalau engkau melihat ketika orang-orang yang zalim itu dibawa berdiri di hadapan Tuhan mereka (untuk dihisab), masing-masing tuduh menuduh antara satu dengan yang lain. Orang-orang yang tertindas berkata kepada orang-orang yang sombong takbur (yang menjadi ketuanya): \"Kalaulah tidak kerana kamu (menindas dan memperdayakan kami), tentulah kami sudah menjadi orang yang beriman\".",
      "id": "Dan orang-orang kafir berkata: \"Kami sekali-kali tidak akan beriman kepada Al Quran ini dan tidak (pula) kepada kitab yang sebelumnya\". Dan (alangkah hebatnya) kalau kamu lihat ketika orang-orang yang zalim itu dihadapkan kepada Tuhannya, sebahagian dari mereka menghadap kan perkataan kepada sebagian yang lain; orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri: \"Kalau tidaklah karena kamu tentulah kami menjadi orang-orang yang beriman\".",
      "ar": "وَقَالَ ٱلَّذِینَ كَفَرُوا۟ لَن نُّؤۡمِنَ بِهَـٰذَا ٱلۡقُرۡءَانِ وَلَا بِٱلَّذِی بَیۡنَ یَدَیۡهِۗ وَلَوۡ تَرَىٰۤ إِذِ ٱلظَّـٰلِمُونَ مَوۡقُوفُونَ عِندَ رَبِّهِمۡ یَرۡجِعُ بَعۡضُهُمۡ إِلَىٰ بَعۡضٍ ٱلۡقَوۡلَ یَقُولُ ٱلَّذِینَ ٱسۡتُضۡعِفُوا۟ لِلَّذِینَ ٱسۡتَكۡبَرُوا۟ لَوۡلَاۤ أَنتُمۡ لَكُنَّا مُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 3638,
    "surahId": 34,
    "ayahNumber": 32,
    "arabicText": "قَالَ ٱلَّذِینَ ٱسۡتَكۡبَرُوا۟ لِلَّذِینَ ٱسۡتُضۡعِفُوۤا۟ أَنَحۡنُ صَدَدۡنَـٰكُمۡ عَنِ ٱلۡهُدَىٰ بَعۡدَ إِذۡ جَاۤءَكُمۖ بَلۡ كُنتُم مُّجۡرِمِینَ\n",
    "translations": {
      "en": "[And] those who were wont to glory in their arrogance will say unto those who had been weak: “Why - did we keep you [forcibly] from following the right path after it had become obvious to you? Nay, it was but you [yourselves] who were guilty!”",
      "ms": "Orang-orang yang sombong takbur itu menjawab kepada orang-orang yang tertindas: Kamikah yang telah menghalang kamu daripada menerima hidayah petunjuk sesudah ia datang kepada kamu? (Bukan kami yang menghalang) bahkan kamulah yang menyebabkan diri sendiri menjadi orang-orang yang berdosa\".",
      "id": "Orang-orang yang menyombongkan diri berkata kepada orang-orang yang dianggap lemah: \"Kamikah yang telah menghalangi kamu dari petunjuk sesudah petunjuk itu datang kepadamu? (Tidak), sebenarnya kamu sendirilah orang-orang yang berdosa\".",
      "ar": "قَالَ ٱلَّذِینَ ٱسۡتَكۡبَرُوا۟ لِلَّذِینَ ٱسۡتُضۡعِفُوۤا۟ أَنَحۡنُ صَدَدۡنَـٰكُمۡ عَنِ ٱلۡهُدَىٰ بَعۡدَ إِذۡ جَاۤءَكُمۖ بَلۡ كُنتُم مُّجۡرِمِینَ\n"
    }
  },
  {
    "id": 3639,
    "surahId": 34,
    "ayahNumber": 33,
    "arabicText": "وَقَالَ ٱلَّذِینَ ٱسۡتُضۡعِفُوا۟ لِلَّذِینَ ٱسۡتَكۡبَرُوا۟ بَلۡ مَكۡرُ ٱلَّیۡلِ وَٱلنَّهَارِ إِذۡ تَأۡمُرُونَنَاۤ أَن نَّكۡفُرَ بِٱللَّهِ وَنَجۡعَلَ لَهُۥۤ أَندَادࣰاۚ وَأَسَرُّوا۟ ٱلنَّدَامَةَ لَمَّا رَأَوُا۟ ٱلۡعَذَابَۚ وَجَعَلۡنَا ٱلۡأَغۡلَـٰلَ فِیۤ أَعۡنَاقِ ٱلَّذِینَ كَفَرُوا۟ۖ هَلۡ یُجۡزَوۡنَ إِلَّا مَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "But those who had been weak will say unto those who had gloried in their arrogance: “Nay, [what kept us away was your] devising of false arguments, night and day, [against God’s messages- as you did] when you persuaded us to blaspheme against God and to claim that there are powers that could rival Him!” And when they see the suffering [that awaits them], they will [all] be unable to express [the full depth of] their remorse: for We shall have put shackles around the necks of those who had been bent on denying the truth: [and] will this be aught but a [just] requital for what they were doing?",
      "ms": "Dan berkata pula orang-orang yang tertindas kepada orang-orang yang sombong takbur itu: \"Tidak! Bahkan (yang menghalang kami daripada beriman ialah) perbuatan kamu memperdaya kami malam dan siang, ketika kamu menyuruh kami berlaku kufur kepada Allah dan mengadakan sekutu-sekutu bagiNya. Akhirnya masing-masing diam sambil memendamkan perasaan sesal dan kecewa semasa mereka melihat azab; dan Kami pasangkan belenggu-belenggu pada leher orang-orang yang kafir itu. Mereka tidak dibalas melainkan dengan apa yang mereka telah kerjakan.",
      "id": "Dan orang-orang yang dianggap lemah berkata kepada orang-orang yang menyombongkan diri: \"(Tidak) sebenarnya tipu daya(mu) di waktu malam dan siang (yang menghalangi kami), ketika kamu menyeru kami supaya kami kafir kepada Allah dan menjadikan sekutu-sekutu bagi-Nya\". Kedua belah pihak menyatakan penyesalan tatkala mereka melihat azab. Dan kami pasang belenggu di leher orang-orang yang kafir. Mereka tidak dibalas melainkan dengan apa yang telah mereka kerjakan.",
      "ar": "وَقَالَ ٱلَّذِینَ ٱسۡتُضۡعِفُوا۟ لِلَّذِینَ ٱسۡتَكۡبَرُوا۟ بَلۡ مَكۡرُ ٱلَّیۡلِ وَٱلنَّهَارِ إِذۡ تَأۡمُرُونَنَاۤ أَن نَّكۡفُرَ بِٱللَّهِ وَنَجۡعَلَ لَهُۥۤ أَندَادࣰاۚ وَأَسَرُّوا۟ ٱلنَّدَامَةَ لَمَّا رَأَوُا۟ ٱلۡعَذَابَۚ وَجَعَلۡنَا ٱلۡأَغۡلَـٰلَ فِیۤ أَعۡنَاقِ ٱلَّذِینَ كَفَرُوا۟ۖ هَلۡ یُجۡزَوۡنَ إِلَّا مَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 3640,
    "surahId": 34,
    "ayahNumber": 34,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَا فِی قَرۡیَةࣲ مِّن نَّذِیرٍ إِلَّا قَالَ مُتۡرَفُوهَاۤ إِنَّا بِمَاۤ أُرۡسِلۡتُم بِهِۦ كَـٰفِرُونَ\n",
    "translations": {
      "en": "For [thus it is:] whenever We sent a warner to any community, those of its people who had lost themselves entirely in the pursuit of pleasures would declare, “Behold, we deny that there is any truth in [what you claim to be] your message!” –",
      "ms": "Dan Kami tidak mengutus kepada sesebuah negeri: seseorang Rasul pemberi amaran melainkan orang-orang yang berada dalam kemewahan di negeri itu berkata: \"Sesungguhnya kami tetap mengingkari apa yang kamu diutuskan membawanya\".",
      "id": "Dan Kami tidak mengutus kepada suatu negeri seorang pemberi peringatanpun, melainkan orang-orang yang hidup mewah di negeri itu berkata: \"Sesungguhnya kami mengingkari apa yang kamu diutus untuk menyampaikannya\".",
      "ar": "وَمَاۤ أَرۡسَلۡنَا فِی قَرۡیَةࣲ مِّن نَّذِیرٍ إِلَّا قَالَ مُتۡرَفُوهَاۤ إِنَّا بِمَاۤ أُرۡسِلۡتُم بِهِۦ كَـٰفِرُونَ\n"
    }
  },
  {
    "id": 3641,
    "surahId": 34,
    "ayahNumber": 35,
    "arabicText": "وَقَالُوا۟ نَحۡنُ أَكۡثَرُ أَمۡوَ ٰ⁠لࣰا وَأَوۡلَـٰدࣰا وَمَا نَحۡنُ بِمُعَذَّبِینَ\n",
    "translations": {
      "en": "and they would add, “Richer [than you] are we in wealth and in children, and [so] we are not going to be made to suffer!”",
      "ms": "Dan mereka berkata lagi: \"Kami lebih banyak harta benda dan anak pinak, dan kami pula tidak akan diseksa\".",
      "id": "Dan mereka berkata: \"Kami lebih banyak mempunyai harta dan anak-anak (daripada kamu) dan kami sekali-kali tidak akan diazab.",
      "ar": "وَقَالُوا۟ نَحۡنُ أَكۡثَرُ أَمۡوَ ٰ⁠لࣰا وَأَوۡلَـٰدࣰا وَمَا نَحۡنُ بِمُعَذَّبِینَ\n"
    }
  },
  {
    "id": 3642,
    "surahId": 34,
    "ayahNumber": 36,
    "arabicText": "قُلۡ إِنَّ رَبِّی یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ وَیَقۡدِرُ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "Say: “Behold, my Sustainer grants abundant sustenance, or gives it in scant measure, unto whomever He wills: but most men do not understand [God’s ways].”",
      "ms": "Katakanlah (wahai Muhammad): \"Sesungguhnya Tuhanku memewahkan rezeki bagi sesiapa yang dikehendakiNya, dan Dia juga yang menyempitkan (bagi sesiapa yang dikehendakiNya); akan tetapi kebanyakan manusia tidak mengetahui (hakikat itu).",
      "id": "Katakanlah: \"Sesungguhnya Tuhanku melapangkan rezeki bagi siapa yang dikehendaki-Nya dan menyempitkan (bagi siapa yang dikehendaki-Nya). akan tetapi kebanyakan manusia tidak mengetahui\".",
      "ar": "قُلۡ إِنَّ رَبِّی یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ وَیَقۡدِرُ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 3643,
    "surahId": 34,
    "ayahNumber": 37,
    "arabicText": "وَمَاۤ أَمۡوَ ٰ⁠لُكُمۡ وَلَاۤ أَوۡلَـٰدُكُم بِٱلَّتِی تُقَرِّبُكُمۡ عِندَنَا زُلۡفَىٰۤ إِلَّا مَنۡ ءَامَنَ وَعَمِلَ صَـٰلِحࣰا فَأُو۟لَـٰۤىِٕكَ لَهُمۡ جَزَاۤءُ ٱلضِّعۡفِ بِمَا عَمِلُوا۟ وَهُمۡ فِی ٱلۡغُرُفَـٰتِ ءَامِنُونَ\n",
    "translations": {
      "en": "For, it is neither your riches nor your children that can bring you nearer to Us: only he who attains to faith and does what is right and just [comes near unto Us]; and it is [such as] these whom multiple recompense awaits for all that they have done; and it is they who shall dwell secure in the mansions [of paradise] –",
      "ms": "Dan bukanlah harta benda kamu dan tidak juga anak pinak kamu yang mendampingkan kamu di sisi Kami walau sedikitpun, kecuali orang-orang yang beriman dan beramal soleh, maka mereka itu akan beroleh balasan yang berlipat ganda disebabkan apa yang mereka telah kerjakan; dan mereka pula ditempatkan dalam mahligai-mahligai (di Syurga) dengan aman sentosa.",
      "id": "Dan sekali-kali bukanlah harta dan bukan (pula) anak-anak kamu yang mendekatkan kamu kepada Kami sedikitpun; tetapi orang-orang yang beriman dan mengerjakan amal-amal (saleh, mereka itulah yang memperoleh balasan yang berlipat ganda disebabkan apa yang telah mereka kerjakan; dan mereka aman sentosa di tempat-tempat yang tinggi (dalam surga).",
      "ar": "وَمَاۤ أَمۡوَ ٰ⁠لُكُمۡ وَلَاۤ أَوۡلَـٰدُكُم بِٱلَّتِی تُقَرِّبُكُمۡ عِندَنَا زُلۡفَىٰۤ إِلَّا مَنۡ ءَامَنَ وَعَمِلَ صَـٰلِحࣰا فَأُو۟لَـٰۤىِٕكَ لَهُمۡ جَزَاۤءُ ٱلضِّعۡفِ بِمَا عَمِلُوا۟ وَهُمۡ فِی ٱلۡغُرُفَـٰتِ ءَامِنُونَ\n"
    }
  },
  {
    "id": 3644,
    "surahId": 34,
    "ayahNumber": 38,
    "arabicText": "وَٱلَّذِینَ یَسۡعَوۡنَ فِیۤ ءَایَـٰتِنَا مُعَـٰجِزِینَ أُو۟لَـٰۤىِٕكَ فِی ٱلۡعَذَابِ مُحۡضَرُونَ\n",
    "translations": {
      "en": "whereas all who strive against Our messages, seeking to defeat their purpose, shall be given over to suffering.",
      "ms": "Dan orang-orang yang berusaha menentang dan membatalkan ayat-ayat keterangan Kami sambil menyangka dapat melepaskan diri (dari hukuman Kami), mereka itu akan berada di dalam azab seksa.",
      "id": "Dan orang-orang yang berusaha (menentang) ayat-ayat Kami dengan anggapan untuk dapat melemahkan (menggagalkan azab Kami), mereka itu dimasukkan ke dalam azab.",
      "ar": "وَٱلَّذِینَ یَسۡعَوۡنَ فِیۤ ءَایَـٰتِنَا مُعَـٰجِزِینَ أُو۟لَـٰۤىِٕكَ فِی ٱلۡعَذَابِ مُحۡضَرُونَ\n"
    }
  },
  {
    "id": 3645,
    "surahId": 34,
    "ayahNumber": 39,
    "arabicText": "قُلۡ إِنَّ رَبِّی یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ مِنۡ عِبَادِهِۦ وَیَقۡدِرُ لَهُۥۚ وَمَاۤ أَنفَقۡتُم مِّن شَیۡءࣲ فَهُوَ یُخۡلِفُهُۥۖ وَهُوَ خَیۡرُ ٱلرَّ ٰ⁠زِقِینَ\n",
    "translations": {
      "en": "Say: “Behold, my Sustainer grants abundant sustenance, or gives it in scant measure, unto whomever He wills of His servants; and whatever it be that you spend on others, He [always] replaces it: for He is the best of providers.”",
      "ms": "Katakanlah (wahai Muhammad): \"Sesungguhnya Tuhanku memewahkan rezeki bagi sesiapa yang dikehendakiNya di antara hamba-hambaNya, dan Ia juga yang menyempitkan baginya; dan apa sahaja yang kamu dermakan maka Allah akan menggantikannya; dan Dia lah jua sebaik-baik Pemberi rezeki\".",
      "id": "Katakanlah: \"Sesungguhnya Tuhanku melapangkan rezeki bagi siapa yang dikehendaki-Nya di antara hamba-hamba-Nya dan menyempitkan bagi (siapa yang dikehendaki-Nya)\". Dan barang apa saja yang kamu nafkahkan, maka Allah akan menggantinya dan Dialah Pemberi rezeki yang sebaik-baiknya.",
      "ar": "قُلۡ إِنَّ رَبِّی یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ مِنۡ عِبَادِهِۦ وَیَقۡدِرُ لَهُۥۚ وَمَاۤ أَنفَقۡتُم مِّن شَیۡءࣲ فَهُوَ یُخۡلِفُهُۥۖ وَهُوَ خَیۡرُ ٱلرَّ ٰ⁠زِقِینَ\n"
    }
  },
  {
    "id": 3646,
    "surahId": 34,
    "ayahNumber": 40,
    "arabicText": "وَیَوۡمَ یَحۡشُرُهُمۡ جَمِیعࣰا ثُمَّ یَقُولُ لِلۡمَلَـٰۤىِٕكَةِ أَهَـٰۤؤُلَاۤءِ إِیَّاكُمۡ كَانُوا۟ یَعۡبُدُونَ\n",
    "translations": {
      "en": "And [as for those who now deny the truth,] one Day He will gather them all together, and will ask the angels, “Was it you that they were wont to worship?”",
      "ms": "Dan (ingatkanlah) masa Allah menghimpunkan mereka semua (pada hari kiamat), kemudian Ia bertanya kepada malaikat: \"Adakah orang-orang ini, (kamu setujui) menyembah kamu dahulu?\"",
      "id": "Dan (ingatlah) hari (yang di waktu itu) Allah mengumpulkan mereka semuanya kemudian Allah berfirman kepada malaikat: \"Apakah mereka ini dahulu menyembah kamu?\".",
      "ar": "وَیَوۡمَ یَحۡشُرُهُمۡ جَمِیعࣰا ثُمَّ یَقُولُ لِلۡمَلَـٰۤىِٕكَةِ أَهَـٰۤؤُلَاۤءِ إِیَّاكُمۡ كَانُوا۟ یَعۡبُدُونَ\n"
    }
  },
  {
    "id": 3647,
    "surahId": 34,
    "ayahNumber": 41,
    "arabicText": "قَالُوا۟ سُبۡحَـٰنَكَ أَنتَ وَلِیُّنَا مِن دُونِهِمۖ بَلۡ كَانُوا۟ یَعۡبُدُونَ ٱلۡجِنَّۖ أَكۡثَرُهُم بِهِم مُّؤۡمِنُونَ\n",
    "translations": {
      "en": "They will answer: “Limitless art Thou in Thy glory! Thou [alone] art close unto us, not they! Nay, [when they thought that they were worshipping us,] they were but [blindly] worshipping forces concealed from their senses; most of them believed in them.”",
      "ms": "Malaikat menjawab: \"Maha Suci Engkau (dari adanya sebarang sekutu denganMu). Engkaulah (yang kami hubungi sebagai Pemimpin dan) Pelindung kami bukan mereka. (Tidak ada hubungan dari pihak kami dengan mereka mengenai penyembahan mereka kepada kami), bahkan mereka adalah menyembah Jin Syaitan; kebanyakan mereka pula percaya kepada Jin Syaitan itu (sebagai sekutu Tuhan yang dipuja dan dipatuhi)\".",
      "id": "Malaikat-malaikat itu menjawab: \"Maha Suci Engkau. Engkaulah pelindung kami, bukan mereka; bahkan mereka telah menyembah jin; kebanyakan mereka beriman kepada jin itu\".",
      "ar": "قَالُوا۟ سُبۡحَـٰنَكَ أَنتَ وَلِیُّنَا مِن دُونِهِمۖ بَلۡ كَانُوا۟ یَعۡبُدُونَ ٱلۡجِنَّۖ أَكۡثَرُهُم بِهِم مُّؤۡمِنُونَ\n"
    }
  },
  {
    "id": 3648,
    "surahId": 34,
    "ayahNumber": 42,
    "arabicText": "فَٱلۡیَوۡمَ لَا یَمۡلِكُ بَعۡضُكُمۡ لِبَعۡضࣲ نَّفۡعࣰا وَلَا ضَرࣰّا وَنَقُولُ لِلَّذِینَ ظَلَمُوا۟ ذُوقُوا۟ عَذَابَ ٱلنَّارِ ٱلَّتِی كُنتُم بِهَا تُكَذِّبُونَ\n",
    "translations": {
      "en": "And [on that Day God will say]: “None of you [created beings] has today any power to benefit or to harm another!” And [then] We shall say unto those who had been bent on evildoing: “Taste [now] that suffering through fire which you were wont to call a lie!”",
      "ms": "Maka pada hari ini, masing-masing di antara kamu tidak berkuasa memberi sebarang manfaat kepada kawannya, dan tidak pula dapat menolak sesuatu bahaya daripadanya; dan Kami katakan kepada orang-orang yang zalim (yang berlaku syirik) itu: \"Rasalah azab neraka yang kamu dahulu mendustakannya\".",
      "id": "Maka pada hari ini sebahagian kamu tidak berkuasa (untuk memberikan) kemanfaatan dan tidak pula kemudharatan kepada sebahagian yang lain. Dan Kami katakan kepada orang-orang yang zalim: \"Rasakanlah olehmu azab neraka yang dahulunya kamu dustakan itu\".",
      "ar": "فَٱلۡیَوۡمَ لَا یَمۡلِكُ بَعۡضُكُمۡ لِبَعۡضࣲ نَّفۡعࣰا وَلَا ضَرࣰّا وَنَقُولُ لِلَّذِینَ ظَلَمُوا۟ ذُوقُوا۟ عَذَابَ ٱلنَّارِ ٱلَّتِی كُنتُم بِهَا تُكَذِّبُونَ\n"
    }
  },
  {
    "id": 3649,
    "surahId": 34,
    "ayahNumber": 43,
    "arabicText": "وَإِذَا تُتۡلَىٰ عَلَیۡهِمۡ ءَایَـٰتُنَا بَیِّنَـٰتࣲ قَالُوا۟ مَا هَـٰذَاۤ إِلَّا رَجُلࣱ یُرِیدُ أَن یَصُدَّكُمۡ عَمَّا كَانَ یَعۡبُدُ ءَابَاۤؤُكُمۡ وَقَالُوا۟ مَا هَـٰذَاۤ إِلَّاۤ إِفۡكࣱ مُّفۡتَرࣰىۚ وَقَالَ ٱلَّذِینَ كَفَرُوا۟ لِلۡحَقِّ لَمَّا جَاۤءَهُمۡ إِنۡ هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "For [thus it is:] whenever Our messages are conveyed unto them in all their clarity, they [who are bent on denying the truth] say [to one another], “This [Muhammad] is nothing but a man who wants to turn you away from what your forefathers were wont to worship!” And they say, “This [Qur’an] is nothing but a falsehood invented [by man]!” And [finally,] they who are bent on denying the truth speak thus of the truth when it comes to them: “This is clearly nothing but spellbinding eloquence!”",
      "ms": "Dan apabila dibacakan kepada mereka ayat-ayat keterangan Kami yang jelas nyata, berkatalah mereka (sesama sendiri): \"Orang ini (Muhammad) tidak lain hanyalah seorang lelaki yang hendak menghalang kamu daripada menyembah apa yang telah disembah oleh datuk nenek kamu\"; dan mereka berkata lagi: (Al-Quran) ini tidak lain hanyalah kata-kata dusta yang direka-reka\"; dan berkatalah orang-orang yang kafir terhadap kebenaran ketika datangnya kepada mereka: \"ini tidak lain hanyalah sihir yang terang nyata\".",
      "id": "Dan apabila dibacakan kepada mereka ayat-ayat Kami yang terang, mereka berkata: \"Orang ini tiada lain hanyalah seorang laki-laki yang ingin menghalangi kamu dari apa yang disembah oleh bapak-bapakmu\", dan mereka berkata: \"(Al Quran) ini tidak lain hanyalah kebohongan yang diada-adakan saja\". Dan orang-orang kafir berkata terhadap kebenaran tatkala kebenaran itu datang kepada mereka: \"Ini tidak lain hanyalah sihir yang nyata\".",
      "ar": "وَإِذَا تُتۡلَىٰ عَلَیۡهِمۡ ءَایَـٰتُنَا بَیِّنَـٰتࣲ قَالُوا۟ مَا هَـٰذَاۤ إِلَّا رَجُلࣱ یُرِیدُ أَن یَصُدَّكُمۡ عَمَّا كَانَ یَعۡبُدُ ءَابَاۤؤُكُمۡ وَقَالُوا۟ مَا هَـٰذَاۤ إِلَّاۤ إِفۡكࣱ مُّفۡتَرࣰىۚ وَقَالَ ٱلَّذِینَ كَفَرُوا۟ لِلۡحَقِّ لَمَّا جَاۤءَهُمۡ إِنۡ هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 3650,
    "surahId": 34,
    "ayahNumber": 44,
    "arabicText": "وَمَاۤ ءَاتَیۡنَـٰهُم مِّن كُتُبࣲ یَدۡرُسُونَهَاۖ وَمَاۤ أَرۡسَلۡنَاۤ إِلَیۡهِمۡ قَبۡلَكَ مِن نَّذِیرࣲ\n",
    "translations": {
      "en": "And yet, [O Muhammad,] never have We vouchsafed them any revelations which they could quote, and neither have We sent unto them any warner before thee.",
      "ms": "Dan (tidak ada sebarang alasan bagi dakwaan mereka, kerana) Kami tidak pernah memberi kepada mereka Kitab-kitab untuk mereka membaca dan mengkajinya, dan Kami juga tidak pernah mengutus kepada mereka sebelummu (wahai Muhammad) seseorang Rasul pemberi amaran (melarang mereka menerima ajaranmu).",
      "id": "Dan Kami tidak pernah memberikan kepada mereka kitab-kitab yang mereka baca dan sekali-kali tidak pernah (pula) mengutus kepada mereka sebelum kamu seorang pemberi peringatanpun.",
      "ar": "وَمَاۤ ءَاتَیۡنَـٰهُم مِّن كُتُبࣲ یَدۡرُسُونَهَاۖ وَمَاۤ أَرۡسَلۡنَاۤ إِلَیۡهِمۡ قَبۡلَكَ مِن نَّذِیرࣲ\n"
    }
  },
  {
    "id": 3651,
    "surahId": 34,
    "ayahNumber": 45,
    "arabicText": "وَكَذَّبَ ٱلَّذِینَ مِن قَبۡلِهِمۡ وَمَا بَلَغُوا۟ مِعۡشَارَ مَاۤ ءَاتَیۡنَـٰهُمۡ فَكَذَّبُوا۟ رُسُلِیۖ فَكَیۡفَ كَانَ نَكِیرِ\n",
    "translations": {
      "en": "Thus, too, gave the lie to the truth [many of] those who lived before them; and although those [earlier people] had not attained to even a tenth of [the evidence of the truth] which We have vouch­safed unto these [late successors of theirs], yet when they gave the lie to My apostles, how awesome was My rejection!",
      "ms": "Dan (ketahuilah bahawa) umat-umat yang terdahulu sebelum mereka telah juga mendustakan (Rasul-rasulnya), sedang mereka (yang mendustakanmu) itu tidak: mencapai satu persepuluh (dari kekayaan, kepandaian dan kekuatan) yang Kami beri kepada umat-umat yang terdahulu itu; setelah umat-umat itu mendustakan Rasul-rasulKu (mereka pun dibinasakan). Dengan yang demikian perhatikanlah bagaimana buruknya akibat kemurkaanKu (menimpa mereka).",
      "id": "Dan orang-orang yang sebelum mereka telah mendustakan sedang orang-orang kafir Mekah itu belum sampai menerima sepersepuluh dari apa yang telah Kami berikan kepada orang-orang dahulu itu lalu mereka mendustakan rasul-rasul-Ku. Maka alangkah hebatnya akibat kemurkaan-Ku.",
      "ar": "وَكَذَّبَ ٱلَّذِینَ مِن قَبۡلِهِمۡ وَمَا بَلَغُوا۟ مِعۡشَارَ مَاۤ ءَاتَیۡنَـٰهُمۡ فَكَذَّبُوا۟ رُسُلِیۖ فَكَیۡفَ كَانَ نَكِیرِ\n"
    }
  },
  {
    "id": 3652,
    "surahId": 34,
    "ayahNumber": 46,
    "arabicText": "۞ قُلۡ إِنَّمَاۤ أَعِظُكُم بِوَ ٰ⁠حِدَةٍۖ أَن تَقُومُوا۟ لِلَّهِ مَثۡنَىٰ وَفُرَ ٰ⁠دَىٰ ثُمَّ تَتَفَكَّرُوا۟ۚ مَا بِصَاحِبِكُم مِّن جِنَّةٍۚ إِنۡ هُوَ إِلَّا نَذِیرࣱ لَّكُم بَیۡنَ یَدَیۡ عَذَابࣲ شَدِیدࣲ\n",
    "translations": {
      "en": "Say: “I counsel you one thing only: Be [ever­ conscious of] standing before God, whether you are in the company of others or alone; and then bethink yourselves [that] there is no madness in [this pro­phet,] your fellow-man: he is only a warner to you of suffering severe to come.”",
      "ms": "Katakanlah (wahai Muhammad): \"Aku hanyalah mengajar dan menasihati kamu dengan satu perkara sahaja, iaitu: hendaklah kamu bersungguh-sungguh berusaha mencari kebenaran kerana Allah semata-mata, sama ada dengan cara berdua (dengan orang lain), atau seorang diri; kemudian hendaklah kamu berfikir sematang-matangnya (untuk mengetahui salah benarnya ajaranKu)\". Sebenarnya tidak ada pada (Muhammad) yang menjadi sahabat kamu sebarang penyakit gila (sebagaimana yang dituduh); ia hanyalah seorang Rasul pemberi amaran kepada kamu, sebelum kamu ditimpa azab yang berat (di akhirat).",
      "id": "Katakanlah: \"Sesungguhnya aku hendak memperingatkan kepadamu suatu hal saja, yaitu supaya kamu menghadap Allah (dengan ikhlas) berdua-dua atau sendiri-sendiri; kemudian kamu fikirkan (tentang Muhammad) tidak ada penyakit gila sedikitpun pada kawanmu itu. Dia tidak lain hanyalah pemberi peringatan bagi kamu sebelum (menghadapi) azab yang keras.",
      "ar": "۞ قُلۡ إِنَّمَاۤ أَعِظُكُم بِوَ ٰ⁠حِدَةٍۖ أَن تَقُومُوا۟ لِلَّهِ مَثۡنَىٰ وَفُرَ ٰ⁠دَىٰ ثُمَّ تَتَفَكَّرُوا۟ۚ مَا بِصَاحِبِكُم مِّن جِنَّةٍۚ إِنۡ هُوَ إِلَّا نَذِیرࣱ لَّكُم بَیۡنَ یَدَیۡ عَذَابࣲ شَدِیدࣲ\n"
    }
  },
  {
    "id": 3653,
    "surahId": 34,
    "ayahNumber": 47,
    "arabicText": "قُلۡ مَا سَأَلۡتُكُم مِّنۡ أَجۡرࣲ فَهُوَ لَكُمۡۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱللَّهِۖ وَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ شَهِیدࣱ\n",
    "translations": {
      "en": "Say: “No reward have I ever asked of you [out of anything] that is yours: my reward rests with none but God, and He is witness unto everything!”",
      "ms": "Katakanlah (wahai Muhammad): \"Apa jua yang aku harap kamu berikan kepadaku sebagai upah maka faedahnya tetap terpulang kepada kamu; balasan yang menjadi upahku yang sebenar hanyalah dari Allah, dan Ia sentiasa Memerhati serta Menyaksikan tiap-tiap sesuatu\".",
      "id": "Katakanlah: \"Upah apapun yang aku minta kepadamu, maka itu untuk kamu. Upahku hanyalah dari Allah, dan Dia Maha Mengetahui segala sesuatu\".",
      "ar": "قُلۡ مَا سَأَلۡتُكُم مِّنۡ أَجۡرࣲ فَهُوَ لَكُمۡۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱللَّهِۖ وَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ شَهِیدࣱ\n"
    }
  },
  {
    "id": 3654,
    "surahId": 34,
    "ayahNumber": 48,
    "arabicText": "قُلۡ إِنَّ رَبِّی یَقۡذِفُ بِٱلۡحَقِّ عَلَّـٰمُ ٱلۡغُیُوبِ\n",
    "translations": {
      "en": "Say: “Verily, my Sustainer hurls the truth [against all that is false] He who fully knows all the things that are beyond the reach of a created being’s perception!”",
      "ms": "Katakanlah lagi: \"Sesungguhnya TuhanKu, menurunkan wahyu (kepada Nabi-nabi pilihanNya) dengan perkara yang benar; Ia sentiasa Mengetahui akan segala perkara yang ghaib\".",
      "id": "Katakanlah: \"Sesungguhnya Tuhanku mewahyukan kebenaran. Dia Maha Mengetahui segala yang ghaib\".",
      "ar": "قُلۡ إِنَّ رَبِّی یَقۡذِفُ بِٱلۡحَقِّ عَلَّـٰمُ ٱلۡغُیُوبِ\n"
    }
  },
  {
    "id": 3655,
    "surahId": 34,
    "ayahNumber": 49,
    "arabicText": "قُلۡ جَاۤءَ ٱلۡحَقُّ وَمَا یُبۡدِئُ ٱلۡبَـٰطِلُ وَمَا یُعِیدُ\n",
    "translations": {
      "en": "Say: “The truth has now come [to light, and falsehood is bound to wither away]: for, falsehood cannot bring forth anything new, nor can it bring back [what has passed away].”",
      "ms": "Katakanlah lagi: \"Telah datang kebenaran (Al-Quran yang memberi segala kebaikan), dan perkara yang salah tidak memberi sebarang kebaikan di dunia, usahkan hendak mengulanginya di akhirat\".",
      "id": "Katakanlah: \"Kebenaran telah datang dan yang batil itu tidak akan memulai dan tidak (pula) akan mengulangi\".",
      "ar": "قُلۡ جَاۤءَ ٱلۡحَقُّ وَمَا یُبۡدِئُ ٱلۡبَـٰطِلُ وَمَا یُعِیدُ\n"
    }
  },
  {
    "id": 3656,
    "surahId": 34,
    "ayahNumber": 50,
    "arabicText": "قُلۡ إِن ضَلَلۡتُ فَإِنَّمَاۤ أَضِلُّ عَلَىٰ نَفۡسِیۖ وَإِنِ ٱهۡتَدَیۡتُ فَبِمَا یُوحِیۤ إِلَیَّ رَبِّیۤۚ إِنَّهُۥ سَمِیعࣱ قَرِیبࣱ\n",
    "translations": {
      "en": "Say: “Were I to go astray, I would but go astray [due to my own self, and] to the hurt of myself; but if I am on the right path, it is but by virtue of what my Sustainer reveals unto me: for, verily, He is all-hearing, ever-near!”",
      "ms": "Katakanlah lagi: \"Sekiranya aku sesat maka bahaya kesesatanku akan menimpa diriku sendiri, dan jika aku beroleh hidayah petunjuk maka yang demikian disebabkan apa yang telah diwahyukan oleh Tuhanku kepadaku; sesungguhnya Ia Maha Mendengar, lagi Maha Dekat\".",
      "id": "Katakanlah: \"Jika aku sesat maka sesungguhnya aku sesat atas kemudharatan diriku sendiri; dan jika aku mendapat petunjuk maka itu adalah disebabkan apa yang diwahyukan Tuhanku kepadaku. Sesungguhnya Dia Maha Mendengar lagi Maha Dekat\".",
      "ar": "قُلۡ إِن ضَلَلۡتُ فَإِنَّمَاۤ أَضِلُّ عَلَىٰ نَفۡسِیۖ وَإِنِ ٱهۡتَدَیۡتُ فَبِمَا یُوحِیۤ إِلَیَّ رَبِّیۤۚ إِنَّهُۥ سَمِیعࣱ قَرِیبࣱ\n"
    }
  },
  {
    "id": 3657,
    "surahId": 34,
    "ayahNumber": 51,
    "arabicText": "وَلَوۡ تَرَىٰۤ إِذۡ فَزِعُوا۟ فَلَا فَوۡتَ وَأُخِذُوا۟ مِن مَّكَانࣲ قَرِیبࣲ\n",
    "translations": {
      "en": "IF THOU couldst but see [how the deniers of the truth will fare on Resurrection Day,] when they will shrink in terror, with nowhere to escape - since they will have been seized from so close nearby",
      "ms": "Dan (sungguh ngeri) jika engkau melihat (keadaan orang-orang yang bersalah itu) ketika mereka gelisah takut (menyaksikan azabnya) serta mereka tidak mendapat jalan mengelaknya, dan mereka pun diambil dari tempat mereka berada (untuk dibawa ke tempat azab).",
      "id": "Dan (alangkah hebatnya) jikalau kamu melihat ketika mereka (orang-orang kafir) terperanjat ketakutan (pada hari kiamat); maka mereka tidak dapat melepaskan diri dan mereka ditangkap dari tempat yang dekat (untuk dibawa ke neraka),",
      "ar": "وَلَوۡ تَرَىٰۤ إِذۡ فَزِعُوا۟ فَلَا فَوۡتَ وَأُخِذُوا۟ مِن مَّكَانࣲ قَرِیبࣲ\n"
    }
  },
  {
    "id": 3658,
    "surahId": 34,
    "ayahNumber": 52,
    "arabicText": "وَقَالُوۤا۟ ءَامَنَّا بِهِۦ وَأَنَّىٰ لَهُمُ ٱلتَّنَاوُشُ مِن مَّكَانِۭ بَعِیدࣲ\n",
    "translations": {
      "en": "and will cry, “We do [now] believe in it!” But how can they [hope to] attain [to salvation] from so far away,",
      "ms": "Dan (pada ketika itu) mereka berkata: \"Kami sekarang beriman kepada kebenaran yang di bawa oleh Nabi Muhammad (s.a.w)\"; (apa jalannya) dan bagaimana caranya mereka dapat mencapai iman dari tempat yang jauh?",
      "id": "dan (di waktu itu) mereka berkata: \"Kami beriman kepada Allah\", bagaimanakah mereka dapat mencapai (keimanan) dari tempat yang jauh itu.",
      "ar": "وَقَالُوۤا۟ ءَامَنَّا بِهِۦ وَأَنَّىٰ لَهُمُ ٱلتَّنَاوُشُ مِن مَّكَانِۭ بَعِیدࣲ\n"
    }
  },
  {
    "id": 3659,
    "surahId": 34,
    "ayahNumber": 53,
    "arabicText": "وَقَدۡ كَفَرُوا۟ بِهِۦ مِن قَبۡلُۖ وَیَقۡذِفُونَ بِٱلۡغَیۡبِ مِن مَّكَانِۭ بَعِیدࣲ\n",
    "translations": {
      "en": "seeing that aforetime they had been bent on denying the truth, and had been wont to cast scorn, from far away, on something that was beyond the reach of human perception?",
      "ms": "Pada hal mereka telah mengingkarinya sebelum itu, dan mereka pula selalu melemparkan tuduhan-tuduhan buta terhadap kebenaran itu dari tempat yang jauh? (sudah tentu salah).",
      "id": "Dan sesungguhnya mereka telah mengingkari Allah sebelum itu; dan mereka menduga-duga tentang yang ghaib dari tempat yang jauh.",
      "ar": "وَقَدۡ كَفَرُوا۟ بِهِۦ مِن قَبۡلُۖ وَیَقۡذِفُونَ بِٱلۡغَیۡبِ مِن مَّكَانِۭ بَعِیدࣲ\n"
    }
  },
  {
    "id": 3660,
    "surahId": 34,
    "ayahNumber": 54,
    "arabicText": "وَحِیلَ بَیۡنَهُمۡ وَبَیۡنَ مَا یَشۡتَهُونَ كَمَا فُعِلَ بِأَشۡیَاعِهِم مِّن قَبۡلُۚ إِنَّهُمۡ كَانُوا۟ فِی شَكࣲّ مُّرِیبِۭ\n",
    "translations": {
      "en": "And so, a barrier will be set between them and all that they had [ever] desired, as will be done to such of their kind as lived before their time: for, behold, they [too] were lost in doubt amounting to suspicion.",
      "ms": "Dan disekatlah di antara mereka dengan (iman) yang mereka ingini, sebagaimana yang telah dilakukan kepada orang-orang yang sama keadaannya dengan mereka pada masa yang lalu; sesungguhnya mereka dahulu berada dalam keadaan syak yang meragukan.",
      "id": "Dan dihalangi antara mereka dengan apa yang mereka ingini sebagaimana yang dilakukan terhadap orang-orang yang serupa dengan mereka pada masa dahulu. Sesungguhnya mereka dahulu (di dunia) dalam keraguan yang mendalam.",
      "ar": "وَحِیلَ بَیۡنَهُمۡ وَبَیۡنَ مَا یَشۡتَهُونَ كَمَا فُعِلَ بِأَشۡیَاعِهِم مِّن قَبۡلُۚ إِنَّهُمۡ كَانُوا۟ فِی شَكࣲّ مُّرِیبِۭ\n"
    }
  }
]