[
  {
    "id": 5105,
    "surahId": 58,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِی تُجَـٰدِلُكَ فِی زَوۡجِهَا وَتَشۡتَكِیۤ إِلَى ٱللَّهِ وَٱللَّهُ یَسۡمَعُ تَحَاوُرَكُمَاۤۚ إِنَّ ٱللَّهَ سَمِیعُۢ بَصِیرٌ\n",
    "translations": {
      "en": "GOD has indeed heard the words of her who pleads with thee concerning her husband, and complains Unto God. And God does hear what you both have to say: verily, God is all-hearing, all-seeing.",
      "ms": "",
      "id": "",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِی تُجَـٰدِلُكَ فِی زَوۡجِهَا وَتَشۡتَكِیۤ إِلَى ٱللَّهِ وَٱللَّهُ یَسۡمَعُ تَحَاوُرَكُمَاۤۚ إِنَّ ٱللَّهَ سَمِیعُۢ بَصِیرٌ\n"
    }
  },
  {
    "id": 5106,
    "surahId": 58,
    "ayahNumber": 2,
    "arabicText": "ٱلَّذِینَ یُظَـٰهِرُونَ مِنكُم مِّن نِّسَاۤىِٕهِم مَّا هُنَّ أُمَّهَـٰتِهِمۡۖ إِنۡ أُمَّهَـٰتُهُمۡ إِلَّا ٱلَّـٰۤـِٔی وَلَدۡنَهُمۡۚ وَإِنَّهُمۡ لَیَقُولُونَ مُنكَرࣰا مِّنَ ٱلۡقَوۡلِ وَزُورࣰاۚ وَإِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورࣱ\n",
    "translations": {
      "en": "As for those of you who [henceforth] separate themselves from their wives by saying, “Thou art as unlawful to me as my mother”, [let them bear in mind that] they can never be [as] their mothers: none are their mothers save those who gave them birth: and so, behold, they but utter a saying that runs counter to reason, and is [therefore] false. But, behold, God is indeed an absolver of sins, much-forgiving:",
      "ms": "",
      "id": "",
      "ar": "ٱلَّذِینَ یُظَـٰهِرُونَ مِنكُم مِّن نِّسَاۤىِٕهِم مَّا هُنَّ أُمَّهَـٰتِهِمۡۖ إِنۡ أُمَّهَـٰتُهُمۡ إِلَّا ٱلَّـٰۤـِٔی وَلَدۡنَهُمۡۚ وَإِنَّهُمۡ لَیَقُولُونَ مُنكَرࣰا مِّنَ ٱلۡقَوۡلِ وَزُورࣰاۚ وَإِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورࣱ\n"
    }
  },
  {
    "id": 5107,
    "surahId": 58,
    "ayahNumber": 3,
    "arabicText": "وَٱلَّذِینَ یُظَـٰهِرُونَ مِن نِّسَاۤىِٕهِمۡ ثُمَّ یَعُودُونَ لِمَا قَالُوا۟ فَتَحۡرِیرُ رَقَبَةࣲ مِّن قَبۡلِ أَن یَتَمَاۤسَّاۚ ذَ ٰ⁠لِكُمۡ تُوعَظُونَ بِهِۦۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِیرࣱ\n",
    "translations": {
      "en": "hence, as for those who would separate themselves from their wives by saying, “Thou art as unlawful to me as my mother”, and thereafter would go back on what they have said, [their atonement] shall be the freeing of a human being from bondage before the couple may touch one another again: this you are [hereby] exhorted to do - for God is fully aware of all that you do.",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذِینَ یُظَـٰهِرُونَ مِن نِّسَاۤىِٕهِمۡ ثُمَّ یَعُودُونَ لِمَا قَالُوا۟ فَتَحۡرِیرُ رَقَبَةࣲ مِّن قَبۡلِ أَن یَتَمَاۤسَّاۚ ذَ ٰ⁠لِكُمۡ تُوعَظُونَ بِهِۦۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِیرࣱ\n"
    }
  },
  {
    "id": 5108,
    "surahId": 58,
    "ayahNumber": 4,
    "arabicText": "فَمَن لَّمۡ یَجِدۡ فَصِیَامُ شَهۡرَیۡنِ مُتَتَابِعَیۡنِ مِن قَبۡلِ أَن یَتَمَاۤسَّاۖ فَمَن لَّمۡ یَسۡتَطِعۡ فَإِطۡعَامُ سِتِّینَ مِسۡكِینࣰاۚ ذَ ٰ⁠لِكَ لِتُؤۡمِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦۚ وَتِلۡكَ حُدُودُ ٱللَّهِۗ وَلِلۡكَـٰفِرِینَ عَذَابٌ أَلِیمٌ\n",
    "translations": {
      "en": "However, he who does not have the where­withal shall fast [instead] for two consecutive months before the couple may touch one another again; and he who is unable to do it shall feed sixty needy ones: this, so that you might prove your faith in God and His Apostle. Now these are the bounds set by God; and grievous suffering [in the life to come] awaits all who deny the truth.",
      "ms": "",
      "id": "",
      "ar": "فَمَن لَّمۡ یَجِدۡ فَصِیَامُ شَهۡرَیۡنِ مُتَتَابِعَیۡنِ مِن قَبۡلِ أَن یَتَمَاۤسَّاۖ فَمَن لَّمۡ یَسۡتَطِعۡ فَإِطۡعَامُ سِتِّینَ مِسۡكِینࣰاۚ ذَ ٰ⁠لِكَ لِتُؤۡمِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦۚ وَتِلۡكَ حُدُودُ ٱللَّهِۗ وَلِلۡكَـٰفِرِینَ عَذَابٌ أَلِیمٌ\n"
    }
  },
  {
    "id": 5109,
    "surahId": 58,
    "ayahNumber": 5,
    "arabicText": "إِنَّ ٱلَّذِینَ یُحَاۤدُّونَ ٱللَّهَ وَرَسُولَهُۥ كُبِتُوا۟ كَمَا كُبِتَ ٱلَّذِینَ مِن قَبۡلِهِمۡۚ وَقَدۡ أَنزَلۡنَاۤ ءَایَـٰتِۭ بَیِّنَـٰتࣲۚ وَلِلۡكَـٰفِرِینَ عَذَابࣱ مُّهِینࣱ\n",
    "translations": {
      "en": "Verily, those who contend against God and His Apostle shall be brought low even as those [evildoers] who lived before them were brought low after We had bestowed [on them] clear messages from on high. And [so,] for those who deny the truth there will be shameful suffering in store",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ یُحَاۤدُّونَ ٱللَّهَ وَرَسُولَهُۥ كُبِتُوا۟ كَمَا كُبِتَ ٱلَّذِینَ مِن قَبۡلِهِمۡۚ وَقَدۡ أَنزَلۡنَاۤ ءَایَـٰتِۭ بَیِّنَـٰتࣲۚ وَلِلۡكَـٰفِرِینَ عَذَابࣱ مُّهِینࣱ\n"
    }
  },
  {
    "id": 5110,
    "surahId": 58,
    "ayahNumber": 6,
    "arabicText": "یَوۡمَ یَبۡعَثُهُمُ ٱللَّهُ جَمِیعࣰا فَیُنَبِّئُهُم بِمَا عَمِلُوۤا۟ۚ أَحۡصَىٰهُ ٱللَّهُ وَنَسُوهُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ شَهِیدٌ\n",
    "translations": {
      "en": "on the Day when God will raise them all from the dead and will make them truly understand all that they did [in life]: God will have taken [all of] it into account, even though they [themselves] may have forgotten it - for God is wit­ness unto everything.",
      "ms": "",
      "id": "",
      "ar": "یَوۡمَ یَبۡعَثُهُمُ ٱللَّهُ جَمِیعࣰا فَیُنَبِّئُهُم بِمَا عَمِلُوۤا۟ۚ أَحۡصَىٰهُ ٱللَّهُ وَنَسُوهُۚ وَٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ شَهِیدٌ\n"
    }
  },
  {
    "id": 5111,
    "surahId": 58,
    "ayahNumber": 7,
    "arabicText": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ یَعۡلَمُ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۖ مَا یَكُونُ مِن نَّجۡوَىٰ ثَلَـٰثَةٍ إِلَّا هُوَ رَابِعُهُمۡ وَلَا خَمۡسَةٍ إِلَّا هُوَ سَادِسُهُمۡ وَلَاۤ أَدۡنَىٰ مِن ذَ ٰ⁠لِكَ وَلَاۤ أَكۡثَرَ إِلَّا هُوَ مَعَهُمۡ أَیۡنَ مَا كَانُوا۟ۖ ثُمَّ یُنَبِّئُهُم بِمَا عَمِلُوا۟ یَوۡمَ ٱلۡقِیَـٰمَةِۚ إِنَّ ٱللَّهَ بِكُلِّ شَیۡءٍ عَلِیمٌ\n",
    "translations": {
      "en": "ART THOU NOT aware that God knows all that is in the heavens and all that is on earth? Never can there be a secret confabulation between three persons without His being the fourth of them, nor between five without His being the sixth of them; and neither between less than that, or more, without His being with them wherever they may he. But in the end, on Resurrection Day, He will make them truly understand what they did: for, verily, God has full knowledge of everything.",
      "ms": "",
      "id": "",
      "ar": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ یَعۡلَمُ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۖ مَا یَكُونُ مِن نَّجۡوَىٰ ثَلَـٰثَةٍ إِلَّا هُوَ رَابِعُهُمۡ وَلَا خَمۡسَةٍ إِلَّا هُوَ سَادِسُهُمۡ وَلَاۤ أَدۡنَىٰ مِن ذَ ٰ⁠لِكَ وَلَاۤ أَكۡثَرَ إِلَّا هُوَ مَعَهُمۡ أَیۡنَ مَا كَانُوا۟ۖ ثُمَّ یُنَبِّئُهُم بِمَا عَمِلُوا۟ یَوۡمَ ٱلۡقِیَـٰمَةِۚ إِنَّ ٱللَّهَ بِكُلِّ شَیۡءٍ عَلِیمٌ\n"
    }
  },
  {
    "id": 5112,
    "surahId": 58,
    "ayahNumber": 8,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ نُهُوا۟ عَنِ ٱلنَّجۡوَىٰ ثُمَّ یَعُودُونَ لِمَا نُهُوا۟ عَنۡهُ وَیَتَنَـٰجَوۡنَ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَ ٰ⁠نِ وَمَعۡصِیَتِ ٱلرَّسُولِۖ وَإِذَا جَاۤءُوكَ حَیَّوۡكَ بِمَا لَمۡ یُحَیِّكَ بِهِ ٱللَّهُ وَیَقُولُونَ فِیۤ أَنفُسِهِمۡ لَوۡلَا یُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُۚ حَسۡبُهُمۡ جَهَنَّمُ یَصۡلَوۡنَهَاۖ فَبِئۡسَ ٱلۡمَصِیرُ\n",
    "translations": {
      "en": "Art thou not aware of such as have been for­bidden [to intrigue through] secret confabulations, and yet [always] revert to that which they have been forbidden, and conspire with one another with a view to sinful doings, and aggressive conduct, and dis­obedience to the Apostle? Now whenever such [people] approach thee, [O Muhammad,] they salute thee with a greeting which God has never countenanced; and they say to themselves, “Why does not God chastise us for what we are saying?” Hell shall be their allotted portion: they shall [in­deed] enter it - and how vile a journey’s end!",
      "ms": "",
      "id": "",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ نُهُوا۟ عَنِ ٱلنَّجۡوَىٰ ثُمَّ یَعُودُونَ لِمَا نُهُوا۟ عَنۡهُ وَیَتَنَـٰجَوۡنَ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَ ٰ⁠نِ وَمَعۡصِیَتِ ٱلرَّسُولِۖ وَإِذَا جَاۤءُوكَ حَیَّوۡكَ بِمَا لَمۡ یُحَیِّكَ بِهِ ٱللَّهُ وَیَقُولُونَ فِیۤ أَنفُسِهِمۡ لَوۡلَا یُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُۚ حَسۡبُهُمۡ جَهَنَّمُ یَصۡلَوۡنَهَاۖ فَبِئۡسَ ٱلۡمَصِیرُ\n"
    }
  },
  {
    "id": 5113,
    "surahId": 58,
    "ayahNumber": 9,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا تَنَـٰجَیۡتُمۡ فَلَا تَتَنَـٰجَوۡا۟ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَ ٰ⁠نِ وَمَعۡصِیَتِ ٱلرَّسُولِ وَتَنَـٰجَوۡا۟ بِٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَٱتَّقُوا۟ ٱللَّهَ ٱلَّذِیۤ إِلَیۡهِ تُحۡشَرُونَ\n",
    "translations": {
      "en": "[Hence,] O you who have attained to faith, when you do hold secret confabulations, do not conspire with one another with a view to sinful doings, and aggressive conduct, and disobedience to the Apostle, but [rather] hold counsel in the cause of virtue and God-consciousness: and [always] remain conscious of God, unto whom you all shall be gathered.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا تَنَـٰجَیۡتُمۡ فَلَا تَتَنَـٰجَوۡا۟ بِٱلۡإِثۡمِ وَٱلۡعُدۡوَ ٰ⁠نِ وَمَعۡصِیَتِ ٱلرَّسُولِ وَتَنَـٰجَوۡا۟ بِٱلۡبِرِّ وَٱلتَّقۡوَىٰۖ وَٱتَّقُوا۟ ٱللَّهَ ٱلَّذِیۤ إِلَیۡهِ تُحۡشَرُونَ\n"
    }
  },
  {
    "id": 5114,
    "surahId": 58,
    "ayahNumber": 10,
    "arabicText": "إِنَّمَا ٱلنَّجۡوَىٰ مِنَ ٱلشَّیۡطَـٰنِ لِیَحۡزُنَ ٱلَّذِینَ ءَامَنُوا۟ وَلَیۡسَ بِضَاۤرِّهِمۡ شَیۡـًٔا إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡیَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ\n",
    "translations": {
      "en": "[All other kinds of] secret confabulations are but of Satan’s doing, so that he might cause grief to those who have attained to faith; yet he cannot harm them in the least, unless it be by God’s leave: in God, then, let the believers place their trust!",
      "ms": "",
      "id": "",
      "ar": "إِنَّمَا ٱلنَّجۡوَىٰ مِنَ ٱلشَّیۡطَـٰنِ لِیَحۡزُنَ ٱلَّذِینَ ءَامَنُوا۟ وَلَیۡسَ بِضَاۤرِّهِمۡ شَیۡـًٔا إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡیَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 5115,
    "surahId": 58,
    "ayahNumber": 11,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا قِیلَ لَكُمۡ تَفَسَّحُوا۟ فِی ٱلۡمَجَـٰلِسِ فَٱفۡسَحُوا۟ یَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِیلَ ٱنشُزُوا۟ فَٱنشُزُوا۟ یَرۡفَعِ ٱللَّهُ ٱلَّذِینَ ءَامَنُوا۟ مِنكُمۡ وَٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ دَرَجَـٰتࣲۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِیرࣱ\n",
    "translations": {
      "en": "O YOU who have attained to faith! When you are told, “Make room for one another in your collective life”, do make room: [and in return,] God will make room for you [in His grace]. And whenever you are told, “Rise up [for a good deed]”, do rise up; [and] God will exalt by [many] degrees those of you who have attained to faith and, [above all,] such as have been vouchsafed [true] knowledge: for God is fully aware of all that you do.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا قِیلَ لَكُمۡ تَفَسَّحُوا۟ فِی ٱلۡمَجَـٰلِسِ فَٱفۡسَحُوا۟ یَفۡسَحِ ٱللَّهُ لَكُمۡۖ وَإِذَا قِیلَ ٱنشُزُوا۟ فَٱنشُزُوا۟ یَرۡفَعِ ٱللَّهُ ٱلَّذِینَ ءَامَنُوا۟ مِنكُمۡ وَٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ دَرَجَـٰتࣲۚ وَٱللَّهُ بِمَا تَعۡمَلُونَ خَبِیرࣱ\n"
    }
  },
  {
    "id": 5116,
    "surahId": 58,
    "ayahNumber": 12,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا نَـٰجَیۡتُمُ ٱلرَّسُولَ فَقَدِّمُوا۟ بَیۡنَ یَدَیۡ نَجۡوَىٰكُمۡ صَدَقَةࣰۚ ذَ ٰ⁠لِكَ خَیۡرࣱ لَّكُمۡ وَأَطۡهَرُۚ فَإِن لَّمۡ تَجِدُوا۟ فَإِنَّ ٱللَّهَ غَفُورࣱ رَّحِیمٌ\n",
    "translations": {
      "en": "O YOU who have attained to faith! Whenever you [intend to] consult the Apostle, offer up something in charity on the occasion of your consultation: this will be for your own good, and more conducive to your [inner] purity. Yet if you are unable to do so, [know that,] verily, God is much-forgiving, a dispen­ser of grace.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا نَـٰجَیۡتُمُ ٱلرَّسُولَ فَقَدِّمُوا۟ بَیۡنَ یَدَیۡ نَجۡوَىٰكُمۡ صَدَقَةࣰۚ ذَ ٰ⁠لِكَ خَیۡرࣱ لَّكُمۡ وَأَطۡهَرُۚ فَإِن لَّمۡ تَجِدُوا۟ فَإِنَّ ٱللَّهَ غَفُورࣱ رَّحِیمٌ\n"
    }
  },
  {
    "id": 5117,
    "surahId": 58,
    "ayahNumber": 13,
    "arabicText": "ءَأَشۡفَقۡتُمۡ أَن تُقَدِّمُوا۟ بَیۡنَ یَدَیۡ نَجۡوَىٰكُمۡ صَدَقَـٰتࣲۚ فَإِذۡ لَمۡ تَفۡعَلُوا۟ وَتَابَ ٱللَّهُ عَلَیۡكُمۡ فَأَقِیمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَأَطِیعُوا۟ ٱللَّهَ وَرَسُولَهُۥۚ وَٱللَّهُ خَبِیرُۢ بِمَا تَعۡمَلُونَ\n",
    "translations": {
      "en": "Do you, perchance, fear lest [you may be sinning if] you cannot offer up anything in charity on the occasion of your consultation [with the Apostle]? But if you fail to do it [for lack of opportunity], and God turns unto you in His mercy, remain but con­stant in prayer and render [no more than] the purify­ing dues, and [thus] pay heed unto God and His Apostle: for God is fully aware of all that you do.",
      "ms": "",
      "id": "",
      "ar": "ءَأَشۡفَقۡتُمۡ أَن تُقَدِّمُوا۟ بَیۡنَ یَدَیۡ نَجۡوَىٰكُمۡ صَدَقَـٰتࣲۚ فَإِذۡ لَمۡ تَفۡعَلُوا۟ وَتَابَ ٱللَّهُ عَلَیۡكُمۡ فَأَقِیمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَأَطِیعُوا۟ ٱللَّهَ وَرَسُولَهُۥۚ وَٱللَّهُ خَبِیرُۢ بِمَا تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 5118,
    "surahId": 58,
    "ayahNumber": 14,
    "arabicText": "۞ أَلَمۡ تَرَ إِلَى ٱلَّذِینَ تَوَلَّوۡا۟ قَوۡمًا غَضِبَ ٱللَّهُ عَلَیۡهِم مَّا هُم مِّنكُمۡ وَلَا مِنۡهُمۡ وَیَحۡلِفُونَ عَلَى ٱلۡكَذِبِ وَهُمۡ یَعۡلَمُونَ\n",
    "translations": {
      "en": "ART THOU NOT aware of those who would be friends with people whom God has condemned? They are neither of you [O believers] nor of those [who utterly reject the truth]: and so they swear to a falsehood the while they know [it to be false].",
      "ms": "",
      "id": "",
      "ar": "۞ أَلَمۡ تَرَ إِلَى ٱلَّذِینَ تَوَلَّوۡا۟ قَوۡمًا غَضِبَ ٱللَّهُ عَلَیۡهِم مَّا هُم مِّنكُمۡ وَلَا مِنۡهُمۡ وَیَحۡلِفُونَ عَلَى ٱلۡكَذِبِ وَهُمۡ یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 5119,
    "surahId": 58,
    "ayahNumber": 15,
    "arabicText": "أَعَدَّ ٱللَّهُ لَهُمۡ عَذَابࣰا شَدِیدًاۖ إِنَّهُمۡ سَاۤءَ مَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "God has readied for them suffering severe [in the life to come]. Behold, evil indeed is what they are wont to do:",
      "ms": "",
      "id": "",
      "ar": "أَعَدَّ ٱللَّهُ لَهُمۡ عَذَابࣰا شَدِیدًاۖ إِنَّهُمۡ سَاۤءَ مَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 5120,
    "surahId": 58,
    "ayahNumber": 16,
    "arabicText": "ٱتَّخَذُوۤا۟ أَیۡمَـٰنَهُمۡ جُنَّةࣰ فَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ فَلَهُمۡ عَذَابࣱ مُّهِینࣱ\n",
    "translations": {
      "en": "they have made their oaths a cover [for their falseness], and thus they turn others away from the path of God: hence, shameful suffering awaits them.",
      "ms": "",
      "id": "",
      "ar": "ٱتَّخَذُوۤا۟ أَیۡمَـٰنَهُمۡ جُنَّةࣰ فَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ فَلَهُمۡ عَذَابࣱ مُّهِینࣱ\n"
    }
  },
  {
    "id": 5121,
    "surahId": 58,
    "ayahNumber": 17,
    "arabicText": "لَّن تُغۡنِیَ عَنۡهُمۡ أَمۡوَ ٰ⁠لُهُمۡ وَلَاۤ أَوۡلَـٰدُهُم مِّنَ ٱللَّهِ شَیۡـًٔاۚ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلنَّارِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n",
    "translations": {
      "en": "Neither their worldly possessions nor their offspring will be of the least avail to them against God: it is they who are destined for the fire, therein to abide!",
      "ms": "",
      "id": "",
      "ar": "لَّن تُغۡنِیَ عَنۡهُمۡ أَمۡوَ ٰ⁠لُهُمۡ وَلَاۤ أَوۡلَـٰدُهُم مِّنَ ٱللَّهِ شَیۡـًٔاۚ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلنَّارِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n"
    }
  },
  {
    "id": 5122,
    "surahId": 58,
    "ayahNumber": 18,
    "arabicText": "یَوۡمَ یَبۡعَثُهُمُ ٱللَّهُ جَمِیعࣰا فَیَحۡلِفُونَ لَهُۥ كَمَا یَحۡلِفُونَ لَكُمۡ وَیَحۡسَبُونَ أَنَّهُمۡ عَلَىٰ شَیۡءٍۚ أَلَاۤ إِنَّهُمۡ هُمُ ٱلۡكَـٰذِبُونَ\n",
    "translations": {
      "en": "On the Day when God will raise them all from the dead, they will swear before Him as they [now] swear before you, thinking that they are on firm ground [in their assumptions]. Oh, verily, it is they, they who are the [greatest] liars!",
      "ms": "",
      "id": "",
      "ar": "یَوۡمَ یَبۡعَثُهُمُ ٱللَّهُ جَمِیعࣰا فَیَحۡلِفُونَ لَهُۥ كَمَا یَحۡلِفُونَ لَكُمۡ وَیَحۡسَبُونَ أَنَّهُمۡ عَلَىٰ شَیۡءٍۚ أَلَاۤ إِنَّهُمۡ هُمُ ٱلۡكَـٰذِبُونَ\n"
    }
  },
  {
    "id": 5123,
    "surahId": 58,
    "ayahNumber": 19,
    "arabicText": "ٱسۡتَحۡوَذَ عَلَیۡهِمُ ٱلشَّیۡطَـٰنُ فَأَنسَىٰهُمۡ ذِكۡرَ ٱللَّهِۚ أُو۟لَـٰۤىِٕكَ حِزۡبُ ٱلشَّیۡطَـٰنِۚ أَلَاۤ إِنَّ حِزۡبَ ٱلشَّیۡطَـٰنِ هُمُ ٱلۡخَـٰسِرُونَ\n",
    "translations": {
      "en": "Satan has gained mastery over them, and has caused them to remain oblivious of the remem­brance of God. Such as these are Satan’s partisans: oh, verily, it is they, the partisans of Satan, who will truly be the losers!",
      "ms": "",
      "id": "",
      "ar": "ٱسۡتَحۡوَذَ عَلَیۡهِمُ ٱلشَّیۡطَـٰنُ فَأَنسَىٰهُمۡ ذِكۡرَ ٱللَّهِۚ أُو۟لَـٰۤىِٕكَ حِزۡبُ ٱلشَّیۡطَـٰنِۚ أَلَاۤ إِنَّ حِزۡبَ ٱلشَّیۡطَـٰنِ هُمُ ٱلۡخَـٰسِرُونَ\n"
    }
  },
  {
    "id": 5124,
    "surahId": 58,
    "ayahNumber": 20,
    "arabicText": "إِنَّ ٱلَّذِینَ یُحَاۤدُّونَ ٱللَّهَ وَرَسُولَهُۥۤ أُو۟لَـٰۤىِٕكَ فِی ٱلۡأَذَلِّینَ\n",
    "translations": {
      "en": "Verily, those who contend against God and His Apostle - it is they who [on Judgment Day] shall find themselves among the most abject.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ یُحَاۤدُّونَ ٱللَّهَ وَرَسُولَهُۥۤ أُو۟لَـٰۤىِٕكَ فِی ٱلۡأَذَلِّینَ\n"
    }
  },
  {
    "id": 5125,
    "surahId": 58,
    "ayahNumber": 21,
    "arabicText": "كَتَبَ ٱللَّهُ لَأَغۡلِبَنَّ أَنَا۠ وَرُسُلِیۤۚ إِنَّ ٱللَّهَ قَوِیٌّ عَزِیزࣱ\n",
    "translations": {
      "en": "[For] God has thus ordained: “I shall most certainly prevail, I and My apostles!” Verily, God is powerful, almighty!",
      "ms": "",
      "id": "",
      "ar": "كَتَبَ ٱللَّهُ لَأَغۡلِبَنَّ أَنَا۠ وَرُسُلِیۤۚ إِنَّ ٱللَّهَ قَوِیٌّ عَزِیزࣱ\n"
    }
  },
  {
    "id": 5126,
    "surahId": 58,
    "ayahNumber": 22,
    "arabicText": "لَّا تَجِدُ قَوۡمࣰا یُؤۡمِنُونَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ یُوَاۤدُّونَ مَنۡ حَاۤدَّ ٱللَّهَ وَرَسُولَهُۥ وَلَوۡ كَانُوۤا۟ ءَابَاۤءَهُمۡ أَوۡ أَبۡنَاۤءَهُمۡ أَوۡ إِخۡوَ ٰ⁠نَهُمۡ أَوۡ عَشِیرَتَهُمۡۚ أُو۟لَـٰۤىِٕكَ كَتَبَ فِی قُلُوبِهِمُ ٱلۡإِیمَـٰنَ وَأَیَّدَهُم بِرُوحࣲ مِّنۡهُۖ وَیُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۚ رَضِیَ ٱللَّهُ عَنۡهُمۡ وَرَضُوا۟ عَنۡهُۚ أُو۟لَـٰۤىِٕكَ حِزۡبُ ٱللَّهِۚ أَلَاۤ إِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡمُفۡلِحُونَ\n",
    "translations": {
      "en": "Thou canst not find people who [truly] believe in God and the Last Day and [at the same time] love anyone who contends against God and His Apostle - even though they be their fathers, or their sons, or their brothers, or [others of] their kindred. [As for the true believers,] it is they in whose hearts He has inscribed faith, and whom He has strength­ened with inspiration from Himself, and whom [in time] He will admit into gardens through which running waters flow, therein to abide. Well-pleased is God with them, and well-pleased are they with Him. They are God’s partisans: oh, verily, it is they, the partisans of God, who shall attain to a happy state!",
      "ms": "",
      "id": "",
      "ar": "لَّا تَجِدُ قَوۡمࣰا یُؤۡمِنُونَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ یُوَاۤدُّونَ مَنۡ حَاۤدَّ ٱللَّهَ وَرَسُولَهُۥ وَلَوۡ كَانُوۤا۟ ءَابَاۤءَهُمۡ أَوۡ أَبۡنَاۤءَهُمۡ أَوۡ إِخۡوَ ٰ⁠نَهُمۡ أَوۡ عَشِیرَتَهُمۡۚ أُو۟لَـٰۤىِٕكَ كَتَبَ فِی قُلُوبِهِمُ ٱلۡإِیمَـٰنَ وَأَیَّدَهُم بِرُوحࣲ مِّنۡهُۖ وَیُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۚ رَضِیَ ٱللَّهُ عَنۡهُمۡ وَرَضُوا۟ عَنۡهُۚ أُو۟لَـٰۤىِٕكَ حِزۡبُ ٱللَّهِۚ أَلَاۤ إِنَّ حِزۡبَ ٱللَّهِ هُمُ ٱلۡمُفۡلِحُونَ\n"
    }
  }
]