[
  {
    "id": 790,
    "surahId": 6,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَجَعَلَ ٱلظُّلُمَـٰتِ وَٱلنُّورَۖ ثُمَّ ٱلَّذِینَ كَفَرُوا۟ بِرَبِّهِمۡ یَعۡدِلُونَ\n",
    "translations": {
      "en": "ALL PRAISE is due to God, who has created the heavens and the earth, and brought into being deep darkness as well as light: and yet, those who are bent on denying the truth regard other powers as their Sustainer's equals!",
      "ms": "Segala puji tertentu bagi Allah yang menciptakan langit dan bumi, dan menjadikan gelap dan terang; dalam pada itu, orang-orang kafir menyamakan (sesuatu yang lain) dengan tuhan mereka.",
      "id": "Segala puji bagi Allah Yang telah menciptakan langit dan bumi dan mengadakan gelap dan terang, namun orang-orang yang kafir mempersekutukan (sesuatu) dengan Tuhan mereka.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَجَعَلَ ٱلظُّلُمَـٰتِ وَٱلنُّورَۖ ثُمَّ ٱلَّذِینَ كَفَرُوا۟ بِرَبِّهِمۡ یَعۡدِلُونَ\n"
    }
  },
  {
    "id": 791,
    "surahId": 6,
    "ayahNumber": 2,
    "arabicText": "هُوَ ٱلَّذِی خَلَقَكُم مِّن طِینࣲ ثُمَّ قَضَىٰۤ أَجَلࣰاۖ وَأَجَلࣱ مُّسَمًّى عِندَهُۥۖ ثُمَّ أَنتُمۡ تَمۡتَرُونَ\n",
    "translations": {
      "en": "He it is who has created you out of clay, and then has decreed a term [for you] - a term known [only] to him. And yet you doubt –",
      "ms": "Dia lah yang menciptakan kamu dari tanah, kemudian Ia tentukan ajal (kematian kamu) dan satu ajal lagi yang tertentu di sisiNya (iaitu masa yang telah ditetapkan untuk dibangkitkan kamu semula pada hari kiamat); dalam pada itu, kamu masih ragu-ragu (tentang hari pembalasan).",
      "id": "Dialah Yang menciptakan kamu dari tanah, sesudah itu ditentukannya ajal (kematianmu), dan ada lagi suatu ajal yang ada pada sisi-Nya (yang Dia sendirilah mengetahuinya), kemudian kamu masih ragu-ragu (tentang berbangkit itu).",
      "ar": "هُوَ ٱلَّذِی خَلَقَكُم مِّن طِینࣲ ثُمَّ قَضَىٰۤ أَجَلࣰاۖ وَأَجَلࣱ مُّسَمًّى عِندَهُۥۖ ثُمَّ أَنتُمۡ تَمۡتَرُونَ\n"
    }
  },
  {
    "id": 792,
    "surahId": 6,
    "ayahNumber": 3,
    "arabicText": "وَهُوَ ٱللَّهُ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَفِی ٱلۡأَرۡضِ یَعۡلَمُ سِرَّكُمۡ وَجَهۡرَكُمۡ وَیَعۡلَمُ مَا تَكۡسِبُونَ\n",
    "translations": {
      "en": "although He is God in the heavens and on earth, knowing all that you keep secret as well as all that you do openly, and knowing what you deserve.",
      "ms": "Dan Dia lah Allah (yang disembah dan diakui kekuasaanNya) di langit dan di bumi; Ia mengetahui apa yang kamu rahsiakan dan apa yang kamu lahirkan, dan Ia juga mengetahui apa yang kamu usahakan.",
      "id": "Dan Dialah Allah (yang disembah), baik di langit maupun di bumi; Dia mengetahui apa yang kamu rahasiakan dan apa yang kamu lahirkan dan mengetahui (pula) apa yang kamu usahakan.",
      "ar": "وَهُوَ ٱللَّهُ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَفِی ٱلۡأَرۡضِ یَعۡلَمُ سِرَّكُمۡ وَجَهۡرَكُمۡ وَیَعۡلَمُ مَا تَكۡسِبُونَ\n"
    }
  },
  {
    "id": 793,
    "surahId": 6,
    "ayahNumber": 4,
    "arabicText": "وَمَا تَأۡتِیهِم مِّنۡ ءَایَةࣲ مِّنۡ ءَایَـٰتِ رَبِّهِمۡ إِلَّا كَانُوا۟ عَنۡهَا مُعۡرِضِینَ\n",
    "translations": {
      "en": "Yet whenever any of their Sustainer's messages comes unto them, they [who are bent on denying the truth] turn their backs upon it:",
      "ms": "Dan tidak ada sesuatu keterangan yang sampai kepada mereka (yang kafir) dari keterangan-keterangan Tuhan mereka, melainkan mereka selalu berpaling daripadanya (enggan menerimanya).",
      "id": "Dan tidak ada suatu ayatpun dari ayat-ayat Tuhan sampai kepada mereka, melainkan mereka selalu berpaling dari padanya (mendustakannya).",
      "ar": "وَمَا تَأۡتِیهِم مِّنۡ ءَایَةࣲ مِّنۡ ءَایَـٰتِ رَبِّهِمۡ إِلَّا كَانُوا۟ عَنۡهَا مُعۡرِضِینَ\n"
    }
  },
  {
    "id": 794,
    "surahId": 6,
    "ayahNumber": 5,
    "arabicText": "فَقَدۡ كَذَّبُوا۟ بِٱلۡحَقِّ لَمَّا جَاۤءَهُمۡ فَسَوۡفَ یَأۡتِیهِمۡ أَنۢبَـٰۤؤُا۟ مَا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n",
    "translations": {
      "en": "and so they give the lie to this truth now that it has come unto them. In time, however, they will come to understand what it was that they were wont to deride.",
      "ms": "Sesungguhnya mereka telah mendustakan kebenaran (Al-Quran) ketika ia sampai kepada mereka. Oleh itu, akan datanglah kepada mereka berita (yang membuktikan kebenaran) apa yang mereka selalu ejek-ejek itu (iaitu mereka akan ditimpa bala bencana).",
      "id": "Sesungguhnya mereka telah mendustakan yang haq (Al-Quran) tatkala sampai kepada mereka, maka kelak akan sampai kepada mereka (kenyataan dari) berita-berita yang selalu mereka perolok-olokkan.",
      "ar": "فَقَدۡ كَذَّبُوا۟ بِٱلۡحَقِّ لَمَّا جَاۤءَهُمۡ فَسَوۡفَ یَأۡتِیهِمۡ أَنۢبَـٰۤؤُا۟ مَا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n"
    }
  },
  {
    "id": 795,
    "surahId": 6,
    "ayahNumber": 6,
    "arabicText": "أَلَمۡ یَرَوۡا۟ كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنࣲ مَّكَّنَّـٰهُمۡ فِی ٱلۡأَرۡضِ مَا لَمۡ نُمَكِّن لَّكُمۡ وَأَرۡسَلۡنَا ٱلسَّمَاۤءَ عَلَیۡهِم مِّدۡرَارࣰا وَجَعَلۡنَا ٱلۡأَنۡهَـٰرَ تَجۡرِی مِن تَحۡتِهِمۡ فَأَهۡلَكۡنَـٰهُم بِذُنُوبِهِمۡ وَأَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قَرۡنًا ءَاخَرِینَ\n",
    "translations": {
      "en": "Do they not see how many a generation We have destroyed before their time - [people] whom We had given a [bountiful] place on earth, the like of which We never gave unto you, and upon whom We showered heavenly blessings abundant, and at whose feet We made running waters flow? And yet we destroyed them for their sins, and gave rise to other people in their stead.",
      "ms": "Tidakkah mereka memerhati dan memikirkan berapa banyak umat-umat yang telah Kami binasakan sebelum mereka, padahal (umat-umat itu) telah Kami teguhkan kedudukan mereka di muka bumi (dengan kekuasaan dan kemewahan) yang tidak Kami berikan kepada kamu, dan Kami turunkan hujan atas mereka dengan lebatnya, dan Kami jadikan sungai-sungai mengalir di bawah mereka, kemudian Kami binasakan mereka dengan sebab dosa mereka mereka, dan Kami ciptakan sesudah mereka, umat yang lain?",
      "id": "Apakah mereka tidak memperhatikan berapa banyak generasi yang telah Kami binasakan sebelum mereka, padahal (generasi itu) telah Kami teguhkan kedudukan mereka di muka bumi, yaitu keteguhan yang belum pernah Kami berikan kepadamu, dan Kami curahkan hujan yang lebat atas mereka dan Kami jadikan sungai-sungai mengalir di bawah mereka, kemudian Kami binasakan mereka karena dosa mereka sendiri, dan Kami ciptakan sesudah mereka generasi yang lain.",
      "ar": "أَلَمۡ یَرَوۡا۟ كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنࣲ مَّكَّنَّـٰهُمۡ فِی ٱلۡأَرۡضِ مَا لَمۡ نُمَكِّن لَّكُمۡ وَأَرۡسَلۡنَا ٱلسَّمَاۤءَ عَلَیۡهِم مِّدۡرَارࣰا وَجَعَلۡنَا ٱلۡأَنۡهَـٰرَ تَجۡرِی مِن تَحۡتِهِمۡ فَأَهۡلَكۡنَـٰهُم بِذُنُوبِهِمۡ وَأَنشَأۡنَا مِنۢ بَعۡدِهِمۡ قَرۡنًا ءَاخَرِینَ\n"
    }
  },
  {
    "id": 796,
    "surahId": 6,
    "ayahNumber": 7,
    "arabicText": "وَلَوۡ نَزَّلۡنَا عَلَیۡكَ كِتَـٰبࣰا فِی قِرۡطَاسࣲ فَلَمَسُوهُ بِأَیۡدِیهِمۡ لَقَالَ ٱلَّذِینَ كَفَرُوۤا۟ إِنۡ هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "But even if we had sent down unto thee [O Prophet] a writing on paper, and they had touched it with their own hands - those who are bent on denying the truth would indeed have said, \"This is clearly nothing but a deception!\"",
      "ms": "Dan kalau Kami turunkan kepadamu (wahai Muhammad) sebuah kitab (yang bertulis) pada kertas, lalu mereka memegangnya dengan tangan mereka, nescaya orang-orang yang kafir itu berkata: \"Ini tidak lain, hanyalah sihir yang terang nyata\".",
      "id": "Dan kalau Kami turunkan kepadamu tulisan di atas kertas, lalu mereka dapat menyentuhnya dengan tangan mereka sendiri, tentulah orang-orang kafir itu berkata: \"Ini tidak lain hanyalah sihir yang nyata\".",
      "ar": "وَلَوۡ نَزَّلۡنَا عَلَیۡكَ كِتَـٰبࣰا فِی قِرۡطَاسࣲ فَلَمَسُوهُ بِأَیۡدِیهِمۡ لَقَالَ ٱلَّذِینَ كَفَرُوۤا۟ إِنۡ هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 797,
    "surahId": 6,
    "ayahNumber": 8,
    "arabicText": "وَقَالُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ مَلَكࣱۖ وَلَوۡ أَنزَلۡنَا مَلَكࣰا لَّقُضِیَ ٱلۡأَمۡرُ ثُمَّ لَا یُنظَرُونَ\n",
    "translations": {
      "en": "They are saying, too, \"Why has not an angel (visibly] been sent down unto him?\" But had we sent down an angel, all would indeed have been decided, and they would have been allowed no further respite [for repentance.",
      "ms": "Dan mereka berkata: \"Mengapa tidak diturunkan malaikat kepadanya? \" padahal kalau Kami turunkan malaikat nescaya selesailah perkara itu (kerana mereka tetap berdegil dan tidak akan beriman), kemudian mereka tidak diberi tempoh (lalu dibinasakan dengan bala bencana secara mengejut).",
      "id": "Dan mereka berkata: \"Mengapa tidak diturunkan kepadanya (Muhammad) malaikat?\" dan kalau Kami turunkan (kepadanya) malaikat, tentulah selesai urusan itu, kemudian mereka tidak diberi tangguh (sedikitpun).",
      "ar": "وَقَالُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ مَلَكࣱۖ وَلَوۡ أَنزَلۡنَا مَلَكࣰا لَّقُضِیَ ٱلۡأَمۡرُ ثُمَّ لَا یُنظَرُونَ\n"
    }
  },
  {
    "id": 798,
    "surahId": 6,
    "ayahNumber": 9,
    "arabicText": "وَلَوۡ جَعَلۡنَـٰهُ مَلَكࣰا لَّجَعَلۡنَـٰهُ رَجُلࣰا وَلَلَبَسۡنَا عَلَیۡهِم مَّا یَلۡبِسُونَ\n",
    "translations": {
      "en": "And (even] if We had appointed an angel as Our message-bearer, We would certainly have made him [appear as] a man - and thus We would only have confused them in the same way as they are now confusing themselves.",
      "ms": "Dan kalau (Rasul) itu Kami jadikan malaikat, tentulah Kami jadikan dia berupa seorang lelaki (supaya mereka dapat melihatnya), dan tentulah Kami (dengan yang demikian) menyebabkan mereka kesamaran sebagaimana mereka sengaja membuat-buat kesamaran (tentang kebenaran Nabi Muhammad s.a.w).",
      "id": "Dan kalau Kami jadikan rasul itu malaikat, tentulah Kami jadikan dia seorang laki-laki dan (kalau Kami jadikan ia seorang laki-laki), tentulah Kami meragu-ragukan atas mereka apa yang mereka ragu-ragukan atas diri mereka sendiri.",
      "ar": "وَلَوۡ جَعَلۡنَـٰهُ مَلَكࣰا لَّجَعَلۡنَـٰهُ رَجُلࣰا وَلَلَبَسۡنَا عَلَیۡهِم مَّا یَلۡبِسُونَ\n"
    }
  },
  {
    "id": 799,
    "surahId": 6,
    "ayahNumber": 10,
    "arabicText": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلࣲ مِّن قَبۡلِكَ فَحَاقَ بِٱلَّذِینَ سَخِرُوا۟ مِنۡهُم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n",
    "translations": {
      "en": "And, indeed, [even] before thy time have apostles been derided - but those who scoffed at them were [in the end] overwhelmed by the very thing which they were wont to deride.",
      "ms": "Dan demi sesungguhnya! Telah diperolok-olok beberapa Rasul sebelummu, lalu orang-orang yang mengejek-ejek di antara mereka ditimpakan (balasan azab) bagi apa yang mereka telah perolok-olokkan itu.",
      "id": "Dan sungguh telah diperolok-olokkan beberapa rasul sebelum kamu, maka turunlah kepada orang-orang yang mencemoohkan di antara mereka balasan (azab) olok-olokan mereka.",
      "ar": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلࣲ مِّن قَبۡلِكَ فَحَاقَ بِٱلَّذِینَ سَخِرُوا۟ مِنۡهُم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n"
    }
  },
  {
    "id": 800,
    "surahId": 6,
    "ayahNumber": 11,
    "arabicText": "قُلۡ سِیرُوا۟ فِی ٱلۡأَرۡضِ ثُمَّ ٱنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلۡمُكَذِّبِینَ\n",
    "translations": {
      "en": "Say: \"Go all over the earth, and behold what happened in the end to those who gave the lie to the truth!\"",
      "ms": "Katakanlah (wahai Muhammad): \"Mengembaralah kamu di muka bumi, kemudian perhatikanlah bagaimana akibat buruk (yang menimpa) orang-orang yang mendustakan (Rasul-rasul) itu.\"",
      "id": "Katakanlah: \"Berjalanlah di muka bumi, kemudian perhatikanlah bagaimana kesudahan orang-orang yang mendustakan itu\".",
      "ar": "قُلۡ سِیرُوا۟ فِی ٱلۡأَرۡضِ ثُمَّ ٱنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلۡمُكَذِّبِینَ\n"
    }
  },
  {
    "id": 801,
    "surahId": 6,
    "ayahNumber": 12,
    "arabicText": "قُل لِّمَن مَّا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ قُل لِّلَّهِۚ كَتَبَ عَلَىٰ نَفۡسِهِ ٱلرَّحۡمَةَۚ لَیَجۡمَعَنَّكُمۡ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ لَا رَیۡبَ فِیهِۚ ٱلَّذِینَ خَسِرُوۤا۟ أَنفُسَهُمۡ فَهُمۡ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Say: \"Unto whom belongs all that is in the heavens and on earth?\" Say: \"Unto God, who has willed upon Himself the law of grace and mercy. He will assuredly gather you all together on the Day of Resurrection, [the coming of] which is beyond all doubt: yet those who have squandered their own selves-it is they who refuse to believe [in Him],",
      "ms": "Bertanyalah (wahai muhammad): \"Hak milik siapakah segala yang ada di langit dan di bumi?\" Katakanlah: \"(Semuanya itu) adalah milik Allah. Ia telah menetapkan atas diriNya memberi rahmat. Demi sesungguhnya Ia akan menghimpunkan kamu pada hari kiamat yang tidak ada sebarang syak padanya\". Orang-orang yang merugikan diri sendiri (dangan mensia-siakan pengurniaan Allah), maka mereka (dengan sebab yang tersebut) tidak beriman.",
      "id": "Katakanlah: \"Kepunyaan siapakah apa yang ada di langit dan di bumi\". Katakanlah: \"Kepunyaan Allah\". Dia telah menetapkan atas Diri-Nya kasih sayang. Dia sungguh akan menghimpun kamu pada hari kiamat yang tidak ada keraguan padanya. Orang-orang yang meragukan dirinya mereka itu tidak beriman.",
      "ar": "قُل لِّمَن مَّا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ قُل لِّلَّهِۚ كَتَبَ عَلَىٰ نَفۡسِهِ ٱلرَّحۡمَةَۚ لَیَجۡمَعَنَّكُمۡ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ لَا رَیۡبَ فِیهِۚ ٱلَّذِینَ خَسِرُوۤا۟ أَنفُسَهُمۡ فَهُمۡ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 802,
    "surahId": 6,
    "ayahNumber": 13,
    "arabicText": "۞ وَلَهُۥ مَا سَكَنَ فِی ٱلَّیۡلِ وَٱلنَّهَارِۚ وَهُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n",
    "translations": {
      "en": "although His is all that dwells in the night and the day, and He alone is all-hearing, all-knowing.",
      "ms": "Dan bagi Allah jualah apa yang ada pada waktu malam dan siang; dan Dia lah Yang Maha Mendengar, lagi Maha Mengetahui.",
      "id": "Dan kepunyaan Allah-lah segala yang ada pada malam dan siang. Dan Dialah Yang Maha Mendengar lagi Maha Mengetahui.",
      "ar": "۞ وَلَهُۥ مَا سَكَنَ فِی ٱلَّیۡلِ وَٱلنَّهَارِۚ وَهُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n"
    }
  },
  {
    "id": 803,
    "surahId": 6,
    "ayahNumber": 14,
    "arabicText": "قُلۡ أَغَیۡرَ ٱللَّهِ أَتَّخِذُ وَلِیࣰّا فَاطِرِ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَهُوَ یُطۡعِمُ وَلَا یُطۡعَمُۗ قُلۡ إِنِّیۤ أُمِرۡتُ أَنۡ أَكُونَ أَوَّلَ مَنۡ أَسۡلَمَۖ وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِینَ\n",
    "translations": {
      "en": "Say: \"Am I to take for my master anyone but God, the Originator of the heavens and the earth, when it is He who gives nourishment and Himself needs none?” Say: \"I am bidden to be foremost among those who surrender themselves unto God, and not to be among those who ascribe divinity to aught beside Him.\"",
      "ms": "Katakanlah (wahai Muhammad): \"Patutkah aku mengambil (memilih) pelindung yang lain dari Allah yang menciptakan langit dan bumi, dan Ia pula yang memberi makan dan bukan Ia yang diberi makan?\" Katakanlah: \"Sesungguhnya aku diperintahkan supaya menjadi orang yang pertama sekali menyerah diri kepada Allah (Islam), dan (aku diperintahkan dengan firmanNya): `Jangan sekali-kali engkau menjadi dari golongan orang-orang musyrik itu. ' \"",
      "id": "Katakanlah: \"Apakah akan aku jadikan pelindung selain dari Allah yang menjadikan langit dan bumi, padahal Dia memberi makan dan tidak memberi makan?\" Katakanlah: \"Sesungguhnya aku diperintah supaya aku menjadi orang yang pertama kali menyerah diri (kepada Allah), dan jangan sekali-kali kamu masuk golongan orang musyrik\".",
      "ar": "قُلۡ أَغَیۡرَ ٱللَّهِ أَتَّخِذُ وَلِیࣰّا فَاطِرِ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَهُوَ یُطۡعِمُ وَلَا یُطۡعَمُۗ قُلۡ إِنِّیۤ أُمِرۡتُ أَنۡ أَكُونَ أَوَّلَ مَنۡ أَسۡلَمَۖ وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِینَ\n"
    }
  },
  {
    "id": 804,
    "surahId": 6,
    "ayahNumber": 15,
    "arabicText": "قُلۡ إِنِّیۤ أَخَافُ إِنۡ عَصَیۡتُ رَبِّی عَذَابَ یَوۡمٍ عَظِیمࣲ\n",
    "translations": {
      "en": "Say: \"Behold, I would dread, were I [thus] to rebel against my Sustainer, the suffering [which would befall me] on that awesome Day [of Judgment].\"",
      "ms": "Katakanlah: \"Sesungguhnya aku takut jika aku derhaka kepada Tuhanku, (akan dikenakan) azab hari yang besar (hari kiamat)\".",
      "id": "Katakanlah: \"Sesungguhnya aku takut akan azab hari yang besar (hari kiamat), jika aku mendurhakai Tuhanku\".",
      "ar": "قُلۡ إِنِّیۤ أَخَافُ إِنۡ عَصَیۡتُ رَبِّی عَذَابَ یَوۡمٍ عَظِیمࣲ\n"
    }
  },
  {
    "id": 805,
    "surahId": 6,
    "ayahNumber": 16,
    "arabicText": "مَّن یُصۡرَفۡ عَنۡهُ یَوۡمَىِٕذࣲ فَقَدۡ رَحِمَهُۥۚ وَذَ ٰ⁠لِكَ ٱلۡفَوۡزُ ٱلۡمُبِینُ\n",
    "translations": {
      "en": "Upon him who shall be spared on that Day, He will indeed have bestowed His grace: and this will be a manifest triumph.",
      "ms": "Sesiapa yang dijauhkan azab daripadanya pada hari itu, maka sesugguhnya Allah telah memberi rahmat kepadanya; dan itulah kejayaan yang jelas nyata.",
      "id": "Barang siapa yang dijauhkan azab dari padanya pada hari itu, maka sungguh Allah telah memberikan rahmat kepadanya. Dan itulah keberuntungan yang nyata.",
      "ar": "مَّن یُصۡرَفۡ عَنۡهُ یَوۡمَىِٕذࣲ فَقَدۡ رَحِمَهُۥۚ وَذَ ٰ⁠لِكَ ٱلۡفَوۡزُ ٱلۡمُبِینُ\n"
    }
  },
  {
    "id": 806,
    "surahId": 6,
    "ayahNumber": 17,
    "arabicText": "وَإِن یَمۡسَسۡكَ ٱللَّهُ بِضُرࣲّ فَلَا كَاشِفَ لَهُۥۤ إِلَّا هُوَۖ وَإِن یَمۡسَسۡكَ بِخَیۡرࣲ فَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n",
    "translations": {
      "en": "And if God should touch thee with misfortune, there is none who could remove it but He; and if He should touch thee with good fortune -it is He who has the power to will anything:",
      "ms": "Dan jika Allah mengenakan (menimpakan) engkau dengan bahaya bencana, maka tidak ada sesiapa pun yang dapat menghapuskannya melainkan Dia sendiri; dan jika Ia mengenakan (melimpahkan) engkau dengan kebaikan, maka Ia adalah Maha Kuasa atas tiap-tiap sesuatu.",
      "id": "Dan jika Allah menimpakan sesuatu kemudharatan kepadamu, maka tidak ada yang menghilangkannya melainkan Dia sendiri. Dan jika Dia mendatangkan kebaikan kepadamu, maka Dia Maha Kuasa atas tiap-tiap sesuatu.",
      "ar": "وَإِن یَمۡسَسۡكَ ٱللَّهُ بِضُرࣲّ فَلَا كَاشِفَ لَهُۥۤ إِلَّا هُوَۖ وَإِن یَمۡسَسۡكَ بِخَیۡرࣲ فَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n"
    }
  },
  {
    "id": 807,
    "surahId": 6,
    "ayahNumber": 18,
    "arabicText": "وَهُوَ ٱلۡقَاهِرُ فَوۡقَ عِبَادِهِۦۚ وَهُوَ ٱلۡحَكِیمُ ٱلۡخَبِیرُ\n",
    "translations": {
      "en": "for He alone holds sway over His creatures, and He alone is truly wise, all-aware.",
      "ms": "Dan Dia lah yang Berkuasa atas sekalian hambaNya (dangan tadbir dan takdir); dan Dia lah Yang Maha Bijaksana serta Amat Mendalam PengetahuanNya.",
      "id": "Dan Dialah yang berkuasa atas sekalian hamba-hamba-Nya. Dan Dialah Yang Maha Bijaksana lagi Maha Mengetahui.",
      "ar": "وَهُوَ ٱلۡقَاهِرُ فَوۡقَ عِبَادِهِۦۚ وَهُوَ ٱلۡحَكِیمُ ٱلۡخَبِیرُ\n"
    }
  },
  {
    "id": 808,
    "surahId": 6,
    "ayahNumber": 19,
    "arabicText": "قُلۡ أَیُّ شَیۡءٍ أَكۡبَرُ شَهَـٰدَةࣰۖ قُلِ ٱللَّهُۖ شَهِیدُۢ بَیۡنِی وَبَیۡنَكُمۡۚ وَأُوحِیَ إِلَیَّ هَـٰذَا ٱلۡقُرۡءَانُ لِأُنذِرَكُم بِهِۦ وَمَنۢ بَلَغَۚ أَىِٕنَّكُمۡ لَتَشۡهَدُونَ أَنَّ مَعَ ٱللَّهِ ءَالِهَةً أُخۡرَىٰۚ قُل لَّاۤ أَشۡهَدُۚ قُلۡ إِنَّمَا هُوَ إِلَـٰهࣱ وَ ٰ⁠حِدࣱ وَإِنَّنِی بَرِیۤءࣱ مِّمَّا تُشۡرِكُونَ\n",
    "translations": {
      "en": "Say: \"What could most weightily bear witness to the truth?\" Say: \"God is witness between me and you; and this Qur’an has been revealed unto me so that on the strength thereof I might warn you and all whom it may reach.\" Could you in truth bear witness that there are other deities side by side with God? Say: \"I bear no [such] witness!\" Say: \"He is the One God; and, behold, far be it from me to ascribe divinity, as, you do, to aught beside Him!\"",
      "ms": "Bertanyalah (wahai Muhammad): \"Apakah sesuatu yang lebih besar persaksiannya?\" (Bagi menjawabnya) katakanlah: \"Allah menjadi Saksi antaraku dengan kamu, dan diwahyukan kepadaku Al-Quran ini, supaya aku memberi amaran dengannya kepada kamu dan juga (kepada) sesiapa yang telah sampai kepadanya seruan Al-Quran itu. Adakah kamu sungguh-sungguh mengakui bahawa ada beberapa tuhan yang lain bersama-sama Allah?\" Katakanlah: \"Aku tidak mengakuinya\". Katakanlah lagi: \"Hanyasanya Dia lah sahaja Tuhan Yang Maha Esa, dan sesungguhnya aku adalah berlepas diri apa yang kamu sekutukan (dengan Allah Azza Wa Jalla)\".",
      "id": "Katakanlah: \"Siapakah yang lebih kuat persaksiannya?\" Katakanlah: \"Allah\". Dia menjadi saksi antara aku dan kamu. Dan Al Quran ini diwahyukan kepadaku supaya dengan dia aku memberi peringatan kepadamu dan kepada orang-orang yang sampai Al-Quran (kepadanya). Apakah sesungguhnya kamu mengakui bahwa ada tuhan-tuhan lain di samping Allah?\" Katakanlah: \"Aku tidak mengakui\". Katakanlah: \"Sesungguhnya Dia adalah Tuhan Yang Maha Esa dan sesungguhnya aku berlepas diri dari apa yang kamu persekutukan (dengan Allah)\".",
      "ar": "قُلۡ أَیُّ شَیۡءٍ أَكۡبَرُ شَهَـٰدَةࣰۖ قُلِ ٱللَّهُۖ شَهِیدُۢ بَیۡنِی وَبَیۡنَكُمۡۚ وَأُوحِیَ إِلَیَّ هَـٰذَا ٱلۡقُرۡءَانُ لِأُنذِرَكُم بِهِۦ وَمَنۢ بَلَغَۚ أَىِٕنَّكُمۡ لَتَشۡهَدُونَ أَنَّ مَعَ ٱللَّهِ ءَالِهَةً أُخۡرَىٰۚ قُل لَّاۤ أَشۡهَدُۚ قُلۡ إِنَّمَا هُوَ إِلَـٰهࣱ وَ ٰ⁠حِدࣱ وَإِنَّنِی بَرِیۤءࣱ مِّمَّا تُشۡرِكُونَ\n"
    }
  },
  {
    "id": 809,
    "surahId": 6,
    "ayahNumber": 20,
    "arabicText": "ٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ یَعۡرِفُونَهُۥ كَمَا یَعۡرِفُونَ أَبۡنَاۤءَهُمُۘ ٱلَّذِینَ خَسِرُوۤا۟ أَنفُسَهُمۡ فَهُمۡ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "They unto whom we have vouchsafed revelation aforetime know this as they know their own children; yet those [of them] who have squandered their own selves -it is they who refuse to believe.",
      "ms": "Orang-orang (Yahudi dan Nasrani) yang telah Kami berikan kitab kepada mereka, mereka mengenalinya (Nabi Muhammad), sebagaimana mereka mengenali anak-anak mereka sendiri. Orang-orang yang merugikan diri sendiri (dengan mensia-siakan pengurniaan Allah), maka mereka (dengan sebab yang tersebut) tidak beriman.",
      "id": "Orang-orang yang telah Kami berikan kitab kepadanya, mereka mengenalnya (Muhammad) seperti mereka mengenal anak-anaknya sendiri. Orang-orang yang merugikan dirinya, mereka itu tidak beriman (kepada Allah).",
      "ar": "ٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ یَعۡرِفُونَهُۥ كَمَا یَعۡرِفُونَ أَبۡنَاۤءَهُمُۘ ٱلَّذِینَ خَسِرُوۤا۟ أَنفُسَهُمۡ فَهُمۡ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 810,
    "surahId": 6,
    "ayahNumber": 21,
    "arabicText": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِـَٔایَـٰتِهِۦۤۚ إِنَّهُۥ لَا یُفۡلِحُ ٱلظَّـٰلِمُونَ\n",
    "translations": {
      "en": "And who could be more wicked than he who attributes his own lying inventions to God or gives the lie to His messages? Verily, such evildoers will never attain to a happy state:",
      "ms": "Dan siapakah lagi yang lebih aniaya dari orang yang mengada-adakan perkara-perkara yang dusta terhadap Allah, atau yang mendustakan ayat-ayat keteranganNya? Sesungguhnya orang-orang yang zalim itu tidak akan berjaya.",
      "id": "Dan siapakah yang lebih aniaya daripada orang yang membuat-buat suatu kedustaan terhadap Allah, atau mendustakan ayat-ayat-Nya? Sesungguhnya orang-orang yang aniaya itu tidak mendapat keberuntungan.",
      "ar": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِـَٔایَـٰتِهِۦۤۚ إِنَّهُۥ لَا یُفۡلِحُ ٱلظَّـٰلِمُونَ\n"
    }
  },
  {
    "id": 811,
    "surahId": 6,
    "ayahNumber": 22,
    "arabicText": "وَیَوۡمَ نَحۡشُرُهُمۡ جَمِیعࣰا ثُمَّ نَقُولُ لِلَّذِینَ أَشۡرَكُوۤا۟ أَیۡنَ شُرَكَاۤؤُكُمُ ٱلَّذِینَ كُنتُمۡ تَزۡعُمُونَ\n",
    "translations": {
      "en": "for one Day We shall gather them all together, and then We shall say unto those who ascribed divinity to aught beside God: \"Where, now, are those beings whom you imagined to have a share in God's divinity?\"",
      "ms": "Dan (ingatlah), hari (kiamat yang padanya) Kami himpunkan mereka semua, kemudian Kami berfirman kepada orang-orang musyrik: \"Manakah orang-orang dan benda-benda yang dahulu kamu sifatkan (menjadi sekutu Allah):?\"",
      "id": "Dan (ingatlah), hari yang di waktu itu Kami menghimpun mereka semuanya kemudian Kami berkata kepada orang-orang musyrik: \"Di manakah sembahan-sembahan kamu yang dulu kamu katakan (sekutu-sekutu) Kami?\".",
      "ar": "وَیَوۡمَ نَحۡشُرُهُمۡ جَمِیعࣰا ثُمَّ نَقُولُ لِلَّذِینَ أَشۡرَكُوۤا۟ أَیۡنَ شُرَكَاۤؤُكُمُ ٱلَّذِینَ كُنتُمۡ تَزۡعُمُونَ\n"
    }
  },
  {
    "id": 812,
    "surahId": 6,
    "ayahNumber": 23,
    "arabicText": "ثُمَّ لَمۡ تَكُن فِتۡنَتُهُمۡ إِلَّاۤ أَن قَالُوا۟ وَٱللَّهِ رَبِّنَا مَا كُنَّا مُشۡرِكِینَ\n",
    "translations": {
      "en": "Whereupon, in their utter confusion, they will only [be able to] say: \"By God, our Sustainer, we did not [mean to] ascribe divinity to aught beside Him!\"",
      "ms": "Kemudian tidaklah ada akidah kufur mereka selain dari mereka menjawab dengan dusta: \"Demi Allah Tuhan kami, kami tidak pernah menjadi orang-orang yang mempersekutukan Allah (dengan sesuatu yang lain)\".",
      "id": "Kemudian tiadalah fitnah mereka, kecuali mengatakan: \"Demi Allah, Tuhan kami, tiadalah kami mempersekutukan Allah\".",
      "ar": "ثُمَّ لَمۡ تَكُن فِتۡنَتُهُمۡ إِلَّاۤ أَن قَالُوا۟ وَٱللَّهِ رَبِّنَا مَا كُنَّا مُشۡرِكِینَ\n"
    }
  },
  {
    "id": 813,
    "surahId": 6,
    "ayahNumber": 24,
    "arabicText": "ٱنظُرۡ كَیۡفَ كَذَبُوا۟ عَلَىٰۤ أَنفُسِهِمۡۚ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n",
    "translations": {
      "en": "Behold how they have lied to themselves -and [how] their false imagery has forsaken them!",
      "ms": "Lihatlah bagaimana mereka berdusta terhadap diri mereka sendiri, dan bagaimana hilang lenyapnya dari mereka apa yang telah mereka ada-adakan (sebagai sekutu Allah) itu.",
      "id": "Lihatlah bagaimana mereka telah berdusta kepada diri mereka sendiri dan hilanglah daripada mereka sembahan-sembahan yang dahulu mereka ada-adakan.",
      "ar": "ٱنظُرۡ كَیۡفَ كَذَبُوا۟ عَلَىٰۤ أَنفُسِهِمۡۚ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n"
    }
  },
  {
    "id": 814,
    "surahId": 6,
    "ayahNumber": 25,
    "arabicText": "وَمِنۡهُم مَّن یَسۡتَمِعُ إِلَیۡكَۖ وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن یَفۡقَهُوهُ وَفِیۤ ءَاذَانِهِمۡ وَقۡرࣰاۚ وَإِن یَرَوۡا۟ كُلَّ ءَایَةࣲ لَّا یُؤۡمِنُوا۟ بِهَاۖ حَتَّىٰۤ إِذَا جَاۤءُوكَ یُجَـٰدِلُونَكَ یَقُولُ ٱلَّذِینَ كَفَرُوۤا۟ إِنۡ هَـٰذَاۤ إِلَّاۤ أَسَـٰطِیرُ ٱلۡأَوَّلِینَ\n",
    "translations": {
      "en": "And there are among them such as [seem to] listen to thee [O Prophet]: but over their hearts We have laid veils which prevent them from grasping the truth, and into their ears, deafness. And were they to see every sign [of the truth], they would still not believe in it-so much so that when they come unto thee to contend with thee, those who are bent on denying the truth say, \"This is nothing but fables of ancient times!\"",
      "ms": "Dan di antara mereka ada yang mendengarkanmu (membaca Al-Quran), pada hal Kami telah jadikan tutupan berlapis-lapis atas hati mereka, yang menghalang mereka daripada memahaminya, dan Kami jadikan pada telinga mereka penyumbat (yang menjadikan mereka pekak); dan kalaupun mereka melihat tiap-tiap keterangan (dan mukjizat yang membuktikan kebenaran Rasul), mereka tidak juga akan beriman kepada keterangan itu; sehingga apabila mereka datang kepadamu, sambil membantahmu, berkatalah orang-orang yang kafir itu: \"Ini tidak lain hanyalah cerita-cerita dongeng orang-orang dahulu\".",
      "id": "Dan di antara mereka ada orang yang mendengarkani (bacaan)mu, padahal Kami telah meletakkan tutupan di atas hati mereka (sehingga mereka tidak) memahaminya dan (Kami letakkan) sumbatan di telinganya. Dan jikapun mereka melihat segala tanda (kebenaran), mereka tetap tidak mau beriman kepadanya. Sehingga apabila mereka datang kepadamu untuk membantahmu, orang-orang kafir itu berkata: \"Al-Quran ini tidak lain hanyalah dongengan orang-orang dahulu\".",
      "ar": "وَمِنۡهُم مَّن یَسۡتَمِعُ إِلَیۡكَۖ وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن یَفۡقَهُوهُ وَفِیۤ ءَاذَانِهِمۡ وَقۡرࣰاۚ وَإِن یَرَوۡا۟ كُلَّ ءَایَةࣲ لَّا یُؤۡمِنُوا۟ بِهَاۖ حَتَّىٰۤ إِذَا جَاۤءُوكَ یُجَـٰدِلُونَكَ یَقُولُ ٱلَّذِینَ كَفَرُوۤا۟ إِنۡ هَـٰذَاۤ إِلَّاۤ أَسَـٰطِیرُ ٱلۡأَوَّلِینَ\n"
    }
  },
  {
    "id": 815,
    "surahId": 6,
    "ayahNumber": 26,
    "arabicText": "وَهُمۡ یَنۡهَوۡنَ عَنۡهُ وَیَنۡـَٔوۡنَ عَنۡهُۖ وَإِن یُهۡلِكُونَ إِلَّاۤ أَنفُسَهُمۡ وَمَا یَشۡعُرُونَ\n",
    "translations": {
      "en": "And they bar others therefrom. and go far away from it: but they destroy none but themselves, and perceive it not.",
      "ms": "Dan mereka pula melarang orang ramai dari mendengar Al-Quran dan mereka juga menjauhkan diri daripadanya, padahal mereka (dengan perbuatan yang demikian) hanyalah membinasakan diri sendiri (dengan bala bencana dan azab yang disediakan untuk mereka di dunia dan di akhirat kelak), sedang mereka tidak menyedarinya.",
      "id": "Dan mereka melarang (orang lain) mendengarkan Al-Quran dan mereka sendiri menjauhkan diri daripadanya, dan mereka hanyalah membinasakan diri mereka sendiri, sedang mereka tidak menyadari.",
      "ar": "وَهُمۡ یَنۡهَوۡنَ عَنۡهُ وَیَنۡـَٔوۡنَ عَنۡهُۖ وَإِن یُهۡلِكُونَ إِلَّاۤ أَنفُسَهُمۡ وَمَا یَشۡعُرُونَ\n"
    }
  },
  {
    "id": 816,
    "surahId": 6,
    "ayahNumber": 27,
    "arabicText": "وَلَوۡ تَرَىٰۤ إِذۡ وُقِفُوا۟ عَلَى ٱلنَّارِ فَقَالُوا۟ یَـٰلَیۡتَنَا نُرَدُّ وَلَا نُكَذِّبَ بِـَٔایَـٰتِ رَبِّنَا وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "If thou couldst but see [them] when they will be made to stand before the fire and will say, \"Oh, would that we were brought back [to life]: then we would not give the lie to our Sustainer's messages, but would be among the believers!\"",
      "ms": "Dan sungguh ngeri jika engkau melihat ketika mereka didirikan di tepi neraka (untuk menyaksikan azabnya yang tidak terperi), lalu mereka berkata: \"Wahai kiranya kami dikembalikan ke dunia, dan kami tidak akan mendustakan lagi ayat-ayat keterangan Tuhan kami, dan menjadilah kami dari golongan yang beriman\".",
      "id": "Dan jika kamu (Muhammad) melihat ketika mereka dihadapkan ke neraka, lalu mereka berkata: \"Kiranya kami dikembalikan (ke dunia) dan tidak mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman\", (tentulah kamu melihat suatu peristiwa yang mengharukan).",
      "ar": "وَلَوۡ تَرَىٰۤ إِذۡ وُقِفُوا۟ عَلَى ٱلنَّارِ فَقَالُوا۟ یَـٰلَیۡتَنَا نُرَدُّ وَلَا نُكَذِّبَ بِـَٔایَـٰتِ رَبِّنَا وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 817,
    "surahId": 6,
    "ayahNumber": 28,
    "arabicText": "بَلۡ بَدَا لَهُم مَّا كَانُوا۟ یُخۡفُونَ مِن قَبۡلُۖ وَلَوۡ رُدُّوا۟ لَعَادُوا۟ لِمَا نُهُوا۟ عَنۡهُ وَإِنَّهُمۡ لَكَـٰذِبُونَ\n",
    "translations": {
      "en": "But nay -[they will say this only because] the truth which they used to conceal [from themselves] in the past will have become obvious to them; and if they were brought back [to life], they would return to the very thing which was forbidden to them: for behold, they are indeed liars!",
      "ms": "(Mereka mengatakan yang demikian bukanlah kerana hendak beriman) bahkan setelah nyata kepada mereka apa yang mereka selalu sembunyikan dahulu; dan kalau mereka dikembalikan ke dunia sekalipun, tentulah mereka akan mengulangi lagi apa yang mereka dilarang dari melakukannya; dan sesungguhnya mereka adalah tetap pendusta.",
      "id": "Tetapi (sebenarnya) telah nyata bagi mereka kejahatan yang mereka dahulu selalu menyembunyikannya. Sekiranya mereka dikembalikan ke dunia, tentulah mereka kembali kepada apa yang mereka telah dilarang mengerjakannya. Dan sesungguhnya mereka itu adalah pendusta belaka.",
      "ar": "بَلۡ بَدَا لَهُم مَّا كَانُوا۟ یُخۡفُونَ مِن قَبۡلُۖ وَلَوۡ رُدُّوا۟ لَعَادُوا۟ لِمَا نُهُوا۟ عَنۡهُ وَإِنَّهُمۡ لَكَـٰذِبُونَ\n"
    }
  },
  {
    "id": 818,
    "surahId": 6,
    "ayahNumber": 29,
    "arabicText": "وَقَالُوۤا۟ إِنۡ هِیَ إِلَّا حَیَاتُنَا ٱلدُّنۡیَا وَمَا نَحۡنُ بِمَبۡعُوثِینَ\n",
    "translations": {
      "en": "And some [of the unbelievers] say, \"There is nothing beyond our life in this world, for We shall not be raised from the dead.\"",
      "ms": "Dan tentulah mereka akan berkata pula: \"Tiadalah hidup yang lain selain dari hidup kita di dunia ini, dan tiadalah kita akan dibangkitkan semula sesudah kita mati\".",
      "id": "Dan tentu mereka akan mengatakan (pula): \"Hidup hanyalah kehidupan kita di dunia ini saja, dan kita sekali-sekali tidak akan dibangkitkan\".",
      "ar": "وَقَالُوۤا۟ إِنۡ هِیَ إِلَّا حَیَاتُنَا ٱلدُّنۡیَا وَمَا نَحۡنُ بِمَبۡعُوثِینَ\n"
    }
  },
  {
    "id": 819,
    "surahId": 6,
    "ayahNumber": 30,
    "arabicText": "وَلَوۡ تَرَىٰۤ إِذۡ وُقِفُوا۟ عَلَىٰ رَبِّهِمۡۚ قَالَ أَلَیۡسَ هَـٰذَا بِٱلۡحَقِّۚ قَالُوا۟ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُوا۟ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ\n",
    "translations": {
      "en": "If thou couldst but see [them] when they shall be made to stand before their Sustainer [and] He will say, \"Is not this the truth?\" They will answer: \"Yea, indeed, by our Sustainer!\" [Whereupon] He will say: \"Taste, then, the suffering that comes from your having refused to acknowledge the truth!\"",
      "ms": "Dan sungguh ngeri jika engkau melihat ketika mereka dihadapkan kepada Tuhan mereka, lalu Allah berfirman: \"Bukankah hari kiamat ini suatu perkara yang benar? Mereka menjawab: \"Benar, demi Tuhan kami!\" Allah berfirman lagi: \"Oleh itu, rasalah azab seksa neraka dengan sebab kamu telah kufur ingkar\".",
      "id": "Dan seandainya kamu melihat ketika mereka dihadapkan kepada Tuhannya (tentulah kamu melihat peristiwa yang mengharukan). Berfirman Allah: \"Bukankah (kebangkitan ini benar?\" Mereka menjawab: \"Sungguh benar, demi Tuhan kami\". Berfirman Allah: \"Karena itu rasakanlah azab ini, disebabkan kamu mengingkari(nya)\".",
      "ar": "وَلَوۡ تَرَىٰۤ إِذۡ وُقِفُوا۟ عَلَىٰ رَبِّهِمۡۚ قَالَ أَلَیۡسَ هَـٰذَا بِٱلۡحَقِّۚ قَالُوا۟ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُوا۟ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ\n"
    }
  },
  {
    "id": 820,
    "surahId": 6,
    "ayahNumber": 31,
    "arabicText": "قَدۡ خَسِرَ ٱلَّذِینَ كَذَّبُوا۟ بِلِقَاۤءِ ٱللَّهِۖ حَتَّىٰۤ إِذَا جَاۤءَتۡهُمُ ٱلسَّاعَةُ بَغۡتَةࣰ قَالُوا۟ یَـٰحَسۡرَتَنَا عَلَىٰ مَا فَرَّطۡنَا فِیهَا وَهُمۡ یَحۡمِلُونَ أَوۡزَارَهُمۡ عَلَىٰ ظُهُورِهِمۡۚ أَلَا سَاۤءَ مَا یَزِرُونَ\n",
    "translations": {
      "en": "Lost indeed are they who consider it a lie that they will have to meet God -till the Last Hour suddenly comes upon them, [and] they cry, \"Alas for us, that we disregarded it!\" - for they shall bear on their backs the burden of their sins: oh, how evil the load with which they shall be burdened!",
      "ms": "Sesungguhnya telah rugilah orang-orang yang mendustakan pertemuan mengadap Allah; sehingga apabila hari kiamat datang secara mengejut kepada mereka, mereka berkata; \"Aduhai kesalnya kami atas apa yang telah kami cuaikan dalam dunia!\" Sambil mereka memikul dosa-dosa mereka di atas belakang mereka. Ingatlah, amatlah buruk apa yang mereka pikul itu.",
      "id": "Sungguh telah rugilah orang-orang yang mendustakan pertemuan mereka dengan Tuhan; sehingga apabila kiamat datang kepada mereka dengan tiba-tiba, mereka berkata: \"Alangkah besarnya penyesalan kami, terhadap kelalaian kami tentang kiamat itu!\", sambil mereka memikul dosa-dosa di atas punggungnya. Ingatlah, amat buruklah apa yang mereka pikul itu.",
      "ar": "قَدۡ خَسِرَ ٱلَّذِینَ كَذَّبُوا۟ بِلِقَاۤءِ ٱللَّهِۖ حَتَّىٰۤ إِذَا جَاۤءَتۡهُمُ ٱلسَّاعَةُ بَغۡتَةࣰ قَالُوا۟ یَـٰحَسۡرَتَنَا عَلَىٰ مَا فَرَّطۡنَا فِیهَا وَهُمۡ یَحۡمِلُونَ أَوۡزَارَهُمۡ عَلَىٰ ظُهُورِهِمۡۚ أَلَا سَاۤءَ مَا یَزِرُونَ\n"
    }
  },
  {
    "id": 821,
    "surahId": 6,
    "ayahNumber": 32,
    "arabicText": "وَمَا ٱلۡحَیَوٰةُ ٱلدُّنۡیَاۤ إِلَّا لَعِبࣱ وَلَهۡوࣱۖ وَلَلدَّارُ ٱلۡـَٔاخِرَةُ خَیۡرࣱ لِّلَّذِینَ یَتَّقُونَۚ أَفَلَا تَعۡقِلُونَ\n",
    "translations": {
      "en": "And nothing is the life of this world but a play and a passing delight; and the life in the hereafter is by far the better for all who are conscious of God. Will you not, then, use your reason?",
      "ms": "Dan tidak (dinamakan) kehidupan dunia melainkan permainan yang sia-sia dan hiburan yang melalaikan: dan demi sesungguhnya negeri akhirat itu lebih baik bagi orang-orang yang bertaqwa. Oleh itu, tidakkah kamu mahu berfikir?",
      "id": "Dan tiadalah kehidupan dunia ini, selain dari main-main dan senda gurau belaka. Dan sungguh kampung akhirat itu lebih baik bagi orang-orang yang bertakwa. Maka tidakkah kamu memahaminya?",
      "ar": "وَمَا ٱلۡحَیَوٰةُ ٱلدُّنۡیَاۤ إِلَّا لَعِبࣱ وَلَهۡوࣱۖ وَلَلدَّارُ ٱلۡـَٔاخِرَةُ خَیۡرࣱ لِّلَّذِینَ یَتَّقُونَۚ أَفَلَا تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 822,
    "surahId": 6,
    "ayahNumber": 33,
    "arabicText": "قَدۡ نَعۡلَمُ إِنَّهُۥ لَیَحۡزُنُكَ ٱلَّذِی یَقُولُونَۖ فَإِنَّهُمۡ لَا یُكَذِّبُونَكَ وَلَـٰكِنَّ ٱلظَّـٰلِمِینَ بِـَٔایَـٰتِ ٱللَّهِ یَجۡحَدُونَ\n",
    "translations": {
      "en": "Well do We know that what such people say grieves thee indeed: yet, behold, it is not thee to whom they give the lie, but God's messages do these evildoers deny.",
      "ms": "Sesungguhnya Kami mengetahui bahawa apa yang mereka katakan itu akan menyebabkan engkau (wahai Muhammad) berdukacita; (maka janganlah engkau berdukacita) kerana sebenarnya mereka bukan mendustakanmu, tetapi orang-orang yang zalim itu mengingkari ayat-ayat keterangan Allah (disebabkan kedegilan mereka semata-mata).",
      "id": "Sesungguhnya Kami mengetahui bahwasanya apa yang mereka katakan itu menyedihkan hatimu, (janganlah kamu bersedih hati), karena mereka sebenarnya bukan mendustakan kamu, akan tetapi orang-orang yang zalim itu mengingkari ayat-ayat Allah.",
      "ar": "قَدۡ نَعۡلَمُ إِنَّهُۥ لَیَحۡزُنُكَ ٱلَّذِی یَقُولُونَۖ فَإِنَّهُمۡ لَا یُكَذِّبُونَكَ وَلَـٰكِنَّ ٱلظَّـٰلِمِینَ بِـَٔایَـٰتِ ٱللَّهِ یَجۡحَدُونَ\n"
    }
  },
  {
    "id": 823,
    "surahId": 6,
    "ayahNumber": 34,
    "arabicText": "وَلَقَدۡ كُذِّبَتۡ رُسُلࣱ مِّن قَبۡلِكَ فَصَبَرُوا۟ عَلَىٰ مَا كُذِّبُوا۟ وَأُوذُوا۟ حَتَّىٰۤ أَتَىٰهُمۡ نَصۡرُنَاۚ وَلَا مُبَدِّلَ لِكَلِمَـٰتِ ٱللَّهِۚ وَلَقَدۡ جَاۤءَكَ مِن نَّبَإِی۟ ٱلۡمُرۡسَلِینَ\n",
    "translations": {
      "en": "And, indeed, [even] before thy time have apostles been given the lie, and they endured with patience all those charges of falsehood, and all the hurt done to them, till succour came unto them from Us: for there is no power that could alter [the outcome of] God's promises. And some of the histories of those apostles have already come within thy ken.",
      "ms": "Dan demi sesungguhnya, Rasul-rasul sebelummu pernah juga didustakan, maka mereka sabar terhadap perbuatan orang-orang yang mendustakan mereka dan menyakiti mereka, sehingga datanglah pertolongan Kami kepada mereka; dan sememangnyalah tiada sesiapa pun yang dapat mengubah Kalimah-kalimah Allah (janji-janjiNya); dan demi sesungguhnya, telah datang kepadamu sebahagian dari khabar berita Rasul-rasul itu.",
      "id": "Dan sesungguhnya telah didustakan (pula) rasul-rasul sebelum kamu, akan tetapi mereka sabar terhadap pendustaan dan penganiayaan (yang dilakukan) terhadap mereka, sampai datang pertolongan Allah kepada mereka. Tak ada seorangpun yang dapat merubah kalimat-kalimat (janji-janji) Allah. Dan sesungguhnya telah datang kepadamu sebahagian dari berita rasul-rasul itu.",
      "ar": "وَلَقَدۡ كُذِّبَتۡ رُسُلࣱ مِّن قَبۡلِكَ فَصَبَرُوا۟ عَلَىٰ مَا كُذِّبُوا۟ وَأُوذُوا۟ حَتَّىٰۤ أَتَىٰهُمۡ نَصۡرُنَاۚ وَلَا مُبَدِّلَ لِكَلِمَـٰتِ ٱللَّهِۚ وَلَقَدۡ جَاۤءَكَ مِن نَّبَإِی۟ ٱلۡمُرۡسَلِینَ\n"
    }
  },
  {
    "id": 824,
    "surahId": 6,
    "ayahNumber": 35,
    "arabicText": "وَإِن كَانَ كَبُرَ عَلَیۡكَ إِعۡرَاضُهُمۡ فَإِنِ ٱسۡتَطَعۡتَ أَن تَبۡتَغِیَ نَفَقࣰا فِی ٱلۡأَرۡضِ أَوۡ سُلَّمࣰا فِی ٱلسَّمَاۤءِ فَتَأۡتِیَهُم بِـَٔایَةࣲۚ وَلَوۡ شَاۤءَ ٱللَّهُ لَجَمَعَهُمۡ عَلَى ٱلۡهُدَىٰۚ فَلَا تَكُونَنَّ مِنَ ٱلۡجَـٰهِلِینَ\n",
    "translations": {
      "en": "And if it distress thee that those who deny the truth turn their backs on thee - why, then, if thou art able to go down deep into the earth or to ascend a ladder unto heaven in order to bring them a [yet more convincing] message, [do so;] but [remember that] had God so willed, He would indeed have gathered them all unto [His] guidance. Do not, therefore, allow thyself to ignore [God's ways].",
      "ms": "Dan jika perbuatan mereka berpaling (daripada menerima apa yang engkau bawa wahai Muhammad) terasa amat berat kepadamu; maka sekiranya engkau sanggup mencari satu lubang di bumi (untuk menembusi ke bawahnya) atau satu tangga untuk naik ke langit, supaya engkau dapat bawakan mukjizat kepada mereka, (cubalah lakukan jika engkau sanggup). Dan sekiranya Allah menghendaki, tentulah ia himpunkan mereka atas hidayah petunjuk. (Tetapi Allah tidak menghendakinya), oleh itu janganlah engkau menjadi dari orang-orang yang jahil.",
      "id": "Dan jika perpalingan mereka (darimu) terasa amat berat bagimu, maka jika kamu dapat membuat lobang di bumi atau tangga ke langit lalu kamu dapat mendatangkan mukjizat kepada mereka (maka buatlah). Kalau Allah menghendaki, tentu saja Allah menjadikan mereka semua dalam petunjuk sebab itu janganlah sekali-kali kamu termasuk orang-orang yang jahil",
      "ar": "وَإِن كَانَ كَبُرَ عَلَیۡكَ إِعۡرَاضُهُمۡ فَإِنِ ٱسۡتَطَعۡتَ أَن تَبۡتَغِیَ نَفَقࣰا فِی ٱلۡأَرۡضِ أَوۡ سُلَّمࣰا فِی ٱلسَّمَاۤءِ فَتَأۡتِیَهُم بِـَٔایَةࣲۚ وَلَوۡ شَاۤءَ ٱللَّهُ لَجَمَعَهُمۡ عَلَى ٱلۡهُدَىٰۚ فَلَا تَكُونَنَّ مِنَ ٱلۡجَـٰهِلِینَ\n"
    }
  },
  {
    "id": 825,
    "surahId": 6,
    "ayahNumber": 36,
    "arabicText": "۞ إِنَّمَا یَسۡتَجِیبُ ٱلَّذِینَ یَسۡمَعُونَۘ وَٱلۡمَوۡتَىٰ یَبۡعَثُهُمُ ٱللَّهُ ثُمَّ إِلَیۡهِ یُرۡجَعُونَ\n",
    "translations": {
      "en": "Only they who listen [with their hearts] can respond to a call; and as for the dead [of heart], God [alone] can raise them from the dead, whereupon unto Him they shall return.",
      "ms": "Hanyasanya orang-orang yang menyahut seruanmu itu ialah mereka yang mendengar (yang mahu menurut kebenaran); sedang orang-orang yang mati Allah bangkitkan mereka semula (pada hari kiamat kelak), kemudian mereka dikembalikan kepadaNya untuk menerima balasan.",
      "id": "Hanya mereka yang mendengar sajalah yang mematuhi (seruan Allah), dan orang-orang yang mati (hatinya), akan dibangkitkan oleh Allah, kemudian kepada-Nya-lah mereka dikembalikan.",
      "ar": "۞ إِنَّمَا یَسۡتَجِیبُ ٱلَّذِینَ یَسۡمَعُونَۘ وَٱلۡمَوۡتَىٰ یَبۡعَثُهُمُ ٱللَّهُ ثُمَّ إِلَیۡهِ یُرۡجَعُونَ\n"
    }
  },
  {
    "id": 826,
    "surahId": 6,
    "ayahNumber": 37,
    "arabicText": "وَقَالُوا۟ لَوۡلَا نُزِّلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ قَادِرٌ عَلَىٰۤ أَن یُنَزِّلَ ءَایَةࣰ وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "And they say, \"Why has no miraculous sign been bestowed on him from on high by his Sustainer?\" Say: \"Behold, God has the power to bestow any sign from on high.\" Yet most human beings are unaware of this",
      "ms": "Dan mereka (golongan kafir musyrik) berkata: \"Alangkah eloknya kalau diturunkan kepada Muhammad satu mukjizat dari Tuhannya?\" Katakanlah (wahai Muhammad): \"Sesungguhnya Allah berkuasa menurunkan mukjizat\", akan tetapi kebanyakan mereka tidak mengetahui (balasan yang akan menimpa mereka kalau mereka enggan beriman).",
      "id": "Dan mereka (orang-orang musyrik Mekah) berkata: \"Mengapa tidak diturunkan kepadanya (Muhammad) suatu mukjizat dari Tuhannya?\" Katakanlah: \"Sesungguhnya Allah kuasa menurunkan suatu mukjizat, tetapi kebanyakan mereka tidak mengetahui\".",
      "ar": "وَقَالُوا۟ لَوۡلَا نُزِّلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ قَادِرٌ عَلَىٰۤ أَن یُنَزِّلَ ءَایَةࣰ وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 827,
    "surahId": 6,
    "ayahNumber": 38,
    "arabicText": "وَمَا مِن دَاۤبَّةࣲ فِی ٱلۡأَرۡضِ وَلَا طَـٰۤىِٕرࣲ یَطِیرُ بِجَنَاحَیۡهِ إِلَّاۤ أُمَمٌ أَمۡثَالُكُمۚ مَّا فَرَّطۡنَا فِی ٱلۡكِتَـٰبِ مِن شَیۡءࣲۚ ثُمَّ إِلَىٰ رَبِّهِمۡ یُحۡشَرُونَ\n",
    "translations": {
      "en": "although there is no beast that walks on earth and no bird that flies on its two wings which is not [God's] creature like yourselves: no single thing have We neglected in Our decree. And once again: Unto their Sustainer shall they [all] be gathered.",
      "ms": "Dan tidak seekor pun binatang yang melata di bumi, dan tidak seekor pun burung yang terbang dengan kedua sayapnya, melainkan mereka umat-umat seperti kamu. Tiada Kami tinggalkan sesuatu pun di dalam kitab Al-Quran ini; kemudian mereka semuanya akan dihimpunkan kepada Tuhan mereka (untuk dihisab dan menerima balasan).",
      "id": "Dan tiadalah binatang-binatang yang ada di bumi dan burung-burung yang terbang dengan kedua sayapnya, melainkan umat (juga) seperti kamu. Tiadalah Kami alpakan sesuatupun dalam Al-Kitab, kemudian kepada Tuhanlah mereka dihimpunkan.",
      "ar": "وَمَا مِن دَاۤبَّةࣲ فِی ٱلۡأَرۡضِ وَلَا طَـٰۤىِٕرࣲ یَطِیرُ بِجَنَاحَیۡهِ إِلَّاۤ أُمَمٌ أَمۡثَالُكُمۚ مَّا فَرَّطۡنَا فِی ٱلۡكِتَـٰبِ مِن شَیۡءࣲۚ ثُمَّ إِلَىٰ رَبِّهِمۡ یُحۡشَرُونَ\n"
    }
  },
  {
    "id": 828,
    "surahId": 6,
    "ayahNumber": 39,
    "arabicText": "وَٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِنَا صُمࣱّ وَبُكۡمࣱ فِی ٱلظُّلُمَـٰتِۗ مَن یَشَإِ ٱللَّهُ یُضۡلِلۡهُ وَمَن یَشَأۡ یَجۡعَلۡهُ عَلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "And they who give the lie to Our messages are deaf and dumb, in darkness deep. Whomever God wills, He lets go astray; and whomever He wills, He places upon a straight way.",
      "ms": "Dan orang-orang yang mendustakan ayat-ayat keterangan Kami, mereka adalah bisu dan tuli, di dalam gelap-gelita. Sesiapa yang Allah kehendaki: akan disesatkannya (menurut peraturan tetapNya), dan sesiapa yang Ia kehendaki: akan dijadikannya atas jalan yang betul lurus.",
      "id": "Dan orang-orang yang mendustakan ayat-ayat Kami adalah pekak, bisu dan berada dalam gelap gulita. Barangsiapa yang dikehendaki Allah (kesesatannya), niscaya disesatkan-Nya. Dan barangsiapa yang dikehendaki Allah (untuk diberi-Nya petunjuk), niscaya Dia menjadikan-Nya berada di atas jalan yang lurus.",
      "ar": "وَٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِنَا صُمࣱّ وَبُكۡمࣱ فِی ٱلظُّلُمَـٰتِۗ مَن یَشَإِ ٱللَّهُ یُضۡلِلۡهُ وَمَن یَشَأۡ یَجۡعَلۡهُ عَلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 829,
    "surahId": 6,
    "ayahNumber": 40,
    "arabicText": "قُلۡ أَرَءَیۡتَكُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُ ٱللَّهِ أَوۡ أَتَتۡكُمُ ٱلسَّاعَةُ أَغَیۡرَ ٱللَّهِ تَدۡعُونَ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "Say: \"Can you see yourselves invoking any but God when God's chastisement befalls you [in this world], or the Last Hour comes upon you? [Tell me this,] if you are men of truth!",
      "ms": "Katakanlah (wahai Muhammad): \"Khabarkanlah kepadaku, jika datang kepada kamu azab Allah, atau datang kepada kamu hari kiamat, adakah kamu akan menyeru yang lain dari Allah (untuk menolong kamu), jika betul kamu orang-orang yang benar?\"",
      "id": "Katakanlah: \"Terangkanlah kepadaku jika datang siksaan Allah kepadamu, atau datang kepadamu hari kiamat, apakah kamu menyeru (tuhan) selain Allah; jika kamu orang-orang yang benar!\"",
      "ar": "قُلۡ أَرَءَیۡتَكُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُ ٱللَّهِ أَوۡ أَتَتۡكُمُ ٱلسَّاعَةُ أَغَیۡرَ ٱللَّهِ تَدۡعُونَ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 830,
    "surahId": 6,
    "ayahNumber": 41,
    "arabicText": "بَلۡ إِیَّاهُ تَدۡعُونَ فَیَكۡشِفُ مَا تَدۡعُونَ إِلَیۡهِ إِن شَاۤءَ وَتَنسَوۡنَ مَا تُشۡرِكُونَ\n",
    "translations": {
      "en": "Nay, but it is Him alone that you will invoke - whereupon He may, if He so wills, remove that [ill] which caused you to call unto Him; and you will have forgotten all that. to which you [now] ascribe divinity side by side with Him.\"",
      "ms": "Bahkan Dia lah (Allah) yang kamu seru lalu Ia hapuskan bahaya yang kamu pohonkan kepadaNya jika Ia kehendaki; dan kamu lupakan apa yang kamu sekutukan (dengan Allah dalam masa kamu ditimpa bahaya itu).",
      "id": "(Tidak), tetapi hanya Dialah yang kamu seru, maka Dia menghilangkan bahaya yang karenanya kamu berdoa kepada-Nya, jika Dia menghendaki, dan kamu tinggalkan sembahan-sembahan yang kamu sekutukan (dengan Allah).",
      "ar": "بَلۡ إِیَّاهُ تَدۡعُونَ فَیَكۡشِفُ مَا تَدۡعُونَ إِلَیۡهِ إِن شَاۤءَ وَتَنسَوۡنَ مَا تُشۡرِكُونَ\n"
    }
  },
  {
    "id": 831,
    "surahId": 6,
    "ayahNumber": 42,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَاۤ إِلَىٰۤ أُمَمࣲ مِّن قَبۡلِكَ فَأَخَذۡنَـٰهُم بِٱلۡبَأۡسَاۤءِ وَٱلضَّرَّاۤءِ لَعَلَّهُمۡ یَتَضَرَّعُونَ\n",
    "translations": {
      "en": "And, indeed, We sent Our messages unto people before thy time, [O Prophet,] and visited them with misfortune and hardship so that they might humble themselves:",
      "ms": "Dan demi sesungguhnya Kami telah utuskan Rasul-rasul kepada umat-umat yang dahulu daripadamu (lalu mereka mendustakannya), maka Kami seksakan mereka dengan kebuluran dan penyakit, supaya mereka berdoa (kepada Kami) dangan merendah diri (serta insaf dan bertaubat).",
      "id": "Dan sesungguhnya Kami telah mengutus (rasul-rasul) kepada umat-umat yang sebelum kamu, kemudian Kami siksa mereka dengan (menimpakan) kesengsaraan dan kemelaratan, supaya mereka memohon (kepada Allah) dengan tunduk merendahkan diri.",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَاۤ إِلَىٰۤ أُمَمࣲ مِّن قَبۡلِكَ فَأَخَذۡنَـٰهُم بِٱلۡبَأۡسَاۤءِ وَٱلضَّرَّاۤءِ لَعَلَّهُمۡ یَتَضَرَّعُونَ\n"
    }
  },
  {
    "id": 832,
    "surahId": 6,
    "ayahNumber": 43,
    "arabicText": "فَلَوۡلَاۤ إِذۡ جَاۤءَهُم بَأۡسُنَا تَضَرَّعُوا۟ وَلَـٰكِن قَسَتۡ قُلُوبُهُمۡ وَزَیَّنَ لَهُمُ ٱلشَّیۡطَـٰنُ مَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "yet when the misfortune decreed by Us befell them, they did not humble themselves, but rather their hearts grew hard, for Satan had made all their doings seem goodly to them.",
      "ms": "Maka alangkah eloknya kalau mereka berdoa kepada Kami dengan merendah diri (serta insaf dan bertaubat) ketika mereka ditimpa azab Kami? Tetapi yang sebenarnya hati mereka keras (tidak mahu menerima kebenaran), dan Syaitan pula memperelokkan pada (pandangan) mereka apa yang mereka telah lakukan.",
      "id": "Maka mengapa mereka tidak memohon (kepada Allah) dengan tunduk merendahkan diri ketika datang siksaan Kami kepada mereka, bahkan hati mereka telah menjadi keras, dan syaitanpun menampakkan kepada mereka kebagusan apa yang selalu mereka kerjakan.",
      "ar": "فَلَوۡلَاۤ إِذۡ جَاۤءَهُم بَأۡسُنَا تَضَرَّعُوا۟ وَلَـٰكِن قَسَتۡ قُلُوبُهُمۡ وَزَیَّنَ لَهُمُ ٱلشَّیۡطَـٰنُ مَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 833,
    "surahId": 6,
    "ayahNumber": 44,
    "arabicText": "فَلَمَّا نَسُوا۟ مَا ذُكِّرُوا۟ بِهِۦ فَتَحۡنَا عَلَیۡهِمۡ أَبۡوَ ٰ⁠بَ كُلِّ شَیۡءٍ حَتَّىٰۤ إِذَا فَرِحُوا۟ بِمَاۤ أُوتُوۤا۟ أَخَذۡنَـٰهُم بَغۡتَةࣰ فَإِذَا هُم مُّبۡلِسُونَ\n",
    "translations": {
      "en": "Then, when they had forgotten all that they had been told to take to heart, We threw open to them the gates of all [good] things until -even as they were rejoicing in what they had been granted - We suddenly took them to task: and lo! they were broken in spirit;",
      "ms": "Kemudian apabila mereka melupakan apa yang telah diperingatkan mereka dengannya, Kami bukakan kepada mereka pintu-pintu segala kemewahan dan kesenangan, sehingga apabila mereka bergembira dan bersukaria dengan segala nikmat yang diberikan kepada mereka, Kami timpakan mereka secara mengejut (dengan bala bencana yang membinasakan), maka mereka pun berputus asa (dari mendapat sebarang pertolongan).",
      "id": "Maka tatkala mereka melupakan peringatan yang telah diberikan kepada mereka, Kamipun membukakan semua pintu-pintu kesenangan untuk mereka; sehingga apabila mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka dengan sekonyong-konyong, maka ketika itu mereka terdiam berputus asa.",
      "ar": "فَلَمَّا نَسُوا۟ مَا ذُكِّرُوا۟ بِهِۦ فَتَحۡنَا عَلَیۡهِمۡ أَبۡوَ ٰ⁠بَ كُلِّ شَیۡءٍ حَتَّىٰۤ إِذَا فَرِحُوا۟ بِمَاۤ أُوتُوۤا۟ أَخَذۡنَـٰهُم بَغۡتَةࣰ فَإِذَا هُم مُّبۡلِسُونَ\n"
    }
  },
  {
    "id": 834,
    "surahId": 6,
    "ayahNumber": 45,
    "arabicText": "فَقُطِعَ دَابِرُ ٱلۡقَوۡمِ ٱلَّذِینَ ظَلَمُوا۟ۚ وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "and [in the end,] the last remnant of those folk who had been bent on evildoing was wiped out. For all praise is due to God, the Sustainer of all the worlds.",
      "ms": "Lalu kaum yang zalim itu dibinasakan sehingga terputus keturunannya. Dan (dengan itu bersyukurlah kerana musnahnya kezaliman, dengan menyebut): \"Segala puji tertentu bagi Allah Tuhan yang memelihara dan mentadbirkan sekalian Alam\".",
      "id": "Maka orang-orang yang zalim itu dimusnahkan sampai ke akar-akarnya. Segala puji bagi Allah, Tuhan semesta alam.",
      "ar": "فَقُطِعَ دَابِرُ ٱلۡقَوۡمِ ٱلَّذِینَ ظَلَمُوا۟ۚ وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 835,
    "surahId": 6,
    "ayahNumber": 46,
    "arabicText": "قُلۡ أَرَءَیۡتُمۡ إِنۡ أَخَذَ ٱللَّهُ سَمۡعَكُمۡ وَأَبۡصَـٰرَكُمۡ وَخَتَمَ عَلَىٰ قُلُوبِكُم مَّنۡ إِلَـٰهٌ غَیۡرُ ٱللَّهِ یَأۡتِیكُم بِهِۗ ٱنظُرۡ كَیۡفَ نُصَرِّفُ ٱلۡـَٔایَـٰتِ ثُمَّ هُمۡ یَصۡدِفُونَ\n",
    "translations": {
      "en": "Say: \"What do you think? If God should take away your hearing and your sight and seal your hearts - what deity but God is there that could bring it all back to you?\" Behold how many facets we give to our messages-and yet they turn away in disdain!",
      "ms": "Katakanlah (wahai Muhammad): \"Bagaimana fikiran kamu, jika Allah melenyapkan pendengaran serta penglihatan kamu, dan Ia pula memeteraikan atas hati kamu? Siapakah Tuhan selain Allah yang berkuasa mengembalikannya kepada kamu?\" Lihatlah bagaimana Kami berulang-ulang menerangkan tanda-tanda kebesaran Kami (dengan berbagai cara), dalam pada itu, mereka tetap juga berpaling - ingkar.",
      "id": "Katakanlah: \"Terangkanlah kepadaku jika Allah mencabut pendengaran dan penglihatan serta menutup hatimu, siapakah tuhan selain Allah yang kuasa mengembalikannya kepadamu?\" Perhatikanlah bagaimana Kami berkali-kali memperlihatkan tanda-tanda kebesaran (Kami), kemudian mereka tetap berpaling (juga).",
      "ar": "قُلۡ أَرَءَیۡتُمۡ إِنۡ أَخَذَ ٱللَّهُ سَمۡعَكُمۡ وَأَبۡصَـٰرَكُمۡ وَخَتَمَ عَلَىٰ قُلُوبِكُم مَّنۡ إِلَـٰهٌ غَیۡرُ ٱللَّهِ یَأۡتِیكُم بِهِۗ ٱنظُرۡ كَیۡفَ نُصَرِّفُ ٱلۡـَٔایَـٰتِ ثُمَّ هُمۡ یَصۡدِفُونَ\n"
    }
  },
  {
    "id": 836,
    "surahId": 6,
    "ayahNumber": 47,
    "arabicText": "قُلۡ أَرَءَیۡتَكُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُ ٱللَّهِ بَغۡتَةً أَوۡ جَهۡرَةً هَلۡ یُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلظَّـٰلِمُونَ\n",
    "translations": {
      "en": "Say: \"Can you imagine what your condition will be if God's chastisement befalls you, either suddenly or in a [gradually] perceptible manner? [But then-] will any but evildoing folk [ever] be destroyed?",
      "ms": "Katakanlah:\" Bagaimana fikiran kamu, jika datang kepada kamu azab Allah dengan tiba-tiba, atau dengan terang-terang (setelah diperlihatkan tanda-tanda yang menunjukkan kedatangannya), siapakah yang akan binasa, selain dari kaum yang zalim?\".",
      "id": "Katakanlah: \"Terangkanlah kepadaku jika datang siksaan Allah kepadamu dengan sekonyong-konyong, atau terang-terangan, maka adakah yang dibinasakan (Allah) selain dari orang yang zalim?\"",
      "ar": "قُلۡ أَرَءَیۡتَكُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُ ٱللَّهِ بَغۡتَةً أَوۡ جَهۡرَةً هَلۡ یُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلظَّـٰلِمُونَ\n"
    }
  },
  {
    "id": 837,
    "surahId": 6,
    "ayahNumber": 48,
    "arabicText": "وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِینَ إِلَّا مُبَشِّرِینَ وَمُنذِرِینَۖ فَمَنۡ ءَامَنَ وَأَصۡلَحَ فَلَا خَوۡفٌ عَلَیۡهِمۡ وَلَا هُمۡ یَحۡزَنُونَ\n",
    "translations": {
      "en": "And We send [Our] message-bearers only as heralds of glad tidings and as warners: hence, all who believe and live righteously -no fear need they have, and neither shall they grieve;",
      "ms": "Dan tiadalah Kami utuskan Rasul-rasul itu melainkan sebagai pembawa berita gembira dan pembawa amaran; kemudian sesiapa yang beramal soleh, maka tidak ada kebimbangan (dari berlakunya kejadian yang tidak baik) terhadap mereka, dan mereka tidak akan berdukacita.",
      "id": "Dan tidaklah Kami mengutus para rasul itu melainkan untuk memberikan kabar gembira dan memberi peringatan. Barangsiapa yang beriman dan mengadakan perbaikan, maka tak ada kekhawatiran terhadap mereka dan tidak pula mereka bersedih hati.",
      "ar": "وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِینَ إِلَّا مُبَشِّرِینَ وَمُنذِرِینَۖ فَمَنۡ ءَامَنَ وَأَصۡلَحَ فَلَا خَوۡفٌ عَلَیۡهِمۡ وَلَا هُمۡ یَحۡزَنُونَ\n"
    }
  },
  {
    "id": 838,
    "surahId": 6,
    "ayahNumber": 49,
    "arabicText": "وَٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِنَا یَمَسُّهُمُ ٱلۡعَذَابُ بِمَا كَانُوا۟ یَفۡسُقُونَ\n",
    "translations": {
      "en": "whereas those who give the lie to Our messages - suffering will afflict them in result of all their sinful doings.",
      "ms": "Dan orang-orang yang mendustakan ayat-ayat keterangan Kami, mereka akan dikenakan azab seksa dengan sebab mereka berlaku fasik.",
      "id": "Dan orang-orang yang mendustakan ayat-ayat Kami, mereka akan ditimpa siksa disebabkan mereka selalu berbuat fasik.",
      "ar": "وَٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِنَا یَمَسُّهُمُ ٱلۡعَذَابُ بِمَا كَانُوا۟ یَفۡسُقُونَ\n"
    }
  },
  {
    "id": 839,
    "surahId": 6,
    "ayahNumber": 50,
    "arabicText": "قُل لَّاۤ أَقُولُ لَكُمۡ عِندِی خَزَاۤىِٕنُ ٱللَّهِ وَلَاۤ أَعۡلَمُ ٱلۡغَیۡبَ وَلَاۤ أَقُولُ لَكُمۡ إِنِّی مَلَكٌۖ إِنۡ أَتَّبِعُ إِلَّا مَا یُوحَىٰۤ إِلَیَّۚ قُلۡ هَلۡ یَسۡتَوِی ٱلۡأَعۡمَىٰ وَٱلۡبَصِیرُۚ أَفَلَا تَتَفَكَّرُونَ\n",
    "translations": {
      "en": "Say [O Prophet]: \"I do not say unto you, 'God's treasures are with me,'; nor [do I say], 'I know the things that are beyond the reach of human perception'; nor do I say unto you, 'Behold, I am an angel': I but follow what is revealed to me.\" Say: \"Can the blind and the seeing be deemed equal? Will you not, then, take thought?\"",
      "ms": "Katakanlah (wahai Muhammad); \"Aku tidak mengatakan kepada kamu (bahawa) perbendaharaan Allah ada di sisiku, dan aku pula tidak mengetahui perkara-perkara yang ghaib; aku juga tidak mengatakan kepada kamu bahawasanya aku ini malaikat, aku tidak menurut melainkan apa yang diwahyukan kepadaku\". Bertanyalah (kepada mereka): \"Adakah sama orang yang buta dengan orang yang celik? Tidakkah kamu mahu berfikir?\"",
      "id": "Katakanlah: Aku tidak mengatakan kepadamu, bahwa perbendaharaan Allah ada padaku, dan tidak (pula) aku mengetahui yang ghaib dan tidak (pula) aku mengatakan kepadamu bahwa aku seorang malaikat. Aku tidak mengikuti kecuali apa yang diwahyukan kepadaku. Katakanlah: \"Apakah sama orang yang buta dengan yang melihat?\" Maka apakah kamu tidak memikirkan(nya)?\"",
      "ar": "قُل لَّاۤ أَقُولُ لَكُمۡ عِندِی خَزَاۤىِٕنُ ٱللَّهِ وَلَاۤ أَعۡلَمُ ٱلۡغَیۡبَ وَلَاۤ أَقُولُ لَكُمۡ إِنِّی مَلَكٌۖ إِنۡ أَتَّبِعُ إِلَّا مَا یُوحَىٰۤ إِلَیَّۚ قُلۡ هَلۡ یَسۡتَوِی ٱلۡأَعۡمَىٰ وَٱلۡبَصِیرُۚ أَفَلَا تَتَفَكَّرُونَ\n"
    }
  },
  {
    "id": 840,
    "surahId": 6,
    "ayahNumber": 51,
    "arabicText": "وَأَنذِرۡ بِهِ ٱلَّذِینَ یَخَافُونَ أَن یُحۡشَرُوۤا۟ إِلَىٰ رَبِّهِمۡ لَیۡسَ لَهُم مِّن دُونِهِۦ وَلِیࣱّ وَلَا شَفِیعࣱ لَّعَلَّهُمۡ یَتَّقُونَ\n",
    "translations": {
      "en": "And warn hereby those who fear lest they be gathered unto their Sustainer with none to protect them from Him or to intercede with Him, so that they might become [fully] conscious of Him.",
      "ms": "Dan berilah amaran dengan Al-Quran itu kepada orang-orang yang merasa takut bahawa mereka akan dihimpunkan kepada Tuhan mereka (pada hari kiamat), (padahal) tiadalah bagi mereka pelindung dan tidak juga pemberi syafaat yang lain dari Allah, supaya mereka bertaqwa.",
      "id": "Dan berilah peringatan dengan apa yang diwahyukan itu kepada orang-orang yang takut akan dihimpunkan kepada Tuhannya (pada hari kiamat), sedang bagi mereka tidak ada seorang pelindung dan pemberi syafa'atpun selain daripada Allah, agar mereka bertakwa.",
      "ar": "وَأَنذِرۡ بِهِ ٱلَّذِینَ یَخَافُونَ أَن یُحۡشَرُوۤا۟ إِلَىٰ رَبِّهِمۡ لَیۡسَ لَهُم مِّن دُونِهِۦ وَلِیࣱّ وَلَا شَفِیعࣱ لَّعَلَّهُمۡ یَتَّقُونَ\n"
    }
  },
  {
    "id": 841,
    "surahId": 6,
    "ayahNumber": 52,
    "arabicText": "وَلَا تَطۡرُدِ ٱلَّذِینَ یَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِیِّ یُرِیدُونَ وَجۡهَهُۥۖ مَا عَلَیۡكَ مِنۡ حِسَابِهِم مِّن شَیۡءࣲ وَمَا مِنۡ حِسَابِكَ عَلَیۡهِم مِّن شَیۡءࣲ فَتَطۡرُدَهُمۡ فَتَكُونَ مِنَ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "Hence, repulse not [any of] those who at morn and evening invoke their Sustainer, seeking His countenance. Thou art in no wise accountable for them-just as they are in no wise accountable for thee -and thou hast therefore no right to repulse them: for then thou wouldst be among the evildoers.",
      "ms": "Dan janganlah engkau usir orang-orang yang beribadat dan berdoa kepada Tuhan mereka pagi dan petang, sedang mereka menghendaki keredaanNya semata-mata. Tiadalah engkau bertanggungjawab sesuatu pun mengenai hitungan amal mereka, dan mereka juga tidak bertanggungjawab sesuatu pun mengenai hitungan amalmu. Maka (sekiranya) engkau usir mereka, nescaya menjadilah engkau dari orang-orang yang zalim.",
      "id": "Dan janganlah kamu mengusir orang-orang yang menyeru Tuhannya di pagi dan petang hari, sedang mereka menghendaki keridhaan-Nya. Kamu tidak memikul tanggung jawab sedikitpun terhadap perbuatan mereka dan merekapun tidak memikul tanggung jawab sedikitpun terhadap perbuatanmu, yang menyebabkan kamu (berhak) mengusir mereka, (sehingga kamu termasuk orang-orang yang zalim).",
      "ar": "وَلَا تَطۡرُدِ ٱلَّذِینَ یَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِیِّ یُرِیدُونَ وَجۡهَهُۥۖ مَا عَلَیۡكَ مِنۡ حِسَابِهِم مِّن شَیۡءࣲ وَمَا مِنۡ حِسَابِكَ عَلَیۡهِم مِّن شَیۡءࣲ فَتَطۡرُدَهُمۡ فَتَكُونَ مِنَ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 842,
    "surahId": 6,
    "ayahNumber": 53,
    "arabicText": "وَكَذَ ٰ⁠لِكَ فَتَنَّا بَعۡضَهُم بِبَعۡضࣲ لِّیَقُولُوۤا۟ أَهَـٰۤؤُلَاۤءِ مَنَّ ٱللَّهُ عَلَیۡهِم مِّنۢ بَیۡنِنَاۤۗ أَلَیۡسَ ٱللَّهُ بِأَعۡلَمَ بِٱلشَّـٰكِرِینَ\n",
    "translations": {
      "en": "For it is in this way that We try men through one another - to the end that they might ask, \"Has God, then, bestowed His favour upon those others in preference to us?\" Does not God know best as to who is grateful [to Him]?",
      "ms": "Dan demikianlah Kami uji sebahagian dari mereka (yang kaya raya) dengan sebahagian yang lain (yang fakir miskin); lalu orang-orang yang kaya itu berkata (kepada orang-orang fakir miskin yang beriman): \"Inikah orang-orangnya yang telah dikurniakan nikmat oleh Allah kepada mereka di antara kami? \" (Allah berfirman): \"Bukankah Allah lebih mengetahui akan orang-orang yang bersyukur?\"",
      "id": "Dan demikianlah telah Kami uji sebahagian mereka (orang-orang kaya) dengan sebahagian mereka (orang-orang miskin), supaya (orang-orang yang kaya itu) berkata: \"Orang-orang semacam inikah di antara kita yang diberi anugerah Allah kepada mereka?\" (Allah berfirman): \"Tidakkah Allah lebih mengetahui tentang orang-orang yang bersyukur (kepada-Nya)?\"",
      "ar": "وَكَذَ ٰ⁠لِكَ فَتَنَّا بَعۡضَهُم بِبَعۡضࣲ لِّیَقُولُوۤا۟ أَهَـٰۤؤُلَاۤءِ مَنَّ ٱللَّهُ عَلَیۡهِم مِّنۢ بَیۡنِنَاۤۗ أَلَیۡسَ ٱللَّهُ بِأَعۡلَمَ بِٱلشَّـٰكِرِینَ\n"
    }
  },
  {
    "id": 843,
    "surahId": 6,
    "ayahNumber": 54,
    "arabicText": "وَإِذَا جَاۤءَكَ ٱلَّذِینَ یُؤۡمِنُونَ بِـَٔایَـٰتِنَا فَقُلۡ سَلَـٰمٌ عَلَیۡكُمۡۖ كَتَبَ رَبُّكُمۡ عَلَىٰ نَفۡسِهِ ٱلرَّحۡمَةَ أَنَّهُۥ مَنۡ عَمِلَ مِنكُمۡ سُوۤءَۢا بِجَهَـٰلَةࣲ ثُمَّ تَابَ مِنۢ بَعۡدِهِۦ وَأَصۡلَحَ فَأَنَّهُۥ غَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "And when those who believe in Our messages come unto thee, say: \"Peace be upon you. Your Sustainer has willed upon Himself the law of grace and mercy - so that if any of you does a bad deed out of ignorance, and thereafter repents and lives righteously, He shall be [found] much-forgiving, a dispenser of grace.\"",
      "ms": "Dan apabila orang-orang yang beriman kepada ayat-ayat keterangan Kami itu datang kepadamu (dengan tujuan hendak bertaubat dari dosa-dosa mereka), maka katakanlah: \"Mudah-mudahan kamu beroleh selamat! Tuhan kamu telah menetapkan bagi diriNya untuk memberi rahmat (yang melimpah-limpah): bahawasanya sesiapa di antara kamu yang melakukan kejahatan dengan sebab kejahilannya, kemudian ia bertaubat sesudah itu, dan berusaha memperbaiki (amalannya), maka sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani\".",
      "id": "Apabila orang-orang yang beriman kepada ayat-ayat Kami itu datang kepadamu, maka katakanlah: \"Salaamun alaikum. Tuhanmu telah menetapkan atas diri-Nya kasih sayang, (yaitu) bahwasanya barang siapa yang berbuat kejahatan di antara kamu lantaran kejahilan, kemudian ia bertaubat setelah mengerjakannya dan mengadakan perbaikan, maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "وَإِذَا جَاۤءَكَ ٱلَّذِینَ یُؤۡمِنُونَ بِـَٔایَـٰتِنَا فَقُلۡ سَلَـٰمٌ عَلَیۡكُمۡۖ كَتَبَ رَبُّكُمۡ عَلَىٰ نَفۡسِهِ ٱلرَّحۡمَةَ أَنَّهُۥ مَنۡ عَمِلَ مِنكُمۡ سُوۤءَۢا بِجَهَـٰلَةࣲ ثُمَّ تَابَ مِنۢ بَعۡدِهِۦ وَأَصۡلَحَ فَأَنَّهُۥ غَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 844,
    "surahId": 6,
    "ayahNumber": 55,
    "arabicText": "وَكَذَ ٰ⁠لِكَ نُفَصِّلُ ٱلۡـَٔایَـٰتِ وَلِتَسۡتَبِینَ سَبِیلُ ٱلۡمُجۡرِمِینَ\n",
    "translations": {
      "en": "And thus clearly do We spell out Our messages: and [We do it] so that the path of those who are lost in sin might be distinct [from that of the righteous].",
      "ms": "Dan demikianlah Kami terangkan ayat-ayat Al-Quran satu persatu (supaya jelas jalan yang benar), dan supaya jelas pula jalan orang-orang yang berdosa.",
      "id": "Dan demikianlah Kami terangkan ayat-ayat Al-Quran (supaya jelas jalan orang-orang yang saleh, dan supaya jelas (pula) jalan orang-orang yang berdosa.",
      "ar": "وَكَذَ ٰ⁠لِكَ نُفَصِّلُ ٱلۡـَٔایَـٰتِ وَلِتَسۡتَبِینَ سَبِیلُ ٱلۡمُجۡرِمِینَ\n"
    }
  },
  {
    "id": 845,
    "surahId": 6,
    "ayahNumber": 56,
    "arabicText": "قُلۡ إِنِّی نُهِیتُ أَنۡ أَعۡبُدَ ٱلَّذِینَ تَدۡعُونَ مِن دُونِ ٱللَّهِۚ قُل لَّاۤ أَتَّبِعُ أَهۡوَاۤءَكُمۡ قَدۡ ضَلَلۡتُ إِذࣰا وَمَاۤ أَنَا۠ مِنَ ٱلۡمُهۡتَدِینَ\n",
    "translations": {
      "en": "SAY [to the deniers of the truth]: \"Behold, I have been forbidden to worship those [beings] whom you invoke instead of God.\" Say: \"I do not follow your errant views -or else I should have gone astray, and should not be among those who have found the right path.\"",
      "ms": "Katakanlah (wahai Muhammad): \"Sesungguhnya aku dilarang menyembah mereka yang kamu sembah yang lain dari Allah\". Katakanlah lagi: \"Aku tidak akan menurut hawa nafsu kamu, kerana kalau aku turut, sesungguhnya sesatlah aku, dan tiadalah aku dari orang-orang yang mendapat hidayah petunjuk\".",
      "id": "Katakanlah: \"Sesungguhnya aku dilarang menyembah tuhan-tuhan yang kamu sembah selain Allah\". Katakanlah: \"Aku tidak akan mengikuti hawa nafsumu, sungguh tersesatlah aku jika berbuat demikian dan tidaklah (pula) aku termasuk orang-orang yang mendapat petunjuk\".",
      "ar": "قُلۡ إِنِّی نُهِیتُ أَنۡ أَعۡبُدَ ٱلَّذِینَ تَدۡعُونَ مِن دُونِ ٱللَّهِۚ قُل لَّاۤ أَتَّبِعُ أَهۡوَاۤءَكُمۡ قَدۡ ضَلَلۡتُ إِذࣰا وَمَاۤ أَنَا۠ مِنَ ٱلۡمُهۡتَدِینَ\n"
    }
  },
  {
    "id": 846,
    "surahId": 6,
    "ayahNumber": 57,
    "arabicText": "قُلۡ إِنِّی عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَكَذَّبۡتُم بِهِۦۚ مَا عِندِی مَا تَسۡتَعۡجِلُونَ بِهِۦۤۚ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِۖ یَقُصُّ ٱلۡحَقَّۖ وَهُوَ خَیۡرُ ٱلۡفَـٰصِلِینَ\n",
    "translations": {
      "en": "Say: \"Behold, I take my stand on a clear evidence from my Sustainer-and [so] it is to Him that you are giving the lie! Not in my power is that which [in your ignorance] you so hastily demand: judgment rests with none but God. He shall declare the truth, since it is He who is the best judge between truth and falsehood.\"",
      "ms": "Katakanlah: \"Sesungguhnya aku tetap berada di atas (kebenaran yang berdasarkan) bukti-bukti yang nyata (Al-Quran) dari Tuhanku; sedang kamu mendustakannya. Tidak ada padaku apa yang kamu minta disegerakan (dari azab seksa); hanya Allah jualah yang menetapkan hukum; Ia menerangkan kebenaran, dan Dia lah sebaik-baik yang memberi keputusan\".",
      "id": "Katakanlah: \"Sesungguhnya aku berada di atas hujjah yang nyata (Al Quran) dari Tuhanku, sedang kamu mendustakannya. Tidak ada padaku apa (azab) yang kamu minta supaya disegerakan kedatangannya. Menetapkan hukum itu hanyalah hak Allah. Dia menerangkan yang sebenarnya dan Dia Pemberi keputusan yang paling baik\".",
      "ar": "قُلۡ إِنِّی عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَكَذَّبۡتُم بِهِۦۚ مَا عِندِی مَا تَسۡتَعۡجِلُونَ بِهِۦۤۚ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِۖ یَقُصُّ ٱلۡحَقَّۖ وَهُوَ خَیۡرُ ٱلۡفَـٰصِلِینَ\n"
    }
  },
  {
    "id": 847,
    "surahId": 6,
    "ayahNumber": 58,
    "arabicText": "قُل لَّوۡ أَنَّ عِندِی مَا تَسۡتَعۡجِلُونَ بِهِۦ لَقُضِیَ ٱلۡأَمۡرُ بَیۡنِی وَبَیۡنَكُمۡۗ وَٱللَّهُ أَعۡلَمُ بِٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "Say: \"If that which you so hastily demand were in my power, everything would indeed have been decided between me and you. But God knows best as to who is doing wrong.\"",
      "ms": "Katakanlah: \"Kalau ada padaku (kuasa menurunkan) azab seksa yang kamu minta disegerakan kedatangannya itu, nescaya selesailah perkara (yang sedang berbangkit) antaraku dengan kamu. Dan (ingatlah) Allah Maha Mengetahui akan orang-orang yang zalim\".",
      "id": "Katakanlah: \"Kalau sekiranya ada padaku apa (azab) yang kamu minta supaya disegerakan, tentu telah diselesaikan Allah urusan yang ada antara aku dan kamu. Dan Allah lebih mengetahui tentang orang-orang yang zalim.",
      "ar": "قُل لَّوۡ أَنَّ عِندِی مَا تَسۡتَعۡجِلُونَ بِهِۦ لَقُضِیَ ٱلۡأَمۡرُ بَیۡنِی وَبَیۡنَكُمۡۗ وَٱللَّهُ أَعۡلَمُ بِٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 848,
    "surahId": 6,
    "ayahNumber": 59,
    "arabicText": "۞ وَعِندَهُۥ مَفَاتِحُ ٱلۡغَیۡبِ لَا یَعۡلَمُهَاۤ إِلَّا هُوَۚ وَیَعۡلَمُ مَا فِی ٱلۡبَرِّ وَٱلۡبَحۡرِۚ وَمَا تَسۡقُطُ مِن وَرَقَةٍ إِلَّا یَعۡلَمُهَا وَلَا حَبَّةࣲ فِی ظُلُمَـٰتِ ٱلۡأَرۡضِ وَلَا رَطۡبࣲ وَلَا یَابِسٍ إِلَّا فِی كِتَـٰبࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "For, with Him are the keys to the things that are beyond the reach of a created being's perception: none knows them but He. And He knows all that is on land and in the sea; and not a leaf falls but He knows it; and neither is there a grain in the earth's deep darkness, nor anything: living or dead, but is recorded in [His] clear decree.",
      "ms": "Dan pada sisi Allah jualah anak kunci perbendaharaan segala yang ghaib, tiada sesiapa yang mengetahuinya melainkan Dia lah sahaja; dan Ia mengetahui apa yang ada di darat dan di laut; dan tidak gugur sehelai daun pun melainkan Ia mengetahuinya, dan tidak gugur sebutir bijipun dalam kegelapan bumi dan tidak gugur yang basah dan yang kering, melainkan (semuanya) ada tertulis di dalam kitab (Lauh Mahfuz) yang terang nyata.",
      "id": "Dan pada sisi Allah-lah kunci-kunci semua yang ghaib; tidak ada yang mengetahuinya kecuali Dia sendiri, dan Dia mengetahui apa yang di daratan dan di lautan, dan tiada sehelai daun pun yang gugur melainkan Dia mengetahuinya (pula), dan tidak jatuh sebutir biji-pun dalam kegelapan bumi, dan tidak sesuatu yang basah atau yang kering, melainkan tertulis dalam kitab yang nyata (Lauh Mahfudz)\"",
      "ar": "۞ وَعِندَهُۥ مَفَاتِحُ ٱلۡغَیۡبِ لَا یَعۡلَمُهَاۤ إِلَّا هُوَۚ وَیَعۡلَمُ مَا فِی ٱلۡبَرِّ وَٱلۡبَحۡرِۚ وَمَا تَسۡقُطُ مِن وَرَقَةٍ إِلَّا یَعۡلَمُهَا وَلَا حَبَّةࣲ فِی ظُلُمَـٰتِ ٱلۡأَرۡضِ وَلَا رَطۡبࣲ وَلَا یَابِسٍ إِلَّا فِی كِتَـٰبࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 849,
    "surahId": 6,
    "ayahNumber": 60,
    "arabicText": "وَهُوَ ٱلَّذِی یَتَوَفَّىٰكُم بِٱلَّیۡلِ وَیَعۡلَمُ مَا جَرَحۡتُم بِٱلنَّهَارِ ثُمَّ یَبۡعَثُكُمۡ فِیهِ لِیُقۡضَىٰۤ أَجَلࣱ مُّسَمࣰّىۖ ثُمَّ إِلَیۡهِ مَرۡجِعُكُمۡ ثُمَّ یُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ\n",
    "translations": {
      "en": "And He it is who causes you to be [like] dead at night, and knows what you work in daytime; and He brings you back to life each days in order that a term set [by Him] be fulfilled. In the end, unto Him you must return: and then He will make you understand all that you were doing [in life].",
      "ms": "Dan Dia lah yang menidurkan kamu pada waktu malam, dan mengetahui apa yang kamu kerjakan pada siang hari; kemudian Ia bangunkan kamu (dari tidur) padanya, untuk disempurnakan ajal (masa umur kamu) yang telah ditetapkan. Kemudian kepadaNyalah tempat kamu kembali, kemudian Ia menyatakan kepada kamu apa yang kamu lakukan.",
      "id": "Dan Dialah yang menidurkan kamu di malam hari dan Dia mengetahui apa yang kamu kerjakan di siang hari, kemudian Dia membangunkan kamu pada siang hari untuk disempurnakan umur(mu) yang telah ditentukan, kemudian kepada Allah-lah kamu kembali, lalu Dia memberitahukan kepadamu apa yang dahulu kamu kerjakan.",
      "ar": "وَهُوَ ٱلَّذِی یَتَوَفَّىٰكُم بِٱلَّیۡلِ وَیَعۡلَمُ مَا جَرَحۡتُم بِٱلنَّهَارِ ثُمَّ یَبۡعَثُكُمۡ فِیهِ لِیُقۡضَىٰۤ أَجَلࣱ مُّسَمࣰّىۖ ثُمَّ إِلَیۡهِ مَرۡجِعُكُمۡ ثُمَّ یُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 850,
    "surahId": 6,
    "ayahNumber": 61,
    "arabicText": "وَهُوَ ٱلۡقَاهِرُ فَوۡقَ عِبَادِهِۦۖ وَیُرۡسِلُ عَلَیۡكُمۡ حَفَظَةً حَتَّىٰۤ إِذَا جَاۤءَ أَحَدَكُمُ ٱلۡمَوۡتُ تَوَفَّتۡهُ رُسُلُنَا وَهُمۡ لَا یُفَرِّطُونَ\n",
    "translations": {
      "en": "And He alone holds sway over His servants. And He sends forth heavenly forces to watch over you until, when death approaches any of you, Our messengers cause him to die: and they do not overlook [anyone].",
      "ms": "Dan Dia lah yang berkuasa atas sekalian hambaNya; dan Ia mengutuskan kepada kamu pengawal-pengawal (malaikat yang menjaga dan menulis segala yang kamu lakukan), sehingga apabila sampai ajal maut kepada salah seorang di antara kamu, lalu diambil (nyawanya) oleh utusan-utusan Kami (malaikat); sedang mereka pula (malaikat itu) tidak cuai (dalam menjalankan tugasnya).",
      "id": "Dan Dialah yang mempunyai kekuasaan tertinggi di atas semua hamba-Nya, dan diutus-Nya kepadamu malaikat-malaikat penjaga, sehingga apabila datang kematian kepada salah seorang di antara kamu, ia diwafatkan oleh malaikat-malaikat Kami, dan malaikat-malaikat Kami itu tidak melalaikan kewajibannya.",
      "ar": "وَهُوَ ٱلۡقَاهِرُ فَوۡقَ عِبَادِهِۦۖ وَیُرۡسِلُ عَلَیۡكُمۡ حَفَظَةً حَتَّىٰۤ إِذَا جَاۤءَ أَحَدَكُمُ ٱلۡمَوۡتُ تَوَفَّتۡهُ رُسُلُنَا وَهُمۡ لَا یُفَرِّطُونَ\n"
    }
  },
  {
    "id": 851,
    "surahId": 6,
    "ayahNumber": 62,
    "arabicText": "ثُمَّ رُدُّوۤا۟ إِلَى ٱللَّهِ مَوۡلَىٰهُمُ ٱلۡحَقِّۚ أَلَا لَهُ ٱلۡحُكۡمُ وَهُوَ أَسۡرَعُ ٱلۡحَـٰسِبِینَ\n",
    "translations": {
      "en": "And they [who have died] are thereupon brought before God, their true Lord Supreme. Oh, verily, His alone is all judgment: and He is the swiftest of all reckoners!",
      "ms": "Kemudian mereka (yang diambil nyawanya itu) dikembalikan kepada Allah Pengawas mereka yang sebenar (yang akan membalas dengan adil). Ketahuilah, bagi Allah jua lah kuasa menetapkan hukum (pada hari kiamat itu), dan Dia lah secepat-cepat Pengira - Penghitung.",
      "id": "Kemudian mereka (hamba Allah) dikembalikan kepada Allah, Penguasa mereka yang sebenarnya. Ketahuilah bahwa segala hukum (pada hari itu) kepunyaan-Nya. Dan Dialah Pembuat Perhitungan yang paling cepat.",
      "ar": "ثُمَّ رُدُّوۤا۟ إِلَى ٱللَّهِ مَوۡلَىٰهُمُ ٱلۡحَقِّۚ أَلَا لَهُ ٱلۡحُكۡمُ وَهُوَ أَسۡرَعُ ٱلۡحَـٰسِبِینَ\n"
    }
  },
  {
    "id": 852,
    "surahId": 6,
    "ayahNumber": 63,
    "arabicText": "قُلۡ مَن یُنَجِّیكُم مِّن ظُلُمَـٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِ تَدۡعُونَهُۥ تَضَرُّعࣰا وَخُفۡیَةࣰ لَّىِٕنۡ أَنجَىٰنَا مِنۡ هَـٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّـٰكِرِینَ\n",
    "translations": {
      "en": "Say: \"Who is it that saves you from the dark dangers of land and sea [when] you call unto Him humbly, and in the secrecy of your hearts, `If He will but save us from this [distress], we shall most certainly be among the grateful'?\"",
      "ms": "Katakanlah: \"Siapakah yang menyelamatkan kamu dari bencana-bencana di darat dan di laut? (Ketika) kamu berdoa merayu kepadaNya dengan merendah diri (secara terbuka) dan secara bersembunyi, (dengan berkata): \"Demi sesungguhnya jika Allah selamatkan kami dari bencana ini nescaya menjadilah kami dari orang-orang yang bersyukur\".",
      "id": "Katakanlah: \"Siapakah yang dapat menyelamatkan kamu dari bencana di darat dan di laut, yang kamu berdoa kepada-Nya dengan rendah diri dengan suara yang lembut (dengan mengatakan: \"Sesungguhnya jika Dia menyelamatkan kami dari (bencana) ini, tentulah kami menjadi orang-orang yang bersyukur\"\".",
      "ar": "قُلۡ مَن یُنَجِّیكُم مِّن ظُلُمَـٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِ تَدۡعُونَهُۥ تَضَرُّعࣰا وَخُفۡیَةࣰ لَّىِٕنۡ أَنجَىٰنَا مِنۡ هَـٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّـٰكِرِینَ\n"
    }
  },
  {
    "id": 853,
    "surahId": 6,
    "ayahNumber": 64,
    "arabicText": "قُلِ ٱللَّهُ یُنَجِّیكُم مِّنۡهَا وَمِن كُلِّ كَرۡبࣲ ثُمَّ أَنتُمۡ تُشۡرِكُونَ\n",
    "translations": {
      "en": "Say: \"God [alone] can save you from this and from every distress - and still you ascribe divinity to other powers beside Him!\"",
      "ms": "Katakanlah: \"Allah jualah yang menyelamatkan kamu dari bencana itu dan dari segala jenis kesusahan; dalam pada itu, kamu (masih) mempersekutukan (Allah dengan sesuatu yang lain)\".",
      "id": "Katakanlah: \"Allah menyelamatkan kamu dari bencana itu dan dari segala macam kesusahan, kemudian kamu kembali mempersekutukan-Nya\".",
      "ar": "قُلِ ٱللَّهُ یُنَجِّیكُم مِّنۡهَا وَمِن كُلِّ كَرۡبࣲ ثُمَّ أَنتُمۡ تُشۡرِكُونَ\n"
    }
  },
  {
    "id": 854,
    "surahId": 6,
    "ayahNumber": 65,
    "arabicText": "قُلۡ هُوَ ٱلۡقَادِرُ عَلَىٰۤ أَن یَبۡعَثَ عَلَیۡكُمۡ عَذَابࣰا مِّن فَوۡقِكُمۡ أَوۡ مِن تَحۡتِ أَرۡجُلِكُمۡ أَوۡ یَلۡبِسَكُمۡ شِیَعࣰا وَیُذِیقَ بَعۡضَكُم بَأۡسَ بَعۡضٍۗ ٱنظُرۡ كَیۡفَ نُصَرِّفُ ٱلۡـَٔایَـٰتِ لَعَلَّهُمۡ یَفۡقَهُونَ\n",
    "translations": {
      "en": "Say: \"It is He alone who has the power to let loose upon you suffering from above you or from beneath your feet, or to confound you with mutual discord and let you taste the fear of one another.\" Behold how many facets we give to these messages, so that they might understand the truth.",
      "ms": "Katakanlah: \"Dia lah yang berkuasa menghantar kepada kamu azab seksa (bala bencana), dari sebelah atas kamu, atau dari bawah kaki kamu, atau Ia menjadikan kamu bertentangan dan berpecah-belah - berpuak-puak, dan Ia merasakan sebahagian daripada kamu akan perbuatan ganas dan kejam sebahagian yang lain\". Perhatikanlah bagaimana Kami menjelaskan ayat-ayat keterangan (yang menunjukkan kebesaran Kami) dengan berbagai cara, supaya mereka memahaminya.",
      "id": "Katakanlah: \"Dialah yang berkuasa untuk mengirimkan azab kepadamu, dari atas kamu atau dari bawah kakimu atau Dia mencampurkan kamu dalam golongan-golongan (yang saling bertentangan) dan merasakan kepada sebahagian kamu keganasan sebahagian yang lain. Perhatikanlah, betapa Kami mendatangkan tanda-tanda kebesaran Kami silih berganti agar mereka memahami(nya)\".",
      "ar": "قُلۡ هُوَ ٱلۡقَادِرُ عَلَىٰۤ أَن یَبۡعَثَ عَلَیۡكُمۡ عَذَابࣰا مِّن فَوۡقِكُمۡ أَوۡ مِن تَحۡتِ أَرۡجُلِكُمۡ أَوۡ یَلۡبِسَكُمۡ شِیَعࣰا وَیُذِیقَ بَعۡضَكُم بَأۡسَ بَعۡضٍۗ ٱنظُرۡ كَیۡفَ نُصَرِّفُ ٱلۡـَٔایَـٰتِ لَعَلَّهُمۡ یَفۡقَهُونَ\n"
    }
  },
  {
    "id": 855,
    "surahId": 6,
    "ayahNumber": 66,
    "arabicText": "وَكَذَّبَ بِهِۦ قَوۡمُكَ وَهُوَ ٱلۡحَقُّۚ قُل لَّسۡتُ عَلَیۡكُم بِوَكِیلࣲ\n",
    "translations": {
      "en": "and yet, to all this thy peoples have given the lie, although it is the truth. Say [then]: \"I am not responsible for your conduct.",
      "ms": "Dan kaum engkau (wahai Muhammad) mendustakannya (Al-Quran), padahal ia adalah benar. Katakanlah: \"Aku bukanlah orang yang ditugaskan menjaga urusan kamu, (aku hanya seorang Rasul yang menyampaikan perintah-perintah Allah kepada kamu)\".",
      "id": "Dan kaummu mendustakannya (azab) padahal azab itu benar adanya. Katakanlah: \"Aku ini bukanlah orang yang diserahi mengurus urusanmu\".",
      "ar": "وَكَذَّبَ بِهِۦ قَوۡمُكَ وَهُوَ ٱلۡحَقُّۚ قُل لَّسۡتُ عَلَیۡكُم بِوَكِیلࣲ\n"
    }
  },
  {
    "id": 856,
    "surahId": 6,
    "ayahNumber": 67,
    "arabicText": "لِّكُلِّ نَبَإࣲ مُّسۡتَقَرࣱّۚ وَسَوۡفَ تَعۡلَمُونَ\n",
    "translations": {
      "en": "Every tiding [from God] has a term set for its fulfilment: and in time you will come to know [the truth].\"",
      "ms": "Tiap-tiap khabar berita mempunyai masa yang menentukannya (yang membuktikan benarnya atau dustanya); dan kamu akan mengetahuinya.",
      "id": "Untuk setiap berita (yang dibawa oleh rasul-rasul) ada (waktu) terjadinya dan kelak kamu akan mengetahui.",
      "ar": "لِّكُلِّ نَبَإࣲ مُّسۡتَقَرࣱّۚ وَسَوۡفَ تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 857,
    "surahId": 6,
    "ayahNumber": 68,
    "arabicText": "وَإِذَا رَأَیۡتَ ٱلَّذِینَ یَخُوضُونَ فِیۤ ءَایَـٰتِنَا فَأَعۡرِضۡ عَنۡهُمۡ حَتَّىٰ یَخُوضُوا۟ فِی حَدِیثٍ غَیۡرِهِۦۚ وَإِمَّا یُنسِیَنَّكَ ٱلشَّیۡطَـٰنُ فَلَا تَقۡعُدۡ بَعۡدَ ٱلذِّكۡرَىٰ مَعَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "NOW, whenever thou meet such as indulge in [blasphemous] talk about Our messages, turn thy back upon them until they begin to talk of other things and if Satan should ever cause thee to forget [thyself], remain not, after recollection, in the company of such evildoing folk,",
      "ms": "Dan apabila engkau melihat orang-orang yang memperkatakan dengan cara mencaci atau mengejek-ejek ayat-ayat Kami, maka tinggalkanlah mereka sehingga mereka memperkatakan soal yang lain; dan jika engkau dilupakan oleh Syaitan (lalu engkau duduk bersama mereka), maka janganlah engkau duduk lagi bersama-sama kaum yang zalim itu, sesudah engkau mengingati (akan larangan itu).",
      "id": "Dan apabila kamu melihat orang-orang memperolok-olokkan ayat-ayat Kami, maka tinggalkanlah mereka sehingga mereka membicarakan pembicaraan yang lain. Dan jika syaitan menjadikan kamu lupa (akan larangan ini), maka janganlah kamu duduk bersama orang-orang yang zalim itu sesudah teringat (akan larangan itu).",
      "ar": "وَإِذَا رَأَیۡتَ ٱلَّذِینَ یَخُوضُونَ فِیۤ ءَایَـٰتِنَا فَأَعۡرِضۡ عَنۡهُمۡ حَتَّىٰ یَخُوضُوا۟ فِی حَدِیثٍ غَیۡرِهِۦۚ وَإِمَّا یُنسِیَنَّكَ ٱلشَّیۡطَـٰنُ فَلَا تَقۡعُدۡ بَعۡدَ ٱلذِّكۡرَىٰ مَعَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 858,
    "surahId": 6,
    "ayahNumber": 69,
    "arabicText": "وَمَا عَلَى ٱلَّذِینَ یَتَّقُونَ مِنۡ حِسَابِهِم مِّن شَیۡءࣲ وَلَـٰكِن ذِكۡرَىٰ لَعَلَّهُمۡ یَتَّقُونَ\n",
    "translations": {
      "en": "for whom those who are conscious of God are in no wise accountable. Theirs, however, is the duty to admonish [the sinners], so that they might become conscious of God.",
      "ms": "Dan tidaklah ada tanggungjawab sedikitpun atas orang-orang yang bertaqwa mengenai dosa orang-orang (kafir yang mengejek-ejek) itu, akan tetapi (kewajipan orang-orang Islam) ialah mengingati (larangan Allah itu) supaya mereka bertaqwa.",
      "id": "Dan tidak ada pertanggungjawaban sedikitpun atas orang-orang yang bertakwa terhadap dosa mereka; akan tetapi (kewajiban mereka ialah) mengingatkan agar mereka bertakwa.",
      "ar": "وَمَا عَلَى ٱلَّذِینَ یَتَّقُونَ مِنۡ حِسَابِهِم مِّن شَیۡءࣲ وَلَـٰكِن ذِكۡرَىٰ لَعَلَّهُمۡ یَتَّقُونَ\n"
    }
  },
  {
    "id": 859,
    "surahId": 6,
    "ayahNumber": 70,
    "arabicText": "وَذَرِ ٱلَّذِینَ ٱتَّخَذُوا۟ دِینَهُمۡ لَعِبࣰا وَلَهۡوࣰا وَغَرَّتۡهُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَاۚ وَذَكِّرۡ بِهِۦۤ أَن تُبۡسَلَ نَفۡسُۢ بِمَا كَسَبَتۡ لَیۡسَ لَهَا مِن دُونِ ٱللَّهِ وَلِیࣱّ وَلَا شَفِیعࣱ وَإِن تَعۡدِلۡ كُلَّ عَدۡلࣲ لَّا یُؤۡخَذۡ مِنۡهَاۤۗ أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ أُبۡسِلُوا۟ بِمَا كَسَبُوا۟ۖ لَهُمۡ شَرَابࣱ مِّنۡ حَمِیمࣲ وَعَذَابٌ أَلِیمُۢ بِمَا كَانُوا۟ یَكۡفُرُونَ\n",
    "translations": {
      "en": "And leave to themselves all those who, beguiled by the life of this world, have made play and passing delights their religion; but remind [them] herewith that [in the life to come] every human being shall be held in pledge for whatever wrong he has done, and shall have none to protect him from God, and none to intercede for him; and though he offer any conceivable ransom, it shall not be accepted from him. It is [people such as] these that shall be held in pledge for the wrong they have done; for them there is [in the life to come] a draught of burning despair and grievous suffering awaits them because of their persistent refusal to acknowledge the truth.",
      "ms": "Dan jauhkanlah diri dari orang-orang yang menjadikan ugama mereka sebagai permainan dan hiburan, dan mereka pula telah diperdayakan oleh kehidupan dunia dan peringatkanlah (mereka) dengan Al-Quran itu supaya tiap-tiap diri (di akhirat kelak) tidak terjerumus (ke dalam azab neraka) dengan sebab apa yang ia telah usahakan (dari perbuatan yang buruk dan keji). Tidak ada baginya pelindung dan tidak juga pemberi syafaat yang lain dari Allah. Dan jika ia hendak menebus (dirinya) dengan segala jenis tebusan, (nescaya tebusan itu) tidak akan diterima daripadanya. Mereka itulah orang-orang yang dijerumuskan (ke dalam azab neraka) dengan sebab apa yang telah mereka usahakan. Bagi mereka disediakan minuman dari air panas yang menggelegak, dan azab seksa yang tidak terperi sakitnya, disebabkan mereka kufur ingkar (semasa hidupnya).",
      "id": "Dan tinggalkan lah orang-orang yang menjadikan agama mereka sebagai main-main dan senda gurau, dan mereka telah ditipu oleh kehidupan dunia. Peringatkanlah (mereka) dengan Al-Quran itu agar masing-masing diri tidak dijerumuskan ke dalam neraka, karena perbuatannya sendiri. Tidak akan ada baginya pelindung dan tidak pula pemberi syafa'at selain daripada Allah. Dan jika ia menebus dengan segala macam tebusanpun, niscaya tidak akan diterima itu daripadanya. Mereka itulah orang-orang yang dijerumuskan ke dalam neraka. Bagi mereka (disediakan) minuman dari air yang sedang mendidih dan azab yang pedih disebabkan kekafiran mereka dahulu.",
      "ar": "وَذَرِ ٱلَّذِینَ ٱتَّخَذُوا۟ دِینَهُمۡ لَعِبࣰا وَلَهۡوࣰا وَغَرَّتۡهُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَاۚ وَذَكِّرۡ بِهِۦۤ أَن تُبۡسَلَ نَفۡسُۢ بِمَا كَسَبَتۡ لَیۡسَ لَهَا مِن دُونِ ٱللَّهِ وَلِیࣱّ وَلَا شَفِیعࣱ وَإِن تَعۡدِلۡ كُلَّ عَدۡلࣲ لَّا یُؤۡخَذۡ مِنۡهَاۤۗ أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ أُبۡسِلُوا۟ بِمَا كَسَبُوا۟ۖ لَهُمۡ شَرَابࣱ مِّنۡ حَمِیمࣲ وَعَذَابٌ أَلِیمُۢ بِمَا كَانُوا۟ یَكۡفُرُونَ\n"
    }
  },
  {
    "id": 860,
    "surahId": 6,
    "ayahNumber": 71,
    "arabicText": "قُلۡ أَنَدۡعُوا۟ مِن دُونِ ٱللَّهِ مَا لَا یَنفَعُنَا وَلَا یَضُرُّنَا وَنُرَدُّ عَلَىٰۤ أَعۡقَابِنَا بَعۡدَ إِذۡ هَدَىٰنَا ٱللَّهُ كَٱلَّذِی ٱسۡتَهۡوَتۡهُ ٱلشَّیَـٰطِینُ فِی ٱلۡأَرۡضِ حَیۡرَانَ لَهُۥۤ أَصۡحَـٰبࣱ یَدۡعُونَهُۥۤ إِلَى ٱلۡهُدَى ٱئۡتِنَاۗ قُلۡ إِنَّ هُدَى ٱللَّهِ هُوَ ٱلۡهُدَىٰۖ وَأُمِرۡنَا لِنُسۡلِمَ لِرَبِّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "SAY: \"Shall we invoke, instead of God, something that can neither benefit us nor harm us, and [thus] turn around on our heels after God has guided us aright? -like one whom the satans have enticed into blundering after earthly lusts, the while his companions, trying to guide him, call out unto him [from afar], `Come thou to us!\"' Say: \"Verily, God's guidance is the only guidance: and so we have been bidden to surrender ourselves unto the Sustainer of all the worlds,",
      "ms": "Katakanlah: \"Patutkah kita menyeru serta menyembah yang lain dari Allah, sesuatu yang tidak dapat memberi manfaat kepada kita dan tidak dapat mendatangkan mudarat kepada kita; dan (patutkah) kita dikembalikan undur ke belakang (menjadi kafir musyrik) setelah kita diberi hidayah petunjuk oleh Allah (dengan ugama Islam), seperti orang yang telah disesatkan oleh Syaitan-syaitan di bumi (di tempat yang lengang) dalam keadaan bingung, sedang ia pula mempunyai sahabat-sahabat yang mengajaknya ke jalan yang lurus (dengan berkata kepadanya): \"Marilah bersama-sama kami. \"Katakanlah: \"Sesungguhnya petunjuk Allah itulah sebenar-benar petunjuk, dan kita diperintahkan supaya berserah diri kepada Tuhan yang memelihara dan mentadbirkan sekalian alam\".",
      "id": "Katakanlah: \"Apakah kita akan menyeru selain daripada Allah, sesuatu yang tidak dapat mendatangkan kemanfaatan kepada kita dan tidak (pula) mendatangkan kemudharatan kepada kita dan (apakah) kita akan kembali ke belakang, sesudah Allah memberi petunjuk kepada kita, seperti orang yang telah disesatkan oleh syaitan di pesawangan yang menakutkan; dalam keadaan bingung, dia mempunyai kawan-kawan yang memanggilnya kepada jalan yang lurus (dengan mengatakan): \"Marilah ikuti kami\". Katakanlah: \"Sesungguhnya petunjuk Allah itulah (yang sebenarnya) petunjuk; dan kita disuruh agar menyerahkan diri kepada Tuhan semesta alam,",
      "ar": "قُلۡ أَنَدۡعُوا۟ مِن دُونِ ٱللَّهِ مَا لَا یَنفَعُنَا وَلَا یَضُرُّنَا وَنُرَدُّ عَلَىٰۤ أَعۡقَابِنَا بَعۡدَ إِذۡ هَدَىٰنَا ٱللَّهُ كَٱلَّذِی ٱسۡتَهۡوَتۡهُ ٱلشَّیَـٰطِینُ فِی ٱلۡأَرۡضِ حَیۡرَانَ لَهُۥۤ أَصۡحَـٰبࣱ یَدۡعُونَهُۥۤ إِلَى ٱلۡهُدَى ٱئۡتِنَاۗ قُلۡ إِنَّ هُدَى ٱللَّهِ هُوَ ٱلۡهُدَىٰۖ وَأُمِرۡنَا لِنُسۡلِمَ لِرَبِّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 861,
    "surahId": 6,
    "ayahNumber": 72,
    "arabicText": "وَأَنۡ أَقِیمُوا۟ ٱلصَّلَوٰةَ وَٱتَّقُوهُۚ وَهُوَ ٱلَّذِیۤ إِلَیۡهِ تُحۡشَرُونَ\n",
    "translations": {
      "en": "and to be constant in prayer and conscious of Him: for it is He unto whom you all shall be gathered.\"",
      "ms": "Dan (diperintahkan): Hendaklah kamu mengerjakan sembahyang dan bertaqwa kepadaNya, dan Dia lah Tuhan yang kepadaNya kamu akan dihimpunkan (pada hari akhirat kelak).",
      "id": "dan agar mendirikan sembahyang serta bertakwa kepada-Nya\". Dan Dialah Tuhan yang kepada-Nya-lah kamu akan dihimpunkan.",
      "ar": "وَأَنۡ أَقِیمُوا۟ ٱلصَّلَوٰةَ وَٱتَّقُوهُۚ وَهُوَ ٱلَّذِیۤ إِلَیۡهِ تُحۡشَرُونَ\n"
    }
  },
  {
    "id": 862,
    "surahId": 6,
    "ayahNumber": 73,
    "arabicText": "وَهُوَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۖ وَیَوۡمَ یَقُولُ كُن فَیَكُونُۚ قَوۡلُهُ ٱلۡحَقُّۚ وَلَهُ ٱلۡمُلۡكُ یَوۡمَ یُنفَخُ فِی ٱلصُّورِۚ عَـٰلِمُ ٱلۡغَیۡبِ وَٱلشَّهَـٰدَةِۚ وَهُوَ ٱلۡحَكِیمُ ٱلۡخَبِیرُ\n",
    "translations": {
      "en": "And He it is who has created the heavens and the earth in accordance with [an inner] truth - and whenever He says, \"Be,\" His word comes true; and His will be the dominion on the Day when the trumpet [of resurrection] is blown. He knows all that is beyond the reach of a created being's perception, as well as all that can be witnessed by a creature's senses or mind: for He alone is truly wise, all-aware.",
      "ms": "Dan Dia lah yang menciptakan langit dan bumi dengan (tujuan) yang benar, dan (Dia lah juga) pada masa (hendak menjadikan sesuatu) berfirman: \"Jadilah\", lalu terjadilah ia. FirmanNya itu adalah benar. Dan bagiNyalah kuasa pemerintahan pada hari ditiupkan sangkakala. Ia yang mengetahui segala yang ghaib dan yang nyata, dan Dia lah Yang Maha Bijaksana, lagi Maha mendalam pengetahuanNya.",
      "id": "Dan Dialah yang menciptakan langit dan bumi dengan benar. Dan benarlah perkataan-Nya di waktu Dia mengatakan: \"Jadilah, lalu terjadilah\", dan di tangan-Nya-lah segala kekuasaan di waktu sangkakala ditiup. Dia mengetahui yang ghaib dan yang nampak. Dan Dialah Yang Maha Bijaksana lagi Maha Mengetahui.",
      "ar": "وَهُوَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۖ وَیَوۡمَ یَقُولُ كُن فَیَكُونُۚ قَوۡلُهُ ٱلۡحَقُّۚ وَلَهُ ٱلۡمُلۡكُ یَوۡمَ یُنفَخُ فِی ٱلصُّورِۚ عَـٰلِمُ ٱلۡغَیۡبِ وَٱلشَّهَـٰدَةِۚ وَهُوَ ٱلۡحَكِیمُ ٱلۡخَبِیرُ\n"
    }
  },
  {
    "id": 863,
    "surahId": 6,
    "ayahNumber": 74,
    "arabicText": "۞ وَإِذۡ قَالَ إِبۡرَ ٰ⁠هِیمُ لِأَبِیهِ ءَازَرَ أَتَتَّخِذُ أَصۡنَامًا ءَالِهَةً إِنِّیۤ أَرَىٰكَ وَقَوۡمَكَ فِی ضَلَـٰلࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "AND, LO, [thus] spoke Abraham unto his father Azar: \"Takest thou idols for gods? Verily, I see that thou and thy people have obviously gone astray!\"",
      "ms": "Dan (ingatlah) ketika Nabi Ibrahim berkata kepada bapanya Aazar: \"Patutkah ayah menjadikan berhala-berhala sebagai tuhan-tuhan? Sesungguhnya aku melihatmu dan kaummu dalam kesesatan yang nyata\".",
      "id": "Dan (ingatlah) di waktu Ibrahim berkata kepada bapaknya, Aazar, \"Pantaskah kamu menjadikan berhala-berhala sebagai tuhan-tuhan? Sesungguhnya aku melihat kamu dan kaummu dalam kesesatan yang nyata\".",
      "ar": "۞ وَإِذۡ قَالَ إِبۡرَ ٰ⁠هِیمُ لِأَبِیهِ ءَازَرَ أَتَتَّخِذُ أَصۡنَامًا ءَالِهَةً إِنِّیۤ أَرَىٰكَ وَقَوۡمَكَ فِی ضَلَـٰلࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 864,
    "surahId": 6,
    "ayahNumber": 75,
    "arabicText": "وَكَذَ ٰ⁠لِكَ نُرِیۤ إِبۡرَ ٰ⁠هِیمَ مَلَكُوتَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَلِیَكُونَ مِنَ ٱلۡمُوقِنِینَ\n",
    "translations": {
      "en": "And thus We gave Abraham [his first] insight into [God's] mighty dominion over the heavens and the earth - and [this] to the end that he might become one of those who are inwardly sure.",
      "ms": "Dan demikianlah Kami perlihatkan kepada Nabi Ibrahim kebesaran dan kekuasaan (Kami) di langit dan di bumi, dan supaya menjadilah ia dari orang-orang yang percaya dengan sepenuh-penuh yakin.",
      "id": "Dan demikianlah Kami perlihatkan kepada Ibrahim tanda-tanda keagungan (Kami yang terdapat) di langit dan bumi dan (Kami memperlihatkannya) agar dia termasuk orang yang yakin.",
      "ar": "وَكَذَ ٰ⁠لِكَ نُرِیۤ إِبۡرَ ٰ⁠هِیمَ مَلَكُوتَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَلِیَكُونَ مِنَ ٱلۡمُوقِنِینَ\n"
    }
  },
  {
    "id": 865,
    "surahId": 6,
    "ayahNumber": 76,
    "arabicText": "فَلَمَّا جَنَّ عَلَیۡهِ ٱلَّیۡلُ رَءَا كَوۡكَبࣰاۖ قَالَ هَـٰذَا رَبِّیۖ فَلَمَّاۤ أَفَلَ قَالَ لَاۤ أُحِبُّ ٱلۡـَٔافِلِینَ\n",
    "translations": {
      "en": "Then, when the night overshadowed him with its darkness, he beheld a star;., [and] he exclaimed, \"This is my Sustainer!\" -but when it went down, he said, \"I love not the things that go down.\"",
      "ms": "Maka ketika ia berada pada waktu malam yang gelap, ia melihat sebuah bintang (bersinar-sinar), lalu ia berkata: \"Inikah Tuhanku?\" Kemudian apabila bintang itu terbenam, ia berkata pula: \"Aku tidak suka kepada yang terbenam hilang\".",
      "id": "Ketika malam telah gelap, dia melihat sebuah bintang (lalu) dia berkata: \"Inilah Tuhanku\", tetapi tatkala bintang itu tenggelam dia berkata: \"Saya tidak suka kepada yang tenggelam\".",
      "ar": "فَلَمَّا جَنَّ عَلَیۡهِ ٱلَّیۡلُ رَءَا كَوۡكَبࣰاۖ قَالَ هَـٰذَا رَبِّیۖ فَلَمَّاۤ أَفَلَ قَالَ لَاۤ أُحِبُّ ٱلۡـَٔافِلِینَ\n"
    }
  },
  {
    "id": 866,
    "surahId": 6,
    "ayahNumber": 77,
    "arabicText": "فَلَمَّا رَءَا ٱلۡقَمَرَ بَازِغࣰا قَالَ هَـٰذَا رَبِّیۖ فَلَمَّاۤ أَفَلَ قَالَ لَىِٕن لَّمۡ یَهۡدِنِی رَبِّی لَأَكُونَنَّ مِنَ ٱلۡقَوۡمِ ٱلضَّاۤلِّینَ\n",
    "translations": {
      "en": "Then, when he beheld the moon rising, he said, \"This is my Sustainer!\"-but when it went down, he said, \"Indeed, if my Sustainer guide me not. I will most certainly become one of the people who go astray!\"",
      "ms": "Kemudian apabila dilihatnya bulan terbit (menyinarkan cahayanya), dia berkata: \"Inikah Tuhanku?\" Maka setelah bulan itu terbenam, berkatalah dia: \"Demi sesungguhnya, jika aku tidak diberikan petunjuk oleh Tuhanku, nescaya menjadilah aku dari kaum yang sesat\".",
      "id": "Kemudian tatkala dia melihat bulan terbit dia berkata: \"Inilah Tuhanku\". Tetapi setelah bulan itu terbenam, dia berkata: \"Sesungguhnya jika Tuhanku tidak memberi petunjuk kepadaku, pastilah aku termasuk orang yang sesat\".",
      "ar": "فَلَمَّا رَءَا ٱلۡقَمَرَ بَازِغࣰا قَالَ هَـٰذَا رَبِّیۖ فَلَمَّاۤ أَفَلَ قَالَ لَىِٕن لَّمۡ یَهۡدِنِی رَبِّی لَأَكُونَنَّ مِنَ ٱلۡقَوۡمِ ٱلضَّاۤلِّینَ\n"
    }
  },
  {
    "id": 867,
    "surahId": 6,
    "ayahNumber": 78,
    "arabicText": "فَلَمَّا رَءَا ٱلشَّمۡسَ بَازِغَةࣰ قَالَ هَـٰذَا رَبِّی هَـٰذَاۤ أَكۡبَرُۖ فَلَمَّاۤ أَفَلَتۡ قَالَ یَـٰقَوۡمِ إِنِّی بَرِیۤءࣱ مِّمَّا تُشۡرِكُونَ\n",
    "translations": {
      "en": "Then, when he beheld the sun rising, he said, \"This is my Sustainer! This one is the greatest [of all]!\" - but when it [too] went down, he exclaimed: \"O my people! Behold, far be it from me to ascribe divinity, as you do, to aught beside God!",
      "ms": "Kemudian apabila dia melihat matahari sedang terbit (menyinarkan cahayanya), berkatalah dia: \"Inikah Tuhanku? Ini lebih besar\". Setelah matahari terbenam, dia berkata pula: ` Wahai kaumku, sesungguhnya aku berlepas diri (bersih) dari apa yang kamu sekutukan (Allah dengannya).",
      "id": "Kemudian tatkala ia melihat matahari terbit, dia berkata: \"Inilah Tuhanku, ini yang lebih besar\". Maka tatkala matahari itu terbenam, dia berkata: \"Hai kaumku, sesungguhnya aku berlepas diri dari apa yang kamu persekutukan.",
      "ar": "فَلَمَّا رَءَا ٱلشَّمۡسَ بَازِغَةࣰ قَالَ هَـٰذَا رَبِّی هَـٰذَاۤ أَكۡبَرُۖ فَلَمَّاۤ أَفَلَتۡ قَالَ یَـٰقَوۡمِ إِنِّی بَرِیۤءࣱ مِّمَّا تُشۡرِكُونَ\n"
    }
  },
  {
    "id": 868,
    "surahId": 6,
    "ayahNumber": 79,
    "arabicText": "إِنِّی وَجَّهۡتُ وَجۡهِیَ لِلَّذِی فَطَرَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ حَنِیفࣰاۖ وَمَاۤ أَنَا۠ مِنَ ٱلۡمُشۡرِكِینَ\n",
    "translations": {
      "en": "Behold, unto Him who brought into being the heavens and the earth have I turned my face, having turned away from all that is false; and I am not of those who ascribe divinity to aught beside Him.\"",
      "ms": "\"Sesungguhnya aku hadapkan muka dan diriku kepada Allah yang menciptakan langit dan bumi, sedang aku tetap di atas dasar tauhid dan bukanlah aku dari orang-orang yang menyekutukan Allah (dengan sesuatu yang lain)\".",
      "id": "Sesungguhnya aku menghadapkan diriku kepada Rabb yang menciptakan langit dan bumi, dengan cenderung kepada agama yang benar, dan aku bukanlah termasuk orang-orang yang mempersekutukan Tuhan.",
      "ar": "إِنِّی وَجَّهۡتُ وَجۡهِیَ لِلَّذِی فَطَرَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ حَنِیفࣰاۖ وَمَاۤ أَنَا۠ مِنَ ٱلۡمُشۡرِكِینَ\n"
    }
  },
  {
    "id": 869,
    "surahId": 6,
    "ayahNumber": 80,
    "arabicText": "وَحَاۤجَّهُۥ قَوۡمُهُۥۚ قَالَ أَتُحَـٰۤجُّوۤنِّی فِی ٱللَّهِ وَقَدۡ هَدَىٰنِۚ وَلَاۤ أَخَافُ مَا تُشۡرِكُونَ بِهِۦۤ إِلَّاۤ أَن یَشَاۤءَ رَبِّی شَیۡـࣰٔاۚ وَسِعَ رَبِّی كُلَّ شَیۡءٍ عِلۡمًاۚ أَفَلَا تَتَذَكَّرُونَ\n",
    "translations": {
      "en": "And his people argued with him. He said: \"Do you argue with me about God, when it is He who has guided me? But I do not fear anything to which you ascribe divinity side by side with Him, [for no evil can befall me] unless my Sustainer so wills. All things does my Sustainer embrace within His knowledge; will you not, then, keep this in mind?",
      "ms": "Dan ia dibantah oleh kaumnya, ia pun berkata: \"Patutkah kamu membantahku mengenai Allah, padahal sesungguhnya Ia telah memberi hidayah petunjuk kepadaku? Dan aku pula tidak takut (akan sebarang bahaya dari) apa yang kamu sekutukan dengan Allah, kecuali Tuhanku menghendaki sesuatu dari bahaya itu. (Sesungguhnya) pengetahuan Tuhanku meliputi tiap-tiap sesuatu, tidakkah kamu mahu (insaf) mengambil pelajaran?",
      "id": "Dan dia dibantah oleh kaumnya. Dia berkata: \"Apakah kamu hendak membantah tentang Allah, padahal sesungguhnya Allah telah memberi petunjuk kepadaku\". Dan aku tidak takut kepada (malapetaka dari) sembahan-sembahan yang kamu persekutukan dengan Allah, kecuali di kala Tuhanku menghendaki sesuatu (dari malapetaka) itu. Pengetahuan Tuhanku meliputi segala sesuatu. Maka apakah kamu tidak dapat mengambil pelajaran (daripadanya)?\"",
      "ar": "وَحَاۤجَّهُۥ قَوۡمُهُۥۚ قَالَ أَتُحَـٰۤجُّوۤنِّی فِی ٱللَّهِ وَقَدۡ هَدَىٰنِۚ وَلَاۤ أَخَافُ مَا تُشۡرِكُونَ بِهِۦۤ إِلَّاۤ أَن یَشَاۤءَ رَبِّی شَیۡـࣰٔاۚ وَسِعَ رَبِّی كُلَّ شَیۡءٍ عِلۡمًاۚ أَفَلَا تَتَذَكَّرُونَ\n"
    }
  },
  {
    "id": 870,
    "surahId": 6,
    "ayahNumber": 81,
    "arabicText": "وَكَیۡفَ أَخَافُ مَاۤ أَشۡرَكۡتُمۡ وَلَا تَخَافُونَ أَنَّكُمۡ أَشۡرَكۡتُم بِٱللَّهِ مَا لَمۡ یُنَزِّلۡ بِهِۦ عَلَیۡكُمۡ سُلۡطَـٰنࣰاۚ فَأَیُّ ٱلۡفَرِیقَیۡنِ أَحَقُّ بِٱلۡأَمۡنِۖ إِن كُنتُمۡ تَعۡلَمُونَ\n",
    "translations": {
      "en": "And why should I fear anything that you worship side by side with Him, seeing that you are not afraid of ascribing divinity to other powers beside God without His ever having bestowed upon you from on high any warrant therefor? [Tell me,] then, which of the two parties has a better right to feel secure -if you happen to know [the answer]?",
      "ms": "\"Dan bagaimanakah aku hendak takutkan apa yang kamu sekutukan dengan Allah itu (yang tidak dapat mendatangkan sesuatu bahaya), padahal kamu tidak takut bahawa kamu telah sekutukan Allah dengan sesuatu yang Allah tidak menurunkan sebarang keterangan kepada kamu mengenainya? Maka yang manakah di antara dua puak itu yang lebih berhak mendapat keamanan (dari bahaya), jika betul kamu mengetahui?\"",
      "id": "Bagaimana aku takut kepada sembahan-sembahan yang kamu persekutukan (dengan Allah), padahal kamu tidak mempersekutukan Allah dengan sembahan-sembahan yang Allah sendiri tidak menurunkan hujjah kepadamu untuk mempersekutukan-Nya. Maka manakah di antara dua golongan itu yang lebih berhak memperoleh keamanan (dari malapetaka), jika kamu mengetahui?",
      "ar": "وَكَیۡفَ أَخَافُ مَاۤ أَشۡرَكۡتُمۡ وَلَا تَخَافُونَ أَنَّكُمۡ أَشۡرَكۡتُم بِٱللَّهِ مَا لَمۡ یُنَزِّلۡ بِهِۦ عَلَیۡكُمۡ سُلۡطَـٰنࣰاۚ فَأَیُّ ٱلۡفَرِیقَیۡنِ أَحَقُّ بِٱلۡأَمۡنِۖ إِن كُنتُمۡ تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 871,
    "surahId": 6,
    "ayahNumber": 82,
    "arabicText": "ٱلَّذِینَ ءَامَنُوا۟ وَلَمۡ یَلۡبِسُوۤا۟ إِیمَـٰنَهُم بِظُلۡمٍ أُو۟لَـٰۤىِٕكَ لَهُمُ ٱلۡأَمۡنُ وَهُم مُّهۡتَدُونَ\n",
    "translations": {
      "en": "Those who have attained to faith, and who have not obscured their faith by wrongdoing-it is they who shall be secure, since it is they who have found the right path!\"",
      "ms": "Orang-orang yang beriman dan tidak mencampur adukkan iman mereka dengan kezaliman (syirik), mereka itulah orang-orang yang mendapat keamanan dan merekalah orang-orang yang mendapat hidayah petunjuk.",
      "id": "Orang-orang yang beriman dan tidak mencampuradukkan iman mereka dengan kezaliman (syirik), mereka itulah yang mendapat keamanan dan mereka itu adalah orang-orang yang mendapat petunjuk.",
      "ar": "ٱلَّذِینَ ءَامَنُوا۟ وَلَمۡ یَلۡبِسُوۤا۟ إِیمَـٰنَهُم بِظُلۡمٍ أُو۟لَـٰۤىِٕكَ لَهُمُ ٱلۡأَمۡنُ وَهُم مُّهۡتَدُونَ\n"
    }
  },
  {
    "id": 872,
    "surahId": 6,
    "ayahNumber": 83,
    "arabicText": "وَتِلۡكَ حُجَّتُنَاۤ ءَاتَیۡنَـٰهَاۤ إِبۡرَ ٰ⁠هِیمَ عَلَىٰ قَوۡمِهِۦۚ نَرۡفَعُ دَرَجَـٰتࣲ مَّن نَّشَاۤءُۗ إِنَّ رَبَّكَ حَكِیمٌ عَلِیمࣱ\n",
    "translations": {
      "en": "And this was Our argument which We vouchsafed unto Abraham against his people: [for] We do raise by degrees whom We will. Verily, thy Sustainer is wise, all-knowing.",
      "ms": "Dan itulah hujah (bukti) Kami, yang Kami berikan kepada Nabi Ibrahim untuk mengalahkan kaumnya. Kami tinggikan pangkat-pangkat kedudukan sesiapa yang Kami kehendaki. Sesungguhnya Tuhanmu Maha Bijaksana, lagi Maha Mengetahui.",
      "id": "Dan itulah hujjah Kami yang Kami berikan kepada Ibrahim untuk menghadapi kaumnya. Kami tinggikan siapa yang Kami kehendaki beberapa derajat. Sesungguhnya Tuhanmu Maha Bijaksana lagi Maha Mengetahui.",
      "ar": "وَتِلۡكَ حُجَّتُنَاۤ ءَاتَیۡنَـٰهَاۤ إِبۡرَ ٰ⁠هِیمَ عَلَىٰ قَوۡمِهِۦۚ نَرۡفَعُ دَرَجَـٰتࣲ مَّن نَّشَاۤءُۗ إِنَّ رَبَّكَ حَكِیمٌ عَلِیمࣱ\n"
    }
  },
  {
    "id": 873,
    "surahId": 6,
    "ayahNumber": 84,
    "arabicText": "وَوَهَبۡنَا لَهُۥۤ إِسۡحَـٰقَ وَیَعۡقُوبَۚ كُلًّا هَدَیۡنَاۚ وَنُوحًا هَدَیۡنَا مِن قَبۡلُۖ وَمِن ذُرِّیَّتِهِۦ دَاوُۥدَ وَسُلَیۡمَـٰنَ وَأَیُّوبَ وَیُوسُفَ وَمُوسَىٰ وَهَـٰرُونَۚ وَكَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "And We bestowed upon him Isaac and Jacob; and We guided each of them as We had guided Noah aforetime. And out of his offspring, [We bestowed prophethood upon] David, and Solomon, and Job, and Joseph, and Moses, and Aaron: for thus do We reward the doers of good;",
      "ms": "Dan Kami telah kurniakan kepada Nabi Ibrahim: (anaknya) Ishak (dari isterinya Sarah), dan (cucunya) Yaakub. Tiap-tiap seorang (dari mereka) Kami telah berikan petunjuk, dan Nabi Nuh juga Kami telah berikan petunjuk dahulu sebelum itu; dan dari keturunan Nabi Ibrahim itu (ialah Nabi-nabi): Daud, dan Sulaiman, dan Ayub, dan Yusuf, dan Musa, dan Harun. Dan demikianlah Kami memberi balasan kepada orang-orang yang berusaha supaya baik amal perbuatannya.",
      "id": "Dan Kami telah menganugerahkan Ishak dan Ya'qub kepadanya. Kepada keduanya masing-masing telah Kami beri petunjuk; dan kepada Nuh sebelum itu (juga) telah Kami beri petunjuk, dan kepada sebahagian dari keturunannya (Nuh) yaitu Daud, Sulaiman, Ayyub, Yusuf, Musa dan Harun. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.",
      "ar": "وَوَهَبۡنَا لَهُۥۤ إِسۡحَـٰقَ وَیَعۡقُوبَۚ كُلًّا هَدَیۡنَاۚ وَنُوحًا هَدَیۡنَا مِن قَبۡلُۖ وَمِن ذُرِّیَّتِهِۦ دَاوُۥدَ وَسُلَیۡمَـٰنَ وَأَیُّوبَ وَیُوسُفَ وَمُوسَىٰ وَهَـٰرُونَۚ وَكَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 874,
    "surahId": 6,
    "ayahNumber": 85,
    "arabicText": "وَزَكَرِیَّا وَیَحۡیَىٰ وَعِیسَىٰ وَإِلۡیَاسَۖ كُلࣱّ مِّنَ ٱلصَّـٰلِحِینَ\n",
    "translations": {
      "en": "and [upon] Zachariah, and John, and Jesus, and Elijah: every one of them was of the righteous;",
      "ms": "Dan (dari keturunannya juga ialah Nabi-nabi): Zakaria, dan Yahya, dan Isa, dan Ilyas; semuanya dari orang-orang yang soleh.",
      "id": "dan Zakaria, Yahya, Isa dan Ilyas. Semuanya termasuk orang-orang yang shaleh.",
      "ar": "وَزَكَرِیَّا وَیَحۡیَىٰ وَعِیسَىٰ وَإِلۡیَاسَۖ كُلࣱّ مِّنَ ٱلصَّـٰلِحِینَ\n"
    }
  },
  {
    "id": 875,
    "surahId": 6,
    "ayahNumber": 86,
    "arabicText": "وَإِسۡمَـٰعِیلَ وَٱلۡیَسَعَ وَیُونُسَ وَلُوطࣰاۚ وَكُلࣰّا فَضَّلۡنَا عَلَى ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "and [upon] Ishmael, and Elisha, and Jonah, and Lot. And every one of them did We favour above other people;",
      "ms": "Dan (dari keturunannya juga ialah Nabi-nabi): Ismail, dan Alyasak dan Yunus, dan Lut; dan mereka itu semuanya, Kami lebihkan darjat mereka atas umat-umat (yang ada pada zamannya).",
      "id": "dan Ismail, Alyasa', Yunus dan Luth. Masing-masing Kami lebihkan derajatnya di atas umat (di masanya),",
      "ar": "وَإِسۡمَـٰعِیلَ وَٱلۡیَسَعَ وَیُونُسَ وَلُوطࣰاۚ وَكُلࣰّا فَضَّلۡنَا عَلَى ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 876,
    "surahId": 6,
    "ayahNumber": 87,
    "arabicText": "وَمِنۡ ءَابَاۤىِٕهِمۡ وَذُرِّیَّـٰتِهِمۡ وَإِخۡوَ ٰ⁠نِهِمۡۖ وَٱجۡتَبَیۡنَـٰهُمۡ وَهَدَیۡنَـٰهُمۡ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "and [We exalted likewise] some of their forefathers and-their offspring and their brethren: We elected them [all], and guided them onto a straight way.",
      "ms": "Dan (Kami juga lebihkan darjat) sebahagian daripada datuk nenek mereka, dan keturunan mereka, dan mereka, dan keturunan mereka, dan saudara-saudara mereka; dan Kami telah pilih mereka, serta Kami tunjukkan mereka ke jalan yang lurus.",
      "id": "Dan Kami lebihkan (pula) derajat sebahagian dari bapak-bapak mereka, keturunan dan saudara-saudara mereka. Dan Kami telah memilih mereka (untuk menjadi nabi-nabi dan rasul-rasul) dan Kami menunjuki mereka ke jalan yang lurus.",
      "ar": "وَمِنۡ ءَابَاۤىِٕهِمۡ وَذُرِّیَّـٰتِهِمۡ وَإِخۡوَ ٰ⁠نِهِمۡۖ وَٱجۡتَبَیۡنَـٰهُمۡ وَهَدَیۡنَـٰهُمۡ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 877,
    "surahId": 6,
    "ayahNumber": 88,
    "arabicText": "ذَ ٰ⁠لِكَ هُدَى ٱللَّهِ یَهۡدِی بِهِۦ مَن یَشَاۤءُ مِنۡ عِبَادِهِۦۚ وَلَوۡ أَشۡرَكُوا۟ لَحَبِطَ عَنۡهُم مَّا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "Such is God's guidance: He guides therewith whomever He wills of His servants. And had they ascribed divinity to aught beside Him-in vain, indeed, would have been all [the good] that they ever did:",
      "ms": "Yang demikian itu ialah petunjuk Allah, yang dengannya Ia memimpin sesiapa yang dihendakiNya dari hamba-hambaNya; dan kalau mereka sekutukan (Allah dengan sesuatu yang lain) nescaya gugurlah dari mereka, apa yang mereka telah lakukan (dari amal-amal yang baik).",
      "id": "Itulah petunjuk Allah, yang dengannya Dia memberi petunjuk kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya. Seandainya mereka mempersekutukan Allah, niscaya lenyaplah dari mereka amalan yang telah mereka kerjakan.",
      "ar": "ذَ ٰ⁠لِكَ هُدَى ٱللَّهِ یَهۡدِی بِهِۦ مَن یَشَاۤءُ مِنۡ عِبَادِهِۦۚ وَلَوۡ أَشۡرَكُوا۟ لَحَبِطَ عَنۡهُم مَّا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 878,
    "surahId": 6,
    "ayahNumber": 89,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَۚ فَإِن یَكۡفُرۡ بِهَا هَـٰۤؤُلَاۤءِ فَقَدۡ وَكَّلۡنَا بِهَا قَوۡمࣰا لَّیۡسُوا۟ بِهَا بِكَـٰفِرِینَ\n",
    "translations": {
      "en": "[but] it was to them that We vouchsafed revelation, and sound judgment, and prophethood. And now, although the unbelievers may choose to deny these truths, [know that] We have entrusted them to people who will never refuse to acknowledge them-",
      "ms": "Mereka itulah orang-orang yang telah Kami berikan kepadanya Kitab Suci, dan Hikmah (ilmu pengetahuan), serta pangkat kenabian. Oleh itu, jika orang-orang (kafir) itu mengingkarinya, maka sesungguhnya Kami akan menyerahkannya kepada kaum (lain) yang tidak akan mengingkarinya.",
      "id": "Mereka itulah orang-orang yang telah Kami berikan kitab, hikmat dan kenabian Jika orang-orang (Quraisy) itu mengingkarinya, maka sesungguhnya Kami akan menyerahkannya kepada kaum yang sekali-kali tidak akan mengingkarinya.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَۚ فَإِن یَكۡفُرۡ بِهَا هَـٰۤؤُلَاۤءِ فَقَدۡ وَكَّلۡنَا بِهَا قَوۡمࣰا لَّیۡسُوا۟ بِهَا بِكَـٰفِرِینَ\n"
    }
  },
  {
    "id": 879,
    "surahId": 6,
    "ayahNumber": 90,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ هَدَى ٱللَّهُۖ فَبِهُدَىٰهُمُ ٱقۡتَدِهۡۗ قُل لَّاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ أَجۡرًاۖ إِنۡ هُوَ إِلَّا ذِكۡرَىٰ لِلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "to those whom God has guided. Follow, then, their guidance, [and] say: \"No reward do I ask of you for this [truth]: behold, it is but an admonition unto all mankind!\"",
      "ms": "Mereka (Nabi-nabi) itulah, orang-orang yang telah diberi petunjuk oleh Allah, maka turutlah olehmu (wahai Muhammad) akan petunjuk mereka; Katakanlah: \"Aku tidak meminta upah kepada kamu mengenai petunjuk (Al-Quran yang aku sampaikan) itu. Al-Quran itu tidak lain hanyalah peringatan bagi penduduk alam seluruhnya.",
      "id": "Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah, maka ikutilah petunjuk mereka. Katakanlah: \"Aku tidak meminta upah kepadamu dalam menyampaikan (Al-Quran)\". Al-Quran itu tidak lain hanyalah peringatan untuk seluruh ummat.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ هَدَى ٱللَّهُۖ فَبِهُدَىٰهُمُ ٱقۡتَدِهۡۗ قُل لَّاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ أَجۡرًاۖ إِنۡ هُوَ إِلَّا ذِكۡرَىٰ لِلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 880,
    "surahId": 6,
    "ayahNumber": 91,
    "arabicText": "وَمَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدۡرِهِۦۤ إِذۡ قَالُوا۟ مَاۤ أَنزَلَ ٱللَّهُ عَلَىٰ بَشَرࣲ مِّن شَیۡءࣲۗ قُلۡ مَنۡ أَنزَلَ ٱلۡكِتَـٰبَ ٱلَّذِی جَاۤءَ بِهِۦ مُوسَىٰ نُورࣰا وَهُدࣰى لِّلنَّاسِۖ تَجۡعَلُونَهُۥ قَرَاطِیسَ تُبۡدُونَهَا وَتُخۡفُونَ كَثِیرࣰاۖ وَعُلِّمۡتُم مَّا لَمۡ تَعۡلَمُوۤا۟ أَنتُمۡ وَلَاۤ ءَابَاۤؤُكُمۡۖ قُلِ ٱللَّهُۖ ثُمَّ ذَرۡهُمۡ فِی خَوۡضِهِمۡ یَلۡعَبُونَ\n",
    "translations": {
      "en": "For, no true understanding of God have they when they say, \"Never has God revealed anything unto man.\" Say: \"Who has bestowed from on high the divine writ which Moses brought unto men as a light and a guidance, [and] which you treat as [mere] leaves of paper, making a show of them the while you conceal [so] much - although you have been taught [by it] what neither you nor your forefathers had ever known?\" Say: \"God [has revealed that divine writ]!\" - and then leave them to play at their vain talk.",
      "ms": "Dan tiadalah mereka (kaum Yahudi) menghormati Allah sesuai dengan penghormatan yang sebenarnya ketika mereka berkata: \"Allah tidak menurunkan sesuatu pun kepada manusia\". Bertanyalah (kepada kaum Yahudi yang ingkar itu): \"Siapakah yang menurunkan Kitab (Taurat) yang dibawa oleh Nabi Musa sebagai cahaya dan petunjuk bagi manusia, yang kamu jadikan dia lembaran-lembaran kertas, sambil kamu perlihatkan (kepada orang ramai sebahagian kecil daripadanya) dan kamu sembunyikan kebanyakannya; sedang kamu pula diajarkan (dengan pengajaran-pengajaran yang terkandung di dalamnya), yang tidak diketahui oleh kamu (sebelum itu) dan tidak juga oleh datuk nenek kamu?\" Katakanlah (kepada mereka): \"Allah jualah (yang menurunkannya)\", kemudian, biarkanlah mereka leka bermain-main dalam kesesatannya.",
      "id": "Dan mereka tidak menghormati Allah dengan penghormatan yang semestinya, di kala mereka berkata: \"Allah tidak menurunkan sesuatupun kepada manusia\". Katakanlah: \"Siapakah yang menurunkan kitab (Taurat) yang dibawa oleh Musa sebagai cahaya dan petunjuk bagi manusia, kamu jadikan kitab itu lembaran-lembaran kertas yang bercerai-berai, kamu perlihatkan (sebahagiannya) dan kamu sembunyikan sebahagian besarnya, padahal telah diajarkan kepadamu apa yang kamu dan bapak-bapak kamu tidak mengetahui(nya)?\" Katakanlah: \"Allah-lah (yang menurunkannya)\", kemudian (sesudah kamu menyampaikan Al Quran kepada mereka), biarkanlah mereka bermain-main dalam kesesatannya.",
      "ar": "وَمَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدۡرِهِۦۤ إِذۡ قَالُوا۟ مَاۤ أَنزَلَ ٱللَّهُ عَلَىٰ بَشَرࣲ مِّن شَیۡءࣲۗ قُلۡ مَنۡ أَنزَلَ ٱلۡكِتَـٰبَ ٱلَّذِی جَاۤءَ بِهِۦ مُوسَىٰ نُورࣰا وَهُدࣰى لِّلنَّاسِۖ تَجۡعَلُونَهُۥ قَرَاطِیسَ تُبۡدُونَهَا وَتُخۡفُونَ كَثِیرࣰاۖ وَعُلِّمۡتُم مَّا لَمۡ تَعۡلَمُوۤا۟ أَنتُمۡ وَلَاۤ ءَابَاۤؤُكُمۡۖ قُلِ ٱللَّهُۖ ثُمَّ ذَرۡهُمۡ فِی خَوۡضِهِمۡ یَلۡعَبُونَ\n"
    }
  },
  {
    "id": 881,
    "surahId": 6,
    "ayahNumber": 92,
    "arabicText": "وَهَـٰذَا كِتَـٰبٌ أَنزَلۡنَـٰهُ مُبَارَكࣱ مُّصَدِّقُ ٱلَّذِی بَیۡنَ یَدَیۡهِ وَلِتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَاۚ وَٱلَّذِینَ یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ یُؤۡمِنُونَ بِهِۦۖ وَهُمۡ عَلَىٰ صَلَاتِهِمۡ یُحَافِظُونَ\n",
    "translations": {
      "en": "And this, too, is a divine writ which We have bestowed from on high - blessed, confirming the truth of whatever there still remains [of earlier revelations] -and [this] in order that thou mayest warn the foremost of all cities and all who dwell around it. And those who believe in the life to come do believe in this [warning]; and it is they who are ever-mindful of their prayers.",
      "ms": "Dan ini ialah Kitab (Al-Quran) yang Kami turunkan, yang mengandungi berkat (banyak faedah-faedah dan manfaatnya), lagi mengesahkan kebenaran (Kitab-kitab Suci) yang diturunkan sebelumnya, dan supaya engkau memberi peringatan kepada penduduk \"Ummul-Qura\" (Makkah) serta orang-orang yang tinggal di kelilingnya; dan orang-orang yang beriman kepada hari akhirat, mereka beriman kepada Al-Quran, dan mereka tetap mengerjakan dan memelihara sembahyangnya.",
      "id": "Dan ini (Al Quran) adalah kitab yang telah Kami turunkan yang diberkahi; membenarkan kitab-kitab yang (diturunkan) sebelumnya dan agar kamu memberi peringatan kepada (penduduk) Ummul Qura (Mekah) dan orang-orang yang di luar lingkungannya. Orang-orang yang beriman kepada adanya kehidupan akhirat tentu beriman kepadanya (Al Quran) dan mereka selalu memelihara sembahyangnya.",
      "ar": "وَهَـٰذَا كِتَـٰبٌ أَنزَلۡنَـٰهُ مُبَارَكࣱ مُّصَدِّقُ ٱلَّذِی بَیۡنَ یَدَیۡهِ وَلِتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَاۚ وَٱلَّذِینَ یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ یُؤۡمِنُونَ بِهِۦۖ وَهُمۡ عَلَىٰ صَلَاتِهِمۡ یُحَافِظُونَ\n"
    }
  },
  {
    "id": 882,
    "surahId": 6,
    "ayahNumber": 93,
    "arabicText": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ قَالَ أُوحِیَ إِلَیَّ وَلَمۡ یُوحَ إِلَیۡهِ شَیۡءࣱ وَمَن قَالَ سَأُنزِلُ مِثۡلَ مَاۤ أَنزَلَ ٱللَّهُۗ وَلَوۡ تَرَىٰۤ إِذِ ٱلظَّـٰلِمُونَ فِی غَمَرَ ٰ⁠تِ ٱلۡمَوۡتِ وَٱلۡمَلَـٰۤىِٕكَةُ بَاسِطُوۤا۟ أَیۡدِیهِمۡ أَخۡرِجُوۤا۟ أَنفُسَكُمُۖ ٱلۡیَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَقُولُونَ عَلَى ٱللَّهِ غَیۡرَ ٱلۡحَقِّ وَكُنتُمۡ عَنۡ ءَایَـٰتِهِۦ تَسۡتَكۡبِرُونَ\n",
    "translations": {
      "en": "And who could be more wicked than he who invents a lie about God, or says, \"This has been revealed unto me,\" the while nothing has been revealed to him? - or he who says, \"I, too, can bestow from on high the like of what God has bestowed\"? If thou couldst but see [how it will be] when these evildoers find themselves in the agonies of death, and the angels stretch forth their hands [and call]: \"Give up your souls! Today you shall be requited with the suffering of humiliation for having attributed to God something that is not true, and for having persistently scorned His messages in your arrogance!\"",
      "ms": "Dan siapakah yang lebih zalim daripada orang yang mereka-reka perkara yang dusta terhadap Allah, atau orang yang berkata: \"Telah diberi wahyu kepadaku\", padahal tidak diberikan sesuatu wahyupunr kepadanya; dan orang yang berkata: \"Aku akan menurunkan seperti apa yang diturunkan Allah\". Dan (sungguh ngeri) sekiranya engkau melihat ketika orang-orang yang zalim itu dalam penderitaan \"sakratul-maut\" (ketika hendak putus nyawa), sedang malaikat-malaikat pula menghulurkan tangan mereka (memukul dan menyeksa orang-orang itu) sambil berkata (dengan menengking dan mengejek): \"Keluarkanlah nyawa kamu (dari tubuh kamu sendiri); pada hari ini kamu dibalas dengan azab seksa yang menghina (kamu) sehina-hinanya, disebabkan apa yang telah kamu katakan terhadap Allah dengan tidak benar, dan kamu pula (menolak dengan) sombong takbur akan ayat-ayat keteranganNya\".",
      "id": "Dan siapakah yang lebih zalim daripada orang yang membuat kedustaan terhadap Allah atau yang berkata: \"Telah diwahyukan kepada saya\", padahal tidak ada diwahyukan sesuatupun kepadanya, dan orang yang berkata: \"Saya akan menurunkan seperti apa yang diturunkan Allah\". Alangkah dahsyatnya sekiranya kamu melihat di waktu orang-orang yang zalim berada dalam tekanan sakratul maut, sedang para malaikat memukul dengan tangannya, (sambil berkata): \"Keluarkanlah nyawamu\" Di hari ini kamu dibalas dengan siksa yang sangat menghinakan, karena kamu selalu mengatakan terhadap Allah (perkataan) yang tidak benar dan (karena) kamu selalu menyombongkan diri terhadap ayat-ayat-Nya.",
      "ar": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ قَالَ أُوحِیَ إِلَیَّ وَلَمۡ یُوحَ إِلَیۡهِ شَیۡءࣱ وَمَن قَالَ سَأُنزِلُ مِثۡلَ مَاۤ أَنزَلَ ٱللَّهُۗ وَلَوۡ تَرَىٰۤ إِذِ ٱلظَّـٰلِمُونَ فِی غَمَرَ ٰ⁠تِ ٱلۡمَوۡتِ وَٱلۡمَلَـٰۤىِٕكَةُ بَاسِطُوۤا۟ أَیۡدِیهِمۡ أَخۡرِجُوۤا۟ أَنفُسَكُمُۖ ٱلۡیَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَقُولُونَ عَلَى ٱللَّهِ غَیۡرَ ٱلۡحَقِّ وَكُنتُمۡ عَنۡ ءَایَـٰتِهِۦ تَسۡتَكۡبِرُونَ\n"
    }
  },
  {
    "id": 883,
    "surahId": 6,
    "ayahNumber": 94,
    "arabicText": "وَلَقَدۡ جِئۡتُمُونَا فُرَ ٰ⁠دَىٰ كَمَا خَلَقۡنَـٰكُمۡ أَوَّلَ مَرَّةࣲ وَتَرَكۡتُم مَّا خَوَّلۡنَـٰكُمۡ وَرَاۤءَ ظُهُورِكُمۡۖ وَمَا نَرَىٰ مَعَكُمۡ شُفَعَاۤءَكُمُ ٱلَّذِینَ زَعَمۡتُمۡ أَنَّهُمۡ فِیكُمۡ شُرَكَـٰۤؤُا۟ۚ لَقَد تَّقَطَّعَ بَیۡنَكُمۡ وَضَلَّ عَنكُم مَّا كُنتُمۡ تَزۡعُمُونَ\n",
    "translations": {
      "en": "[And God shall say:] \"And now, indeed, you have come unto Us in a lonely state, even as We created you in the first instance; and you have left behind you all that We bestowed on you [in your lifetime]. And We do not see with you those intercessors of yours whom you supposed to have a share in God's divinity with regard to yourselves! Indeed, all the bonds between you [and your earthly life] are now severed, and all your former fancies have forsaken you!",
      "ms": "Dan demi sesungguhnya, kamu tetap datang kepada Kami (pada hari kiamat) dengan bersendirian, sebagaimana Kami jadikan kamu pada mulanya; dan kamu tinggalkan di belakang kamu apa yang telah kami kurniakan kepada kamu; dan Kami tidak melihat beserta kamu penolong-penolong yang kamu anggap dan sifatkan bahawa mereka ialah sekutu-sekutu Allah dalam kalangan kamu. Demi sesungguhnya, telah putuslah perhubungan antara kamu (dengan mereka), dan hilang lenyaplah daripada kamu apa yang dahulu kamu anggap dan sifatkan (memberi faedah dan manfaat).",
      "id": "Dan sesungguhnya kamu datang kepada Kami sendiri-sendiri sebagaimana kamu Kami ciptakan pada mulanya, dan kamu tinggalkan di belakangmu (di dunia) apa yang telah Kami karuniakan kepadamu; dan Kami tiada melihat besertamu pemberi syafa'at yang kamu anggap bahwa mereka itu sekutu-sekutu Tuhan di antara kamu. Sungguh telah terputuslah (pertalian) antara kamu dan telah lenyap daripada kamu apa yang dahulu kamu anggap (sebagai sekutu Allah).",
      "ar": "وَلَقَدۡ جِئۡتُمُونَا فُرَ ٰ⁠دَىٰ كَمَا خَلَقۡنَـٰكُمۡ أَوَّلَ مَرَّةࣲ وَتَرَكۡتُم مَّا خَوَّلۡنَـٰكُمۡ وَرَاۤءَ ظُهُورِكُمۡۖ وَمَا نَرَىٰ مَعَكُمۡ شُفَعَاۤءَكُمُ ٱلَّذِینَ زَعَمۡتُمۡ أَنَّهُمۡ فِیكُمۡ شُرَكَـٰۤؤُا۟ۚ لَقَد تَّقَطَّعَ بَیۡنَكُمۡ وَضَلَّ عَنكُم مَّا كُنتُمۡ تَزۡعُمُونَ\n"
    }
  },
  {
    "id": 884,
    "surahId": 6,
    "ayahNumber": 95,
    "arabicText": "۞ إِنَّ ٱللَّهَ فَالِقُ ٱلۡحَبِّ وَٱلنَّوَىٰۖ یُخۡرِجُ ٱلۡحَیَّ مِنَ ٱلۡمَیِّتِ وَمُخۡرِجُ ٱلۡمَیِّتِ مِنَ ٱلۡحَیِّۚ ذَ ٰ⁠لِكُمُ ٱللَّهُۖ فَأَنَّىٰ تُؤۡفَكُونَ\n",
    "translations": {
      "en": "VERILY, God is the One who cleaves the grain and the fruit-kernel asunder, bringing forth the living out of that which is dead, and He is the One who brings forth the dead out of that which is alive. This, then, is God: and yet, how perverted are your minds!",
      "ms": "Sesungguhnya Allah jualah yang membelah (menumbuhkan) butir (tumbuh-tumbuhan) dan biji (buah-buahan). Ia mengeluarkan yang hidup dari yang mati, dan mengeluarkan yang mati dari yang hidup. Yang sedemikian itu kekuasaannya ialah Allah. Maka bagaimanakah kamu dipalingkan dari menyembahNya (oleh benda-benda yang kamu jadikan sekutuNya)?",
      "id": "Sesungguhnya Allah menumbuhkan butir tumbuh-tumbuhan dan biji buah-buahan. Dia mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup. (Yang memiliki sifat-sifat) demikian ialah Allah, maka mengapa kamu masih berpaling?",
      "ar": "۞ إِنَّ ٱللَّهَ فَالِقُ ٱلۡحَبِّ وَٱلنَّوَىٰۖ یُخۡرِجُ ٱلۡحَیَّ مِنَ ٱلۡمَیِّتِ وَمُخۡرِجُ ٱلۡمَیِّتِ مِنَ ٱلۡحَیِّۚ ذَ ٰ⁠لِكُمُ ٱللَّهُۖ فَأَنَّىٰ تُؤۡفَكُونَ\n"
    }
  },
  {
    "id": 885,
    "surahId": 6,
    "ayahNumber": 96,
    "arabicText": "فَالِقُ ٱلۡإِصۡبَاحِ وَجَعَلَ ٱلَّیۡلَ سَكَنࣰا وَٱلشَّمۡسَ وَٱلۡقَمَرَ حُسۡبَانࣰاۚ ذَ ٰ⁠لِكَ تَقۡدِیرُ ٱلۡعَزِیزِ ٱلۡعَلِیمِ\n",
    "translations": {
      "en": "[He is] the One who causes the dawn to break; and He has made the night to be [a source of] stillness, and the sun and the moon to run their appointed courses: [all] this is laid down by the will of the Almighty, the All-Knowing.",
      "ms": "Allah jualah Yang membelah cahaya subuh (yang menyingsingkan fajar), dan yang menjadikan malam untuk tinggal berehat, dan menjadikan matahari dan bulan untuk mengira waktu (menurut peredarannya). Yang demikian itu adalah kuasa penentuan Allah Yang Maha Kuasa, lagi Maha Mengetahui.",
      "id": "Dia menyingsingkan pagi dan menjadikan malam untuk beristirahat, dan (menjadikan) matahari dan bulan untuk perhitungan. Itulah ketentuan Allah Yang Maha Perkasa lagi Maha Mengetahui.",
      "ar": "فَالِقُ ٱلۡإِصۡبَاحِ وَجَعَلَ ٱلَّیۡلَ سَكَنࣰا وَٱلشَّمۡسَ وَٱلۡقَمَرَ حُسۡبَانࣰاۚ ذَ ٰ⁠لِكَ تَقۡدِیرُ ٱلۡعَزِیزِ ٱلۡعَلِیمِ\n"
    }
  },
  {
    "id": 886,
    "surahId": 6,
    "ayahNumber": 97,
    "arabicText": "وَهُوَ ٱلَّذِی جَعَلَ لَكُمُ ٱلنُّجُومَ لِتَهۡتَدُوا۟ بِهَا فِی ظُلُمَـٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِۗ قَدۡ فَصَّلۡنَا ٱلۡـَٔایَـٰتِ لِقَوۡمࣲ یَعۡلَمُونَ\n",
    "translations": {
      "en": "And He it is who has set up for you the stars so that you might be guided by them in the midst of the deep darkness of land and sea: clearly, indeed, have We spelled out these messages unto people of [innate] knowledge!",
      "ms": "Dan Dia lah yang menjadikan bintang-bintang bagi kamu supaya kamu berpedoman kepadanya dalam kegelapan (malam) di darat dan di laut. Sesungguhnya kami telah jelaskan tanda-tanda kebesaran (Kami) satu persatu bagi orang-orang yang mengetahui.",
      "id": "Dan Dialah yang menjadikan bintang-bintang bagimu, agar kamu menjadikannya petunjuk dalam kegelapan di darat dan di laut. Sesungguhnya Kami telah menjelaskan tanda-tanda kebesaran (Kami) kepada orang-orang yang mengetahui.",
      "ar": "وَهُوَ ٱلَّذِی جَعَلَ لَكُمُ ٱلنُّجُومَ لِتَهۡتَدُوا۟ بِهَا فِی ظُلُمَـٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِۗ قَدۡ فَصَّلۡنَا ٱلۡـَٔایَـٰتِ لِقَوۡمࣲ یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 887,
    "surahId": 6,
    "ayahNumber": 98,
    "arabicText": "وَهُوَ ٱلَّذِیۤ أَنشَأَكُم مِّن نَّفۡسࣲ وَ ٰ⁠حِدَةࣲ فَمُسۡتَقَرࣱّ وَمُسۡتَوۡدَعࣱۗ قَدۡ فَصَّلۡنَا ٱلۡـَٔایَـٰتِ لِقَوۡمࣲ یَفۡقَهُونَ\n",
    "translations": {
      "en": "And He it is who has brought you [all] into being out of one living entity, and [has appointed for each of you] a time-limit [on earth] and a resting-place [after death]: clearly, indeed, have We spelled out these messages unto people who can grasp the truth!",
      "ms": "Dan Dia lah yang mencipta kamu dari diri yang satu (Adam), maka (bagi kamu) disediakan tempat tetap (dalam tulang sulbi bapa kamu atau di bumi), dan tempat simpanan (dalam rahim ibu atau dalam kubur). Sesungguhnya Kami telah jelaskan tanda-tanda kebesaran (Kami) satu persatu bagi orang-orang yang mengerti (secara mendalam).",
      "id": "Dan Dialah yang menciptakan kamu dari seorang diri, maka (bagimu) ada tempat tetap dan tempat simpanan. Sesungguhnya telah Kami jelaskan tanda-tanda kebesaran Kami kepada orang-orang yang mengetahui.",
      "ar": "وَهُوَ ٱلَّذِیۤ أَنشَأَكُم مِّن نَّفۡسࣲ وَ ٰ⁠حِدَةࣲ فَمُسۡتَقَرࣱّ وَمُسۡتَوۡدَعࣱۗ قَدۡ فَصَّلۡنَا ٱلۡـَٔایَـٰتِ لِقَوۡمࣲ یَفۡقَهُونَ\n"
    }
  },
  {
    "id": 888,
    "surahId": 6,
    "ayahNumber": 99,
    "arabicText": "وَهُوَ ٱلَّذِیۤ أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَخۡرَجۡنَا بِهِۦ نَبَاتَ كُلِّ شَیۡءࣲ فَأَخۡرَجۡنَا مِنۡهُ خَضِرࣰا نُّخۡرِجُ مِنۡهُ حَبࣰّا مُّتَرَاكِبࣰا وَمِنَ ٱلنَّخۡلِ مِن طَلۡعِهَا قِنۡوَانࣱ دَانِیَةࣱ وَجَنَّـٰتࣲ مِّنۡ أَعۡنَابࣲ وَٱلزَّیۡتُونَ وَٱلرُّمَّانَ مُشۡتَبِهࣰا وَغَیۡرَ مُتَشَـٰبِهٍۗ ٱنظُرُوۤا۟ إِلَىٰ ثَمَرِهِۦۤ إِذَاۤ أَثۡمَرَ وَیَنۡعِهِۦۤۚ إِنَّ فِی ذَ ٰ⁠لِكُمۡ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یُؤۡمِنُونَ\n",
    "translations": {
      "en": "And He it is who has caused waters to come down from the sky; and by this means have We brought forth all living growth, and out of this have We brought forth verdure. Out of this do We bring forth close-growing grain; and out of the spathe of the palm tree, dates in thick clusters; and gardens of vines, and the olive tree, and the pomegranate: [all] so alike, and yet so different! Behold their fruit when it comes to fruition and ripens! Verily, in all this there are messages indeed for people who will believe!",
      "ms": "Dan Dia lah yang menurunkan hujan dari langit lalu Kami tumbuhkan dengan air hujan itu segala jenis tumbuh-tumbuhan, kemudian Kami keluarkan daripadanya tanaman yang menghijau, Kami keluarkan pula dari tanaman itu butir-butir (buah) yang bergugus-gugus; dan dari pohon-pohon tamar (kurma), dari mayang-mayangnya (Kami keluarkan) tandan-tandan buah yang mudah dicapai dan dipetik; dan (Kami jadikan) kebun-kebun dari anggur dan zaiton serta buah delima, yang bersamaan (bentuk, rupa dan rasanya) dan yang tidak bersamaan. Perhatikanlah kamu kepada buahnya apabila ia berbuah, dan ketika masaknya. Sesungguhnya yang demikian itu mengandungi tanda-tanda (yang menunjukkan kekuasaan Kami) bagi orang-orang yang beriman.",
      "id": "Dan Dialah yang menurunkan air hujan dari langit, lalu Kami tumbuhkan dengan air itu segala macam tumbuh-tumbuhan maka Kami keluarkan dari tumbuh-tumbuhan itu tanaman yang menghijau. Kami keluarkan dari tanaman yang menghijau itu butir yang banyak; dan dari mayang korma mengurai tangkai-tangkai yang menjulai, dan kebun-kebun anggur, dan (Kami keluarkan pula) zaitun dan delima yang serupa dan yang tidak serupa. Perhatikanlah buahnya di waktu pohonnya berbuah dan (perhatikan pulalah) kematangannya. Sesungguhnya pada yang demikian itu ada tanda-tanda (kekuasaan Allah) bagi orang-orang yang beriman.",
      "ar": "وَهُوَ ٱلَّذِیۤ أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَخۡرَجۡنَا بِهِۦ نَبَاتَ كُلِّ شَیۡءࣲ فَأَخۡرَجۡنَا مِنۡهُ خَضِرࣰا نُّخۡرِجُ مِنۡهُ حَبࣰّا مُّتَرَاكِبࣰا وَمِنَ ٱلنَّخۡلِ مِن طَلۡعِهَا قِنۡوَانࣱ دَانِیَةࣱ وَجَنَّـٰتࣲ مِّنۡ أَعۡنَابࣲ وَٱلزَّیۡتُونَ وَٱلرُّمَّانَ مُشۡتَبِهࣰا وَغَیۡرَ مُتَشَـٰبِهٍۗ ٱنظُرُوۤا۟ إِلَىٰ ثَمَرِهِۦۤ إِذَاۤ أَثۡمَرَ وَیَنۡعِهِۦۤۚ إِنَّ فِی ذَ ٰ⁠لِكُمۡ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 889,
    "surahId": 6,
    "ayahNumber": 100,
    "arabicText": "وَجَعَلُوا۟ لِلَّهِ شُرَكَاۤءَ ٱلۡجِنَّ وَخَلَقَهُمۡۖ وَخَرَقُوا۟ لَهُۥ بَنِینَ وَبَنَـٰتِۭ بِغَیۡرِ عِلۡمࣲۚ سُبۡحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا یَصِفُونَ\n",
    "translations": {
      "en": "And yet, some [people] have come to attribute to all manner of invisible beings a place side by side with God - although it is He who has created them [all]; and in their ignorance they have invented for Him sons and daughters! Limitless is He is His glory, and sublimely exalted above anything that men may devise by way of definition:",
      "ms": "Dan mereka menjadikan jin sekutu bagi Allah, padahal Allah jualah yang mencipta jin-jin itu; dan mereka berdusta terhadap Allah dengan mengada-adakan bagiNya anak-anak lelaki dan anak-anak perempuan, dengan tidak berdasarkan sebarang pengetahuan. Maha Suci Allah dan Maha Tinggilah Ia dari apa yang mereka sifatkan!",
      "id": "Dan mereka (orang-orang musyrik) menjadikan jin itu sekutu bagi Allah, padahal Allah-lah yang menciptakan jin-jin itu, dan mereka membohong (dengan mengatakan): \"Bahwasanya Allah mempunyai anak laki-laki dan perempuan\", tanpa (berdasar) ilmu pengetahuan. Maha Suci Allah dan Maha Tinggi dari sifat-sifat yang mereka berikan.",
      "ar": "وَجَعَلُوا۟ لِلَّهِ شُرَكَاۤءَ ٱلۡجِنَّ وَخَلَقَهُمۡۖ وَخَرَقُوا۟ لَهُۥ بَنِینَ وَبَنَـٰتِۭ بِغَیۡرِ عِلۡمࣲۚ سُبۡحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا یَصِفُونَ\n"
    }
  },
  {
    "id": 890,
    "surahId": 6,
    "ayahNumber": 101,
    "arabicText": "بَدِیعُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ أَنَّىٰ یَكُونُ لَهُۥ وَلَدࣱ وَلَمۡ تَكُن لَّهُۥ صَـٰحِبَةࣱۖ وَخَلَقَ كُلَّ شَیۡءࣲۖ وَهُوَ بِكُلِّ شَیۡءٍ عَلِیمࣱ\n",
    "translations": {
      "en": "the Originator of the heavens and the earth! How could it be that He should have a child without there ever having been a mate for Him - since it is He who has created everything, and He alone knows everything?",
      "ms": "(Dia lah) yang menciptakan langit dan bumi. Bagaimanakah Ia mempunyai anak sedang Ia tidak mempunyai isteri? Ia pula yang menciptakan tiap-tiap sesuatu, dan Dia lah Yang Maha Mengetahui akan segala-galanya.",
      "id": "Dia Pencipta langit dan bumi. Bagaimana Dia mempunyai anak padahal Dia tidak mempunyai isteri. Dia menciptakan segala sesuatu; dan Dia mengetahui segala sesuatu.",
      "ar": "بَدِیعُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ أَنَّىٰ یَكُونُ لَهُۥ وَلَدࣱ وَلَمۡ تَكُن لَّهُۥ صَـٰحِبَةࣱۖ وَخَلَقَ كُلَّ شَیۡءࣲۖ وَهُوَ بِكُلِّ شَیۡءٍ عَلِیمࣱ\n"
    }
  },
  {
    "id": 891,
    "surahId": 6,
    "ayahNumber": 102,
    "arabicText": "ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمۡۖ لَاۤ إِلَـٰهَ إِلَّا هُوَۖ خَـٰلِقُ كُلِّ شَیۡءࣲ فَٱعۡبُدُوهُۚ وَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ وَكِیلࣱ\n",
    "translations": {
      "en": "Such is God, your Sustainer: there is no deity save Him, the Creator of everything: worship, then, Him alone -for it is He who has everything in His care.",
      "ms": "Yang demikian (sifat-sifatNya dan kekuasaanNya) ialah Allah Tuhan kamu, tiada Tuhan (yang berhak disembah) melainkan Dia, yang menciptakan tiap-tiap sesuatu, maka beribadatlah kamu kepadaNya. Dan (ingatlah) Dia lah yang mentadbirkan segala-galanya.",
      "id": "(Yang memiliki sifat-sifat yang) demikian itu ialah Allah Tuhan kamu; tidak ada Tuhan selain Dia; Pencipta segala sesuatu, maka sembahlah Dia; dan Dia adalah Pemelihara segala sesuatu.",
      "ar": "ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمۡۖ لَاۤ إِلَـٰهَ إِلَّا هُوَۖ خَـٰلِقُ كُلِّ شَیۡءࣲ فَٱعۡبُدُوهُۚ وَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ وَكِیلࣱ\n"
    }
  },
  {
    "id": 892,
    "surahId": 6,
    "ayahNumber": 103,
    "arabicText": "لَّا تُدۡرِكُهُ ٱلۡأَبۡصَـٰرُ وَهُوَ یُدۡرِكُ ٱلۡأَبۡصَـٰرَۖ وَهُوَ ٱللَّطِیفُ ٱلۡخَبِیرُ\n",
    "translations": {
      "en": "No human vision can encompass Him, whereas He encompasses all human vision: for He alone is unfathomable, all-aware.",
      "ms": "Ia tidak dapat dilihat dan diliputi oleh penglihatan mata, sedang Ia dapat melihat (dan mengetahui hakikat) segala penglihatan (mata), dan Dia lah Yang Maha Halus (melayan hamba-hambaNya dengan belas kasihan), lagi Maha Mendalam pengetahuanNya.",
      "id": "Dia tidak dapat dicapai oleh penglihatan mata, sedang Dia dapat melihat segala yang kelihatan; dan Dialah Yang Maha Halus lagi Maha Mengetahui.",
      "ar": "لَّا تُدۡرِكُهُ ٱلۡأَبۡصَـٰرُ وَهُوَ یُدۡرِكُ ٱلۡأَبۡصَـٰرَۖ وَهُوَ ٱللَّطِیفُ ٱلۡخَبِیرُ\n"
    }
  },
  {
    "id": 893,
    "surahId": 6,
    "ayahNumber": 104,
    "arabicText": "قَدۡ جَاۤءَكُم بَصَاۤىِٕرُ مِن رَّبِّكُمۡۖ فَمَنۡ أَبۡصَرَ فَلِنَفۡسِهِۦۖ وَمَنۡ عَمِیَ فَعَلَیۡهَاۚ وَمَاۤ أَنَا۠ عَلَیۡكُم بِحَفِیظࣲ\n",
    "translations": {
      "en": "Means of insight have now come unto you from your Sustainer [through this divine writ]. Whoever, therefore, chooses to see, does so for his own good; and whoever chooses to remain blind, does so to his own hurt. And [say unto the blind of heart]: \"I am not your keeper.\"",
      "ms": "(Katakanlah wahai Muhammad): \"Sesungguhnya telah datang kepada kamu keterangan-keterangan (dalil-dalil dan bukti) dari Tuhan kamu; oleh itu sesiapa melihat (kebenaran itu serta menerimanya) maka faedahnya terpulang kepada dirinya sendiri, dan sesiapa buta (dan enggan menerimanya) maka bahayanya tertimpalah ke atas dirinya sendiri. Dan tiadalah aku berkewajipan menjaga dan mengawasi kamu\".",
      "id": "Sesungguhnya telah datang dari Tuhanmu bukti-bukti yang terang; maka barangsiapa melihat (kebenaran itu), maka (manfaatnya) bagi dirinya sendiri; dan barangsiapa buta (tidak melihat kebenaran itu), maka kemudharatannya kembali kepadanya. Dan aku (Muhammad) sekali-kali bukanlah pemelihara(mu).",
      "ar": "قَدۡ جَاۤءَكُم بَصَاۤىِٕرُ مِن رَّبِّكُمۡۖ فَمَنۡ أَبۡصَرَ فَلِنَفۡسِهِۦۖ وَمَنۡ عَمِیَ فَعَلَیۡهَاۚ وَمَاۤ أَنَا۠ عَلَیۡكُم بِحَفِیظࣲ\n"
    }
  },
  {
    "id": 894,
    "surahId": 6,
    "ayahNumber": 105,
    "arabicText": "وَكَذَ ٰ⁠لِكَ نُصَرِّفُ ٱلۡـَٔایَـٰتِ وَلِیَقُولُوا۟ دَرَسۡتَ وَلِنُبَیِّنَهُۥ لِقَوۡمࣲ یَعۡلَمُونَ\n",
    "translations": {
      "en": "And thus do We give many facets to Our messages. And to the end that they might say, \"Thou hast taken [all this] well to heart,\" and that We might make it clear unto people of [innate] knowledge,",
      "ms": "Dan demikianlah Kami menerangkan ayat-ayat keterangan Kami satu persatu (dengan berbagai cara, untuk menimbulkan keingkaran mereka) dan supaya mereka (yang ingkar itu menuduhmu dengan) berkata: \"Engkau telah mempelajarinya (dari orang-orang lain) \", dan supaya kami menerangkan (Al-Quran) itu kepada orang-orang yang (mahu) mengetahui.",
      "id": "Demikianlah Kami mengulang-ulangi ayat-ayat Kami supaya (orang-orang yang beriman mendapat petunjuk) dan supaya orang-orang musyrik mengatakan: \"Kamu telah mempelajari ayat-ayat itu (dari Ahli Kitab)\", dan supaya Kami menjelaskan Al Quran itu kepada orang-orang yang mengetahui.",
      "ar": "وَكَذَ ٰ⁠لِكَ نُصَرِّفُ ٱلۡـَٔایَـٰتِ وَلِیَقُولُوا۟ دَرَسۡتَ وَلِنُبَیِّنَهُۥ لِقَوۡمࣲ یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 895,
    "surahId": 6,
    "ayahNumber": 106,
    "arabicText": "ٱتَّبِعۡ مَاۤ أُوحِیَ إِلَیۡكَ مِن رَّبِّكَۖ لَاۤ إِلَـٰهَ إِلَّا هُوَۖ وَأَعۡرِضۡ عَنِ ٱلۡمُشۡرِكِینَ\n",
    "translations": {
      "en": "follow thou what has been revealed unto thee by thy Sustainer - save whom there is no deity - and turn thy back upon all who ascribe divinity to aught beside Him.",
      "ms": "Ikutlah apa yang telah diwahyukan kepadamu dari Tuhanmu, tiada Tuhan (yang berhak disembah) melainkan Dia, dan berpalinglah dari orang-orang musyrik.",
      "id": "Ikutilah apa yang telah diwahyukan kepadamu dari Tuhanmu; tidak ada Tuhan selain Dia; dan berpalinglah dari orang-orang musyrik.",
      "ar": "ٱتَّبِعۡ مَاۤ أُوحِیَ إِلَیۡكَ مِن رَّبِّكَۖ لَاۤ إِلَـٰهَ إِلَّا هُوَۖ وَأَعۡرِضۡ عَنِ ٱلۡمُشۡرِكِینَ\n"
    }
  },
  {
    "id": 896,
    "surahId": 6,
    "ayahNumber": 107,
    "arabicText": "وَلَوۡ شَاۤءَ ٱللَّهُ مَاۤ أَشۡرَكُوا۟ۗ وَمَا جَعَلۡنَـٰكَ عَلَیۡهِمۡ حَفِیظࣰاۖ وَمَاۤ أَنتَ عَلَیۡهِم بِوَكِیلࣲ\n",
    "translations": {
      "en": "Yet if God had so willed, they would not have ascribed divinity to aught beside Him; hence, We have not made thee their keeper, and neither art thou responsible for their conduct.",
      "ms": "Dan kalau Allah menghendaki, nescaya mereka tidak mempersekutukanNya; dan Kami tidak menjadikan engkau (wahai Muhammad) penjaga dan pengawal mereka, dan engkau pula bukanlah wakil yang menguruskan hal-hal mereka (kerana semuanya itu terserah kepada Allah semata-mata).",
      "id": "Dan kalau Allah menghendaki, niscaya mereka tidak memperkutukan(Nya). Dan Kami tidak menjadikan kamu pemelihara bagi mereka; dan kamu sekali-kali bukanlah pemelihara bagi mereka.",
      "ar": "وَلَوۡ شَاۤءَ ٱللَّهُ مَاۤ أَشۡرَكُوا۟ۗ وَمَا جَعَلۡنَـٰكَ عَلَیۡهِمۡ حَفِیظࣰاۖ وَمَاۤ أَنتَ عَلَیۡهِم بِوَكِیلࣲ\n"
    }
  },
  {
    "id": 897,
    "surahId": 6,
    "ayahNumber": 108,
    "arabicText": "وَلَا تَسُبُّوا۟ ٱلَّذِینَ یَدۡعُونَ مِن دُونِ ٱللَّهِ فَیَسُبُّوا۟ ٱللَّهَ عَدۡوَۢا بِغَیۡرِ عِلۡمࣲۗ كَذَ ٰ⁠لِكَ زَیَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمۡ ثُمَّ إِلَىٰ رَبِّهِم مَّرۡجِعُهُمۡ فَیُنَبِّئُهُم بِمَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "But do not revile those [beings] whom they invoke instead of God, lest they revile God out of spite, and in ignorance: for, goodly indeed have We made their own doings appear unto every community In time, [however,] unto their Sustainer they must return: and then He will make them [truly] understand all that they were doing.",
      "ms": "Dan janganlah kamu cerca benda-benda yang mereka sembah yang lain dari Allah, kerana mereka kelak, akan mencerca Allah secara melampaui batas dengan ketiadaan pengetahuan. Demikianlah Kami memperelokkan pada pandangan tiap-tiap umat akan amal perbuatan mereka, kemudian kepada Tuhan merekalah tempat kembali mereka, lalu Ia menerangkan kepada mereka apa yang mereka telah lakukan.",
      "id": "Dan janganlah kamu memaki sembahan-sembahan yang mereka sembah selain Allah, karena mereka nanti akan memaki Allah dengan melampaui batas tanpa pengetahuan. Demikianlah Kami jadikan setiap umat menganggap baik pekerjaan mereka. Kemudian kepada Tuhan merekalah kembali mereka, lalu Dia memberitakan kepada mereka apa yang dahulu mereka kerjakan.",
      "ar": "وَلَا تَسُبُّوا۟ ٱلَّذِینَ یَدۡعُونَ مِن دُونِ ٱللَّهِ فَیَسُبُّوا۟ ٱللَّهَ عَدۡوَۢا بِغَیۡرِ عِلۡمࣲۗ كَذَ ٰ⁠لِكَ زَیَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمۡ ثُمَّ إِلَىٰ رَبِّهِم مَّرۡجِعُهُمۡ فَیُنَبِّئُهُم بِمَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 898,
    "surahId": 6,
    "ayahNumber": 109,
    "arabicText": "وَأَقۡسَمُوا۟ بِٱللَّهِ جَهۡدَ أَیۡمَـٰنِهِمۡ لَىِٕن جَاۤءَتۡهُمۡ ءَایَةࣱ لَّیُؤۡمِنُنَّ بِهَاۚ قُلۡ إِنَّمَا ٱلۡـَٔایَـٰتُ عِندَ ٱللَّهِۖ وَمَا یُشۡعِرُكُمۡ أَنَّهَاۤ إِذَا جَاۤءَتۡ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Now they swear by God with their most solemn oaths that if a miracle were shown to them, they would indeed believe in this [divine writ]. Say: \"Miracles are in the power of God alone.\" And for all you know, even if one should be shown to them, they would not believe",
      "ms": "Dan mereka pula bersumpah dengan nama Allah, dengan menegaskan sumpah mereka bersungguh-sungguh, bahawa sesungguhnya jika datang kepada mereka sesuatu mukjizat (sebagaimana yang mereka minta itu), tentulah mereka akan beriman kepadanya. Katakanlah (wahai Muhammad): \"Bahawa soal mendatangkan mukjizat-mukjizat itu hanyalah Allah yang menentukannya, dan kamu tidak menyedari (wahai orang-orang Islam), bahawa apabila mukjizat-mukjizat (yang mereka minta) itu datang, mereka juga tidak akan beriman.",
      "id": "Mereka bersumpah dengan nama Allah dengan segala kesungguhan, bahwa sungguh jika datang kepada mereka sesuatu mu jizat, pastilah mereka beriman kepada-Nya. Katakanlah: \"Sesungguhnya mukjizat-mukjizat itu hanya berada di sisi Allah\". Dan apakah yang memberitahukan kepadamu bahwa apabila mukjizat datang mereka tidak akan beriman.",
      "ar": "وَأَقۡسَمُوا۟ بِٱللَّهِ جَهۡدَ أَیۡمَـٰنِهِمۡ لَىِٕن جَاۤءَتۡهُمۡ ءَایَةࣱ لَّیُؤۡمِنُنَّ بِهَاۚ قُلۡ إِنَّمَا ٱلۡـَٔایَـٰتُ عِندَ ٱللَّهِۖ وَمَا یُشۡعِرُكُمۡ أَنَّهَاۤ إِذَا جَاۤءَتۡ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 899,
    "surahId": 6,
    "ayahNumber": 110,
    "arabicText": "وَنُقَلِّبُ أَفۡـِٔدَتَهُمۡ وَأَبۡصَـٰرَهُمۡ كَمَا لَمۡ یُؤۡمِنُوا۟ بِهِۦۤ أَوَّلَ مَرَّةࣲ وَنَذَرُهُمۡ فِی طُغۡیَـٰنِهِمۡ یَعۡمَهُونَ\n",
    "translations": {
      "en": "so long as We keep their hearts and their eyes turned [away from the truth], even as they did not believe in it in the first instance: and [so] We shall leave them in their overweening arrogance, blindly stumbling to and fro.",
      "ms": "Dan kami palingkan hati mereka dan pemandangan mereka sebagaimana mereka telah tidak (mahu) beriman kepada (ayat-ayat Kami ketika datang kepada mereka) pada awal mulanya, dan Kami biarkan mereka meraba-raba di dalam kesesatannya dengan bingung.",
      "id": "Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Quran) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat.",
      "ar": "وَنُقَلِّبُ أَفۡـِٔدَتَهُمۡ وَأَبۡصَـٰرَهُمۡ كَمَا لَمۡ یُؤۡمِنُوا۟ بِهِۦۤ أَوَّلَ مَرَّةࣲ وَنَذَرُهُمۡ فِی طُغۡیَـٰنِهِمۡ یَعۡمَهُونَ\n"
    }
  },
  {
    "id": 900,
    "surahId": 6,
    "ayahNumber": 111,
    "arabicText": "۞ وَلَوۡ أَنَّنَا نَزَّلۡنَاۤ إِلَیۡهِمُ ٱلۡمَلَـٰۤىِٕكَةَ وَكَلَّمَهُمُ ٱلۡمَوۡتَىٰ وَحَشَرۡنَا عَلَیۡهِمۡ كُلَّ شَیۡءࣲ قُبُلࣰا مَّا كَانُوا۟ لِیُؤۡمِنُوۤا۟ إِلَّاۤ أَن یَشَاۤءَ ٱللَّهُ وَلَـٰكِنَّ أَكۡثَرَهُمۡ یَجۡهَلُونَ\n",
    "translations": {
      "en": "And even if We were to send down angels unto them, and if the dead were to speak unto them and [even if] We were to assemble before them, face to face, all the things [that can prove the truth], they would still not believe unless God so willed But [of this] most of them are entirely unaware.",
      "ms": "Dan jika Kami turunkan malaikat pun kepada mereka, dan orang-orang yang mati (hidup semula lalu) berkata-kata dengan mereka, dan kami himpunkan pula tiap-tiap sesuatu di hadapan mereka (untuk menjadi saksi tentang kebenaran Nabi Muhammad), nescaya mereka tidak juga akan beriman, kecuali jika dikehendaki Allah; tetapi kebanyakan mereka tidak mengetahui (hakikat yang sebenar).",
      "id": "Kalau sekiranya Kami turunkan malaikat kepada mereka, dan orang-orang yang telah mati berbicara dengan mereka dan Kami kumpulkan (pula) segala sesuatu ke hadapan mereka, niscaya mereka tidak (juga) akan beriman, kecuali jika Allah menghendaki, tetapi kebanyakan mereka tidak mengetahui.",
      "ar": "۞ وَلَوۡ أَنَّنَا نَزَّلۡنَاۤ إِلَیۡهِمُ ٱلۡمَلَـٰۤىِٕكَةَ وَكَلَّمَهُمُ ٱلۡمَوۡتَىٰ وَحَشَرۡنَا عَلَیۡهِمۡ كُلَّ شَیۡءࣲ قُبُلࣰا مَّا كَانُوا۟ لِیُؤۡمِنُوۤا۟ إِلَّاۤ أَن یَشَاۤءَ ٱللَّهُ وَلَـٰكِنَّ أَكۡثَرَهُمۡ یَجۡهَلُونَ\n"
    }
  },
  {
    "id": 901,
    "surahId": 6,
    "ayahNumber": 112,
    "arabicText": "وَكَذَ ٰ⁠لِكَ جَعَلۡنَا لِكُلِّ نَبِیٍّ عَدُوࣰّا شَیَـٰطِینَ ٱلۡإِنسِ وَٱلۡجِنِّ یُوحِی بَعۡضُهُمۡ إِلَىٰ بَعۡضࣲ زُخۡرُفَ ٱلۡقَوۡلِ غُرُورࣰاۚ وَلَوۡ شَاۤءَ رَبُّكَ مَا فَعَلُوهُۖ فَذَرۡهُمۡ وَمَا یَفۡتَرُونَ\n",
    "translations": {
      "en": "AND THUS it is that against every prophet We have set up as enemies the evil forces from among humans as well as from among invisible beings that whisper unto one another glittering half-truths meant to delude the mind But they could not do this unless thy Sustainer had so willed: stand, therefore, aloof from them and from all their false imagery!",
      "ms": "Dan demikianlah Kami jadikan bagi tiap-tiap Nabi itu musuh dari Syaitan-syaitan manusia dan jin, setengahnya membisikkan kepada setengahnya yang lain kata-kata dusta yang indah-indah susunannya untuk memperdaya pendengarnya. Dan jika Tuhanmu menghendaki, tentulah mereka tidak melakukannya. Oleh itu, biarkanlah mereka dan apa yang mereka ada-adakan (dari perbuatan yang kufur dan dusta) itu.",
      "id": "Dan demikianlah Kami jadikan bagi tiap-tiap nabi itu musuh, yaitu syaitan-syaitan (dari jenis) manusia dan (dan jenis) jin, sebahagian mereka membisikkan kepada sebahagian yang lain perkataan-perkataan yang indah-indah untuk menipu (manusia). Jikalau Tuhanmu menghendaki, niscaya mereka tidak mengerjakannya, maka tinggalkanlah mereka dan apa yang mereka ada-adakan.",
      "ar": "وَكَذَ ٰ⁠لِكَ جَعَلۡنَا لِكُلِّ نَبِیٍّ عَدُوࣰّا شَیَـٰطِینَ ٱلۡإِنسِ وَٱلۡجِنِّ یُوحِی بَعۡضُهُمۡ إِلَىٰ بَعۡضࣲ زُخۡرُفَ ٱلۡقَوۡلِ غُرُورࣰاۚ وَلَوۡ شَاۤءَ رَبُّكَ مَا فَعَلُوهُۖ فَذَرۡهُمۡ وَمَا یَفۡتَرُونَ\n"
    }
  },
  {
    "id": 902,
    "surahId": 6,
    "ayahNumber": 113,
    "arabicText": "وَلِتَصۡغَىٰۤ إِلَیۡهِ أَفۡـِٔدَةُ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ وَلِیَرۡضَوۡهُ وَلِیَقۡتَرِفُوا۟ مَا هُم مُّقۡتَرِفُونَ\n",
    "translations": {
      "en": "Yet, to the end that the hearts of those who do not believe in the life to come might incline towards Him, and that in Him they might find contentment, and that they might earn whatever they can earn [of merit] -",
      "ms": "Dan juga supaya hati orang-orang yang tidak beriman kepada hari akhirat cenderung kepada bisikan itu, dan supaya disetujui oleh mereka, dan juga supaya mereka (terus) melakukan apa yang mereka lakukan itu.",
      "id": "Dan (juga) agar hati kecil orang-orang yang tidak beriman kepada kehidupan akhirat cenderung kepada bisikan itu, mereka merasa senang kepadanya dan supaya mereka mengerjakan apa yang mereka (syaitan) kerjakan.",
      "ar": "وَلِتَصۡغَىٰۤ إِلَیۡهِ أَفۡـِٔدَةُ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ وَلِیَرۡضَوۡهُ وَلِیَقۡتَرِفُوا۟ مَا هُم مُّقۡتَرِفُونَ\n"
    }
  },
  {
    "id": 903,
    "surahId": 6,
    "ayahNumber": 114,
    "arabicText": "أَفَغَیۡرَ ٱللَّهِ أَبۡتَغِی حَكَمࣰا وَهُوَ ٱلَّذِیۤ أَنزَلَ إِلَیۡكُمُ ٱلۡكِتَـٰبَ مُفَصَّلࣰاۚ وَٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ یَعۡلَمُونَ أَنَّهُۥ مُنَزَّلࣱ مِّن رَّبِّكَ بِٱلۡحَقِّۖ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِینَ\n",
    "translations": {
      "en": "[say thou:] \"Am I, then, to look unto anyone but God for judgment [as to what is right and wrong], when it is He who has bestowed upon you from on high this divine writ, clearly spelling out the truth?\" And those unto whom We have vouchsafed revelation aforetime know that this one, too, has been bestowed from on high, step by step, by thy Sustainer. Be not, then, among the doubters-",
      "ms": "(Katakanlah wahai Muhammad): \"Patutkah aku (terpedaya dengan kata-kata dusta Syaitan-syaitan itu sehingga aku) hendak mencari hakim selain dari Allah, padahal Dia lah yang menurunkan kepada kamu kitab Al-Quran yang jelas nyata kandungannya satu persatu (tentang yang benar dan yang salah)?\" Dan orang-orang yang Kami berikan kitab, mengetahui bahawa Al-Quran itu adalah diturunkan dari Tuhanmu dengan sebenar-benarnya. Oleh itu, jangan sekali-kali engkau menjadi (salah seorang) dari golongan yang ragu-ragu.",
      "id": "Maka patutkah aku mencari hakim selain daripada Allah, padahal Dialah yang telah menurunkan kitab (Al Quran) kepadamu dengan terperinci? Orang-orang yang telah Kami datangkan kitab kepada mereka, mereka mengetahui bahwa Al Quran itu diturunkan dari Tuhanmu dengan sebenarnya. Maka janganlah kamu sekali-kali termasuk orang yang ragu-ragu.",
      "ar": "أَفَغَیۡرَ ٱللَّهِ أَبۡتَغِی حَكَمࣰا وَهُوَ ٱلَّذِیۤ أَنزَلَ إِلَیۡكُمُ ٱلۡكِتَـٰبَ مُفَصَّلࣰاۚ وَٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ یَعۡلَمُونَ أَنَّهُۥ مُنَزَّلࣱ مِّن رَّبِّكَ بِٱلۡحَقِّۖ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِینَ\n"
    }
  },
  {
    "id": 904,
    "surahId": 6,
    "ayahNumber": 115,
    "arabicText": "وَتَمَّتۡ كَلِمَتُ رَبِّكَ صِدۡقࣰا وَعَدۡلࣰاۚ لَّا مُبَدِّلَ لِكَلِمَـٰتِهِۦۚ وَهُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n",
    "translations": {
      "en": "for, truly and justly has thy Sustainer's promise been fulfilled. There is no power that could alter [the fulfilment of] His promises: and He alone is all-hearing, all-knowing.",
      "ms": "Dan telah sempurnalah Kalimah Tuhanmu (Al-Quran, meliputi hukum-hukum dan janji-janjiNya) dengan benar dan adil; tiada sesiapa yang dapat mengubah sesuatupun dari Kalimah-kalimahNya; dan Dia lah yang sentiasa Mendengar, lagi sentiasa Mengetahui.",
      "id": "Telah sempurnalah kalimat Tuhanmu (Al-Quran) sebagai kalimat yang benar dan adil. Tidak ada yang dapat merubah rubah kalimat-kalimat-Nya dan Dialah yang Maha Mendenyar lagi Maha Mengetahui.",
      "ar": "وَتَمَّتۡ كَلِمَتُ رَبِّكَ صِدۡقࣰا وَعَدۡلࣰاۚ لَّا مُبَدِّلَ لِكَلِمَـٰتِهِۦۚ وَهُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n"
    }
  },
  {
    "id": 905,
    "surahId": 6,
    "ayahNumber": 116,
    "arabicText": "وَإِن تُطِعۡ أَكۡثَرَ مَن فِی ٱلۡأَرۡضِ یُضِلُّوكَ عَن سَبِیلِ ٱللَّهِۚ إِن یَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ هُمۡ إِلَّا یَخۡرُصُونَ\n",
    "translations": {
      "en": "Now if thou pay heed unto the majority of those [who live] on earth, they will but lead thee astray from the path of God: they follow but [other people's] conjectures, and they themselves do nothing but guess.",
      "ms": "Dan jika engkau menurut kebanyakan orang yang ada di muka bumi, nescaya mereka akan menyesatkanmu dari jalan Allah; tiadalah yang mereka turut melainkan sangkaan semata-mata, dan mereka tidak lain hanyalah berdusta.",
      "id": "Dan jika kamu menuruti kebanyakan orang-orang yang di muka bumi ini, niscaya mereka akan menyesatkanmu dari jalan Allah. Mereka tidak lain hanyalah mengikuti persangkaan belaka, dan mereka tidak lain hanyalah berdusta (terhadap Allah).",
      "ar": "وَإِن تُطِعۡ أَكۡثَرَ مَن فِی ٱلۡأَرۡضِ یُضِلُّوكَ عَن سَبِیلِ ٱللَّهِۚ إِن یَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ هُمۡ إِلَّا یَخۡرُصُونَ\n"
    }
  },
  {
    "id": 906,
    "surahId": 6,
    "ayahNumber": 117,
    "arabicText": "إِنَّ رَبَّكَ هُوَ أَعۡلَمُ مَن یَضِلُّ عَن سَبِیلِهِۦۖ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِینَ\n",
    "translations": {
      "en": "Verily, thy Sustainer knows best as to who strays from His path, and best knows He as to who are the right-guided.",
      "ms": "Sesungguhnya Tuhanmu, Dia lah yang lebih mengetahui akan sesiapa yang sesat dari jalannya, dan Dia lah yang lebih mengetahui akan orang-orang yang mendapat petunjuk.",
      "id": "Sesungguhnya Tuhanmu, Dialah yang lebih mengetahui tentang orang yang tersesat dari jalan-Nya dan Dia lebih mengetahui tentang orang orang yang mendapat petunjuk.",
      "ar": "إِنَّ رَبَّكَ هُوَ أَعۡلَمُ مَن یَضِلُّ عَن سَبِیلِهِۦۖ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِینَ\n"
    }
  },
  {
    "id": 907,
    "surahId": 6,
    "ayahNumber": 118,
    "arabicText": "فَكُلُوا۟ مِمَّا ذُكِرَ ٱسۡمُ ٱللَّهِ عَلَیۡهِ إِن كُنتُم بِـَٔایَـٰتِهِۦ مُؤۡمِنِینَ\n",
    "translations": {
      "en": "EAT, then, of that over which God's name has been pronounced, if you truly believe in His messages.",
      "ms": "Maka makanlah dari (sembelihan binatang-binatang halal) yang disebut nama Allah ketika menyembelihnya, jika betul kamu beriman kepada ayat-ayatNya.",
      "id": "Maka makanlah binatang-binatang (yang halal) yang disebut nama Allah ketika menyembelihnya, jika kamu beriman kepada ayat-ayat-Nya.",
      "ar": "فَكُلُوا۟ مِمَّا ذُكِرَ ٱسۡمُ ٱللَّهِ عَلَیۡهِ إِن كُنتُم بِـَٔایَـٰتِهِۦ مُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 908,
    "surahId": 6,
    "ayahNumber": 119,
    "arabicText": "وَمَا لَكُمۡ أَلَّا تَأۡكُلُوا۟ مِمَّا ذُكِرَ ٱسۡمُ ٱللَّهِ عَلَیۡهِ وَقَدۡ فَصَّلَ لَكُم مَّا حَرَّمَ عَلَیۡكُمۡ إِلَّا مَا ٱضۡطُرِرۡتُمۡ إِلَیۡهِۗ وَإِنَّ كَثِیرࣰا لَّیُضِلُّونَ بِأَهۡوَاۤىِٕهِم بِغَیۡرِ عِلۡمٍۚ إِنَّ رَبَّكَ هُوَ أَعۡلَمُ بِٱلۡمُعۡتَدِینَ\n",
    "translations": {
      "en": "And why should you not eat of that over which God's name has been pronounced, seeing that He has so clearly spelled out to you what He has forbidden you [to eat] unless you are compelled [to do so]? But, behold, [it is precisely in such matters that] many people lead others astray by their own errant views, without [having any real] knowledge. Verily, thy Sustainer is fully aware of those who transgress the bounds of what is right.",
      "ms": "Dan tidak ada sebab bagi kamu, (yang menjadikan) kamu tidak mahu makan dari (sembelihan binatang-binatang halal) yang disebut nama Allah ketika menyembelihnya, padahal Allah telah menerangkan satu persatu kepada kamu apa yang diharamkanNya atas kamu, kecuali apa yang kamu terpaksa memakannya? Dan sesungguhnya kebanyakan manusia hendak menyesatkan dengan hawa nafsu mereka dengan tidak berdasarkan pengetahuan. Sesungguhnya Tuhanmu, Dia lah yang lebih mengetahui akan orang-orang yang melampaui batas.",
      "id": "Mengapa kamu tidak mau memakan (binatang-binatang yang halal) yang disebut nama Allah ketika menyembelihnya, padahal sesungguhnya Allah telah menjelaskan kepada kamu apa yang diharamkan-Nya atasmu, kecuali apa yang terpaksa kamu memakannya. Dan sesungguhnya kebanyakan (dari manusia) benar benar hendak menyesatkan (orang lain) dengan hawa nafsu mereka tanpa pengetahuan. Sesungguhnya Tuhanmu, Dialah yang lebih mengetahui orang-orang yang melampaui batas.",
      "ar": "وَمَا لَكُمۡ أَلَّا تَأۡكُلُوا۟ مِمَّا ذُكِرَ ٱسۡمُ ٱللَّهِ عَلَیۡهِ وَقَدۡ فَصَّلَ لَكُم مَّا حَرَّمَ عَلَیۡكُمۡ إِلَّا مَا ٱضۡطُرِرۡتُمۡ إِلَیۡهِۗ وَإِنَّ كَثِیرࣰا لَّیُضِلُّونَ بِأَهۡوَاۤىِٕهِم بِغَیۡرِ عِلۡمٍۚ إِنَّ رَبَّكَ هُوَ أَعۡلَمُ بِٱلۡمُعۡتَدِینَ\n"
    }
  },
  {
    "id": 909,
    "surahId": 6,
    "ayahNumber": 120,
    "arabicText": "وَذَرُوا۟ ظَـٰهِرَ ٱلۡإِثۡمِ وَبَاطِنَهُۥۤۚ إِنَّ ٱلَّذِینَ یَكۡسِبُونَ ٱلۡإِثۡمَ سَیُجۡزَوۡنَ بِمَا كَانُوا۟ یَقۡتَرِفُونَ\n",
    "translations": {
      "en": "But abstain from sinning, be it open or secret-for, behold, those who commit sins shall be requited for all that they have earned.",
      "ms": "Dan tinggalkanlah kamu dosa yang nyata dan yang tersembunyi. Kerana sesungguhnya orang-orang yang berusaha melakukan dosa, mereka akan dibalas dengan apa yang mereka telah lakukan.",
      "id": "Dan tinggalkanlah dosa yang nampak dan yang tersembunyi. Sesungguhnya orang yang mengerjakan dosa, kelak akan diberi pembalasan (pada hari kiamat), disebabkan apa yang mereka telah kerjakan.",
      "ar": "وَذَرُوا۟ ظَـٰهِرَ ٱلۡإِثۡمِ وَبَاطِنَهُۥۤۚ إِنَّ ٱلَّذِینَ یَكۡسِبُونَ ٱلۡإِثۡمَ سَیُجۡزَوۡنَ بِمَا كَانُوا۟ یَقۡتَرِفُونَ\n"
    }
  },
  {
    "id": 910,
    "surahId": 6,
    "ayahNumber": 121,
    "arabicText": "وَلَا تَأۡكُلُوا۟ مِمَّا لَمۡ یُذۡكَرِ ٱسۡمُ ٱللَّهِ عَلَیۡهِ وَإِنَّهُۥ لَفِسۡقࣱۗ وَإِنَّ ٱلشَّیَـٰطِینَ لَیُوحُونَ إِلَىٰۤ أَوۡلِیَاۤىِٕهِمۡ لِیُجَـٰدِلُوكُمۡۖ وَإِنۡ أَطَعۡتُمُوهُمۡ إِنَّكُمۡ لَمُشۡرِكُونَ\n",
    "translations": {
      "en": "Hence, eat not of that over which God's name has not been pronounced: for this would be sinful conduct indeed. And, verily, the evil impulses [within men's hearts] whisper unto those who have made them their own that they should involve you in argument [as to what is and what is not a sin]; and if you pay heed unto them, lo! you will become [like] those who ascribe divinity to other beings or forces beside God.",
      "ms": "Dan janganlah kamu makan dari (sembelihan binatang-binatang halal) yang tidak disebut nama Allah ketika menyembelihnya, kerana sesungguhnya yang sedemikian itu adalah perbuatan fasik (berdosa); dan sesungguhnya Syaitan-syaitan itu membisikkan kepada pengikut-pengikutnya, supaya mereka membantah (menghasut) kamu; dan jika kamu menurut hasutan mereka (untuk menghalalkan yang haram itu), sesungguhnya kamu tetap menjadi orang-orang musyrik.",
      "id": "Dan janganlah kamu memakan binatang-binatang yang tidak disebut nama Allah ketika menyembelihnya. Sesungguhnya perbuatan yang semacam itu adalah suatu kefasikan. Sesungguhnya syaitan itu membisikkan kepada kawan-kawannya agar mereka membantah kamu; dan jika kamu menuruti mereka, sesungguhnya kamu tentulah menjadi orang-orang yang musyrik.",
      "ar": "وَلَا تَأۡكُلُوا۟ مِمَّا لَمۡ یُذۡكَرِ ٱسۡمُ ٱللَّهِ عَلَیۡهِ وَإِنَّهُۥ لَفِسۡقࣱۗ وَإِنَّ ٱلشَّیَـٰطِینَ لَیُوحُونَ إِلَىٰۤ أَوۡلِیَاۤىِٕهِمۡ لِیُجَـٰدِلُوكُمۡۖ وَإِنۡ أَطَعۡتُمُوهُمۡ إِنَّكُمۡ لَمُشۡرِكُونَ\n"
    }
  },
  {
    "id": 911,
    "surahId": 6,
    "ayahNumber": 122,
    "arabicText": "أَوَمَن كَانَ مَیۡتࣰا فَأَحۡیَیۡنَـٰهُ وَجَعَلۡنَا لَهُۥ نُورࣰا یَمۡشِی بِهِۦ فِی ٱلنَّاسِ كَمَن مَّثَلُهُۥ فِی ٱلظُّلُمَـٰتِ لَیۡسَ بِخَارِجࣲ مِّنۡهَاۚ كَذَ ٰ⁠لِكَ زُیِّنَ لِلۡكَـٰفِرِینَ مَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "IS THEN -HE who was dead [in spirit] and whom We thereupon gave life, and for whom We set up a light whereby he might see his way among men - [is then he] like one [who is lost] in darkness deep, out of which he cannot emerge? [But] thus it is: goodly seem all their own doings to those who deny the truth.",
      "ms": "Dan adakah orang yang mati (hatinya dengan kufur), kemudian Kami hidupkan dia semula (dengan hidayah petunjuk), dan Kami jadikan baginya cahaya (iman) yang menerangi (sehingga dapatlah ia membezakan antara yang benar dengan yang salah, dan dapatlah) ia berjalan dengan suluhan cahaya itu dalam masyarakat manusia, (adakah orang yang demikian keadaannya) sama seperti yang tinggal tetap di dalam gelap-gelita (kufur), yang tidak dapat keluar sama sekali daripadanya? Demikianlah (sebagaimana iman itu diperlihatkan keelokannya kepada orang-orang yang beriman), diperlihatkan pula pada pandangan orang-orang yang kafir itu akan keelokan apa yang mereka telah lakukan (dari perbuatan kufur dan segala jenis maksiat).",
      "id": "Dan apakah orang yang sudah mati kemudian dia Kami hidupkan dan Kami berikan kepadanya cahaya yang terang, yang dengan cahaya itu dia dapat berjalan di tengah-tengah masyarakat manusia, serupa dengan orang yang keadaannya berada dalam gelap gulita yang sekali-kali tidak dapat keluar dari padanya? Demikianlah Kami jadikan orang yang kafir itu memandang baik apa yang telah mereka kerjakan.",
      "ar": "أَوَمَن كَانَ مَیۡتࣰا فَأَحۡیَیۡنَـٰهُ وَجَعَلۡنَا لَهُۥ نُورࣰا یَمۡشِی بِهِۦ فِی ٱلنَّاسِ كَمَن مَّثَلُهُۥ فِی ٱلظُّلُمَـٰتِ لَیۡسَ بِخَارِجࣲ مِّنۡهَاۚ كَذَ ٰ⁠لِكَ زُیِّنَ لِلۡكَـٰفِرِینَ مَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 912,
    "surahId": 6,
    "ayahNumber": 123,
    "arabicText": "وَكَذَ ٰ⁠لِكَ جَعَلۡنَا فِی كُلِّ قَرۡیَةٍ أَكَـٰبِرَ مُجۡرِمِیهَا لِیَمۡكُرُوا۟ فِیهَاۖ وَمَا یَمۡكُرُونَ إِلَّا بِأَنفُسِهِمۡ وَمَا یَشۡعُرُونَ\n",
    "translations": {
      "en": "And it is in this way that We cause the great ones in every land to become its [greatest] evildoers, there to weave their schemes: yet it is only against themselves that they scheme -and they perceive it not.",
      "ms": "Dan demikianlah Kami adakan dalam tiap-tiap negeri orang-orang besar yang jahat supaya mereka melakukan tipu daya di negeri itu, padahal tiadalah mereka memperdayakan selain dari dirinya sendiri (kerana merekalah yang akan menerima akibatnya yang buruk), sedang mereka tidak menyedarinya.",
      "id": "Dan demikianlah Kami adakan pada tiap-tiap negeri penjahat-penjahat yang terbesar agar mereka melakukan tipu daya dalam negeri itu. Dan mereka tidak memperdayakan melainkan dirinya sendiri, sedang mereka tidak menyadarinya.",
      "ar": "وَكَذَ ٰ⁠لِكَ جَعَلۡنَا فِی كُلِّ قَرۡیَةٍ أَكَـٰبِرَ مُجۡرِمِیهَا لِیَمۡكُرُوا۟ فِیهَاۖ وَمَا یَمۡكُرُونَ إِلَّا بِأَنفُسِهِمۡ وَمَا یَشۡعُرُونَ\n"
    }
  },
  {
    "id": 913,
    "surahId": 6,
    "ayahNumber": 124,
    "arabicText": "وَإِذَا جَاۤءَتۡهُمۡ ءَایَةࣱ قَالُوا۟ لَن نُّؤۡمِنَ حَتَّىٰ نُؤۡتَىٰ مِثۡلَ مَاۤ أُوتِیَ رُسُلُ ٱللَّهِۘ ٱللَّهُ أَعۡلَمُ حَیۡثُ یَجۡعَلُ رِسَالَتَهُۥۗ سَیُصِیبُ ٱلَّذِینَ أَجۡرَمُوا۟ صَغَارٌ عِندَ ٱللَّهِ وَعَذَابࣱ شَدِیدُۢ بِمَا كَانُوا۟ یَمۡكُرُونَ\n",
    "translations": {
      "en": "And whenever. a [divine] message comes to them, they say, \"We shall not believe unless we are given the like of what God's apostles were given!\" [But] God knows best upon whom to bestow His message. Abasement in the sight of God will befall those who have become guilty of evildoing, and suffering severe for all the schemes which they were wont to weave.",
      "ms": "Dan apabila datang kepada mereka sesuatu keterangan, mereka berkata: \"Kami tidak akan beriman sehingga kami juga diberi (wahyu) sama seperti yang telah diberikan kepada pesuruh-pesuruh Allah\". Allah lebih mengetahui di mana (dan kepada siapakah yang sepatutnya) Ia berikan jawatan Rasul (dan wahyu) yang diberikanNya itu. Orang-orang yang melakukan perbuatan yang salah itu akan ditimpa kehinaan di sisi Allah, dan azab seksa yang amat berat, disebabkan perbuatan tipu daya yang mereka lakukan.",
      "id": "Apabila datang sesuatu ayat kepada mereka, mereka berkata: \"Kami tidak akan beriman sehingga diberikan kepada kami yang serupa dengan apa yang telah diberikan kepada utusan-utusan Allah\". Allah lebih mengetahui di mana Dia menempatkan tugas kerasulan. Orang-orang yang berdosa, nanti akan ditimpa kehinaan di sisi Allah dan siksa yang keras disebabkan mereka selalu membuat tipu daya.",
      "ar": "وَإِذَا جَاۤءَتۡهُمۡ ءَایَةࣱ قَالُوا۟ لَن نُّؤۡمِنَ حَتَّىٰ نُؤۡتَىٰ مِثۡلَ مَاۤ أُوتِیَ رُسُلُ ٱللَّهِۘ ٱللَّهُ أَعۡلَمُ حَیۡثُ یَجۡعَلُ رِسَالَتَهُۥۗ سَیُصِیبُ ٱلَّذِینَ أَجۡرَمُوا۟ صَغَارٌ عِندَ ٱللَّهِ وَعَذَابࣱ شَدِیدُۢ بِمَا كَانُوا۟ یَمۡكُرُونَ\n"
    }
  },
  {
    "id": 914,
    "surahId": 6,
    "ayahNumber": 125,
    "arabicText": "فَمَن یُرِدِ ٱللَّهُ أَن یَهۡدِیَهُۥ یَشۡرَحۡ صَدۡرَهُۥ لِلۡإِسۡلَـٰمِۖ وَمَن یُرِدۡ أَن یُضِلَّهُۥ یَجۡعَلۡ صَدۡرَهُۥ ضَیِّقًا حَرَجࣰا كَأَنَّمَا یَصَّعَّدُ فِی ٱلسَّمَاۤءِۚ كَذَ ٰ⁠لِكَ یَجۡعَلُ ٱللَّهُ ٱلرِّجۡسَ عَلَى ٱلَّذِینَ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "And whomsoever God wills to guide, his bosom He opens wide with willingness towards self-surrender [unto Him]; and whomsoever He wills to let go astray, his bosom He causes to be tight and constricted, as if he were climbing unto the skies: it is thus that God inflicts horror upon those who will not believe.",
      "ms": "Maka sesiapa yang Allah kehendaki untuk memberi hidayah petunjuk kepadanya nescaya Ia melapangkan dadanya (membuka hatinya) untuk menerima Islam; dan sesiapa yang Allah kehendaki untuk menyesatkannya, nescaya Ia menjadikan dadanya sesak sempit sesempit-sempitnya, seolah-olah ia sedang mendaki naik ke langit (dengan susah payahnya). Demikianlah Allah menimpakan azab kepada orang-orang yang tidak beriman.",
      "id": "Barangsiapa yang Allah menghendaki akan memberikan kepadanya petunjuk, niscaya Dia melapangkan dadanya untuk (memeluk agama) Islam. Dan barangsiapa yang dikehendaki Allah kesesatannya, niscaya Allah menjadikan dadanya sesak lagi sempit, seolah-olah ia sedang mendaki langit. Begitulah Allah menimpakan siksa kepada orang-orang yang tidak beriman.",
      "ar": "فَمَن یُرِدِ ٱللَّهُ أَن یَهۡدِیَهُۥ یَشۡرَحۡ صَدۡرَهُۥ لِلۡإِسۡلَـٰمِۖ وَمَن یُرِدۡ أَن یُضِلَّهُۥ یَجۡعَلۡ صَدۡرَهُۥ ضَیِّقًا حَرَجࣰا كَأَنَّمَا یَصَّعَّدُ فِی ٱلسَّمَاۤءِۚ كَذَ ٰ⁠لِكَ یَجۡعَلُ ٱللَّهُ ٱلرِّجۡسَ عَلَى ٱلَّذِینَ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 915,
    "surahId": 6,
    "ayahNumber": 126,
    "arabicText": "وَهَـٰذَا صِرَ ٰ⁠طُ رَبِّكَ مُسۡتَقِیمࣰاۗ قَدۡ فَصَّلۡنَا ٱلۡـَٔایَـٰتِ لِقَوۡمࣲ یَذَّكَّرُونَ\n",
    "translations": {
      "en": "And undeviating is this thy Sustainer's way. Clearly, indeed, have We spelled out these messages unto people who [are willing to] take them to heart!",
      "ms": "Dan inilah jalan Tuhanmu (ugama Islam) yang betul lurus. Sesungguhnya Kami telah menjelaskan ayat-ayat keterangan (Kami) satu persatu, bagi kaum yang mahu beringat - insaf.",
      "id": "Dan inilah jalan Tuhanmu; (jalan) yang lurus. Sesungguhnya Kami telah menjelaskan ayat-ayat (Kami) kepada orang-orang yang mengambil pelajaran.",
      "ar": "وَهَـٰذَا صِرَ ٰ⁠طُ رَبِّكَ مُسۡتَقِیمࣰاۗ قَدۡ فَصَّلۡنَا ٱلۡـَٔایَـٰتِ لِقَوۡمࣲ یَذَّكَّرُونَ\n"
    }
  },
  {
    "id": 916,
    "surahId": 6,
    "ayahNumber": 127,
    "arabicText": "۞ لَهُمۡ دَارُ ٱلسَّلَـٰمِ عِندَ رَبِّهِمۡۖ وَهُوَ وَلِیُّهُم بِمَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "Theirs shall be an abode of peace with their Sustainer; and He shall be near unto them in result of what they have been doing.",
      "ms": "Bagi merekalah Syurga Darus-Salaam (tempat tinggal yang aman sejahtera) di sisi Tuhan mereka, dan Dia lah Penolong mereka, disebabkan amal-amal (yang baik) yang mereka telah kerjakan.",
      "id": "Bagi mereka (disediakan) darussalam (surga) pada sisi Tuhannya dan Dialah Pelindung mereka disebabkan amal-amal saleh yang selalu mereka kerjakan.",
      "ar": "۞ لَهُمۡ دَارُ ٱلسَّلَـٰمِ عِندَ رَبِّهِمۡۖ وَهُوَ وَلِیُّهُم بِمَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 917,
    "surahId": 6,
    "ayahNumber": 128,
    "arabicText": "وَیَوۡمَ یَحۡشُرُهُمۡ جَمِیعࣰا یَـٰمَعۡشَرَ ٱلۡجِنِّ قَدِ ٱسۡتَكۡثَرۡتُم مِّنَ ٱلۡإِنسِۖ وَقَالَ أَوۡلِیَاۤؤُهُم مِّنَ ٱلۡإِنسِ رَبَّنَا ٱسۡتَمۡتَعَ بَعۡضُنَا بِبَعۡضࣲ وَبَلَغۡنَاۤ أَجَلَنَا ٱلَّذِیۤ أَجَّلۡتَ لَنَاۚ قَالَ ٱلنَّارُ مَثۡوَىٰكُمۡ خَـٰلِدِینَ فِیهَاۤ إِلَّا مَا شَاۤءَ ٱللَّهُۗ إِنَّ رَبَّكَ حَكِیمٌ عَلِیمࣱ\n",
    "translations": {
      "en": "AND ON THE DAY when He shall gather them [all] together, [He will say:] \"O you who have lived in close communion with [evil] invisible beings! A great many [other] human beings have you ensnared! And those of the humans who were close to them will say: \"O our Sustainer! We did enjoy one another's fellowship [in life]; but (now that] we have reached the end of our term-the term which Thou hast laid down for us - (we see the error of our ways]!\" [But] He will say: \"The fire shall be your abode, therein to abide-unless God wills it otherwise.\" Verily, thy Sustainer is wise, all-knowing.",
      "ms": "Dan (ingatlah) hari (kiamat yang padanya) Allah akan himpunkan mereka semua, (lalu berfirman): \"Wahai sekalian jin (Syaitan-syaitan)! Sesungguhnya kamu telah banyak pengikut-pengikut dari manusia\". Dan berkatalah pula pengikut-pengikut mereka dari golongan manusia: \"Wahai Tuhan kami, sebahagian kami (manusia) telah bersenang-senang (mendapat kemudahan) dengan sebahagian yang lain (Syaitan-syaitan), dan kami telah sampailah kepada masa kami (hari kiamat) yang Engkau telah tentukan bagi kami\". (Allah berfirman): \"Nerakalah tempat kediaman kamu, kekal kamu di dalamnya, kecuali apa yang dikehendaki Allah\". Sesungguhnya Tuhanmu (wahai Muhammad) Maha Bijaksana, lagi Maha Mengetahui.",
      "id": "Dan (ingatlah) hari diwaktu Allah menghimpunkan mereka semuanya (dan Allah berfirman): \"Hai golongan jin, sesungguhnya kamu telah banyak menyesatkan manusia\", lalu berkatalah kawan-kawan meraka dari golongan manusia: \"Ya Tuhan kami, sesungguhnya sebahagian daripada kami telah dapat kesenangan dari sebahagian (yang lain) dan kami telah sampai kepada waktu yang telah Engkau tentukan bagi kami\". Allah berfirman: \"Neraka itulah tempat diam kamu, sedang kamu kekal di dalamnya, kecuali kalau Allah menghendaki (yang lain)\". Sesungguhnya Tuhanmu Maha Bijaksana lagi Maha Mengetahui.",
      "ar": "وَیَوۡمَ یَحۡشُرُهُمۡ جَمِیعࣰا یَـٰمَعۡشَرَ ٱلۡجِنِّ قَدِ ٱسۡتَكۡثَرۡتُم مِّنَ ٱلۡإِنسِۖ وَقَالَ أَوۡلِیَاۤؤُهُم مِّنَ ٱلۡإِنسِ رَبَّنَا ٱسۡتَمۡتَعَ بَعۡضُنَا بِبَعۡضࣲ وَبَلَغۡنَاۤ أَجَلَنَا ٱلَّذِیۤ أَجَّلۡتَ لَنَاۚ قَالَ ٱلنَّارُ مَثۡوَىٰكُمۡ خَـٰلِدِینَ فِیهَاۤ إِلَّا مَا شَاۤءَ ٱللَّهُۗ إِنَّ رَبَّكَ حَكِیمٌ عَلِیمࣱ\n"
    }
  },
  {
    "id": 918,
    "surahId": 6,
    "ayahNumber": 129,
    "arabicText": "وَكَذَ ٰ⁠لِكَ نُوَلِّی بَعۡضَ ٱلظَّـٰلِمِینَ بَعۡضَۢا بِمَا كَانُوا۟ یَكۡسِبُونَ\n",
    "translations": {
      "en": "And in this manner do We cause evildoers to seduce one another by means of their (evil] doings.",
      "ms": "Dan demikianlah Kami jadikan sebahagian dari orang-orang yang zalim itu kawan rapat dengan sebahagian yang lain, disebabkan apa yang mereka telah usahakan (dari perbuatan-perbuatan kufur dan maksiat itu).",
      "id": "Dan demikianlah Kami jadikan sebahagian orang-orang yang zalim itu menjadi teman bagi sebahagian yang lain disebabkan apa yang mereka usahakan.",
      "ar": "وَكَذَ ٰ⁠لِكَ نُوَلِّی بَعۡضَ ٱلظَّـٰلِمِینَ بَعۡضَۢا بِمَا كَانُوا۟ یَكۡسِبُونَ\n"
    }
  },
  {
    "id": 919,
    "surahId": 6,
    "ayahNumber": 130,
    "arabicText": "یَـٰمَعۡشَرَ ٱلۡجِنِّ وَٱلۡإِنسِ أَلَمۡ یَأۡتِكُمۡ رُسُلࣱ مِّنكُمۡ یَقُصُّونَ عَلَیۡكُمۡ ءَایَـٰتِی وَیُنذِرُونَكُمۡ لِقَاۤءَ یَوۡمِكُمۡ هَـٰذَاۚ قَالُوا۟ شَهِدۡنَا عَلَىٰۤ أَنفُسِنَاۖ وَغَرَّتۡهُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَا وَشَهِدُوا۟ عَلَىٰۤ أَنفُسِهِمۡ أَنَّهُمۡ كَانُوا۟ كَـٰفِرِینَ\n",
    "translations": {
      "en": "[And thus will God continue:] \"O you who have lived in close communion with [evil] invisible beings and [like-minded] humans! Have there not come unto you apostles from among yourselves, who conveyed unto you My messages and warned you of the coming of this your Day [of Judgment]?\" They will answer: \"We do bear witness against ourselves!\"-for the life of this world had beguiled them: and so they will bear witness against themselves that they had been denying the truth.",
      "ms": "Wahai sekalian jin dan manusia! Bukankah telah datang kepada kamu Rasul-rasul dari kalangan kamu sendiri, yang menyampaikan kepada kamu ayat-ayatKu (perintah-perintahKu), dan yang memberikan amaran kepada kamu tentang pertemuan kamu dengan hari (kiamat) ini? Mereka menjawab: \"Kami menjadi saksi mengakui akan (kesalahan) diri kami sendiri (mendustakan Rasul-rasul itu)\". Dan (sebabnya ialah) mereka telah diperdayakan oleh (kemewahan) hidup di dunia dan (kerana itulah) mereka menjadi saksi (pada hari akhirat) terhadap diri mereka sendiri: (bahawa) sesungguhnya mereka adalah orang-orang yang mengingkari (apa yang telah disampaikan oleh Rasul-rasul itu).",
      "id": "Hai golongan jin dan manusia, apakah belum datang kepadamu rasul-rasul dari golongan kamu sendiri, yang menyampaikan kepadamu ayat-ayat-Ku dan memberi peringatan kepadamu terhadap pertemuanmu dengan hari ini? Mereka berkata: \"Kami menjadi saksi atas diri kami sendiri\", kehidupan dunia telah menipu mereka, dan mereka menjadi saksi atas diri mereka sendiri, bahwa mereka adalah orang-orang yang kafir.",
      "ar": "یَـٰمَعۡشَرَ ٱلۡجِنِّ وَٱلۡإِنسِ أَلَمۡ یَأۡتِكُمۡ رُسُلࣱ مِّنكُمۡ یَقُصُّونَ عَلَیۡكُمۡ ءَایَـٰتِی وَیُنذِرُونَكُمۡ لِقَاۤءَ یَوۡمِكُمۡ هَـٰذَاۚ قَالُوا۟ شَهِدۡنَا عَلَىٰۤ أَنفُسِنَاۖ وَغَرَّتۡهُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَا وَشَهِدُوا۟ عَلَىٰۤ أَنفُسِهِمۡ أَنَّهُمۡ كَانُوا۟ كَـٰفِرِینَ\n"
    }
  },
  {
    "id": 920,
    "surahId": 6,
    "ayahNumber": 131,
    "arabicText": "ذَ ٰ⁠لِكَ أَن لَّمۡ یَكُن رَّبُّكَ مُهۡلِكَ ٱلۡقُرَىٰ بِظُلۡمࣲ وَأَهۡلُهَا غَـٰفِلُونَ\n",
    "translations": {
      "en": "And so it is that thy Sustainer would never destroy a community for its wrongdoing so long as its people are still unaware [of the meaning of right and wrong]:",
      "ms": "Yang demikian (kedatangan Rasul-rasul itu ialah), kerana Tuhanmu tidak membinasakan negeri-negeri secara zalim sedang penduduknya leka lalai.",
      "id": "Yang demikian itu adalah karena Tuhanmu tidaklah membinasakan kota-kota secara aniaya, sedang penduduknya dalam keadaan lengah.",
      "ar": "ذَ ٰ⁠لِكَ أَن لَّمۡ یَكُن رَّبُّكَ مُهۡلِكَ ٱلۡقُرَىٰ بِظُلۡمࣲ وَأَهۡلُهَا غَـٰفِلُونَ\n"
    }
  },
  {
    "id": 921,
    "surahId": 6,
    "ayahNumber": 132,
    "arabicText": "وَلِكُلࣲّ دَرَجَـٰتࣱ مِّمَّا عَمِلُوا۟ۚ وَمَا رَبُّكَ بِغَـٰفِلٍ عَمَّا یَعۡمَلُونَ\n",
    "translations": {
      "en": "for all shall be judged according to their [conscious] deeds - and thy Sustainer is not unaware of what they do.",
      "ms": "Dan bagi tiap-tiap seorang (dari manusia atau jin), beberapa darjat (tingkatan balasan) disebabkan (amal baik atau jahat) yang mereka telah kerjakan; dan (ingatlah) Tuhanmu tiadalah lalai dari apa yang mereka lakukan.",
      "id": "Dan masing-masing orang memperoleh derajat-derajat (seimbang) dengan apa yang dikerjakannya. Dan Tuhanmu tidak lengah dari apa yang mereka kerjakan.",
      "ar": "وَلِكُلࣲّ دَرَجَـٰتࣱ مِّمَّا عَمِلُوا۟ۚ وَمَا رَبُّكَ بِغَـٰفِلٍ عَمَّا یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 922,
    "surahId": 6,
    "ayahNumber": 133,
    "arabicText": "وَرَبُّكَ ٱلۡغَنِیُّ ذُو ٱلرَّحۡمَةِۚ إِن یَشَأۡ یُذۡهِبۡكُمۡ وَیَسۡتَخۡلِفۡ مِنۢ بَعۡدِكُم مَّا یَشَاۤءُ كَمَاۤ أَنشَأَكُم مِّن ذُرِّیَّةِ قَوۡمٍ ءَاخَرِینَ\n",
    "translations": {
      "en": "And thy Sustainer alone is self-sufficient, limitless in His grace. If He so wills, He may put an end to you and thereafter cause whom He wills to succeed you - even as He has brought you into being out of other people's seed.",
      "ms": "Dan Tuhanmu Maha Kaya, lagi Melimpah-limpah rahmatNya. Jika Ia kehendaki, nescaya Ia binasakan kamu dan menggantikan sesudah (binasanya) kamu dengan sesiapa yang dikehendakiNya, sebagaimana Ia telah menjadikan kamu dari keturunan kaum yang lain.",
      "id": "Dan Tuhanmu Maha Kaya lagi mempunyai rahmat. Jika Dia menghendaki niscaya Dia memusnahkan kamu dan menggantimu dengan siapa yang dikehendaki-Nya setelah kamu (musnah), sebagaimana Dia telah menjadikan kamu dari keturunan orang-orang lain.",
      "ar": "وَرَبُّكَ ٱلۡغَنِیُّ ذُو ٱلرَّحۡمَةِۚ إِن یَشَأۡ یُذۡهِبۡكُمۡ وَیَسۡتَخۡلِفۡ مِنۢ بَعۡدِكُم مَّا یَشَاۤءُ كَمَاۤ أَنشَأَكُم مِّن ذُرِّیَّةِ قَوۡمٍ ءَاخَرِینَ\n"
    }
  },
  {
    "id": 923,
    "surahId": 6,
    "ayahNumber": 134,
    "arabicText": "إِنَّ مَا تُوعَدُونَ لَـَٔاتࣲۖ وَمَاۤ أَنتُم بِمُعۡجِزِینَ\n",
    "translations": {
      "en": "Verily, that [reckoning] which you are promised is bound to come, and you cannot elude it!",
      "ms": "Sesungguhnya apa yang dijanjikan kepada kamu (hari kiamat dan balasannya) tetap akan datang, dan kamu tidak akan dapat melepaskan diri (dari balasan itu).",
      "id": "Sesungguhnya apa yang dijanjikan kepadamu pasti datang, dan kamu sekali-kali tidak sanggup menolaknya.",
      "ar": "إِنَّ مَا تُوعَدُونَ لَـَٔاتࣲۖ وَمَاۤ أَنتُم بِمُعۡجِزِینَ\n"
    }
  },
  {
    "id": 924,
    "surahId": 6,
    "ayahNumber": 135,
    "arabicText": "قُلۡ یَـٰقَوۡمِ ٱعۡمَلُوا۟ عَلَىٰ مَكَانَتِكُمۡ إِنِّی عَامِلࣱۖ فَسَوۡفَ تَعۡلَمُونَ مَن تَكُونُ لَهُۥ عَـٰقِبَةُ ٱلدَّارِۚ إِنَّهُۥ لَا یُفۡلِحُ ٱلظَّـٰلِمُونَ\n",
    "translations": {
      "en": "Say: \"O my [unbelieving] people! Do yet all that may be within your power, [while] I, behold, shall labour [in God's way]; and in time you will come to know to whom the future belongs. Verily, never will evildoers attain to a happy state!\"",
      "ms": "Katakanlah (wahai Muhammad): \"Wahai kaumku (yang masih kafir), buatlah sedaya upaya kamu (untuk menentang Islam), sesungguhnya aku juga tetap beramal (berusaha dengan bersungguh-sungguh untuk mempertahankan Islam); kemudian kamu akan ketahui siapakah yang akan beroleh kebaikan dan kejayaan di dunia ini. Sesungguhnya orang-orang yang zalim itu tidak akan berjaya.",
      "id": "Katakanlah: \"Hai kaumku, berbuatlah sepenuh kemampuanmu, sesungguhnya akupun berbuat (pula). Kelak kamu akan mengetahui, siapakah (di antara kita) yang akan memperoleh hasil yang baik di dunia ini. Sesungguhnya orang-orang yang zalim itu tidak akan mendapatkan keberuntungan.",
      "ar": "قُلۡ یَـٰقَوۡمِ ٱعۡمَلُوا۟ عَلَىٰ مَكَانَتِكُمۡ إِنِّی عَامِلࣱۖ فَسَوۡفَ تَعۡلَمُونَ مَن تَكُونُ لَهُۥ عَـٰقِبَةُ ٱلدَّارِۚ إِنَّهُۥ لَا یُفۡلِحُ ٱلظَّـٰلِمُونَ\n"
    }
  },
  {
    "id": 925,
    "surahId": 6,
    "ayahNumber": 136,
    "arabicText": "وَجَعَلُوا۟ لِلَّهِ مِمَّا ذَرَأَ مِنَ ٱلۡحَرۡثِ وَٱلۡأَنۡعَـٰمِ نَصِیبࣰا فَقَالُوا۟ هَـٰذَا لِلَّهِ بِزَعۡمِهِمۡ وَهَـٰذَا لِشُرَكَاۤىِٕنَاۖ فَمَا كَانَ لِشُرَكَاۤىِٕهِمۡ فَلَا یَصِلُ إِلَى ٱللَّهِۖ وَمَا كَانَ لِلَّهِ فَهُوَ یَصِلُ إِلَىٰ شُرَكَاۤىِٕهِمۡۗ سَاۤءَ مَا یَحۡكُمُونَ\n",
    "translations": {
      "en": "AND OUT OF whatever He has created of the fruits of the field and the cattle, they assign unto God a portion, saying, \"This belongs to God\"-or so they [falsely] claim - \"and this is for those beings who, we are convinced, have a share in God's divinity.\" But that which is assigned to the beings associated in their minds with God does not bring [them] closer to God - whereas that which is assigned to God brings [them but] closer to those beings to whom they ascribe a share in His divinity. Bad, indeed, is their judgment!",
      "ms": "Dan mereka (orang-orang musyrik) memperuntukkan dari hasil tanaman dan binatang-binatang ternak yang diciptakan oleh Allah itu, sebahagian bagi Allah (dan sebahagian lagi untuk berhala-berhala mereka), lalu mereka berkata: Ini untuk Allah - menurut anggapan mereka - dan ini untuk berhala-berhala kami.\" Kemudian apa yang telah ditentukan untuk berhala-berhala mereka, maka ia tidak sampai kepada Allah (kerana mereka tidak membelanjakannya pada jalan Allah), dan apa yang telah ditentukan untuk Allah, sampai pula kepada berhala-berhala mereka (kerana mereka membelanjakannya pada jalan itu). Amatlah jahatnya apa yang mereka hukumkan itu.",
      "id": "Dan mereka memperuntukkan bagi Allah satu bagian dari tanaman dan ternak yang telah diciptakan Allah, lalu mereka berkata sesuai dengan persangkaan mereka: \"Ini untuk Allah dan ini untuk berhala-berhala kami\". Maka saji-sajian yang diperuntukkan bagi berhala-berhala mereka tidak sampai kepada Allah; dan saji-sajian yang diperuntukkan bagi Allah, maka sajian itu sampai kepada berhala-berhala mereka. Amat buruklah ketetapan mereka itu.",
      "ar": "وَجَعَلُوا۟ لِلَّهِ مِمَّا ذَرَأَ مِنَ ٱلۡحَرۡثِ وَٱلۡأَنۡعَـٰمِ نَصِیبࣰا فَقَالُوا۟ هَـٰذَا لِلَّهِ بِزَعۡمِهِمۡ وَهَـٰذَا لِشُرَكَاۤىِٕنَاۖ فَمَا كَانَ لِشُرَكَاۤىِٕهِمۡ فَلَا یَصِلُ إِلَى ٱللَّهِۖ وَمَا كَانَ لِلَّهِ فَهُوَ یَصِلُ إِلَىٰ شُرَكَاۤىِٕهِمۡۗ سَاۤءَ مَا یَحۡكُمُونَ\n"
    }
  },
  {
    "id": 926,
    "surahId": 6,
    "ayahNumber": 137,
    "arabicText": "وَكَذَ ٰ⁠لِكَ زَیَّنَ لِكَثِیرࣲ مِّنَ ٱلۡمُشۡرِكِینَ قَتۡلَ أَوۡلَـٰدِهِمۡ شُرَكَاۤؤُهُمۡ لِیُرۡدُوهُمۡ وَلِیَلۡبِسُوا۟ عَلَیۡهِمۡ دِینَهُمۡۖ وَلَوۡ شَاۤءَ ٱللَّهُ مَا فَعَلُوهُۖ فَذَرۡهُمۡ وَمَا یَفۡتَرُونَ\n",
    "translations": {
      "en": "And, likewise, their belief in beings or powers that are supposed to have a share in God's divinity makes [even] the slaying of their children seem goodly to many of those who ascribe divinity to aught beside God, thus bringing them to ruin and confusing them in their faith. Yet, unless God had so willed, they would not be doing all this: stand, therefore, aloof from them and all their false imagery!",
      "ms": "Dan demikianlah juga (jahatnya) ketua-ketua yang orang-orang musyrik itu jadikan sekutu bagi Allah, menghasut kebanyakan dari mereka dengan kata-kata indah yang memperlihatkan eloknya perbuatan membunuh anak-anak mereka, untuk membinasakan mereka, dan untuk mengelirukan mereka nengenai ugama mereka. Dan kalau Allah kehendaki, nescaya mereka tidak melakukannya. Oleh itu biarkanlah mereka dan apa yang mereka ada-adakan itu.",
      "id": "Dan demikianlah pemimpin-pemimpin mereka telah menjadikan kebanyakan dari orang-orang musyrik itu memandang baik membunuh anak-anak mereka untuk membinasakan mereka dan untuk mengaburkan bagi mereka agama-Nya. Dan kalau Allah menghendaki, niscaya mereka tidak mengerjakannya, maka tinggallah mereka dan apa yang mereka ada-adakan.",
      "ar": "وَكَذَ ٰ⁠لِكَ زَیَّنَ لِكَثِیرࣲ مِّنَ ٱلۡمُشۡرِكِینَ قَتۡلَ أَوۡلَـٰدِهِمۡ شُرَكَاۤؤُهُمۡ لِیُرۡدُوهُمۡ وَلِیَلۡبِسُوا۟ عَلَیۡهِمۡ دِینَهُمۡۖ وَلَوۡ شَاۤءَ ٱللَّهُ مَا فَعَلُوهُۖ فَذَرۡهُمۡ وَمَا یَفۡتَرُونَ\n"
    }
  },
  {
    "id": 927,
    "surahId": 6,
    "ayahNumber": 138,
    "arabicText": "وَقَالُوا۟ هَـٰذِهِۦۤ أَنۡعَـٰمࣱ وَحَرۡثٌ حِجۡرࣱ لَّا یَطۡعَمُهَاۤ إِلَّا مَن نَّشَاۤءُ بِزَعۡمِهِمۡ وَأَنۡعَـٰمٌ حُرِّمَتۡ ظُهُورُهَا وَأَنۡعَـٰمࣱ لَّا یَذۡكُرُونَ ٱسۡمَ ٱللَّهِ عَلَیۡهَا ٱفۡتِرَاۤءً عَلَیۡهِۚ سَیَجۡزِیهِم بِمَا كَانُوا۟ یَفۡتَرُونَ\n",
    "translations": {
      "en": "And they say, \"Such-and-such cattle and fruits of the field are sacred; none may eat thereof save those whom we will [to do so]\" -so they [falsely] claim; and [they declare that] it is forbidden to burden the backs of certain kinds of cattle; and there are cattle over which they do not pronounce God's name - falsely attributing [the origin of these customs] to Him. [But] He will requite them for all their false imagery.",
      "ms": "Dan mereka berkata lagi: \"Ini adalah binatang-binatang ternak dan tanaman-tanaman yang dilarang, yang tidak boleh seorang pun memakannya kecuali sesiapa yang kami kehendaki\", - menurut anggapan mereka; dan (sejenis lagi) binatang-binatang ternak yang dilarang menunggangnya; dan (sejenis lagi) bintang-bintang ternak yang tidak mereka sebutkan nama Allah ketika menyembelihnya; (semuanya itu mereka lakukan dengan) berdusta terhadap Allah. Allah akan membalas mereka disebabkan apa yang mereka telah ada-adakan itu.",
      "id": "Dan mereka mengatakan: \"Inilah hewan ternak dan tanaman yang dilarang; tidak boleh memakannya, kecuali orang yang kami kehendaki\", menurut anggapan mereka, dan ada binatang ternak yang diharamkan menungganginya dan ada binatang ternak yang mereka tidak menyebut nama Allah waktu menyembelihnya, semata-mata membuat-buat kedustaan terhadap Allah. Kelak Allah akan membalas mereka terhadap apa yang selalu mereka ada-adakan.",
      "ar": "وَقَالُوا۟ هَـٰذِهِۦۤ أَنۡعَـٰمࣱ وَحَرۡثٌ حِجۡرࣱ لَّا یَطۡعَمُهَاۤ إِلَّا مَن نَّشَاۤءُ بِزَعۡمِهِمۡ وَأَنۡعَـٰمٌ حُرِّمَتۡ ظُهُورُهَا وَأَنۡعَـٰمࣱ لَّا یَذۡكُرُونَ ٱسۡمَ ٱللَّهِ عَلَیۡهَا ٱفۡتِرَاۤءً عَلَیۡهِۚ سَیَجۡزِیهِم بِمَا كَانُوا۟ یَفۡتَرُونَ\n"
    }
  },
  {
    "id": 928,
    "surahId": 6,
    "ayahNumber": 139,
    "arabicText": "وَقَالُوا۟ مَا فِی بُطُونِ هَـٰذِهِ ٱلۡأَنۡعَـٰمِ خَالِصَةࣱ لِّذُكُورِنَا وَمُحَرَّمٌ عَلَىٰۤ أَزۡوَ ٰ⁠جِنَاۖ وَإِن یَكُن مَّیۡتَةࣰ فَهُمۡ فِیهِ شُرَكَاۤءُۚ سَیَجۡزِیهِمۡ وَصۡفَهُمۡۚ إِنَّهُۥ حَكِیمٌ عَلِیمࣱ\n",
    "translations": {
      "en": "And they say, \"All that is in the wombs of such-and-such cattle is reserved for our males and forbidden to our women; but if it be stillborn, then both may have their share thereof.\" [God] will requite them for all that they [falsely] attribute [to Him]: behold, He is wise, all-knowing.",
      "ms": "Dan mereka berkata lagi: \"Apa yang ada dalam perut binatang-binatang ternak itu (jika ia lahirkan hidup) adalah halal bagi lelaki-lelaki kami dan haram bagi perempuan-perempuan kami\". Dan jika ia (dilahirkan) mati, maka mereka (lelaki perempuan) bersekutu padanya (bersama-sama memakannya). Allah akan membalas mereka tentang apa yang mereka tetapkan (mengenai halal dan haram) itu. Sesungguhnya Allah Maha Bijaksana, lagi Maha Mengetahui.",
      "id": "Dan mereka mengatakan: \"Apa yang ada dalam perut binatang ternak ini adalah khusus untuk pria kami dan diharamkan atas wanita kami,\" dan jika yang dalam perut itu dilahirkan mati, maka pria dan wanita sama-sama boleh memakannya. Kelak Allah akan membalas mereka terhadap ketetapan mereka. Sesungguhnya Allah Maha Bijaksana lagi Maha Mengetahui.",
      "ar": "وَقَالُوا۟ مَا فِی بُطُونِ هَـٰذِهِ ٱلۡأَنۡعَـٰمِ خَالِصَةࣱ لِّذُكُورِنَا وَمُحَرَّمٌ عَلَىٰۤ أَزۡوَ ٰ⁠جِنَاۖ وَإِن یَكُن مَّیۡتَةࣰ فَهُمۡ فِیهِ شُرَكَاۤءُۚ سَیَجۡزِیهِمۡ وَصۡفَهُمۡۚ إِنَّهُۥ حَكِیمٌ عَلِیمࣱ\n"
    }
  },
  {
    "id": 929,
    "surahId": 6,
    "ayahNumber": 140,
    "arabicText": "قَدۡ خَسِرَ ٱلَّذِینَ قَتَلُوۤا۟ أَوۡلَـٰدَهُمۡ سَفَهَۢا بِغَیۡرِ عِلۡمࣲ وَحَرَّمُوا۟ مَا رَزَقَهُمُ ٱللَّهُ ٱفۡتِرَاۤءً عَلَى ٱللَّهِۚ قَدۡ ضَلُّوا۟ وَمَا كَانُوا۟ مُهۡتَدِینَ\n",
    "translations": {
      "en": "Lost, indeed, are they who, in their weak-minded ignorance, slay their children and declare as forbidden that which God has provided for them as sustenance, falsely ascribing [such prohibitions] to God: they have gone astray and have not found the right path.",
      "ms": "Sesungguhnya rugilah orang-orang yang membunuh anak-anak mereka kerana kebodohan, lagi tidak berpengetahuan (sedang Allah yang memberi rezeki kepada sekalian makhluknya), dan juga (rugilah orang-orang yang) mengharamkan apa yang telah dikurniakan oleh Allah kepada mereka, dengan berdusta terhadap Allah. Sesungguhnya sesatlah mereka, dan tiadalah mereka mendapat petunjuk.",
      "id": "Sesungguhnya rugilah orang yang membunuh anak-anak mereka, karena kebodohan lagi tidak mengetahui dan mereka mengharamkan apa yang Allah telah rezeki-kan pada mereka dengan semata-mata mengada-adakan terhadap Allah. Sesungguhnya mereka telah sesat dan tidaklah mereka mendapat petunjuk.",
      "ar": "قَدۡ خَسِرَ ٱلَّذِینَ قَتَلُوۤا۟ أَوۡلَـٰدَهُمۡ سَفَهَۢا بِغَیۡرِ عِلۡمࣲ وَحَرَّمُوا۟ مَا رَزَقَهُمُ ٱللَّهُ ٱفۡتِرَاۤءً عَلَى ٱللَّهِۚ قَدۡ ضَلُّوا۟ وَمَا كَانُوا۟ مُهۡتَدِینَ\n"
    }
  },
  {
    "id": 930,
    "surahId": 6,
    "ayahNumber": 141,
    "arabicText": "۞ وَهُوَ ٱلَّذِیۤ أَنشَأَ جَنَّـٰتࣲ مَّعۡرُوشَـٰتࣲ وَغَیۡرَ مَعۡرُوشَـٰتࣲ وَٱلنَّخۡلَ وَٱلزَّرۡعَ مُخۡتَلِفًا أُكُلُهُۥ وَٱلزَّیۡتُونَ وَٱلرُّمَّانَ مُتَشَـٰبِهࣰا وَغَیۡرَ مُتَشَـٰبِهࣲۚ كُلُوا۟ مِن ثَمَرِهِۦۤ إِذَاۤ أَثۡمَرَ وَءَاتُوا۟ حَقَّهُۥ یَوۡمَ حَصَادِهِۦۖ وَلَا تُسۡرِفُوۤا۟ۚ إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡرِفِینَ\n",
    "translations": {
      "en": "For it is He who has brought into being gardens-[both] the cultivated ones and those growing wild -and the date-palm, and fields bearing multiform produce, and the olive tree, and the pomegranate: [all] resembling one another and yet so different! Eat of their fruit when it comes to fruition, and give [unto the poor] their due on harvest day. And do not waste [God's bounties]: verily, He does not love the wasteful!",
      "ms": "Dan Dia lah (Allah) yang menjadikan (untuk kamu) kebun-kebun yang menjalar tanamannya dan yang tidak menjalar; dan pohon-pohon tamar (kurma) dan tanaman-tanaman yang berlainan (bentuk, rupa dan) rasanya; dan buah zaiton dan delima, yang bersamaan (warnanya atau daunnya) dan tidak bersamaan (rasanya). Makanlah dari buahnya ketika ia berbuah, dan keluarkanlah haknya (zakatnya) pada hari memetik atau menuainya; dan janganlah kamu melampau (pada apa-apa jua yang kamu makan atau belanjakan); sesungguhnya Allah tidak suka kepada orang-orang yang melampau.",
      "id": "Dan Dialah yang menjadikan kebun-kebun yang berjunjung dan yang tidak berjunjung, pohon korma, tanam-tanaman yang bermacam-macam buahnya, zaitun dan delima yang serupa (bentuk dan warnanya) dan tidak sama (rasanya). Makanlah dari buahnya (yang bermacam-macam itu) bila dia berbuah, dan tunaikanlah haknya di hari memetik hasilnya (dengan disedekahkan kepada fakir miskin); dan janganlah kamu berlebih-lebihan. Sesungguhnya Allah tidak menyukai orang yang berlebih-lebihan.",
      "ar": "۞ وَهُوَ ٱلَّذِیۤ أَنشَأَ جَنَّـٰتࣲ مَّعۡرُوشَـٰتࣲ وَغَیۡرَ مَعۡرُوشَـٰتࣲ وَٱلنَّخۡلَ وَٱلزَّرۡعَ مُخۡتَلِفًا أُكُلُهُۥ وَٱلزَّیۡتُونَ وَٱلرُّمَّانَ مُتَشَـٰبِهࣰا وَغَیۡرَ مُتَشَـٰبِهࣲۚ كُلُوا۟ مِن ثَمَرِهِۦۤ إِذَاۤ أَثۡمَرَ وَءَاتُوا۟ حَقَّهُۥ یَوۡمَ حَصَادِهِۦۖ وَلَا تُسۡرِفُوۤا۟ۚ إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡرِفِینَ\n"
    }
  },
  {
    "id": 931,
    "surahId": 6,
    "ayahNumber": 142,
    "arabicText": "وَمِنَ ٱلۡأَنۡعَـٰمِ حَمُولَةࣰ وَفَرۡشࣰاۚ كُلُوا۟ مِمَّا رَزَقَكُمُ ٱللَّهُ وَلَا تَتَّبِعُوا۟ خُطُوَ ٰ⁠تِ ٱلشَّیۡطَـٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوࣱّ مُّبِینࣱ\n",
    "translations": {
      "en": "And of the cattle reared for work and for the sake of their flesh, eat whatever God has provided for you as sustenance, and follow not Satan's foot-steps: behold, he is your open foe!",
      "ms": "Dan di antara binatang-binatang ternak itu, ada yang dijadikan untuk pengangkutan, dan ada yang untuk disembelih. Makanlah dari apa yang telah dikurniakan oleh Allah kepada kamu, dan janganlah kamu menurut jejak langkah Syaitan; kerana sesungguhnya Syaitan itu musuh bagi kamu yang terang nyata.",
      "id": "Dan di antara hewan ternak itu ada yang dijadikan untuk pengangkutan dan ada yang untuk disembelih. Makanlah dari rezeki yang telah diberikan Allah kepadamu, dan janganlah kamu mengikuti langkah-langkah syaitan. Sesungguhnya syaitan itu musuh yang nyata bagimu.",
      "ar": "وَمِنَ ٱلۡأَنۡعَـٰمِ حَمُولَةࣰ وَفَرۡشࣰاۚ كُلُوا۟ مِمَّا رَزَقَكُمُ ٱللَّهُ وَلَا تَتَّبِعُوا۟ خُطُوَ ٰ⁠تِ ٱلشَّیۡطَـٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوࣱّ مُّبِینࣱ\n"
    }
  },
  {
    "id": 932,
    "surahId": 6,
    "ayahNumber": 143,
    "arabicText": "ثَمَـٰنِیَةَ أَزۡوَ ٰ⁠جࣲۖ مِّنَ ٱلضَّأۡنِ ٱثۡنَیۡنِ وَمِنَ ٱلۡمَعۡزِ ٱثۡنَیۡنِۗ قُلۡ ءَاۤلذَّكَرَیۡنِ حَرَّمَ أَمِ ٱلۡأُنثَیَیۡنِ أَمَّا ٱشۡتَمَلَتۡ عَلَیۡهِ أَرۡحَامُ ٱلۡأُنثَیَیۡنِۖ نَبِّـُٔونِی بِعِلۡمٍ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "[His followers would have it that, in certain cases, any of these] four kinds of cattle of either sex [is unlawful to man]: either of the two sexes of sheep and of goats. Ask [them]: \"Is it the two males that He has forbidden, or the two females, or that which the wombs of the two females may contain? Tell me what you know in this respect, if what you say is true.\"",
      "ms": "(Binatang ternak itu) delapan ekor - (empat) pasangan; dari kambing biri-biri dua ekor (sepasang jantan betina), dan dari kambing biasa dua ekor (sepasang jantan betina). Tanyalah (wahai Muhammad kepada orang-orang musyrik itu): \"Adakah yang diharamkan Allah itu, dua jantannya atau dua betinanya, atau yang dikandung oleh rahim dua betinanya? Terangkanlah kepadaku dengan berdasarkan ilmu pengetahuan (Syarak dari Allah yang menjadi dalil tentang haramnya), jika betul kamu orang-orang yang benar\".",
      "id": "(yaitu) delapan binatang yang berpasangan, sepasang domba, sepasang dari kambing. Katakanlah: \"Apakah dua yang jantan yang diharamkan Allah ataukah dua yang betina, ataukah yang ada dalam kandungan dua betinanya?\" Terangkanlah kepadaku dengan berdasar pengetahuan jika kamu memang orang-orang yang benar,",
      "ar": "ثَمَـٰنِیَةَ أَزۡوَ ٰ⁠جࣲۖ مِّنَ ٱلضَّأۡنِ ٱثۡنَیۡنِ وَمِنَ ٱلۡمَعۡزِ ٱثۡنَیۡنِۗ قُلۡ ءَاۤلذَّكَرَیۡنِ حَرَّمَ أَمِ ٱلۡأُنثَیَیۡنِ أَمَّا ٱشۡتَمَلَتۡ عَلَیۡهِ أَرۡحَامُ ٱلۡأُنثَیَیۡنِۖ نَبِّـُٔونِی بِعِلۡمٍ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 933,
    "surahId": 6,
    "ayahNumber": 144,
    "arabicText": "وَمِنَ ٱلۡإِبِلِ ٱثۡنَیۡنِ وَمِنَ ٱلۡبَقَرِ ٱثۡنَیۡنِۗ قُلۡ ءَاۤلذَّكَرَیۡنِ حَرَّمَ أَمِ ٱلۡأُنثَیَیۡنِ أَمَّا ٱشۡتَمَلَتۡ عَلَیۡهِ أَرۡحَامُ ٱلۡأُنثَیَیۡنِۖ أَمۡ كُنتُمۡ شُهَدَاۤءَ إِذۡ وَصَّىٰكُمُ ٱللَّهُ بِهَـٰذَاۚ فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبࣰا لِّیُضِلَّ ٱلنَّاسَ بِغَیۡرِ عِلۡمٍۚ إِنَّ ٱللَّهَ لَا یَهۡدِی ٱلۡقَوۡمَ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "And [likewise they declare as unlawful] either of the two sexes of camels and of bovine cattle. Ask [them]: \"Is it the two males that He has forbidden, or the two females, or that which the wombs of the two females may contain? Is it, perchance, that you [yourselves] were witnesses when God enjoined [all] this upon you?\" And who could be more wicked than he who, without any [real] knowledge, attributes his own lying inventions to God, and thus leads people astray'? Behold, God does not grace [such] evildoing folk with His guidance.",
      "ms": "Dan dari unta dua ekor (sepasang jantan betina), dan dari lembu dua ekor (sepasang jantan betina). Tanyalah (wahai Muhammad): \"Adakah yang diharamkan Allah itu dua jantannya atau dua betinanya, atau yang dikandung oleh rahim dua betinanya? Ataupun kamu ada menyaksikan ketika Allah menyuruh serta menentukan kepada kamu (atau kepada datuk nenek kamu) dengan yang demikian ini?\" Oleh itu, siapakah yang lebih zalim daripada orang yang berdusta terhadap Allah untuk menyesatkan manusia dengan tidak berdasarkan ilmu pengetahuan? Sesungguhnya Allah tidak memberi petunjuk kepada kaum yang zalim.",
      "id": "dan sepasang dari unta dan sepasang dari lembu. Katakanlah: \"Apakah dua yang jantan yang diharamkan ataukah dua yang betina, ataukah yang ada dalam kandungan dua betinanya? Apakah kamu menyaksikan di waktu Allah menetapkan ini bagimu? Maka siapakah yang lebih zalim daripada orang-orang yang membuat-buat dusta terhadap Allah untuk menyesatkan manusia tanpa pengetahuan?\" Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zalim.",
      "ar": "وَمِنَ ٱلۡإِبِلِ ٱثۡنَیۡنِ وَمِنَ ٱلۡبَقَرِ ٱثۡنَیۡنِۗ قُلۡ ءَاۤلذَّكَرَیۡنِ حَرَّمَ أَمِ ٱلۡأُنثَیَیۡنِ أَمَّا ٱشۡتَمَلَتۡ عَلَیۡهِ أَرۡحَامُ ٱلۡأُنثَیَیۡنِۖ أَمۡ كُنتُمۡ شُهَدَاۤءَ إِذۡ وَصَّىٰكُمُ ٱللَّهُ بِهَـٰذَاۚ فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبࣰا لِّیُضِلَّ ٱلنَّاسَ بِغَیۡرِ عِلۡمٍۚ إِنَّ ٱللَّهَ لَا یَهۡدِی ٱلۡقَوۡمَ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 934,
    "surahId": 6,
    "ayahNumber": 145,
    "arabicText": "قُل لَّاۤ أَجِدُ فِی مَاۤ أُوحِیَ إِلَیَّ مُحَرَّمًا عَلَىٰ طَاعِمࣲ یَطۡعَمُهُۥۤ إِلَّاۤ أَن یَكُونَ مَیۡتَةً أَوۡ دَمࣰا مَّسۡفُوحًا أَوۡ لَحۡمَ خِنزِیرࣲ فَإِنَّهُۥ رِجۡسٌ أَوۡ فِسۡقًا أُهِلَّ لِغَیۡرِ ٱللَّهِ بِهِۦۚ فَمَنِ ٱضۡطُرَّ غَیۡرَ بَاغࣲ وَلَا عَادࣲ فَإِنَّ رَبَّكَ غَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "Say [O Prophet]: \"In all that has been revealed unto me, I do not find anything forbidden to eat, if one wants to eat thereof, unless it be carrion, or blood poured forth, or the flesh of swine-for that, behold, is loathsome-or a sinful offering over which any name other than God's has been invoked. But if one is driven by necessity - neither coveting it nor exceeding his immediate need -then [know that], behold, thy Sustainer is much-forgiving, a dispenser of grace.\"",
      "ms": "Katakanlah (wahai Muhammad): \"Aku tidak dapati dalam apa yang telah diwahyukan kepadaku, sesuatu yang diharamkan bagi orang yang hendak memakannya melainkan kalau benda itu bangkai, atau darah yang mengalir, atau daging babi - kerana sesungguhnya ia adalah kotor - atau sesuatu yang dilakukan secara fasik, iaitu binatang yang disembelih atas nama yang lain dari Allah\". Kemudian sesiapa yang terpaksa (memakannya kerana darurat) sedang ia tidak mengingininya dan tidak melampaui batas, maka sesungguhnya Tuhan mu Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Katakanlah: \"Tiadalah aku peroleh dalam wahyu yang diwahyukan kepadaku, sesuatu yang diharamkan bagi orang yang hendak memakannya, kecuali kalau makanan itu bangkai, atau darah yang mengalir atau daging babi -- karena sesungguhnya semua itu kotor -- atau binatang yang disembelih atas nama selain Allah. Barangsiapa yang dalam keadaan terpaksa, sedang dia tidak menginginkannya dan tidak (pula) melampaui batas, maka sesungguhnya Tuhanmu Maha Pengampun lagi Maha Penyayang\".",
      "ar": "قُل لَّاۤ أَجِدُ فِی مَاۤ أُوحِیَ إِلَیَّ مُحَرَّمًا عَلَىٰ طَاعِمࣲ یَطۡعَمُهُۥۤ إِلَّاۤ أَن یَكُونَ مَیۡتَةً أَوۡ دَمࣰا مَّسۡفُوحًا أَوۡ لَحۡمَ خِنزِیرࣲ فَإِنَّهُۥ رِجۡسٌ أَوۡ فِسۡقًا أُهِلَّ لِغَیۡرِ ٱللَّهِ بِهِۦۚ فَمَنِ ٱضۡطُرَّ غَیۡرَ بَاغࣲ وَلَا عَادࣲ فَإِنَّ رَبَّكَ غَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 935,
    "surahId": 6,
    "ayahNumber": 146,
    "arabicText": "وَعَلَى ٱلَّذِینَ هَادُوا۟ حَرَّمۡنَا كُلَّ ذِی ظُفُرࣲۖ وَمِنَ ٱلۡبَقَرِ وَٱلۡغَنَمِ حَرَّمۡنَا عَلَیۡهِمۡ شُحُومَهُمَاۤ إِلَّا مَا حَمَلَتۡ ظُهُورُهُمَاۤ أَوِ ٱلۡحَوَایَاۤ أَوۡ مَا ٱخۡتَلَطَ بِعَظۡمࣲۚ ذَ ٰ⁠لِكَ جَزَیۡنَـٰهُم بِبَغۡیِهِمۡۖ وَإِنَّا لَصَـٰدِقُونَ\n",
    "translations": {
      "en": "And [only] unto those who followed the Jewish faith did We forbid all beasts that have claws; and We forbade unto them the fat of both oxen and sheep, excepting that which is in their backs or entrails or that which is within the bone: thus did We requite them for their evildoing-for, behold, We are true to Our word!\"",
      "ms": "Dan Kami haramkan atas orang-orang Yahudi segala binatang yang berkuku, dan dari lembu dan kambing pula Kami haramkan kepada mereka lemaknya, kecuali (lemak) yang ada pada belakangnya atau yang menyelaputi perkakas dalam perutnya, atau yang bercampur dengan tulang. Demikianlah Kami balas mereka dengan sebab kederhakaan mereka; dan sesungguhnya Kamilah yang benar.",
      "id": "Dan kepada orang-orang Yahudi, Kami haramkan segala binatang yang berkuku dan dari sapi dan domba, Kami haramkan atas mereka lemak dari kedua binatang itu, selain lemak yang melekat di punggung keduanya atau yang di perut besar dan usus atau yang bercampur dengan tulang. Demikianlah Kami hukum mereka disebabkan kedurhakaan mereka; dan sesungguhnya Kami adalah Maha Benar.",
      "ar": "وَعَلَى ٱلَّذِینَ هَادُوا۟ حَرَّمۡنَا كُلَّ ذِی ظُفُرࣲۖ وَمِنَ ٱلۡبَقَرِ وَٱلۡغَنَمِ حَرَّمۡنَا عَلَیۡهِمۡ شُحُومَهُمَاۤ إِلَّا مَا حَمَلَتۡ ظُهُورُهُمَاۤ أَوِ ٱلۡحَوَایَاۤ أَوۡ مَا ٱخۡتَلَطَ بِعَظۡمࣲۚ ذَ ٰ⁠لِكَ جَزَیۡنَـٰهُم بِبَغۡیِهِمۡۖ وَإِنَّا لَصَـٰدِقُونَ\n"
    }
  },
  {
    "id": 936,
    "surahId": 6,
    "ayahNumber": 147,
    "arabicText": "فَإِن كَذَّبُوكَ فَقُل رَّبُّكُمۡ ذُو رَحۡمَةࣲ وَ ٰ⁠سِعَةࣲ وَلَا یُرَدُّ بَأۡسُهُۥ عَنِ ٱلۡقَوۡمِ ٱلۡمُجۡرِمِینَ\n",
    "translations": {
      "en": "And if they give thee the lie, say: \"Limitless is your Sustainer in His grace; but His punishment shall not be averted from people who are lost in sin.\"",
      "ms": "Kemudian jika mereka mendustakanmu (wahai Muhammad) maka katakanlah: \"Tuhan kamu mempunyai rahmat yang luas melimpah-ruah, dan azab seksaNya tidak dapat ditolak dari kaum yang berdosa\".",
      "id": "Maka jika mereka mendustakan kamu, katakanlah: \"Tuhanmu mempunyai rahmat yang luas; dan siksa-Nya tidak dapat ditolak dari kaum yang berdosa\".",
      "ar": "فَإِن كَذَّبُوكَ فَقُل رَّبُّكُمۡ ذُو رَحۡمَةࣲ وَ ٰ⁠سِعَةࣲ وَلَا یُرَدُّ بَأۡسُهُۥ عَنِ ٱلۡقَوۡمِ ٱلۡمُجۡرِمِینَ\n"
    }
  },
  {
    "id": 937,
    "surahId": 6,
    "ayahNumber": 148,
    "arabicText": "سَیَقُولُ ٱلَّذِینَ أَشۡرَكُوا۟ لَوۡ شَاۤءَ ٱللَّهُ مَاۤ أَشۡرَكۡنَا وَلَاۤ ءَابَاۤؤُنَا وَلَا حَرَّمۡنَا مِن شَیۡءࣲۚ كَذَ ٰ⁠لِكَ كَذَّبَ ٱلَّذِینَ مِن قَبۡلِهِمۡ حَتَّىٰ ذَاقُوا۟ بَأۡسَنَاۗ قُلۡ هَلۡ عِندَكُم مِّنۡ عِلۡمࣲ فَتُخۡرِجُوهُ لَنَاۤۖ إِن تَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ أَنتُمۡ إِلَّا تَخۡرُصُونَ\n",
    "translations": {
      "en": "THOSE who are bent on ascribing divinity to aught beside God will say, \"Had God so willed, we would not have ascribed divinity to aught but Him, nor would our forefathers [have done so]; and neither would we have declared as forbidden anything [that He has allowed].\" Even so did those who lived before them give the lie to the truth -until they came to taste Our punishment! Say: \"Have you any [certain] knowledge which you could proffer to us? You follow but [other people's] conjectures, and you yourselves do nothing but guess.\"",
      "ms": "Orang-orang musyrik akan mengatakan: \"Kalau Allah menghendaki tentulah kami dan datuk nenek kami tidak mempersekutukanNya (dengan sesuatu yang lain), dan tidak pula kami haramkan sesuatu apa pun\". Demikianlah juga orang-orang yang dahulu sebelum mereka telah mendustakan (Rasul-rasul) sehingga mereka merasai azab seksa Kami. Katakanlah: Adakah kamu mempunyai (sesuatu keterangan yang berdasarkan) ilmu supaya dapat kamu tunjukkan kepada kami? Tiadalah kamu menurut melainkan sangkaan semata-mata, dan kamu pula tidak lain hanyalah berdusta\".",
      "id": "Orang-orang yang mempersekutukan Tuhan, akan mengatakan: \"Jika Allah menghendaki, niscaya kami dan bapak-bapak kami tidak mempersekutukan-Nya dan tidak (pula) kami mengharamkan barang sesuatu apapun\". Demikian pulalah orang-orang sebelum mereka telah mendustakan (para rasul) sampai mereka merasakan siksaan Kami. Katakanlah: \"Adakah kamu mempunyai sesuatu pengetahuan sehingga dapat kamu mengemukakannya kepada Kami?\" Kamu tidak mengikuti kecuali persangkaan belaka, dan kamu tidak lain hanyalah berdusta.",
      "ar": "سَیَقُولُ ٱلَّذِینَ أَشۡرَكُوا۟ لَوۡ شَاۤءَ ٱللَّهُ مَاۤ أَشۡرَكۡنَا وَلَاۤ ءَابَاۤؤُنَا وَلَا حَرَّمۡنَا مِن شَیۡءࣲۚ كَذَ ٰ⁠لِكَ كَذَّبَ ٱلَّذِینَ مِن قَبۡلِهِمۡ حَتَّىٰ ذَاقُوا۟ بَأۡسَنَاۗ قُلۡ هَلۡ عِندَكُم مِّنۡ عِلۡمࣲ فَتُخۡرِجُوهُ لَنَاۤۖ إِن تَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ أَنتُمۡ إِلَّا تَخۡرُصُونَ\n"
    }
  },
  {
    "id": 938,
    "surahId": 6,
    "ayahNumber": 149,
    "arabicText": "قُلۡ فَلِلَّهِ ٱلۡحُجَّةُ ٱلۡبَـٰلِغَةُۖ فَلَوۡ شَاۤءَ لَهَدَىٰكُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "Say: \"[Know,] then, that the final evidence [of all truth] rests with God alone; and had He so willed, He would have guided you all aright.",
      "ms": "Katakanlah (wahai Muhammad: \"Kalau kamu sudah tidak ada sesuatu bukti) maka Allah mempunyai bukti yang tegas nyata. Oleh itu, jika Ia menghendaki tentulah Ia akan memberi hidayah petunjuk kepada kamu semuanya\".",
      "id": "Katakanlah: \"Allah mempunyai hujjah yang jelas lagi kuat; maka jika Dia menghendaki, pasti Dia memberi petunjuk kepada kamu semuanya\".",
      "ar": "قُلۡ فَلِلَّهِ ٱلۡحُجَّةُ ٱلۡبَـٰلِغَةُۖ فَلَوۡ شَاۤءَ لَهَدَىٰكُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 939,
    "surahId": 6,
    "ayahNumber": 150,
    "arabicText": "قُلۡ هَلُمَّ شُهَدَاۤءَكُمُ ٱلَّذِینَ یَشۡهَدُونَ أَنَّ ٱللَّهَ حَرَّمَ هَـٰذَاۖ فَإِن شَهِدُوا۟ فَلَا تَشۡهَدۡ مَعَهُمۡۚ وَلَا تَتَّبِعۡ أَهۡوَاۤءَ ٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِنَا وَٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ وَهُم بِرَبِّهِمۡ یَعۡدِلُونَ\n",
    "translations": {
      "en": "Say: \"Bring forward your witnesses who could bear witness that God has forbidden [all] this!\" -and if they bear witness [falsely], do not bear witness with them; and do not follow the errant views of those who have given the lie to Our messages, nor of those who believe not in the life to come, and who regard other powers as their Sustainer's equals!",
      "ms": "Katakanlah: \"Bawalah saksi-saksi kamu memberi keterangan bahawa Allah mengharamkan (benda-benda yang kamu haramkan) ini\". Kemudian jika mereka (tergamak) menjadi saksi (secara dusta), maka janganlah engkau turut sama membenarkan mereka mereka; dan janganlah engkau turut hawa nafsu orang-orang yang mendustakan ayat-ayat keterangan Kami, dan orang-orang yang tidak beriman kepada hari akhirat, sedang mereka pula menyamakan (sesuatu yang lain) dengan Tuhan mereka.",
      "id": "Katakanlah: \"Bawalah kemari saksi-saksi kamu yang dapat mempersaksikan bahwasanya Allah telah mengharamkan (makanan yang kamu) haramkan ini\" Jika mereka mempersaksikan, maka janganlah kamu ikut pula menjadi saksi bersama mereka; dan janganlah kamu mengikuti hawa nafsu orang-orang yang mendustakan ayat-ayat Kami, dan orang-orang yang tidak beriman kepada kehidupan akhirat, sedang mereka mempersekutukan Tuhan mereka.",
      "ar": "قُلۡ هَلُمَّ شُهَدَاۤءَكُمُ ٱلَّذِینَ یَشۡهَدُونَ أَنَّ ٱللَّهَ حَرَّمَ هَـٰذَاۖ فَإِن شَهِدُوا۟ فَلَا تَشۡهَدۡ مَعَهُمۡۚ وَلَا تَتَّبِعۡ أَهۡوَاۤءَ ٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِنَا وَٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ وَهُم بِرَبِّهِمۡ یَعۡدِلُونَ\n"
    }
  },
  {
    "id": 940,
    "surahId": 6,
    "ayahNumber": 151,
    "arabicText": "۞ قُلۡ تَعَالَوۡا۟ أَتۡلُ مَا حَرَّمَ رَبُّكُمۡ عَلَیۡكُمۡۖ أَلَّا تُشۡرِكُوا۟ بِهِۦ شَیۡـࣰٔاۖ وَبِٱلۡوَ ٰ⁠لِدَیۡنِ إِحۡسَـٰنࣰاۖ وَلَا تَقۡتُلُوۤا۟ أَوۡلَـٰدَكُم مِّنۡ إِمۡلَـٰقࣲ نَّحۡنُ نَرۡزُقُكُمۡ وَإِیَّاهُمۡۖ وَلَا تَقۡرَبُوا۟ ٱلۡفَوَ ٰ⁠حِشَ مَا ظَهَرَ مِنۡهَا وَمَا بَطَنَۖ وَلَا تَقۡتُلُوا۟ ٱلنَّفۡسَ ٱلَّتِی حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۚ ذَ ٰ⁠لِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَعۡقِلُونَ\n",
    "translations": {
      "en": "Say: \"Come, let me convey unto you what God has [really] forbidden to you: \"Do not ascribe divinity, in any way, to aught beside Him; and [do not offend against but, rather,] do good unto your parents; and do not kill your children for fear of poverty - [for] it is We who shall provide sustenance for you as well as for them; and do not commit any shameful deeds, be they open or secret; and do not take any human being's life-[the life] which God has declared to be sacred -otherwise than in [the pursuit of] justice: this has He enjoined upon you so that you might use your reason;",
      "ms": "Katakanlah: \"Marilah, supaya aku bacakan apa yang telah diharamkan oleh Tuhan kamu kepada kamu, iaitu janganlah kamu sekutukan dengan Allah sesuatupun; dan hendaklah (kamu) membuat baik kepada ibu bapa; dan janganlah kamu membunuh anak-anak kamu kerana kepapaan, (sebenarnya) Kamilah yang memberi rezeki kepada kamu dan kepada mereka; dan janganlah kamu hampiri kejahatan-kejahatan (zina) - yang terang daripadanya dan yang tersembunyi; dan janganlah kamu membunuh jiwa yang telah diharamkan Allah (membunuhnya) melainkan dengan jalan yang hak (yang dibenarkan oleh Syarak). Dengan yang demikian itulah Allah perintahkan kamu, supaya kamu memahaminya.",
      "id": "Katakanlah: \"Marilah kubacakan apa yang diharamkan atas kamu oleh Tuhanmu yaitu: janganlah kamu mempersekutukan sesuatu dengan Dia, berbuat baiklah terhadap kedua orang ibu bapa, dan janganlah kamu membunuh anak-anak kamu karena takut kemiskinan, Kami akan memberi rezeki kepadamu dan kepada mereka, dan janganlah kamu mendekati perbuatan-perbuatan yang keji, baik yang nampak di antaranya maupun yang tersembunyi, dan janganlah kamu membunuh jiwa yang diharamkan Allah (membunuhnya) melainkan dengan sesuatu (sebab) yang benar\". Demikian itu yang diperintahkan kepadamu supaya kamu memahami(nya).",
      "ar": "۞ قُلۡ تَعَالَوۡا۟ أَتۡلُ مَا حَرَّمَ رَبُّكُمۡ عَلَیۡكُمۡۖ أَلَّا تُشۡرِكُوا۟ بِهِۦ شَیۡـࣰٔاۖ وَبِٱلۡوَ ٰ⁠لِدَیۡنِ إِحۡسَـٰنࣰاۖ وَلَا تَقۡتُلُوۤا۟ أَوۡلَـٰدَكُم مِّنۡ إِمۡلَـٰقࣲ نَّحۡنُ نَرۡزُقُكُمۡ وَإِیَّاهُمۡۖ وَلَا تَقۡرَبُوا۟ ٱلۡفَوَ ٰ⁠حِشَ مَا ظَهَرَ مِنۡهَا وَمَا بَطَنَۖ وَلَا تَقۡتُلُوا۟ ٱلنَّفۡسَ ٱلَّتِی حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۚ ذَ ٰ⁠لِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 941,
    "surahId": 6,
    "ayahNumber": 152,
    "arabicText": "وَلَا تَقۡرَبُوا۟ مَالَ ٱلۡیَتِیمِ إِلَّا بِٱلَّتِی هِیَ أَحۡسَنُ حَتَّىٰ یَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُوا۟ ٱلۡكَیۡلَ وَٱلۡمِیزَانَ بِٱلۡقِسۡطِۖ لَا نُكَلِّفُ نَفۡسًا إِلَّا وُسۡعَهَاۖ وَإِذَا قُلۡتُمۡ فَٱعۡدِلُوا۟ وَلَوۡ كَانَ ذَا قُرۡبَىٰۖ وَبِعَهۡدِ ٱللَّهِ أَوۡفُوا۟ۚ ذَ ٰ⁠لِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَذَكَّرُونَ\n",
    "translations": {
      "en": "and do not touch the substance of an orphan - save to improve it-before he comes of age.\" And [in all your dealings] give full measure and weight, with equity: [however,] We do not burden any human being with more than he is well able to bear; and when you voice an opinion, be just, even though it be [against] one near of kin. And [always] observe your bond with God: this has He enjoined upon you, so that you might keep it in mind.",
      "ms": "\"Dan janganlah kamu hampiri harta anak yatim melainkan dengan cara yang baik (untuk mengawal dan mengembangkannya), sehingga ia baligh (dewasa, serta layak mengurus hartanya dengan sendiri); dan sempurnakanlah segala sukatan dan timbangan dengan adil\". - Kami tidak memberatkan seseorang dengan kewajipan melainkan sekadar kesanggupannya - \"dan apabila kamu mengatakan sesuatu (semasa membuat apa-apa keterangan) maka hendaklah kamu berlaku adil, sekalipun orang itu ada hubungan kerabat (dengan kamu); dan perjanjian (perintah-perintah) Allah hendaklah kamu sempurnakan. Dengan yang demikian itulah Allah perintahkan kamu, supaya kamu beringat (mematuhiNya)\".",
      "id": "Dan janganlah kamu dekati harta anak yatim, kecuali dengan cara yang lebih bermanfaat, hingga sampai ia dewasa. Dan sempurnakanlah takaran dan timbangan dengan adil. Kami tidak memikulkan beban kepada sesorang melainkan sekedar kesanggupannya. Dan apabila kamu berkata, maka hendaklah kamu berlaku adil, kendatipun ia adalah kerabat(mu), dan penuhilah janji Allah. Yang demikian itu diperintahkan Allah kepadamu agar kamu ingat.",
      "ar": "وَلَا تَقۡرَبُوا۟ مَالَ ٱلۡیَتِیمِ إِلَّا بِٱلَّتِی هِیَ أَحۡسَنُ حَتَّىٰ یَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُوا۟ ٱلۡكَیۡلَ وَٱلۡمِیزَانَ بِٱلۡقِسۡطِۖ لَا نُكَلِّفُ نَفۡسًا إِلَّا وُسۡعَهَاۖ وَإِذَا قُلۡتُمۡ فَٱعۡدِلُوا۟ وَلَوۡ كَانَ ذَا قُرۡبَىٰۖ وَبِعَهۡدِ ٱللَّهِ أَوۡفُوا۟ۚ ذَ ٰ⁠لِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَذَكَّرُونَ\n"
    }
  },
  {
    "id": 942,
    "surahId": 6,
    "ayahNumber": 153,
    "arabicText": "وَأَنَّ هَـٰذَا صِرَ ٰ⁠طِی مُسۡتَقِیمࣰا فَٱتَّبِعُوهُۖ وَلَا تَتَّبِعُوا۟ ٱلسُّبُلَ فَتَفَرَّقَ بِكُمۡ عَن سَبِیلِهِۦۚ ذَ ٰ⁠لِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَتَّقُونَ\n",
    "translations": {
      "en": "And [know] that this is the way leading straight unto Me: follow it, then, and follow not other ways, lest they cause you to deviate from His way. [All] this has He enjoined upon you, so that you might remain conscious of Him.",
      "ms": "Dan bahawa sesungguhnya inilah jalanKu (ugama Islam) yang betul lurus, maka hendaklah kamu menurutnya; dan janganlah kamu menurut menurut jalan-jalan (yang lain dari Islam), kerana jalan-jalan (yang lain itu) mencerai-beraikan kamu dari jalan Allah, Dengan yang demikian itulah Allah perintahkan kamu, supaya kamu bertaqwa.",
      "id": "dan bahwa (yang Kami perintahkan ini) adalah jalan-Ku yang lurus, maka ikutilah dia, dan janganlah kamu mengikuti jalan-jalan (yang lain), karena jalan-jalan itu mencerai beraikan kamu dari jalan-Nya. Yang demikian itu diperintahkan Allah agar kamu bertakwa.",
      "ar": "وَأَنَّ هَـٰذَا صِرَ ٰ⁠طِی مُسۡتَقِیمࣰا فَٱتَّبِعُوهُۖ وَلَا تَتَّبِعُوا۟ ٱلسُّبُلَ فَتَفَرَّقَ بِكُمۡ عَن سَبِیلِهِۦۚ ذَ ٰ⁠لِكُمۡ وَصَّىٰكُم بِهِۦ لَعَلَّكُمۡ تَتَّقُونَ\n"
    }
  },
  {
    "id": 943,
    "surahId": 6,
    "ayahNumber": 154,
    "arabicText": "ثُمَّ ءَاتَیۡنَا مُوسَى ٱلۡكِتَـٰبَ تَمَامًا عَلَى ٱلَّذِیۤ أَحۡسَنَ وَتَفۡصِیلࣰا لِّكُلِّ شَیۡءࣲ وَهُدࣰى وَرَحۡمَةࣰ لَّعَلَّهُم بِلِقَاۤءِ رَبِّهِمۡ یُؤۡمِنُونَ\n",
    "translations": {
      "en": "AND ONCE AGAIN: We vouchsafed the divine writ unto Moses in fulfilment [of Our favour] upon those who persevered in doing good, clearly spelling out everything, and [thus providing] guidance and grace, so that they might have faith in the [final] meeting with their Sustainer.",
      "ms": "Kemudian (ketahuilah pula bahawa) Kami telah memberikan kepada Nabi Musa Kitab Taurat untuk menyempurnakan (kemuliaan dan nikmat Kami) kepada orang yang telah berbuat baik (menjalankan ajaran Kitab itu iaitu Nabi Musa), dan untuk menerangkan tiap-tiap sesuatu, serta menjadi petunjuk dan rahmat, supaya mereka beriman kepada pertemuan dengan Tuhan mereka (pada hari akhirat kelak).",
      "id": "Kemudian Kami telah memberikan Al Kitab (Taurat) kepada Musa untuk menyempurnakan (nikmat Kami) kepada orang yang berbuat kebaikan, dan untuk menjelaskan segala sesuatu dan sebagai petunjuk dan rahmat, agar mereka beriman (bahwa) mereka akan menemui Tuhan mereka.",
      "ar": "ثُمَّ ءَاتَیۡنَا مُوسَى ٱلۡكِتَـٰبَ تَمَامًا عَلَى ٱلَّذِیۤ أَحۡسَنَ وَتَفۡصِیلࣰا لِّكُلِّ شَیۡءࣲ وَهُدࣰى وَرَحۡمَةࣰ لَّعَلَّهُم بِلِقَاۤءِ رَبِّهِمۡ یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 944,
    "surahId": 6,
    "ayahNumber": 155,
    "arabicText": "وَهَـٰذَا كِتَـٰبٌ أَنزَلۡنَـٰهُ مُبَارَكࣱ فَٱتَّبِعُوهُ وَٱتَّقُوا۟ لَعَلَّكُمۡ تُرۡحَمُونَ\n",
    "translations": {
      "en": "And this, too, is a divine writ which We have bestowed from on high, a blessed one: follow it, then, and be conscious of God, so that you might be graced with His mercy.",
      "ms": "Dan ini sebuah Kitab (Al-Quran) yang Kami turunkan, yang ada berkatnya (banyak manfaatnya). Oleh itu, hendaklah kamu menurutnya; dan bertaqwalah (kepada Allah), mudah-mudahan kamu beroleh rahmat.",
      "id": "Dan Al-Quran itu adalah kitab yang Kami turunkan yang diberkati, maka ikutilah dia dan bertakwalah agar kamu diberi rahmat.",
      "ar": "وَهَـٰذَا كِتَـٰبٌ أَنزَلۡنَـٰهُ مُبَارَكࣱ فَٱتَّبِعُوهُ وَٱتَّقُوا۟ لَعَلَّكُمۡ تُرۡحَمُونَ\n"
    }
  },
  {
    "id": 945,
    "surahId": 6,
    "ayahNumber": 156,
    "arabicText": "أَن تَقُولُوۤا۟ إِنَّمَاۤ أُنزِلَ ٱلۡكِتَـٰبُ عَلَىٰ طَاۤىِٕفَتَیۡنِ مِن قَبۡلِنَا وَإِن كُنَّا عَن دِرَاسَتِهِمۡ لَغَـٰفِلِینَ\n",
    "translations": {
      "en": "It has been given to you] lest you say, \"Only unto two groups of people, [both of them] before our time, has a divine writ been bestowed from on high and we were indeed unaware of their teachings\";",
      "ms": "Supaya kamu tidak mengatakan: \"Bahawa Kitab (ugama) itu hanya diturunkan kepada dua golongan (Yahudi dan Nasrani) dahulu sebelum kami, dan sesungguhnya kami lalai (tidak faham) akan apa yang dibaca dan dipelajari oleh mereka\".",
      "id": "(Kami turunkan al-Quran itu) agar kamu (tidak) mengatakan: \"Bahwa kitab itu hanya diturunkan kepada dua golongan saja sebelum kami, dan sesungguhnya kami tidak memperhatikan apa yang mereka baca.",
      "ar": "أَن تَقُولُوۤا۟ إِنَّمَاۤ أُنزِلَ ٱلۡكِتَـٰبُ عَلَىٰ طَاۤىِٕفَتَیۡنِ مِن قَبۡلِنَا وَإِن كُنَّا عَن دِرَاسَتِهِمۡ لَغَـٰفِلِینَ\n"
    }
  },
  {
    "id": 946,
    "surahId": 6,
    "ayahNumber": 157,
    "arabicText": "أَوۡ تَقُولُوا۟ لَوۡ أَنَّاۤ أُنزِلَ عَلَیۡنَا ٱلۡكِتَـٰبُ لَكُنَّاۤ أَهۡدَىٰ مِنۡهُمۡۚ فَقَدۡ جَاۤءَكُم بَیِّنَةࣱ مِّن رَّبِّكُمۡ وَهُدࣰى وَرَحۡمَةࣱۚ فَمَنۡ أَظۡلَمُ مِمَّن كَذَّبَ بِـَٔایَـٰتِ ٱللَّهِ وَصَدَفَ عَنۡهَاۗ سَنَجۡزِی ٱلَّذِینَ یَصۡدِفُونَ عَنۡ ءَایَـٰتِنَا سُوۤءَ ٱلۡعَذَابِ بِمَا كَانُوا۟ یَصۡدِفُونَ\n",
    "translations": {
      "en": "or lest you say, \"If a divine writ had been bestowed from on high upon us, we would surely have followed its guidance better than they did.\" And so, a clear evidence of the truth has now come unto you from your Sustainer, and guidance, and grace. Who, then, could be more wicked than he who gives the lie to God's messages, and turns away from them in disdain? We shall requite those who turn away from Our messages in disdain with evil suffering for having thus turned away!",
      "ms": "Atau supaya kamu (tidak) mengatakan: \"Sesungguhnya kalau diturunkan Kitab kepada kami tentulah kami mendapat petunjuk hidayah lebih daripada mereka\". (Kamu tidak akan dapat berdalih lagi) kerana sesungguhnya telah datang kepada kamu keterangan (yang cukup) dari Tuhan kamu, dan petunjuk hidayah serta rahmatNya (yang melimpah-limpah). Oleh itu, siapakah yang lebih zalim lagi daripada orang yang mendustakan ayat-ayat keterangan Allah dan berpaling daripadanya? Kami akan membalas orang-orang yang berpaling dari ayat-ayat keterangan Kami (dengan) azab seksa yang seburuk-buruknya, disebabkan mereka sentiasa berpaling (mengingkarinya).",
      "id": "Atau agar kamu (tidak) mengatakan: \"Sesungguhnya jikalau kitab ini diturunkan kepada kami, tentulah kami lebih mendapat petunjuk dari mereka\". Sesungguhnya telah datang kepada kamu keterangan yang nyata dari Tuhanmu, petunjuk dan rahmat. Maka siapakah yang lebih zalim daripada orang yang mendustakan ayat-ayat Allah dan berpaling daripadanya? Kelak Kami akan memberi balasan kepada orang-orang yang berpaling dari ayat-ayat Kami dengan siksa yang buruk, disebabkan mereka selalu berpaling.",
      "ar": "أَوۡ تَقُولُوا۟ لَوۡ أَنَّاۤ أُنزِلَ عَلَیۡنَا ٱلۡكِتَـٰبُ لَكُنَّاۤ أَهۡدَىٰ مِنۡهُمۡۚ فَقَدۡ جَاۤءَكُم بَیِّنَةࣱ مِّن رَّبِّكُمۡ وَهُدࣰى وَرَحۡمَةࣱۚ فَمَنۡ أَظۡلَمُ مِمَّن كَذَّبَ بِـَٔایَـٰتِ ٱللَّهِ وَصَدَفَ عَنۡهَاۗ سَنَجۡزِی ٱلَّذِینَ یَصۡدِفُونَ عَنۡ ءَایَـٰتِنَا سُوۤءَ ٱلۡعَذَابِ بِمَا كَانُوا۟ یَصۡدِفُونَ\n"
    }
  },
  {
    "id": 947,
    "surahId": 6,
    "ayahNumber": 158,
    "arabicText": "هَلۡ یَنظُرُونَ إِلَّاۤ أَن تَأۡتِیَهُمُ ٱلۡمَلَـٰۤىِٕكَةُ أَوۡ یَأۡتِیَ رَبُّكَ أَوۡ یَأۡتِیَ بَعۡضُ ءَایَـٰتِ رَبِّكَۗ یَوۡمَ یَأۡتِی بَعۡضُ ءَایَـٰتِ رَبِّكَ لَا یَنفَعُ نَفۡسًا إِیمَـٰنُهَا لَمۡ تَكُنۡ ءَامَنَتۡ مِن قَبۡلُ أَوۡ كَسَبَتۡ فِیۤ إِیمَـٰنِهَا خَیۡرࣰاۗ قُلِ ٱنتَظِرُوۤا۟ إِنَّا مُنتَظِرُونَ\n",
    "translations": {
      "en": "Do they, perchance, wait for the angels to appear unto them, or for thy Sustainer [Himself] to appear, or for some of thy Sustainer's [final] portents to appear? [But] on the Day when thy Sustainer's [final] portents do appear, believing will be of no avail to any human being who did not believe before, or who, while believing, did no good works. Say: \"Wait, [then, for the Last Day, O unbelievers:] behold, we [believers] are waiting, too!\"",
      "ms": "Apakah (yang ditunggu-tunggu oleh mereka yang tidak beriman itu?) mereka tidak menunggu melainkan kedatangan malaikat (yang mencabut nyawa mereka), atau kedatangan (azab) Tuhanmu, atau kedatangan sebahagian dari tanda-tanda Tuhanmu (yang menjadi alamat hari kiamat). Pada hari datangnya sebahagian dari tanda-tanda Tuhanmu itu, tidak berfaedah lagi iman seseorang yang tidak beriman sebelum itu, atau yang tidak berusaha mengerjakan kebaikan mengenai imannya. Katakanlah: \"Tunggulah kamu (akan apa yang kamu berhak mendapatnya), dan kami pun sebenarnya menunggu (akan apa yang telah dijanjikan oleh Tuhan kepada kami)\".",
      "id": "Yang mereka nanti-nanti tidak lain hanyalah kedatangan malaikat kepada mereka (untuk mencabut nyawa mereka) atau kedatangan (siksa) Tuhanmu atau kedatangan beberapa ayat Tuhanmu. Pada hari datangnya ayat dari Tuhanmu, tidaklah bermanfaat lagi iman seseorang kepada dirinya sendiri yang belum beriman sebelum itu, atau dia (belum) mengusahakan kebaikan dalam masa imannya. Katakanlah: \"Tunggulah olehmu sesungguhnya Kamipun menunggu (pula)\".",
      "ar": "هَلۡ یَنظُرُونَ إِلَّاۤ أَن تَأۡتِیَهُمُ ٱلۡمَلَـٰۤىِٕكَةُ أَوۡ یَأۡتِیَ رَبُّكَ أَوۡ یَأۡتِیَ بَعۡضُ ءَایَـٰتِ رَبِّكَۗ یَوۡمَ یَأۡتِی بَعۡضُ ءَایَـٰتِ رَبِّكَ لَا یَنفَعُ نَفۡسًا إِیمَـٰنُهَا لَمۡ تَكُنۡ ءَامَنَتۡ مِن قَبۡلُ أَوۡ كَسَبَتۡ فِیۤ إِیمَـٰنِهَا خَیۡرࣰاۗ قُلِ ٱنتَظِرُوۤا۟ إِنَّا مُنتَظِرُونَ\n"
    }
  },
  {
    "id": 948,
    "surahId": 6,
    "ayahNumber": 159,
    "arabicText": "إِنَّ ٱلَّذِینَ فَرَّقُوا۟ دِینَهُمۡ وَكَانُوا۟ شِیَعࣰا لَّسۡتَ مِنۡهُمۡ فِی شَیۡءٍۚ إِنَّمَاۤ أَمۡرُهُمۡ إِلَى ٱللَّهِ ثُمَّ یُنَبِّئُهُم بِمَا كَانُوا۟ یَفۡعَلُونَ\n",
    "translations": {
      "en": "VERILY, as for those who have broken the unity of their faith and have become sects - thou hast nothing to do with them. Behold, their case rests with God: and in time He will make them understand what they were doing.",
      "ms": "Bahawasanya orang-orang yang mencerai-beraikan ugama mereka (dengan perselisihan-perselisihan yang berdasarkan hawa nafsu), dan mereka menjadi berpuak-puak, tiadalah engkau terkait sedikitpun dalam (perbuatan) mereka. Sesungguhnya perkara mereka hanya terserah kepada Allah. Kemudian Ia akan menerangkan kepada mereka (pada hari kiamat kelak), apa yang telah mereka lakukan (dan membalasnya).",
      "id": "Sesungguhnya orang-orang yang memecah belah agama-Nya dan mereka menjadi bergolongan, tidak ada sedikitpun tanggung jawabmu kepada mereka. Sesungguhnya urusan mereka hanyalah terserah kepada Allah, kemudian Allah akan memberitahukan kepada mereka apa yang telah mereka perbuat.",
      "ar": "إِنَّ ٱلَّذِینَ فَرَّقُوا۟ دِینَهُمۡ وَكَانُوا۟ شِیَعࣰا لَّسۡتَ مِنۡهُمۡ فِی شَیۡءٍۚ إِنَّمَاۤ أَمۡرُهُمۡ إِلَى ٱللَّهِ ثُمَّ یُنَبِّئُهُم بِمَا كَانُوا۟ یَفۡعَلُونَ\n"
    }
  },
  {
    "id": 949,
    "surahId": 6,
    "ayahNumber": 160,
    "arabicText": "مَن جَاۤءَ بِٱلۡحَسَنَةِ فَلَهُۥ عَشۡرُ أَمۡثَالِهَاۖ وَمَن جَاۤءَ بِٱلسَّیِّئَةِ فَلَا یُجۡزَىٰۤ إِلَّا مِثۡلَهَا وَهُمۡ لَا یُظۡلَمُونَ\n",
    "translations": {
      "en": "Whoever shall come [before God] with a good deed will gain ten times the like thereof; but whoever shall come with an evil deed will be requited with no more than the like thereof; and none shall be wronged.",
      "ms": "Sesiapa yang membawa amal kebaikan (pada hari kiamat), maka baginya (balasan) sepuluh kali ganda (dari kebaikan) yang sama dengannya; dan sesiapa yang membawa amal kejahatan, maka ia tidak dibalas melainkan (kejahatan) yang sama dengannya; sedang mereka tidak dianiaya (sedikitpun).",
      "id": "Barangsiapa membawa amal yang baik, maka baginya (pahala) sepuluh kali lipat amalnya; dan barangsiapa yang membawa perbuatan jahat maka dia tidak diberi pembalasan melainkan seimbang dengan kejahatannya, sedang mereka sedikitpun tidak dianiaya (dirugikan).",
      "ar": "مَن جَاۤءَ بِٱلۡحَسَنَةِ فَلَهُۥ عَشۡرُ أَمۡثَالِهَاۖ وَمَن جَاۤءَ بِٱلسَّیِّئَةِ فَلَا یُجۡزَىٰۤ إِلَّا مِثۡلَهَا وَهُمۡ لَا یُظۡلَمُونَ\n"
    }
  },
  {
    "id": 950,
    "surahId": 6,
    "ayahNumber": 161,
    "arabicText": "قُلۡ إِنَّنِی هَدَىٰنِی رَبِّیۤ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ دِینࣰا قِیَمࣰا مِّلَّةَ إِبۡرَ ٰ⁠هِیمَ حَنِیفࣰاۚ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِینَ\n",
    "translations": {
      "en": "SAY: \"Behold, my Sustainer has guided me onto a straight way through an ever-true faith-the way of Abraham, who turned away from all that is false, and wa,. not of those who ascribe divinity to aught beside Him.\"",
      "ms": "Katakanlah (wahai Muhammad): \"Sesungguhnya aku telah diberikan petunjuk hidayah oleh Tuhanku ke jalan yang betul lurus, (kepada) ugama yang tetap teguh, iaitu ugama Nabi Ibrahim yang ikhlas, dan tiadalah ia dari orang-orang musyrik\".",
      "id": "Katakanlah: \"Sesungguhnya aku telah ditunjuki oleh Tuhanku kepada jalan yang lurus, (yaitu) agama yang benar, agama Ibrahim yang lurus, dan Ibrahim itu bukanlah termasuk orang-orang musyrik\".",
      "ar": "قُلۡ إِنَّنِی هَدَىٰنِی رَبِّیۤ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ دِینࣰا قِیَمࣰا مِّلَّةَ إِبۡرَ ٰ⁠هِیمَ حَنِیفࣰاۚ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِینَ\n"
    }
  },
  {
    "id": 951,
    "surahId": 6,
    "ayahNumber": 162,
    "arabicText": "قُلۡ إِنَّ صَلَاتِی وَنُسُكِی وَمَحۡیَایَ وَمَمَاتِی لِلَّهِ رَبِّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "Say: \"Behold, my prayer, and (all] my acts of worship, and my living and my dying are for God [alone], the Sustainer of all the worlds,",
      "ms": "Katakanlah: \"Sesungguhnya sembahyangku dan ibadatku, hidupku dan matiku, hanyalah untuk Allah Tuhan yang memelihara dan mentadbirkan sekalian alam.",
      "id": "Katakanlah: sesungguhnya sembahyangku, ibadatku, hidupku dan matiku hanyalah untuk Allah, Tuhan semesta alam.",
      "ar": "قُلۡ إِنَّ صَلَاتِی وَنُسُكِی وَمَحۡیَایَ وَمَمَاتِی لِلَّهِ رَبِّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 952,
    "surahId": 6,
    "ayahNumber": 163,
    "arabicText": "لَا شَرِیكَ لَهُۥۖ وَبِذَ ٰ⁠لِكَ أُمِرۡتُ وَأَنَا۠ أَوَّلُ ٱلۡمُسۡلِمِینَ\n",
    "translations": {
      "en": "in whose divinity none has a share: for thus have I been bidden-and I shall [always] be foremost among those who surrender themselves unto Him.\"",
      "ms": "Tiada sekutu bagiNya, dan dengan yang demikian sahaja aku diperintahkan, dan aku (di antara seluruh umatku) adalah orang Islam yang awal pertama - (yang berserah diri kepada Allah dan mematuhi perintahNya)\".",
      "id": "Tiada sekutu bagi-Nya; dan demikian itulah yang diperintahkan kepadaku dan aku adalah orang yang pertama-tama menyerahkan diri (kepada Allah)\".",
      "ar": "لَا شَرِیكَ لَهُۥۖ وَبِذَ ٰ⁠لِكَ أُمِرۡتُ وَأَنَا۠ أَوَّلُ ٱلۡمُسۡلِمِینَ\n"
    }
  },
  {
    "id": 953,
    "surahId": 6,
    "ayahNumber": 164,
    "arabicText": "قُلۡ أَغَیۡرَ ٱللَّهِ أَبۡغِی رَبࣰّا وَهُوَ رَبُّ كُلِّ شَیۡءࣲۚ وَلَا تَكۡسِبُ كُلُّ نَفۡسٍ إِلَّا عَلَیۡهَاۚ وَلَا تَزِرُ وَازِرَةࣱ وِزۡرَ أُخۡرَىٰۚ ثُمَّ إِلَىٰ رَبِّكُم مَّرۡجِعُكُمۡ فَیُنَبِّئُكُم بِمَا كُنتُمۡ فِیهِ تَخۡتَلِفُونَ\n",
    "translations": {
      "en": "Say: \"Am I, then, to seek a sustainer other than God, when He is the Sustainer of all things?\" And whatever [wrong] any human being commits rests upon himself alone; and no bearer of burdens shall be made to bear another's burden. And, in time, unto your Sustainer you all must return: and then He will make you. [truly] understand all that on which you were wont to differ.",
      "ms": "Katakanlah: \"(Sesudah aku mentauhidkan Allah dan berserah diri kepadaNya) patutkah aku mencari Tuhan selain Allah, padahal Dia lah Tuhan bagi tiap-tiap sesuatu? Dan tiadalah (kejahatan) yang diusahakan oleh tiap-tiap seorang melainkan orang itulah sahaja yang menanggung dosanya; dan seseorang yang boleh memikul tidak akan memikul dosa perbuatan orang lain (bahkan dosa usahanya sahaja); kemudian kepada Tuhan kamulah tempat kamu kembali, lalu Ia menerangkan kepada kamu akan apa yang kamu berselisihan padanya.",
      "id": "Katakanlah: \"Apakah aku akan mencari Tuhan selain Allah, padahal Dia adalah Tuhan bagi segala sesuatu. Dan tidaklah seorang membuat dosa melainkan kemudharatannya kembali kepada dirinya sendiri; dan seorang yang berdosa tidak akan memikul dosa orang lain. Kemudian kepada Tuhanmulah kamu kembali, dan akan diberitakan-Nya kepadamu apa yang kamu perselisihkan\".",
      "ar": "قُلۡ أَغَیۡرَ ٱللَّهِ أَبۡغِی رَبࣰّا وَهُوَ رَبُّ كُلِّ شَیۡءࣲۚ وَلَا تَكۡسِبُ كُلُّ نَفۡسٍ إِلَّا عَلَیۡهَاۚ وَلَا تَزِرُ وَازِرَةࣱ وِزۡرَ أُخۡرَىٰۚ ثُمَّ إِلَىٰ رَبِّكُم مَّرۡجِعُكُمۡ فَیُنَبِّئُكُم بِمَا كُنتُمۡ فِیهِ تَخۡتَلِفُونَ\n"
    }
  },
  {
    "id": 954,
    "surahId": 6,
    "ayahNumber": 165,
    "arabicText": "وَهُوَ ٱلَّذِی جَعَلَكُمۡ خَلَـٰۤىِٕفَ ٱلۡأَرۡضِ وَرَفَعَ بَعۡضَكُمۡ فَوۡقَ بَعۡضࣲ دَرَجَـٰتࣲ لِّیَبۡلُوَكُمۡ فِی مَاۤ ءَاتَىٰكُمۡۗ إِنَّ رَبَّكَ سَرِیعُ ٱلۡعِقَابِ وَإِنَّهُۥ لَغَفُورࣱ رَّحِیمُۢ\n",
    "translations": {
      "en": "For, He it is who has made you inherit the earth, and has raised some of you by degrees above others, so that He might try you by means of what He has bestowed upon you. Verily, thy Sustainer is swift in retribution: yet, behold, He is indeed much-forgiving, a dispenser of grace.",
      "ms": "Dan Dia lah yang menjadikan kamu khalifah di bumi dan meninggikan setengah kamu atas setengahnya yang lain beberapa darjat, kerana Ia hendak menguji kamu pada apa yang telah dikurniakanNya kepada kamu. Sesungguhnya Tuhanmu amatlah cepat azab seksaNya, dan sesungguhnya Ia Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Dan Dialah yang menjadikan kamu penguasa-penguasa di bumi dan Dia meninggikan sebahagian kamu atas sebahagian (yang lain) beberapa derajat, untuk mengujimu tentang apa yang diberikan-Nya kepadamu. Sesungguhnya Tuhanmu amat cepat siksaan-Nya dan sesungguhnya Dia Maha Pengampun lagi Maha Penyayang.",
      "ar": "وَهُوَ ٱلَّذِی جَعَلَكُمۡ خَلَـٰۤىِٕفَ ٱلۡأَرۡضِ وَرَفَعَ بَعۡضَكُمۡ فَوۡقَ بَعۡضࣲ دَرَجَـٰتࣲ لِّیَبۡلُوَكُمۡ فِی مَاۤ ءَاتَىٰكُمۡۗ إِنَّ رَبَّكَ سَرِیعُ ٱلۡعِقَابِ وَإِنَّهُۥ لَغَفُورࣱ رَّحِیمُۢ\n"
    }
  }
]