[
  {
    "id": 4415,
    "surahId": 44,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ حمۤ\n",
    "translations": {
      "en": "Ha. Mim.",
      "ms": "Haa, Miim.",
      "id": "Haa miim.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ حمۤ\n"
    }
  },
  {
    "id": 4416,
    "surahId": 44,
    "ayahNumber": 2,
    "arabicText": "وَٱلۡكِتَـٰبِ ٱلۡمُبِینِ\n",
    "translations": {
      "en": "CONSIDER this divine writ, clear in itself and clearly showing the truth!",
      "ms": "Demi Al-Quran Kitab yang menerangkan kebenaran.",
      "id": "Demi Kitab (Al Quran) yang menjelaskan,",
      "ar": "وَٱلۡكِتَـٰبِ ٱلۡمُبِینِ\n"
    }
  },
  {
    "id": 4417,
    "surahId": 44,
    "ayahNumber": 3,
    "arabicText": "إِنَّاۤ أَنزَلۡنَـٰهُ فِی لَیۡلَةࣲ مُّبَـٰرَكَةٍۚ إِنَّا كُنَّا مُنذِرِینَ\n",
    "translations": {
      "en": "Behold, from on high have We bestowed it on a blessed night: for, verily, We have always been warning [man].",
      "ms": "Sesungguhnya Kami telah menurunkan Al-Quran itu pada malam yang berkat; (Kami berbuat demikian) kerana sesungguhnya Kami sentiasa memberi peringatan dan amaran (jangan hamba-hamba Kami ditimpa azab).",
      "id": "sesungguhnya Kami menurunkannya pada suatu malam yang diberkahi dan sesungguhnya Kami-lah yang memberi peringatan.",
      "ar": "إِنَّاۤ أَنزَلۡنَـٰهُ فِی لَیۡلَةࣲ مُّبَـٰرَكَةٍۚ إِنَّا كُنَّا مُنذِرِینَ\n"
    }
  },
  {
    "id": 4418,
    "surahId": 44,
    "ayahNumber": 4,
    "arabicText": "فِیهَا یُفۡرَقُ كُلُّ أَمۡرٍ حَكِیمٍ\n",
    "translations": {
      "en": "On that [night] was made clear, in wisdom, the distinction between all things [good and evil]",
      "ms": "(Kami menurunkan Al-Quran pada malam yang tersebut, kerana) pada malam yang berkat itu, dijelaskan (kepada malaikat) tiap-tiap perkara yang mengandungi hikmat serta tetap berlaku, (tidak berubah atau bertukar).",
      "id": "Pada malam itu dijelaskan segala urusan yang penuh hikmah,",
      "ar": "فِیهَا یُفۡرَقُ كُلُّ أَمۡرٍ حَكِیمٍ\n"
    }
  },
  {
    "id": 4419,
    "surahId": 44,
    "ayahNumber": 5,
    "arabicText": "أَمۡرࣰا مِّنۡ عِندِنَاۤۚ إِنَّا كُنَّا مُرۡسِلِینَ\n",
    "translations": {
      "en": "at a behest from Ourselves: for, verily, We have always been sending [Our messages of guidance]",
      "ms": "Iaitu perkara-perkara yang terbitnya dari hikmat kebijaksanaan Kami; sesungguhnya telah menjadi adat Kami mengutus Rasul.",
      "id": "(yaitu) urusan yang besar dari sisi Kami. Sesungguhnya Kami adalah Yang mengutus rasul-rasul,",
      "ar": "أَمۡرࣰا مِّنۡ عِندِنَاۤۚ إِنَّا كُنَّا مُرۡسِلِینَ\n"
    }
  },
  {
    "id": 4420,
    "surahId": 44,
    "ayahNumber": 6,
    "arabicText": "رَحۡمَةࣰ مِّن رَّبِّكَۚ إِنَّهُۥ هُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n",
    "translations": {
      "en": "in pur­suance of thy Sustainer’s grace [unto man]. Verily, He alone is all-hearing, all-knowing,",
      "ms": "(Untuk menyampaikan) rahmat dari Tuhanmu (kepada umat manusia); sesungguhnya Allah Jualah Yang Maha Mendengar, lagi Maha Mengetahui (akan segala keadaan hamba-hambaNya).",
      "id": "sebagai rahmat dari Tuhanmu. Sesungguhnya Dialah Yang Maha Mendengar lagi Maha Mengetahui,",
      "ar": "رَحۡمَةࣰ مِّن رَّبِّكَۚ إِنَّهُۥ هُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n"
    }
  },
  {
    "id": 4421,
    "surahId": 44,
    "ayahNumber": 7,
    "arabicText": "رَبِّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَمَا بَیۡنَهُمَاۤۖ إِن كُنتُم مُّوقِنِینَ\n",
    "translations": {
      "en": "the Sustainer of the heavens and the earth and all that is between them - if you could but grasp it with inner certainty!",
      "ms": "Tuhan (yang mencipta dan mentadbirkan keadaan) langit dan bumi serta segala yang ada di antara keduanya; kalau betul kamu orang-orang yang yakin (akan hakikat itu, maka terimalah sahaja apa yang diutuskan kepada kamu).",
      "id": "Tuhan Yang memelihara langit dan bumi dan apa yang ada di antara keduanya, jika kamu adalah orang yang meyakini.",
      "ar": "رَبِّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَمَا بَیۡنَهُمَاۤۖ إِن كُنتُم مُّوقِنِینَ\n"
    }
  },
  {
    "id": 4422,
    "surahId": 44,
    "ayahNumber": 8,
    "arabicText": "لَاۤ إِلَـٰهَ إِلَّا هُوَ یُحۡیِۦ وَیُمِیتُۖ رَبُّكُمۡ وَرَبُّ ءَابَاۤىِٕكُمُ ٱلۡأَوَّلِینَ\n",
    "translations": {
      "en": "There is no deity save Him: He grants life and deals death: He is your Sustainer as well as the Sustainer of your forebears of old.",
      "ms": "Tiada Tuhan yang berhak disembah melainkan Dia; Dia lah Yang menghidupkan dan Yang mematikan; (Dia lah jua) Tuhan kamu dan Tuhan datuk nenek kamu yang telah lalu.",
      "id": "Tidak ada Tuhan (yang berhak disembah) melainkan Dia, Yang menghidupkan dan Yang mematikan (Dialah) Tuhanmu dan Tuhan bapak-bapakmu yang terdahulu.",
      "ar": "لَاۤ إِلَـٰهَ إِلَّا هُوَ یُحۡیِۦ وَیُمِیتُۖ رَبُّكُمۡ وَرَبُّ ءَابَاۤىِٕكُمُ ٱلۡأَوَّلِینَ\n"
    }
  },
  {
    "id": 4423,
    "surahId": 44,
    "ayahNumber": 9,
    "arabicText": "بَلۡ هُمۡ فِی شَكࣲّ یَلۡعَبُونَ\n",
    "translations": {
      "en": "Nay, but they [who lack inner certainty] are but Dying with their doubts.",
      "ms": "(Mereka tidak meyakini kebenaran yang dijelaskan kepada mereka), bahkan mereka masih tenggelam dalam keraguan sambil bermain-main dengan perkara ugama.",
      "id": "Tetapi mereka bermain-main dalam keragu-raguan.",
      "ar": "بَلۡ هُمۡ فِی شَكࣲّ یَلۡعَبُونَ\n"
    }
  },
  {
    "id": 4424,
    "surahId": 44,
    "ayahNumber": 10,
    "arabicText": "فَٱرۡتَقِبۡ یَوۡمَ تَأۡتِی ٱلسَّمَاۤءُ بِدُخَانࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "WAIT, THEN, for the Day when the skies shall bring forth a pall of smoke which will make obvious [the approach of the Last Hour],",
      "ms": "Oleh itu tunggulah (wahai Muhammad) semasa langit membawa asap kemarau yang jelas nyata (yang menyebabkan kebuluran yang dahsyat),",
      "id": "Maka tunggulah hari ketika langit membawa kabut yang nyata,",
      "ar": "فَٱرۡتَقِبۡ یَوۡمَ تَأۡتِی ٱلسَّمَاۤءُ بِدُخَانࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 4425,
    "surahId": 44,
    "ayahNumber": 11,
    "arabicText": "یَغۡشَى ٱلنَّاسَۖ هَـٰذَا عَذَابٌ أَلِیمࣱ\n",
    "translations": {
      "en": "enveloping all mankind, [and causing the sinners to exclaim:] “Grievous is this suffering!",
      "ms": "Yang akan menimpa seluruh keadaan manusia (yang kafir itu, sehingga mereka akan berkata: \"Ini adalah azab yang sungguh menyakitkan\".",
      "id": "yang meliputi manusia. Inilah azab yang pedih.",
      "ar": "یَغۡشَى ٱلنَّاسَۖ هَـٰذَا عَذَابٌ أَلِیمࣱ\n"
    }
  },
  {
    "id": 4426,
    "surahId": 44,
    "ayahNumber": 12,
    "arabicText": "رَّبَّنَا ٱكۡشِفۡ عَنَّا ٱلۡعَذَابَ إِنَّا مُؤۡمِنُونَ\n",
    "translations": {
      "en": "O our Sustainer, relieve us of suffering, for, verily, we [now] believe [in Thee]!”",
      "ms": "(Pada saat itu mereka akan merayu dengan berkata): \"Wahai Tuhan kami! Hapuskanlah azab ini dari kami, sesungguhnya kami akan beriman!\".",
      "id": "(Mereka berdoa): \"Ya Tuhan kami, lenyapkanlah dari kami azab itu. Sesungguhnya kami akan beriman\".",
      "ar": "رَّبَّنَا ٱكۡشِفۡ عَنَّا ٱلۡعَذَابَ إِنَّا مُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 4427,
    "surahId": 44,
    "ayahNumber": 13,
    "arabicText": "أَنَّىٰ لَهُمُ ٱلذِّكۡرَىٰ وَقَدۡ جَاۤءَهُمۡ رَسُولࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "[But] how shall this remembrance avail them [at the Last Hour], seeing that an apostle had pre­viously come unto them, clearly expounding the truth,",
      "ms": "Bagaimana mereka dapat beringat (menyempurnakan janji mereka hendak beriman itu)? Pada hal mereka telah pun didatangi seorang Rasul yang memberi keterangan-keterangan (yang cukup untuk mereka beriman)!",
      "id": "Bagaimanakah mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan,",
      "ar": "أَنَّىٰ لَهُمُ ٱلذِّكۡرَىٰ وَقَدۡ جَاۤءَهُمۡ رَسُولࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 4428,
    "surahId": 44,
    "ayahNumber": 14,
    "arabicText": "ثُمَّ تَوَلَّوۡا۟ عَنۡهُ وَقَالُوا۟ مُعَلَّمࣱ مَّجۡنُونٌ\n",
    "translations": {
      "en": "whereupon they turned their backs on him and said, “Taught [by others] is he, a madman”?",
      "ms": "Sekalipun demikian, mereka juga berpaling ingkar daripada menerima keterangannya sambil berkata (sesama sendiri): \"Dia seorang yang diajar (oleh bangsa asing), dia juga seorang yang gila!\"",
      "id": "kemudian mereka berpaling daripadanya dan berkata: \"Dia adalah seorang yang menerima ajaran (dari orang lain) lagi pula seorang yang gila\".",
      "ar": "ثُمَّ تَوَلَّوۡا۟ عَنۡهُ وَقَالُوا۟ مُعَلَّمࣱ مَّجۡنُونٌ\n"
    }
  },
  {
    "id": 4429,
    "surahId": 44,
    "ayahNumber": 15,
    "arabicText": "إِنَّا كَاشِفُوا۟ ٱلۡعَذَابِ قَلِیلًاۚ إِنَّكُمۡ عَاۤىِٕدُونَ\n",
    "translations": {
      "en": "[Still,] behold, We shall postpone this suffer­ing for a little while, although you are bound to revert [to your evil ways: but]",
      "ms": "Sesungguhnya (kalaulah) kami hapuskan azab itu barang sedikitpun, sudah tentu kamu akan kembali (kufur ingkar).",
      "id": "Sesungguhnya (kalau) Kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar).",
      "ar": "إِنَّا كَاشِفُوا۟ ٱلۡعَذَابِ قَلِیلًاۚ إِنَّكُمۡ عَاۤىِٕدُونَ\n"
    }
  },
  {
    "id": 4430,
    "surahId": 44,
    "ayahNumber": 16,
    "arabicText": "یَوۡمَ نَبۡطِشُ ٱلۡبَطۡشَةَ ٱلۡكُبۡرَىٰۤ إِنَّا مُنتَقِمُونَ\n",
    "translations": {
      "en": "on the Day when We shall seize [all sinners] with a most mighty onslaught, We shall, verily, inflict Our retribution [on you as well]!",
      "ms": "(Ingatlah! Kalau kamu ulangi keingkaran kamu, kamu akan dibinasakan) semasa Kami timpakan (kamu dengan) paluan yang besar (dari pihak lawan kamu); sesungguhnya Kami tetap akan menyeksa (dengan azab yang seberat-beratnya).",
      "id": "(Ingatlah) hari (ketika) Kami menghantam mereka dengan hantaman yang keras. Sesungguhnya Kami adalah Pemberi balasan.",
      "ar": "یَوۡمَ نَبۡطِشُ ٱلۡبَطۡشَةَ ٱلۡكُبۡرَىٰۤ إِنَّا مُنتَقِمُونَ\n"
    }
  },
  {
    "id": 4431,
    "surahId": 44,
    "ayahNumber": 17,
    "arabicText": "۞ وَلَقَدۡ فَتَنَّا قَبۡلَهُمۡ قَوۡمَ فِرۡعَوۡنَ وَجَاۤءَهُمۡ رَسُولࣱ كَرِیمٌ\n",
    "translations": {
      "en": "AND, INDEED, [long] before their time did We try Pharaoh’s people [in the same way]: for there came unto them a noble apostle, [who said:]",
      "ms": "Dan demi Sesungguhnya! Sebelum mereka, Kami telah menguji kaum Firaun, dan merekapun telah didatangi oleh seorang Rasul (Nabi Musa) Yang mulia, -",
      "id": "Sesungguhnya sebelum mereka telah Kami uji kaum Fir'aun dan telah datang kepada mereka seorang rasul yang mulia,",
      "ar": "۞ وَلَقَدۡ فَتَنَّا قَبۡلَهُمۡ قَوۡمَ فِرۡعَوۡنَ وَجَاۤءَهُمۡ رَسُولࣱ كَرِیمٌ\n"
    }
  },
  {
    "id": 4432,
    "surahId": 44,
    "ayahNumber": 18,
    "arabicText": "أَنۡ أَدُّوۤا۟ إِلَیَّ عِبَادَ ٱللَّهِۖ إِنِّی لَكُمۡ رَسُولٌ أَمِینࣱ\n",
    "translations": {
      "en": "“Give in unto me, O God’s bondmen! Verily, I am an apostle [sent] unto you, worthy of trust!",
      "ms": "(Yang memberitahu kepada mereka dengan katanya): Berikanlah kepadaku wahai hamba-hamba Allah (apa-apa yang menandakan kamu menerima kerasulanku); sesungguhnya aku ini seorang Rasul yang amanah, yang diutuskan kepada kamu.",
      "id": "(dengan berkata): \"Serahkanlah kepadaku hamba-hamba Allah (Bani Israil yang kamu perbudak). Sesungguhnya aku adalah utusan (Allah) yang dipercaya kepadamu,",
      "ar": "أَنۡ أَدُّوۤا۟ إِلَیَّ عِبَادَ ٱللَّهِۖ إِنِّی لَكُمۡ رَسُولٌ أَمِینࣱ\n"
    }
  },
  {
    "id": 4433,
    "surahId": 44,
    "ayahNumber": 19,
    "arabicText": "وَأَن لَّا تَعۡلُوا۟ عَلَى ٱللَّهِۖ إِنِّیۤ ءَاتِیكُم بِسُلۡطَـٰنࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "“And exalt not yourselves against God: for, verily, I come unto you with a manifest authority [from Him];",
      "ms": "\"Dan janganlah kamu berlaku sombong takbur terhadap Allah; sesungguhnya aku ada membawa kepada kamu mukjizat yang jelas nyata.",
      "id": "dan janganlah kamu menyombongkan diri terhadap Allah. Sesungguhnya aku datang kepadamu dengan membawa bukti yang nyata.",
      "ar": "وَأَن لَّا تَعۡلُوا۟ عَلَى ٱللَّهِۖ إِنِّیۤ ءَاتِیكُم بِسُلۡطَـٰنࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 4434,
    "surahId": 44,
    "ayahNumber": 20,
    "arabicText": "وَإِنِّی عُذۡتُ بِرَبِّی وَرَبِّكُمۡ أَن تَرۡجُمُونِ\n",
    "translations": {
      "en": "and, behold, it is with my Sustainer - and your Sustainer - that I seek refuge against all your endeavours to revile me.",
      "ms": "\"Dan sesungguhnya aku telah memohon perlindungan kepada Tuhanku dan Tuhan kamu, daripada kamu merejam (atau menyakiti) daku.",
      "id": "Dan sesungguhnya aku berlindung kepada Tuhanku dan Tuhanmu, dari keinginanmu merajamku,",
      "ar": "وَإِنِّی عُذۡتُ بِرَبِّی وَرَبِّكُمۡ أَن تَرۡجُمُونِ\n"
    }
  },
  {
    "id": 4435,
    "surahId": 44,
    "ayahNumber": 21,
    "arabicText": "وَإِن لَّمۡ تُؤۡمِنُوا۟ لِی فَٱعۡتَزِلُونِ\n",
    "translations": {
      "en": "And if you do not believe me, [at least] stand away from me!”",
      "ms": "\"Dan sekiranya kamu tidak juga mahu berimankan kerasulanku, maka putuskanlah perhubungan kamu denganku (janganlah mengganggu daku).\"",
      "id": "dan jika kamu tidak beriman kepadaku maka biarkanlah aku (memimpin Bani Israil)\".",
      "ar": "وَإِن لَّمۡ تُؤۡمِنُوا۟ لِی فَٱعۡتَزِلُونِ\n"
    }
  },
  {
    "id": 4436,
    "surahId": 44,
    "ayahNumber": 22,
    "arabicText": "فَدَعَا رَبَّهُۥۤ أَنَّ هَـٰۤؤُلَاۤءِ قَوۡمࣱ مُّجۡرِمُونَ\n",
    "translations": {
      "en": "But then, [when they beset him with their enmity,] he called out to his Sustainer, “These are [indeed] people lost in sin!”",
      "ms": "(Setelah Nabi Musa berputus asa daripada iman mereka), maka ia pun merayu kepada Tuhannya lalu berkata: \"Sesungguhnya orang-orang ini adalah kaum yang berdosa, (yang telah sebati dengan kekufurannya, dan berhaklah mereka menerima balasan yang seburuk-buruknya)\".",
      "id": "Kemudian Musa berdoa kepada Tuhannya: \"Sesungguhnya mereka ini adalah kaum yang berdosa (segerakanlah azab kepada mereka)\".",
      "ar": "فَدَعَا رَبَّهُۥۤ أَنَّ هَـٰۤؤُلَاۤءِ قَوۡمࣱ مُّجۡرِمُونَ\n"
    }
  },
  {
    "id": 4437,
    "surahId": 44,
    "ayahNumber": 23,
    "arabicText": "فَأَسۡرِ بِعِبَادِی لَیۡلًا إِنَّكُم مُّتَّبَعُونَ\n",
    "translations": {
      "en": "And [God said]: “Go thou forth with My servants by night, for you will surely be pursued;",
      "ms": "Lalu (diperintahkan kepadanya): \"Bawalah hamba-hambaku (pengikut-pengikutmu) keluar pada waktu malam, kerana sesungguhnya kamu akan dikejar (oleh Firaun dan orang-orangnya).",
      "id": "(Allah berfirman): \"Maka berjalanlah kamu dengan membawa hamba-hamba-Ku pada malam hari, sesungguhnya kamu akan dikejar,",
      "ar": "فَأَسۡرِ بِعِبَادِی لَیۡلًا إِنَّكُم مُّتَّبَعُونَ\n"
    }
  },
  {
    "id": 4438,
    "surahId": 44,
    "ayahNumber": 24,
    "arabicText": "وَٱتۡرُكِ ٱلۡبَحۡرَ رَهۡوًاۖ إِنَّهُمۡ جُندࣱ مُّغۡرَقُونَ\n",
    "translations": {
      "en": "and leave the sea becalmed [between thee and Pharaoh’s men]: for, verily, they are a host destined to be drowned!”",
      "ms": "\"Dan tinggalkanlah laut itu dalam keadaan tenang - terbelah, kerana sesungguhnya mereka (yang mengejarmu itu) ialah tentera yang akan ditenggelamkan (sehingga binasa)\".",
      "id": "dan biarkanlah laut itu tetap terbelah. Sesungguhnya mereka adalah tentara yang akan ditenggelamkan\".",
      "ar": "وَٱتۡرُكِ ٱلۡبَحۡرَ رَهۡوًاۖ إِنَّهُمۡ جُندࣱ مُّغۡرَقُونَ\n"
    }
  },
  {
    "id": 4439,
    "surahId": 44,
    "ayahNumber": 25,
    "arabicText": "كَمۡ تَرَكُوا۟ مِن جَنَّـٰتࣲ وَعُیُونࣲ\n",
    "translations": {
      "en": "[And so they perished: and] how many gardens did they leave behind, and water-runnels,",
      "ms": "Banyak sungguh kebun-kebun dan matair, mereka tinggalkan,",
      "id": "Alangkah banyaknya taman dan mata air yang mereka tinggalkan,",
      "ar": "كَمۡ تَرَكُوا۟ مِن جَنَّـٰتࣲ وَعُیُونࣲ\n"
    }
  },
  {
    "id": 4440,
    "surahId": 44,
    "ayahNumber": 26,
    "arabicText": "وَزُرُوعࣲ وَمَقَامࣲ كَرِیمࣲ\n",
    "translations": {
      "en": "and fields of grain, and noble dwellings,",
      "ms": "Dan juga berbagai jenis tanaman serta tempat-tempat kediaman yang indah - mulia,",
      "id": "dan kebun-kebun serta tempat-tempat yang indah-indah,",
      "ar": "وَزُرُوعࣲ وَمَقَامࣲ كَرِیمࣲ\n"
    }
  },
  {
    "id": 4441,
    "surahId": 44,
    "ayahNumber": 27,
    "arabicText": "وَنَعۡمَةࣲ كَانُوا۟ فِیهَا فَـٰكِهِینَ\n",
    "translations": {
      "en": "and [all that] life of ease in which they used to delight!",
      "ms": "Dan juga kemewahan hidup, yang mereka sekian lama menikmatinya.",
      "id": "dan kesenangan-kesenangan yang mereka menikmatinya,",
      "ar": "وَنَعۡمَةࣲ كَانُوا۟ فِیهَا فَـٰكِهِینَ\n"
    }
  },
  {
    "id": 4442,
    "surahId": 44,
    "ayahNumber": 28,
    "arabicText": "كَذَ ٰ⁠لِكَۖ وَأَوۡرَثۡنَـٰهَا قَوۡمًا ءَاخَرِینَ\n",
    "translations": {
      "en": "Thus it was. And [then] We made another people heirs [to what they had left],",
      "ms": "Demikianlah keadaannya (hukum Kami ke atas orang-orang yang derhaka); dan Kami jadikan semua peninggalan Firaun dan orang-orangnya: milik kaum yang lain (kaum Bani Israil).",
      "id": "demikianlah. Dan Kami wariskan semua itu kepada kaum yang lain.",
      "ar": "كَذَ ٰ⁠لِكَۖ وَأَوۡرَثۡنَـٰهَا قَوۡمًا ءَاخَرِینَ\n"
    }
  },
  {
    "id": 4443,
    "surahId": 44,
    "ayahNumber": 29,
    "arabicText": "فَمَا بَكَتۡ عَلَیۡهِمُ ٱلسَّمَاۤءُ وَٱلۡأَرۡضُ وَمَا كَانُوا۟ مُنظَرِینَ\n",
    "translations": {
      "en": "and neither sky nor earth shed tears over them, nor were they allowed a respite.",
      "ms": "Mereka (ketika dibinasakan) itu tidak ditangisi oleh langit dan bumi (atau penduduk keduanya) dan mereka pula tidak diberi tempoh lagi.",
      "id": "Maka langit dan bumi tidak menangisi mereka dan merekapun tidak diberi tangguh.",
      "ar": "فَمَا بَكَتۡ عَلَیۡهِمُ ٱلسَّمَاۤءُ وَٱلۡأَرۡضُ وَمَا كَانُوا۟ مُنظَرِینَ\n"
    }
  },
  {
    "id": 4444,
    "surahId": 44,
    "ayahNumber": 30,
    "arabicText": "وَلَقَدۡ نَجَّیۡنَا بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ مِنَ ٱلۡعَذَابِ ٱلۡمُهِینِ\n",
    "translations": {
      "en": "And, indeed, We delivered the children of Israel from the shameful suffering",
      "ms": "Dan demi sesungguhnya! Kami telah selamatkan kaum Bani Israil, dari azab yang menghina, -",
      "id": "Dan sesungguhnya telah Kami selamatkan Bani Israil dari siksa yang menghinakan,",
      "ar": "وَلَقَدۡ نَجَّیۡنَا بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ مِنَ ٱلۡعَذَابِ ٱلۡمُهِینِ\n"
    }
  },
  {
    "id": 4445,
    "surahId": 44,
    "ayahNumber": 31,
    "arabicText": "مِن فِرۡعَوۡنَۚ إِنَّهُۥ كَانَ عَالِیࣰا مِّنَ ٱلۡمُسۡرِفِینَ\n",
    "translations": {
      "en": "[inflicted on them] by Pharaoh, seeing that he was truly outstand­ing among those who waste their own selves;",
      "ms": "Dari penindasan Firaun, sesungguhnya ia adalah seorang yang sombong takbur lagi terbilang dari orang-orang yang melampaui batas (dalam keganasan dan kekejamannya).",
      "id": "dari (azab) Fir'aun. Sesungguhnya dia adalah orang yang sombong, salah seorang dari orang-orang yang melampaui batas.",
      "ar": "مِن فِرۡعَوۡنَۚ إِنَّهُۥ كَانَ عَالِیࣰا مِّنَ ٱلۡمُسۡرِفِینَ\n"
    }
  },
  {
    "id": 4446,
    "surahId": 44,
    "ayahNumber": 32,
    "arabicText": "وَلَقَدِ ٱخۡتَرۡنَـٰهُمۡ عَلَىٰ عِلۡمٍ عَلَى ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "and indeed, We chose them knowingly above all other people,",
      "ms": "Dan demi sesungguhnya! Kami telah memilih mereka dengan berdasarkan pengetahuan (Kami) - menjadi lebih pangkatnya dari penduduk dunia (pada zaman itu),",
      "id": "Dan sesungguhnya telah Kami pilih mereka dengan pengetahuan (Kami) atas bangsa-bangsa.",
      "ar": "وَلَقَدِ ٱخۡتَرۡنَـٰهُمۡ عَلَىٰ عِلۡمٍ عَلَى ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 4447,
    "surahId": 44,
    "ayahNumber": 33,
    "arabicText": "وَءَاتَیۡنَـٰهُم مِّنَ ٱلۡـَٔایَـٰتِ مَا فِیهِ بَلَـٰۤؤࣱا۟ مُّبِینٌ\n",
    "translations": {
      "en": "and gave them such signs [of Our grace] as would clearly presage a test.",
      "ms": "Dan Kami berikan kepada mereka (melalui Nabi Musa) berbagai mukjizat yang mengandungi ujian yang jelas nyata (untuk melahirkan sikap mereka).",
      "id": "Dan Kami telah memberikan kepada mereka di antara tanda-tanda kekuasaan (Kami) sesuatu yang di dalamnya terdapat nikmat yang nyata.",
      "ar": "وَءَاتَیۡنَـٰهُم مِّنَ ٱلۡـَٔایَـٰتِ مَا فِیهِ بَلَـٰۤؤࣱا۟ مُّبِینٌ\n"
    }
  },
  {
    "id": 4448,
    "surahId": 44,
    "ayahNumber": 34,
    "arabicText": "إِنَّ هَـٰۤؤُلَاۤءِ لَیَقُولُونَ\n",
    "translations": {
      "en": "[Now,] behold, these [people] say indeed:",
      "ms": "(Berbalik kepada kisah kaum musyrik penduduk Makkah, Allah berfirman): \"Sesungguhnya mereka ini akan berkata (kepadamu - wahai Muhammad dan kepada pengikut-pengikutmu):",
      "id": "Sesungguhnya mereka (kaum musyrik) itu benar-benar berkata,",
      "ar": "إِنَّ هَـٰۤؤُلَاۤءِ لَیَقُولُونَ\n"
    }
  },
  {
    "id": 4449,
    "surahId": 44,
    "ayahNumber": 35,
    "arabicText": "إِنۡ هِیَ إِلَّا مَوۡتَتُنَا ٱلۡأُولَىٰ وَمَا نَحۡنُ بِمُنشَرِینَ\n",
    "translations": {
      "en": "“That [which is ahead of us] is but our first [and only] death, and we shall not be raised to life again.",
      "ms": "\"Mati, hanyalah mati kita yang pertama (di dunia), dan kita tidak sekali-kali akan dibangkitkan hidup lagi (sesudah itu);",
      "id": "\"tidak ada kematian selain kematian di dunia ini. Dan kami sekali-kali tidak akan dibangkitkan,",
      "ar": "إِنۡ هِیَ إِلَّا مَوۡتَتُنَا ٱلۡأُولَىٰ وَمَا نَحۡنُ بِمُنشَرِینَ\n"
    }
  },
  {
    "id": 4450,
    "surahId": 44,
    "ayahNumber": 36,
    "arabicText": "فَأۡتُوا۟ بِـَٔابَاۤىِٕنَاۤ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "So then, bring forth our forefathers [as witnesses], if what you claim is true!”",
      "ms": "\"(Jika tidak) maka bawakanlah datuk nenek kami (yang telah mati) kalau betul kamu orang-orang yang benar!\"",
      "id": "maka datangkanlah (kembali) bapak-bapak kami jika kamu memang orang-orang yang benar\".",
      "ar": "فَأۡتُوا۟ بِـَٔابَاۤىِٕنَاۤ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 4451,
    "surahId": 44,
    "ayahNumber": 37,
    "arabicText": "أَهُمۡ خَیۡرٌ أَمۡ قَوۡمُ تُبَّعࣲ وَٱلَّذِینَ مِن قَبۡلِهِمۡ أَهۡلَكۡنَـٰهُمۡۚ إِنَّهُمۡ كَانُوا۟ مُجۡرِمِینَ\n",
    "translations": {
      "en": "Are they, then, better than the people of Tubba and those before them, whom We destroyed because they were truly lost in [the same] sin?",
      "ms": "(Mengapa mereka masih berdegil dalam kekufurannya?) Adakah mereka yang lebih kekuatan dan kehandalannya atau kaum \"Tubba'\" dan orang-orang yang terdahulu dari mereka? Orang-orang itu semuanya Kami telah binasakan, kerana sesungguhnya mereka adalah orang-orang yang berdosa.",
      "id": "Apakah mereka (kaum musyrikin) yang lebih baik ataukah kaum Tubba' dan orang-orang yang sebelum mereka. Kami telah membinasakan mereka karena sesungguhnya mereka adalah orang-orang yang berdosa.",
      "ar": "أَهُمۡ خَیۡرٌ أَمۡ قَوۡمُ تُبَّعࣲ وَٱلَّذِینَ مِن قَبۡلِهِمۡ أَهۡلَكۡنَـٰهُمۡۚ إِنَّهُمۡ كَانُوا۟ مُجۡرِمِینَ\n"
    }
  },
  {
    "id": 4452,
    "surahId": 44,
    "ayahNumber": 38,
    "arabicText": "وَمَا خَلَقۡنَا ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَمَا بَیۡنَهُمَا لَـٰعِبِینَ\n",
    "translations": {
      "en": "For [thus it is:] We have not created the heavens and the earth and all that is between them in mere idle play:",
      "ms": "Dan tidaklah Kami menciptakan langit dan bumi serta segala yang ada di antara keduanya, secara main-main;",
      "id": "Dan Kami tidak menciptakan langit dan bumi dan apa yang ada antara keduanya dengan bermain-main.",
      "ar": "وَمَا خَلَقۡنَا ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَمَا بَیۡنَهُمَا لَـٰعِبِینَ\n"
    }
  },
  {
    "id": 4453,
    "surahId": 44,
    "ayahNumber": 39,
    "arabicText": "مَا خَلَقۡنَـٰهُمَاۤ إِلَّا بِٱلۡحَقِّ وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "none of this have We created without [an inner] truth: but most of them under­stand it not.",
      "ms": "Tidaklah Kami menciptakan keduanya (serta segala yang ada di antaranya) melainkan kerana menzahirkan perkara-perkara yang benar; akan tetapi kebanyakan mereka tidak mengetahui (hakikat itu).",
      "id": "Kami tidak menciptakan keduanya melainkan dengan haq, tetapi kebanyakan mereka tidak mengetahui.",
      "ar": "مَا خَلَقۡنَـٰهُمَاۤ إِلَّا بِٱلۡحَقِّ وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 4454,
    "surahId": 44,
    "ayahNumber": 40,
    "arabicText": "إِنَّ یَوۡمَ ٱلۡفَصۡلِ مِیقَـٰتُهُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "VERILY, the Day of Distinction [between the true and the false] is the term appointed for all of them:",
      "ms": "Sesungguhnya hari pemutusan hukum untuk memberi balasan, ialah masa untuk mereka semua berhimpun, -",
      "id": "Sesungguhnya hari keputusan (hari kiamat) itu adalah waktu yang dijanjikan bagi mereka semuanya,",
      "ar": "إِنَّ یَوۡمَ ٱلۡفَصۡلِ مِیقَـٰتُهُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 4455,
    "surahId": 44,
    "ayahNumber": 41,
    "arabicText": "یَوۡمَ لَا یُغۡنِی مَوۡلًى عَن مَّوۡلࣰى شَیۡـࣰٔا وَلَا هُمۡ یُنصَرُونَ\n",
    "translations": {
      "en": "the Day when no friend shall be of the least avail to his friend, and when none shall be succoured",
      "ms": "Iaitu hari seseorang kerabat atau sahabat karib tidak dapat memberikan sebarang perlindungan kepada seseorang kerabat atau sahabat karibnya, dan mereka pula tidak akan diberikan pertolongan (untuk menghapuskan azab itu),",
      "id": "yaitu hari yang seorang karib tidak dapat memberi manfaat kepada karibnya sedikitpun, dan mereka tidak akan mendapat pertolongan,",
      "ar": "یَوۡمَ لَا یُغۡنِی مَوۡلًى عَن مَّوۡلࣰى شَیۡـࣰٔا وَلَا هُمۡ یُنصَرُونَ\n"
    }
  },
  {
    "id": 4456,
    "surahId": 44,
    "ayahNumber": 42,
    "arabicText": "إِلَّا مَن رَّحِمَ ٱللَّهُۚ إِنَّهُۥ هُوَ ٱلۡعَزِیزُ ٱلرَّحِیمُ\n",
    "translations": {
      "en": "save those upon whom God will have bestowed His grace and mercy: for, verily, He alone is almighty, a dispenser of grace.",
      "ms": "Kecuali orang yang telah diberi rahmat oleh Allah; sesungguhnya Allah jualah yang Maha Kuasa, lagi Maha Mengasihani.",
      "id": "kecuali orang yang diberi rahmat oleh Allah. Sesungguhnya Dialah Yang Maha Perkasa lagi Maha Penyayang.",
      "ar": "إِلَّا مَن رَّحِمَ ٱللَّهُۚ إِنَّهُۥ هُوَ ٱلۡعَزِیزُ ٱلرَّحِیمُ\n"
    }
  },
  {
    "id": 4457,
    "surahId": 44,
    "ayahNumber": 43,
    "arabicText": "إِنَّ شَجَرَتَ ٱلزَّقُّومِ\n",
    "translations": {
      "en": "Verily, [in the life to come] the tree of deadly fruit",
      "ms": "(Ingatlah), sesungguhnya pokok Zaqqum, -",
      "id": "Sesungguhnya pohon zaqqum itu,",
      "ar": "إِنَّ شَجَرَتَ ٱلزَّقُّومِ\n"
    }
  },
  {
    "id": 4458,
    "surahId": 44,
    "ayahNumber": 44,
    "arabicText": "طَعَامُ ٱلۡأَثِیمِ\n",
    "translations": {
      "en": "will be the food of the sinful:",
      "ms": "(Buahnya) menjadi makanan bagi orang yang berdosa (dalam neraka).",
      "id": "makanan orang yang banyak berdosa.",
      "ar": "طَعَامُ ٱلۡأَثِیمِ\n"
    }
  },
  {
    "id": 4459,
    "surahId": 44,
    "ayahNumber": 45,
    "arabicText": "كَٱلۡمُهۡلِ یَغۡلِی فِی ٱلۡبُطُونِ\n",
    "translations": {
      "en": "like molten lead will it boil in the belly,",
      "ms": "(Makanan ini pula panas) seperti tembaga cair, mendidih dalam perut, -",
      "id": "(Ia) sebagai kotoran minyak yang mendidih di dalam perut,",
      "ar": "كَٱلۡمُهۡلِ یَغۡلِی فِی ٱلۡبُطُونِ\n"
    }
  },
  {
    "id": 4460,
    "surahId": 44,
    "ayahNumber": 46,
    "arabicText": "كَغَلۡیِ ٱلۡحَمِیمِ\n",
    "translations": {
      "en": "like the boiling of burning despair.",
      "ms": "Seperti mendidihnya air yang meluap-luap panasnya.",
      "id": "seperti mendidihnya air yang amat panas.",
      "ar": "كَغَلۡیِ ٱلۡحَمِیمِ\n"
    }
  },
  {
    "id": 4461,
    "surahId": 44,
    "ayahNumber": 47,
    "arabicText": "خُذُوهُ فَٱعۡتِلُوهُ إِلَىٰ سَوَاۤءِ ٱلۡجَحِیمِ\n",
    "translations": {
      "en": "[And the word will be spoken:] “Seize him, [O you forces of hell,] and drag him into the midst of the blazing fire:",
      "ms": "(Lalu diperintahkan kepada malaikat penjaga neraka): \"Renggutlah orang yang berdosa itu dan seretlah dia ke tengah-tengah neraka.",
      "id": "Peganglah dia kemudian seretlah dia ke tengah-tengah neraka.",
      "ar": "خُذُوهُ فَٱعۡتِلُوهُ إِلَىٰ سَوَاۤءِ ٱلۡجَحِیمِ\n"
    }
  },
  {
    "id": 4462,
    "surahId": 44,
    "ayahNumber": 48,
    "arabicText": "ثُمَّ صُبُّوا۟ فَوۡقَ رَأۡسِهِۦ مِنۡ عَذَابِ ٱلۡحَمِیمِ\n",
    "translations": {
      "en": "then pour over his head the anguish of burning despair!",
      "ms": "\"Kemudian curahkanlah di atas kepalanya - azab seksa - dari air panas yang menggelegak\".",
      "id": "Kemudian tuangkanlah di atas kepalanya siksaan (dari) air yang amat panas.",
      "ar": "ثُمَّ صُبُّوا۟ فَوۡقَ رَأۡسِهِۦ مِنۡ عَذَابِ ٱلۡحَمِیمِ\n"
    }
  },
  {
    "id": 4463,
    "surahId": 44,
    "ayahNumber": 49,
    "arabicText": "ذُقۡ إِنَّكَ أَنتَ ٱلۡعَزِیزُ ٱلۡكَرِیمُ\n",
    "translations": {
      "en": "Taste it - thou who [on earth] hast considered thyself so mighty, so noble!",
      "ms": "(Serta dikatakan kepadanya secara mengejek): \"Rasalah azab seksa, sebenarnya engkau adalah orang yang berpengaruh dan terhormat (dalam kalangan masyarakatmu)\"",
      "id": "Rasakanlah, sesungguhnya kamu orang yang perkasa lagi mulia.",
      "ar": "ذُقۡ إِنَّكَ أَنتَ ٱلۡعَزِیزُ ٱلۡكَرِیمُ\n"
    }
  },
  {
    "id": 4464,
    "surahId": 44,
    "ayahNumber": 50,
    "arabicText": "إِنَّ هَـٰذَا مَا كُنتُم بِهِۦ تَمۡتَرُونَ\n",
    "translations": {
      "en": "This is the very thing which you [deniers of the truth] were wont to call in question!”",
      "ms": "(Kemudian dikatakan kepada ahli neraka umumnya): \"Sesungguhnya inilah dia (azab seksa) yang kamu dahulu ragu-ragu terhadapnya!\"",
      "id": "Sesungguhnya ini adalah azab yang dahulu selalu kamu meragu-ragukannya.",
      "ar": "إِنَّ هَـٰذَا مَا كُنتُم بِهِۦ تَمۡتَرُونَ\n"
    }
  },
  {
    "id": 4465,
    "surahId": 44,
    "ayahNumber": 51,
    "arabicText": "إِنَّ ٱلۡمُتَّقِینَ فِی مَقَامٍ أَمِینࣲ\n",
    "translations": {
      "en": "[As against this -] verily, the God-conscious will find themselves in a state secure,",
      "ms": "Sesungguhnya orang-orang yang bertaqwa (akan ditempatkan) di tempat tinggal yang aman sentosa. -",
      "id": "Sesungguhnya orang-orang yang bertakwa berada dalam tempat yang aman,",
      "ar": "إِنَّ ٱلۡمُتَّقِینَ فِی مَقَامٍ أَمِینࣲ\n"
    }
  },
  {
    "id": 4466,
    "surahId": 44,
    "ayahNumber": 52,
    "arabicText": "فِی جَنَّـٰتࣲ وَعُیُونࣲ\n",
    "translations": {
      "en": "amid gardens and springs,",
      "ms": "Ia itu di dalam beberapa taman Syurga, dengan matair-matair terpancar padanya,",
      "id": "(yaitu) di dalam taman-taman dan mata-air-mata-air;",
      "ar": "فِی جَنَّـٰتࣲ وَعُیُونࣲ\n"
    }
  },
  {
    "id": 4467,
    "surahId": 44,
    "ayahNumber": 53,
    "arabicText": "یَلۡبَسُونَ مِن سُندُسࣲ وَإِسۡتَبۡرَقࣲ مُّتَقَـٰبِلِینَ\n",
    "translations": {
      "en": "wearing [garments] of silk and brocade, facing one another [in love].",
      "ms": "Mereka memakai pakaian dari kain sutera yang halus dan kain sutera tebal yang bersulam; (mereka duduk di tempat perhimpunan) sentiasa berhadap-hadapan (di atas pelamin masing-masing).",
      "id": "mereka memakai sutera yang halus dan sutera yang tebal, (duduk) berhadap-hadapan,",
      "ar": "یَلۡبَسُونَ مِن سُندُسࣲ وَإِسۡتَبۡرَقࣲ مُّتَقَـٰبِلِینَ\n"
    }
  },
  {
    "id": 4468,
    "surahId": 44,
    "ayahNumber": 54,
    "arabicText": "كَذَ ٰ⁠لِكَ وَزَوَّجۡنَـٰهُم بِحُورٍ عِینࣲ\n",
    "translations": {
      "en": "Thus shall it be. And We shall pair them with companions pure, most beautiful of eye.",
      "ms": "Demikianlah keadaannya; dan Kami jadikan kawan teman mereka bidadari-bidadari yang putih melepak, lagi luas cantik matanya.",
      "id": "demikianlah. Dan Kami berikan kepada mereka bidadari.",
      "ar": "كَذَ ٰ⁠لِكَ وَزَوَّجۡنَـٰهُم بِحُورٍ عِینࣲ\n"
    }
  },
  {
    "id": 4469,
    "surahId": 44,
    "ayahNumber": 55,
    "arabicText": "یَدۡعُونَ فِیهَا بِكُلِّ فَـٰكِهَةٍ ءَامِنِینَ\n",
    "translations": {
      "en": "In that [paradise] they shall [rightfully] claim all the fruits [of their past deeds], resting in security;",
      "ms": "Mereka meminta - di dalam Syurga itu - tiap-tiap jenis buah-buahan (yang mereka ingini), dalam keadaan aman sentosa.",
      "id": "Di dalamnya mereka meminta segala macam buah-buahan dengan aman (dari segala kekhawatiran),",
      "ar": "یَدۡعُونَ فِیهَا بِكُلِّ فَـٰكِهَةٍ ءَامِنِینَ\n"
    }
  },
  {
    "id": 4470,
    "surahId": 44,
    "ayahNumber": 56,
    "arabicText": "لَا یَذُوقُونَ فِیهَا ٱلۡمَوۡتَ إِلَّا ٱلۡمَوۡتَةَ ٱلۡأُولَىٰۖ وَوَقَىٰهُمۡ عَذَابَ ٱلۡجَحِیمِ\n",
    "translations": {
      "en": "and neither shall they taste death there after having passed through their erstwhile death. Thus will He have preserved them from all suffer­ing through the blazing fire-",
      "ms": "Mereka tidak merasai kematian dalam Syurga itu selain daripada mati yang mereka rasai (di dunia) dahulu; dan Allah selamatkan mereka dari azab neraka;",
      "id": "mereka tidak akan merasakan mati di dalamnya kecuali mati di dunia. Dan Allah memelihara mereka dari azab neraka,",
      "ar": "لَا یَذُوقُونَ فِیهَا ٱلۡمَوۡتَ إِلَّا ٱلۡمَوۡتَةَ ٱلۡأُولَىٰۖ وَوَقَىٰهُمۡ عَذَابَ ٱلۡجَحِیمِ\n"
    }
  },
  {
    "id": 4471,
    "surahId": 44,
    "ayahNumber": 57,
    "arabicText": "فَضۡلࣰا مِّن رَّبِّكَۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n",
    "translations": {
      "en": "an act of thy Sustainer’s favour: and that, that will be the triumph supreme!",
      "ms": "(Mereka diberikan semuanya itu) sebagai limpah kurnia dari Tuhanmu (wahai Muhammad); yang demikian itulah kemenangan yang besar.",
      "id": "sebagai karunia dari Tuhanmu. Yang demikian itu adalah keberuntungan yang besar.",
      "ar": "فَضۡلࣰا مِّن رَّبِّكَۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n"
    }
  },
  {
    "id": 4472,
    "surahId": 44,
    "ayahNumber": 58,
    "arabicText": "فَإِنَّمَا یَسَّرۡنَـٰهُ بِلِسَانِكَ لَعَلَّهُمۡ یَتَذَكَّرُونَ\n",
    "translations": {
      "en": "THUS, THEN, [O Prophet,] have We made this [divine writ] easy to understand, in thine own [human] tongue, so that men might take it to heart.",
      "ms": "Maka sesungguhnya tujuan Kami memudahkan Al-Quran dengan bahasamu (wahai Muhammad), ialah supaya mereka (yang memahaminya) beringat dan insaf (untuk beriman dan mematuhinya).",
      "id": "Sesungguhnya Kami mudahkan Al Quran itu dengan bahasamu supaya mereka mendapat pelajaran.",
      "ar": "فَإِنَّمَا یَسَّرۡنَـٰهُ بِلِسَانِكَ لَعَلَّهُمۡ یَتَذَكَّرُونَ\n"
    }
  },
  {
    "id": 4473,
    "surahId": 44,
    "ayahNumber": 59,
    "arabicText": "فَٱرۡتَقِبۡ إِنَّهُم مُّرۡتَقِبُونَ\n",
    "translations": {
      "en": "So wait thou [for what the future will bring]: behold, they, too, are waiting.",
      "ms": "(Kiranya mereka tidak berbuat demikian) maka tunggulah (wahai Muhammad akan kesudahan mereka), sesungguhnya mereka juga menunggu (akan kesudahanmu).",
      "id": "Maka tunggulah; sesungguhnya mereka itu menunggu (pula).",
      "ar": "فَٱرۡتَقِبۡ إِنَّهُم مُّرۡتَقِبُونَ\n"
    }
  }
]