[
  {
    "id": 4134,
    "surahId": 40,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ حمۤ\n",
    "translations": {
      "en": "Ha. Mim.",
      "ms": "Haa, Miim.",
      "id": "Haa Miim.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ حمۤ\n"
    }
  },
  {
    "id": 4135,
    "surahId": 40,
    "ayahNumber": 2,
    "arabicText": "تَنزِیلُ ٱلۡكِتَـٰبِ مِنَ ٱللَّهِ ٱلۡعَزِیزِ ٱلۡعَلِیمِ\n",
    "translations": {
      "en": "THE BESTOWAL from on high of this divine writ issues from God, the Almighty, the All-Know­ing,",
      "ms": "Turunnya Al-Quran ini dari Allah Yang Maha Kuasa, lagi Maha Mengetahui;",
      "id": "Diturunkan Kitab ini (Al Quran) dari Allah Yang Maha Perkasa lagi Maha Mengetahui,",
      "ar": "تَنزِیلُ ٱلۡكِتَـٰبِ مِنَ ٱللَّهِ ٱلۡعَزِیزِ ٱلۡعَلِیمِ\n"
    }
  },
  {
    "id": 4136,
    "surahId": 40,
    "ayahNumber": 3,
    "arabicText": "غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوۡبِ شَدِیدِ ٱلۡعِقَابِ ذِی ٱلطَّوۡلِۖ لَاۤ إِلَـٰهَ إِلَّا هُوَۖ إِلَیۡهِ ٱلۡمَصِیرُ\n",
    "translations": {
      "en": "forgiving sins and accepting repentance, severe in retribution, limitless in His bounty. There is no deity save Him: with Him is all jour­neys’ end.",
      "ms": "Yang Mengampunkan dosa, dan Yang Menerima taubat; Yang Berat azabNya; Yang Melimpah-limpah kurniaNya; tiada Tuhan melainkan Dia; kepadaNyalah tempat kembali.",
      "id": "Yang Mengampuni dosa dan Menerima taubat lagi keras hukuman-Nya. Yang mempunyai karunia. Tiada Tuhan (yang berhak disembah) selain Dia. Hanya kepada-Nya-lah kembali (semua makhluk).",
      "ar": "غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوۡبِ شَدِیدِ ٱلۡعِقَابِ ذِی ٱلطَّوۡلِۖ لَاۤ إِلَـٰهَ إِلَّا هُوَۖ إِلَیۡهِ ٱلۡمَصِیرُ\n"
    }
  },
  {
    "id": 4137,
    "surahId": 40,
    "ayahNumber": 4,
    "arabicText": "مَا یُجَـٰدِلُ فِیۤ ءَایَـٰتِ ٱللَّهِ إِلَّا ٱلَّذِینَ كَفَرُوا۟ فَلَا یَغۡرُرۡكَ تَقَلُّبُهُمۡ فِی ٱلۡبِلَـٰدِ\n",
    "translations": {
      "en": "NONE BUT THOSE who are bent on denying the truth would call God’s messages in question. But let it not deceive thee that they seem to be able to do as they please on earth:",
      "ms": "Tidak ada yang membantah mengenai ayat-ayat Allah melainkan orang-orang yang kafir. Oleh itu janganlah engkau (wahai Muhammad) diperdayakan oleh kebebasan mereka bergerak dengan berulang alik dari sebuah bandar ke bandar yang lain.",
      "id": "Tidak ada yang memperdebatkan tentang ayat-ayat Allah, kecuali orang-orang yang kafir. Karena itu janganlah pulang balik mereka dengan bebas dari suatu kota ke kota yang lain memperdayakan kamu.",
      "ar": "مَا یُجَـٰدِلُ فِیۤ ءَایَـٰتِ ٱللَّهِ إِلَّا ٱلَّذِینَ كَفَرُوا۟ فَلَا یَغۡرُرۡكَ تَقَلُّبُهُمۡ فِی ٱلۡبِلَـٰدِ\n"
    }
  },
  {
    "id": 4138,
    "surahId": 40,
    "ayahNumber": 5,
    "arabicText": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحࣲ وَٱلۡأَحۡزَابُ مِنۢ بَعۡدِهِمۡۖ وَهَمَّتۡ كُلُّ أُمَّةِۭ بِرَسُولِهِمۡ لِیَأۡخُذُوهُۖ وَجَـٰدَلُوا۟ بِٱلۡبَـٰطِلِ لِیُدۡحِضُوا۟ بِهِ ٱلۡحَقَّ فَأَخَذۡتُهُمۡۖ فَكَیۡفَ كَانَ عِقَابِ\n",
    "translations": {
      "en": "to the truth gave the lie, before their time, the people of Noah and, after them, all those [others] who were leagued together [against God’s message-bearers]; and each of those com­munities schemed against the apostle sent unto them, aiming to lay hands on him; and they contended [against his message] with fallacious arguments, so as to render void the truth thereby: but then I took them to task - and how awesome was My retribution!",
      "ms": "Sebelum mereka, kaum Nabi Nuh dan puak-puak yang bergabung - sesudah kaum Nabi Nuh itu - telah mendustakan (Rasul-rasulnya), dan tiap-tiap umat di antaranya telah merancangkan rancangan jahat terhadap Rasul mereka untuk menawannya (dan membinasakannya); dan mereka pula telah membantah dengan perkara yang salah untuk menghapuskan kebenaran dengan perkara yang salah itu; sebab itu Aku binasakan mereka. Maka (lihatlah) bagaimana kesan azabKu!",
      "id": "Sebelum mereka, kaum Nuh dan golongan-golongan yang bersekutu sesudah mereka telah mendustakan (rasul) dan tiap-tiap umat telah merencanakan makar terhadap rasul mereka untuk menawannya dan mereka membantah dengan (alasan) yang batil untuk melenyapkan kebenaran dengan yang batil itu; karena itu Aku azab mereka. Maka betapa (pedihnya) azab-Ku?",
      "ar": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحࣲ وَٱلۡأَحۡزَابُ مِنۢ بَعۡدِهِمۡۖ وَهَمَّتۡ كُلُّ أُمَّةِۭ بِرَسُولِهِمۡ لِیَأۡخُذُوهُۖ وَجَـٰدَلُوا۟ بِٱلۡبَـٰطِلِ لِیُدۡحِضُوا۟ بِهِ ٱلۡحَقَّ فَأَخَذۡتُهُمۡۖ فَكَیۡفَ كَانَ عِقَابِ\n"
    }
  },
  {
    "id": 4139,
    "surahId": 40,
    "ayahNumber": 6,
    "arabicText": "وَكَذَ ٰ⁠لِكَ حَقَّتۡ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِینَ كَفَرُوۤا۟ أَنَّهُمۡ أَصۡحَـٰبُ ٱلنَّارِ\n",
    "translations": {
      "en": "And thus shall thy Sustainer’s word come true against all who are bent on denying the truth: they shall find themselves in the fire [of hell].",
      "ms": "Dan demikianlah juga tetapnya hukuman Tuhanmu terhadap orang-orang yang kafir, kerana sesungguhnya mereka ialah ahli neraka.",
      "id": "Dan demikianlah telah pasti berlaku ketetapan azab Tuhanmu terhadap orang-orang kafir, karena sesungguhnya mereka adalah penghuni neraka.",
      "ar": "وَكَذَ ٰ⁠لِكَ حَقَّتۡ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِینَ كَفَرُوۤا۟ أَنَّهُمۡ أَصۡحَـٰبُ ٱلنَّارِ\n"
    }
  },
  {
    "id": 4140,
    "surahId": 40,
    "ayahNumber": 7,
    "arabicText": "ٱلَّذِینَ یَحۡمِلُونَ ٱلۡعَرۡشَ وَمَنۡ حَوۡلَهُۥ یُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَیُؤۡمِنُونَ بِهِۦ وَیَسۡتَغۡفِرُونَ لِلَّذِینَ ءَامَنُوا۟ۖ رَبَّنَا وَسِعۡتَ كُلَّ شَیۡءࣲ رَّحۡمَةࣰ وَعِلۡمࣰا فَٱغۡفِرۡ لِلَّذِینَ تَابُوا۟ وَٱتَّبَعُوا۟ سَبِیلَكَ وَقِهِمۡ عَذَابَ ٱلۡجَحِیمِ\n",
    "translations": {
      "en": "THEY WHO BEAR [within themselves the knowl­edge of] the throne of [God’s] almightiness, as well as all who are near it, extol their Sustainer’s limitless glory and praise, and have faith in Him, and ask forgiveness for all [others] who have attained to faith: “O our Sustainer! Thou embracest all things within [Thy] grace and knowledge: forgive, then, their sins unto those who repent and follow Thy path, and preserve them from suffering through the blazing fire!",
      "ms": "Malaikat yang memikul Arasy dan malaikat yang berada di sekelilingnya, bertasbih memuji TuhanNya; dan beriman kepadaNya; serta mereka memohon ampun bagi orang-orang yang beriman (dengan berdoa merayu): \"Wahai Tuhan kami! RahmatMu dan IlmuMu meliputi segala-galanya; maka berilah ampun kepada orang-orang yang bertaubat serta menurut jalanMu, dan peliharalah mereka dari azab neraka.",
      "id": "(Malaikat-malaikat) yang memikul 'Arsy dan malaikat yang berada di sekelilingnya bertasbih memuji Tuhannya dan mereka beriman kepada-Nya serta memintakan ampun bagi orang-orang yang beriman (seraya mengucapkan): \"Ya Tuhan kami, rahmat dan ilmu Engkau meliputi segala sesuatu, maka berilah ampunan kepada orang-orang yang bertaubat dan mengikuti jalan Engkau dan peliharalah mereka dari siksaan neraka yang menyala-nyala,",
      "ar": "ٱلَّذِینَ یَحۡمِلُونَ ٱلۡعَرۡشَ وَمَنۡ حَوۡلَهُۥ یُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَیُؤۡمِنُونَ بِهِۦ وَیَسۡتَغۡفِرُونَ لِلَّذِینَ ءَامَنُوا۟ۖ رَبَّنَا وَسِعۡتَ كُلَّ شَیۡءࣲ رَّحۡمَةࣰ وَعِلۡمࣰا فَٱغۡفِرۡ لِلَّذِینَ تَابُوا۟ وَٱتَّبَعُوا۟ سَبِیلَكَ وَقِهِمۡ عَذَابَ ٱلۡجَحِیمِ\n"
    }
  },
  {
    "id": 4141,
    "surahId": 40,
    "ayahNumber": 8,
    "arabicText": "رَبَّنَا وَأَدۡخِلۡهُمۡ جَنَّـٰتِ عَدۡنٍ ٱلَّتِی وَعَدتَّهُمۡ وَمَن صَلَحَ مِنۡ ءَابَاۤىِٕهِمۡ وَأَزۡوَ ٰ⁠جِهِمۡ وَذُرِّیَّـٰتِهِمۡۚ إِنَّكَ أَنتَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n",
    "translations": {
      "en": "“And, O our Sustainer, bring them into the gardens of perpetual bliss which Thou hast promised them, together with the righteous from among their forebears, and their spouses, and their offspring - for, verily, Thou alone art almighty, truly wise –",
      "ms": "\"Wahai Tuhan kami! Dan masukkanlah mereka ke dalam Syurga \"Adn\" yang Engkau telah janjikan kepada mereka; dan (masukkanlah bersama-sama mereka): orang-orang yang layak di antara ibu bapa mereka, dan isteri-isteri mereka, serta keturunan mereka. Sesungguhnya Engkaulah jua Yang Maha Kuasa, lagi Maha Bijaksana.",
      "id": "ya Tuhan kami, dan masukkanlah mereka ke dalam surga 'Adn yang telah Engkau janjikan kepada mereka dan orang-orang yang saleh di antara bapak-bapak mereka, dan isteri-isteri mereka, dan keturunan mereka semua. Sesungguhnya Engkaulah Yang Maha Perkasa lagi Maha Bijaksana,",
      "ar": "رَبَّنَا وَأَدۡخِلۡهُمۡ جَنَّـٰتِ عَدۡنٍ ٱلَّتِی وَعَدتَّهُمۡ وَمَن صَلَحَ مِنۡ ءَابَاۤىِٕهِمۡ وَأَزۡوَ ٰ⁠جِهِمۡ وَذُرِّیَّـٰتِهِمۡۚ إِنَّكَ أَنتَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n"
    }
  },
  {
    "id": 4142,
    "surahId": 40,
    "ayahNumber": 9,
    "arabicText": "وَقِهِمُ ٱلسَّیِّـَٔاتِۚ وَمَن تَقِ ٱلسَّیِّـَٔاتِ یَوۡمَىِٕذࣲ فَقَدۡ رَحِمۡتَهُۥۚ وَذَ ٰ⁠لِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n",
    "translations": {
      "en": "and preserve them from [doing] evil deeds: for anyone whom on that Day [of Judgment] Thou wilt have preserved from [the taint of] evil deeds, him wilt Thou have graced with Thy mercy: and that, that will be the triumph supreme!”",
      "ms": "\"Dan peliharalah mereka dari (balasan) kejahatan-kejahatan (yang dilakukannya); dan (sebenarnya) sesiapa yang Engkau pelihara pada hari itu dari terkena (balasan) kejahatan-kejahatan (yang dilakukannya) maka sesungguhnya Engkau telah mengurniakan rahmat kepadanya; dan yang demikian itulah kemenangan yang besar (nilainya)\".",
      "id": "dan peliharalah mereka dari (balasan) kejahatan. Dan orang-orang yang Engkau pelihara dari (pembalasan) kejahatan pada hari itu maka sesungguhnya telah Engkau anugerahkan rahmat kepadanya dan itulah kemenangan yang besar\".",
      "ar": "وَقِهِمُ ٱلسَّیِّـَٔاتِۚ وَمَن تَقِ ٱلسَّیِّـَٔاتِ یَوۡمَىِٕذࣲ فَقَدۡ رَحِمۡتَهُۥۚ وَذَ ٰ⁠لِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n"
    }
  },
  {
    "id": 4143,
    "surahId": 40,
    "ayahNumber": 10,
    "arabicText": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ یُنَادَوۡنَ لَمَقۡتُ ٱللَّهِ أَكۡبَرُ مِن مَّقۡتِكُمۡ أَنفُسَكُمۡ إِذۡ تُدۡعَوۡنَ إِلَى ٱلۡإِیمَـٰنِ فَتَكۡفُرُونَ\n",
    "translations": {
      "en": "[But,] behold, as for those who are bent on denying the truth - [on that same Day] a voice will call out unto them: “Indeed, greater than your [present] loathing of yourselves was God’s loathing of you [at the time] when you were called unto faith but went on denying the truth!”",
      "ms": "Sesungguhnya orang-orang yang kafir akan dipanggil dan dikatakan kepada mereka (pada hari kiamat): \"Demi sesungguhnya! Kebencian Allah (kepada kamu) lebih besar daripada kebencian kamu kepada diri sendiri, (sebabnya kerana) semasa kamu diseru dan diajak (di dunia dahulu) supaya beriman, (kamu enggan dan menolak), lalu kamu terus berkeadaan kufur\".",
      "id": "Sesungguhnya orang-orang yang kafir diserukan kepada mereka (pada hari kiamat): \"Sesungguhnya kebencian Allah (kepadamu) lebih besar daripada kebencianmu kepada dirimu sendiri karena kamu diseru untuk beriman lalu kamu kafir\".",
      "ar": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ یُنَادَوۡنَ لَمَقۡتُ ٱللَّهِ أَكۡبَرُ مِن مَّقۡتِكُمۡ أَنفُسَكُمۡ إِذۡ تُدۡعَوۡنَ إِلَى ٱلۡإِیمَـٰنِ فَتَكۡفُرُونَ\n"
    }
  },
  {
    "id": 4144,
    "surahId": 40,
    "ayahNumber": 11,
    "arabicText": "قَالُوا۟ رَبَّنَاۤ أَمَتَّنَا ٱثۡنَتَیۡنِ وَأَحۡیَیۡتَنَا ٱثۡنَتَیۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجࣲ مِّن سَبِیلࣲ\n",
    "translations": {
      "en": "[Whereupon] they will exclaim: “O our Sus­tainer! Twice hast Thou caused us to die, just as twice Thou hast brought us to life!",
      "ms": "Mereka menjawab: \"Wahai Tuhan kami! Engkau telah menjadikan kami berkeadaan mati dua kali, dan telah menjadikan kami bersifat hidup dua kali, maka kami (sekarang) mengakui akan dosa-dosa kami. Oleh itu adakah sebarang jalan untuk (kami) keluar (dari neraka)?\"",
      "id": "Mereka menjawab: \"Ya Tuhan kami Engkau telah mematikan kami dua kali dan telah menghidupkan kami dua kali (pula), lalu kami mengakui dosa-dosa kami. Maka adakah sesuatu jalan (bagi kami) untuk keluar (dari neraka)?\"",
      "ar": "قَالُوا۟ رَبَّنَاۤ أَمَتَّنَا ٱثۡنَتَیۡنِ وَأَحۡیَیۡتَنَا ٱثۡنَتَیۡنِ فَٱعۡتَرَفۡنَا بِذُنُوبِنَا فَهَلۡ إِلَىٰ خُرُوجࣲ مِّن سَبِیلࣲ\n"
    }
  },
  {
    "id": 4145,
    "surahId": 40,
    "ayahNumber": 12,
    "arabicText": "ذَ ٰ⁠لِكُم بِأَنَّهُۥۤ إِذَا دُعِیَ ٱللَّهُ وَحۡدَهُۥ كَفَرۡتُمۡ وَإِن یُشۡرَكۡ بِهِۦ تُؤۡمِنُوا۟ۚ فَٱلۡحُكۡمُ لِلَّهِ ٱلۡعَلِیِّ ٱلۡكَبِیرِ\n",
    "translations": {
      "en": "[And they will be told:] “This [has befallen you] because, whenever the One God was invoked, you denied this truth; whereas, when divinity was ascribed to aught beside Him, you believed [in it]! But all judgment rests with God, the Exalted, the Great!”",
      "ms": "(Lalu dikatakan kepada mereka): \"Azab yang kamu berada padanya itu adalah kerana keadaan kamu apabila Allah Yang Maha Esa sahaja diseru dan disembah, kamu kufur (dan menolak cara bertauhid itu); dan apabila dipersekutukan sesuatu dengan Allah, kamu percaya (dan menerima bawaan syirik itu). Maka kuasa menjalankan keadilan adalah hak Allah, Yang Maha Tinggi (dari apa yang dipersekutukan), lagi Yang Maha Besar (pemerintahanNya)\".",
      "id": "Yang demikian itu adalah karena kamu kafir apabila Allah saja disembah. Dan kamu percaya apabila Allah dipersekutukan. Maka putusan (sekarang ini) adalah pada Allah Yang Maha Tinggi lagi Maha Besar.",
      "ar": "ذَ ٰ⁠لِكُم بِأَنَّهُۥۤ إِذَا دُعِیَ ٱللَّهُ وَحۡدَهُۥ كَفَرۡتُمۡ وَإِن یُشۡرَكۡ بِهِۦ تُؤۡمِنُوا۟ۚ فَٱلۡحُكۡمُ لِلَّهِ ٱلۡعَلِیِّ ٱلۡكَبِیرِ\n"
    }
  },
  {
    "id": 4146,
    "surahId": 40,
    "ayahNumber": 13,
    "arabicText": "هُوَ ٱلَّذِی یُرِیكُمۡ ءَایَـٰتِهِۦ وَیُنَزِّلُ لَكُم مِّنَ ٱلسَّمَاۤءِ رِزۡقࣰاۚ وَمَا یَتَذَكَّرُ إِلَّا مَن یُنِیبُ\n",
    "translations": {
      "en": "HE IT IS who shows you His wonders [in all nature], and sends down sustenance for you from the sky: but none bethinks himself [thereof] save those who are wont to turn to God.",
      "ms": "Dia lah Tuhan yang memperlihatkan kepada kamu tanda-tanda keesaanNya dan kekuasaanNya (untuk kehidupan rohani kamu), dan yang menurunkan (untuk jasmani kamu) sebab-sebab rezeki dari langit. Dan tiadalah yang ingat serta mengambil pelajaran (dari yang demikian) melainkan orang yang sentiasa bertumpu (kepada Allah).",
      "id": "Dialah yang memperlihatkan kepadamu tanda-tanda (kekuasaan)-Nya dan menurunkan untukmu rezeki dari langit. Dan tiadalah mendapat pelajaran kecuali orang-orang yang kembali (kepada Allah).",
      "ar": "هُوَ ٱلَّذِی یُرِیكُمۡ ءَایَـٰتِهِۦ وَیُنَزِّلُ لَكُم مِّنَ ٱلسَّمَاۤءِ رِزۡقࣰاۚ وَمَا یَتَذَكَّرُ إِلَّا مَن یُنِیبُ\n"
    }
  },
  {
    "id": 4147,
    "surahId": 40,
    "ayahNumber": 14,
    "arabicText": "فَٱدۡعُوا۟ ٱللَّهَ مُخۡلِصِینَ لَهُ ٱلدِّینَ وَلَوۡ كَرِهَ ٱلۡكَـٰفِرُونَ\n",
    "translations": {
      "en": "Invoke, then, God, sincere in your faith in Him alone, however hateful this may be to those who deny the truth!",
      "ms": "Oleh itu maka sembahlah kamu akan Allah dengan mengikhlaskan ibadat kepadaNya (dan menjauhi bawaan syirik), sekalipun orang-orang kafir tidak menyukai (amalan kamu yang demikian).",
      "id": "Maka sembahlah Allah dengan memurnikan ibadat kepada-Nya, meskipun orang-orang kafir tidak menyukai(nya).",
      "ar": "فَٱدۡعُوا۟ ٱللَّهَ مُخۡلِصِینَ لَهُ ٱلدِّینَ وَلَوۡ كَرِهَ ٱلۡكَـٰفِرُونَ\n"
    }
  },
  {
    "id": 4148,
    "surahId": 40,
    "ayahNumber": 15,
    "arabicText": "رَفِیعُ ٱلدَّرَجَـٰتِ ذُو ٱلۡعَرۡشِ یُلۡقِی ٱلرُّوحَ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن یَشَاۤءُ مِنۡ عِبَادِهِۦ لِیُنذِرَ یَوۡمَ ٱلتَّلَاقِ\n",
    "translations": {
      "en": "High above all orders [of being] is He, in almightiness enthroned. By His Own will does He bestow inspiration upon whomever He wills of His servants, so as to warn [all human beings of the coming] of the Day when they shall meet Him",
      "ms": "Dia lah Yang Maha tinggi darjat kebesaranNya, yang mempunyai Arasy (yang melambangkan keagungan dan kekuasaanNya); Ia memberikan wahyu dari hal perintahNya kepada sesiapa yang dikehendakiNya di antara hamba-hambaNya (yang telah dipilih menjadi RasulNya), supaya Ia memberi amaran (kepada manusia) tentang hari pertemuan,",
      "id": "(Dialah) Yang Maha Tinggi derajat-Nya, Yang mempunyai 'Arsy, Yang mengutus Jibril dengan (membawa) perintah-Nya kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya, supaya dia memperingatkan (manusia) tentang hari pertemuan (hari kiamat).",
      "ar": "رَفِیعُ ٱلدَّرَجَـٰتِ ذُو ٱلۡعَرۡشِ یُلۡقِی ٱلرُّوحَ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن یَشَاۤءُ مِنۡ عِبَادِهِۦ لِیُنذِرَ یَوۡمَ ٱلتَّلَاقِ\n"
    }
  },
  {
    "id": 4149,
    "surahId": 40,
    "ayahNumber": 16,
    "arabicText": "یَوۡمَ هُم بَـٰرِزُونَۖ لَا یَخۡفَىٰ عَلَى ٱللَّهِ مِنۡهُمۡ شَیۡءࣱۚ لِّمَنِ ٱلۡمُلۡكُ ٱلۡیَوۡمَۖ لِلَّهِ ٱلۡوَ ٰ⁠حِدِ ٱلۡقَهَّارِ\n",
    "translations": {
      "en": "the Day when they shall come forth [from death], with nothing of themselves hidden from God. With whom will sovereignty rest on that Day? With God, the One who holds absolute sway over all that exists!",
      "ms": "Iaitu hari mereka keluar (dari kubur masing-masing) dengan jelas nyata; tidak akan tersembunyi kepada Allah sesuatupun dari hal keadaan mereka. (Pada saat itu Allah berfirman): \"Siapakah yang menguasai kerajaan pada hari ini? (Allah sendiri menjawab): \"Dikuasai oleh Allah Yang Maha Esa, lagi Yang Mengatasi kekuasaanNya segala-galanya!",
      "id": "(Yaitu) hari (ketika) mereka keluar (dari kubur); tiada suatupun dari keadaan mereka yang tersembunyi bagi Allah. (Lalu Allah berfirman): \"Kepunyaan siapakah kerajaan pada hari ini?\" Kepunyaan Allah Yang Maha Esa lagi Maha Mengalahkan.",
      "ar": "یَوۡمَ هُم بَـٰرِزُونَۖ لَا یَخۡفَىٰ عَلَى ٱللَّهِ مِنۡهُمۡ شَیۡءࣱۚ لِّمَنِ ٱلۡمُلۡكُ ٱلۡیَوۡمَۖ لِلَّهِ ٱلۡوَ ٰ⁠حِدِ ٱلۡقَهَّارِ\n"
    }
  },
  {
    "id": 4150,
    "surahId": 40,
    "ayahNumber": 17,
    "arabicText": "ٱلۡیَوۡمَ تُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡۚ لَا ظُلۡمَ ٱلۡیَوۡمَۚ إِنَّ ٱللَّهَ سَرِیعُ ٱلۡحِسَابِ\n",
    "translations": {
      "en": "On that Day will every human being be requited for what he has earned: no wrong [will be done] on that Day: verily, swift in reckoning is God!",
      "ms": "\"Pada hari ini, tiap-tiap diri dibalas dengan apa yang telah diusahakannya; tidak ada hukuman yang tidak adil pada hari ini. Sesungguhnya Allah amat cepat hitungan hisabNya.",
      "id": "Pada hari ini tiap-tiap jiwa diberi balasan dengan apa yang diusahakannya. Tidak ada yang dirugikan pada hari ini. Sesungguhnya Allah amat cepat hisabnya.",
      "ar": "ٱلۡیَوۡمَ تُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡۚ لَا ظُلۡمَ ٱلۡیَوۡمَۚ إِنَّ ٱللَّهَ سَرِیعُ ٱلۡحِسَابِ\n"
    }
  },
  {
    "id": 4151,
    "surahId": 40,
    "ayahNumber": 18,
    "arabicText": "وَأَنذِرۡهُمۡ یَوۡمَ ٱلۡـَٔازِفَةِ إِذِ ٱلۡقُلُوبُ لَدَى ٱلۡحَنَاجِرِ كَـٰظِمِینَۚ مَا لِلظَّـٰلِمِینَ مِنۡ حَمِیمࣲ وَلَا شَفِیعࣲ یُطَاعُ\n",
    "translations": {
      "en": "Hence, warn them of that Day which draws ever nearer, when the hearts will chokingly come up to the throats: no loving friend will the evildoers have, nor any intercessor who would be heeded:",
      "ms": "Dan berilah amaran (wahai Muhammad) kepada mereka tentang (hari kiamat) yang dekat (masa datangnya), iaitu ketika hati seseorang merasa resah gelisah, kerana cemas takut, sambil masing-masing menahan perasaannya itu. (Pada saat itu) orang-orang yang zalim tidak akan mendapat seorang sahabatpun yang boleh membelanya, dan tidak akan mendapat pemberi syafaat yang diterima pertolongannya.",
      "id": "Berilah mereka peringatan dengan hari yang dekat (hari kiamat yaitu) ketika hati (menyesak) sampai di kerongkongan dengan menahan kesedihan. Orang-orang yang zalim tidak mempunyai teman setia seorangpun dan tidak (pula) mempunyai seorang pemberi syafa'at yang diterima syafa'atnya.",
      "ar": "وَأَنذِرۡهُمۡ یَوۡمَ ٱلۡـَٔازِفَةِ إِذِ ٱلۡقُلُوبُ لَدَى ٱلۡحَنَاجِرِ كَـٰظِمِینَۚ مَا لِلظَّـٰلِمِینَ مِنۡ حَمِیمࣲ وَلَا شَفِیعࣲ یُطَاعُ\n"
    }
  },
  {
    "id": 4152,
    "surahId": 40,
    "ayahNumber": 19,
    "arabicText": "یَعۡلَمُ خَاۤىِٕنَةَ ٱلۡأَعۡیُنِ وَمَا تُخۡفِی ٱلصُّدُورُ\n",
    "translations": {
      "en": "[for] He is aware of the [most] stealthy glance, and of all that the hearts would conceal.",
      "ms": "Allah mengetahui pengkhianatan (penyelewengan dan ketiadaan jujur) pandangan mata seseorang, serta mengetahui akan apa yang tersembunyi di dalam hati.",
      "id": "Dia mengetahui (pandangan) mata yang khianat dan apa yang disembunyikan oleh hati.",
      "ar": "یَعۡلَمُ خَاۤىِٕنَةَ ٱلۡأَعۡیُنِ وَمَا تُخۡفِی ٱلصُّدُورُ\n"
    }
  },
  {
    "id": 4153,
    "surahId": 40,
    "ayahNumber": 20,
    "arabicText": "وَٱللَّهُ یَقۡضِی بِٱلۡحَقِّۖ وَٱلَّذِینَ یَدۡعُونَ مِن دُونِهِۦ لَا یَقۡضُونَ بِشَیۡءٍۗ إِنَّ ٱللَّهَ هُوَ ٱلسَّمِیعُ ٱلۡبَصِیرُ\n",
    "translations": {
      "en": "And God will judge in accordance with truth and justice, whereas those [beings] whom they invoke beside Him cannot judge at all: for, verily, God alone is all-hearing, all-seeing.",
      "ms": "Dan Allah memutuskan hukum dengan adil, sedang yang mereka sembah yang lain dari Allah - tidak dapat memberikan sebarang keputusan. Sesungguhnya Allah Dia lah Yang Maha Mendengar, lagi Maha Melihat.",
      "id": "Dan Allah menghukum dengan keadilan. Dan sembahan-sembahan yang mereka sembah selain Allah tiada dapat menghukum dengan sesuatu apapun. Sesungguhnya Allah Dialah Yang Maha Mendengar lagi Maha Melihat.",
      "ar": "وَٱللَّهُ یَقۡضِی بِٱلۡحَقِّۖ وَٱلَّذِینَ یَدۡعُونَ مِن دُونِهِۦ لَا یَقۡضُونَ بِشَیۡءٍۗ إِنَّ ٱللَّهَ هُوَ ٱلسَّمِیعُ ٱلۡبَصِیرُ\n"
    }
  },
  {
    "id": 4154,
    "surahId": 40,
    "ayahNumber": 21,
    "arabicText": "۞ أَوَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَیَنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلَّذِینَ كَانُوا۟ مِن قَبۡلِهِمۡۚ كَانُوا۟ هُمۡ أَشَدَّ مِنۡهُمۡ قُوَّةࣰ وَءَاثَارࣰا فِی ٱلۡأَرۡضِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡ وَمَا كَانَ لَهُم مِّنَ ٱللَّهِ مِن وَاقࣲ\n",
    "translations": {
      "en": "Have they, then, never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before their time? Greater were they in power than they are, and in the impact which they left on earth: but God took them to task for their sins, and they had none to defend them against God:",
      "ms": "Tidakkah mereka telah berjalan dan mengembara di muka bumi, dengan itu tidakkah mereka memerhatikan bagaimana kesudahan orang-orang yang terdahulu dari mereka? Orang-orang itu adalah orang-orang yang lebih dari mereka tentang kekuatan tenaga dan tentang kesan-kesan usaha pembangunan di muka bumi. Maka sekalipun demikian, Allah binasakan mereka dengan sebab dosa-dosa mereka, dan tiadalah bagi mereka sesiapapun yang dapat menyelamatkan mereka dari azab Allah.",
      "id": "Dan apakah mereka tidak mengadakan perjalanan di muka bumi, lalu memperhatikan betapa kesudahan orang-orang yang sebelum mereka. Mereka itu adalah lebih hebat kekuatannya daripada mereka dan (lebih banyak) bekas-bekas mereka di muka bumi, maka Allah mengazab mereka disebabkan dosa-dosa mereka. Dan mereka tidak mempunyai seorang pelindung dari azab Allah.",
      "ar": "۞ أَوَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَیَنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلَّذِینَ كَانُوا۟ مِن قَبۡلِهِمۡۚ كَانُوا۟ هُمۡ أَشَدَّ مِنۡهُمۡ قُوَّةࣰ وَءَاثَارࣰا فِی ٱلۡأَرۡضِ فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡ وَمَا كَانَ لَهُم مِّنَ ٱللَّهِ مِن وَاقࣲ\n"
    }
  },
  {
    "id": 4155,
    "surahId": 40,
    "ayahNumber": 22,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّهُمۡ كَانَت تَّأۡتِیهِمۡ رُسُلُهُم بِٱلۡبَیِّنَـٰتِ فَكَفَرُوا۟ فَأَخَذَهُمُ ٱللَّهُۚ إِنَّهُۥ قَوِیࣱّ شَدِیدُ ٱلۡعِقَابِ\n",
    "translations": {
      "en": "this, because their apostles had come to them with all evidence of the truth, and yet they rejected it: and so God took them to task - for, verily, He is powerful, severe in retribution!",
      "ms": "(Kebinasaan mereka) yang demikian ialah kerana mereka sentiasa didatangi Rasul-rasul yang diutuskan kepada mereka dengan membawa keterangan-keterangan (hukum-hukum dan mukjizat) yang jelas nyata, maka mereka kufur ingkar, lalu Allah menyeksa mereka, sesungguhnya Allah adalah Maha Kuat lagi Maha berat azab seksaNya.",
      "id": "Yang demiklan itu adalah karena telah datang kepada mereka rasul-rasul mereka dengan membawa bukti-bukti yang nyata lalu mereka kafir; maka Allah mengazab mereka. Sesungguhnya Dia Maha Kuat lagi Maha Keras hukuman-Nya.",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّهُمۡ كَانَت تَّأۡتِیهِمۡ رُسُلُهُم بِٱلۡبَیِّنَـٰتِ فَكَفَرُوا۟ فَأَخَذَهُمُ ٱللَّهُۚ إِنَّهُۥ قَوِیࣱّ شَدِیدُ ٱلۡعِقَابِ\n"
    }
  },
  {
    "id": 4156,
    "surahId": 40,
    "ayahNumber": 23,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔایَـٰتِنَا وَسُلۡطَـٰنࣲ مُّبِینٍ\n",
    "translations": {
      "en": "THUS, INDEED, did We send Moses with Our mes­sages and a manifest authority [from Us]",
      "ms": "Dan demi sesungguhnya! Kami telah mengutuskan Nabi Musa membawa ayat-ayat Kami dan bukti (mukjizat) yang jelas nyata",
      "id": "Dan sesungguhnya telah Kami utus Musa dengan membawa ayat-ayat Kami dan keterangan yang nyata,",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔایَـٰتِنَا وَسُلۡطَـٰنࣲ مُّبِینٍ\n"
    }
  },
  {
    "id": 4157,
    "surahId": 40,
    "ayahNumber": 24,
    "arabicText": "إِلَىٰ فِرۡعَوۡنَ وَهَـٰمَـٰنَ وَقَـٰرُونَ فَقَالُوا۟ سَـٰحِرࣱ كَذَّابࣱ\n",
    "translations": {
      "en": "unto Pharaoh, and Haman, and Qarun; but they [only] said, “A spellbinder is he, a liar!”",
      "ms": "Kepada Firaun dan Haman serta Qarun; maka mereka (menuduhnya dengan) berkata: \"Ia seorang ahli sihir, lagi pendusta!\"",
      "id": "kepada Fir'aun, Haman dan Qarun; maka mereka berkata: \"(Ia) adalah seorang ahli sihir yang pendusta\".",
      "ar": "إِلَىٰ فِرۡعَوۡنَ وَهَـٰمَـٰنَ وَقَـٰرُونَ فَقَالُوا۟ سَـٰحِرࣱ كَذَّابࣱ\n"
    }
  },
  {
    "id": 4158,
    "surahId": 40,
    "ayahNumber": 25,
    "arabicText": "فَلَمَّا جَاۤءَهُم بِٱلۡحَقِّ مِنۡ عِندِنَا قَالُوا۟ ٱقۡتُلُوۤا۟ أَبۡنَاۤءَ ٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ وَٱسۡتَحۡیُوا۟ نِسَاۤءَهُمۡۚ وَمَا كَیۡدُ ٱلۡكَـٰفِرِینَ إِلَّا فِی ضَلَـٰلࣲ\n",
    "translations": {
      "en": "Now [as for Pharaoh and his followers,] when he came to them, setting forth the truth from Us, they said, “Slay the sons of those who share his beliefs, and spare [only] their women!” - but the guile of those deniers of the truth could not lead to aught but failure.",
      "ms": "Setelah Nabi Musa datang kepada mereka dengan membawa kebenaran dari sisi Kami, mereka berkata (dengan marahnya): \"Bunuhlah anak-anak lelaki orang-orang yang beriman yang mengikutnya, dan biarkan hidup anak-anak perempuan mereka\". (Tetapi usaha) dan tipu daya orang-orang kafir itu hanya menyebabkan mereka tenggelam dalam kesesatan dan kebinasaan sahaja.",
      "id": "Maka tatkala Musa datang kepada mereka membawa kebenaran dari sisi Kami mereka berkata: \"Bunuhlah anak-anak orang-orang yang beriman bersama dengan dia dan biarkanlah hidup wanita-wanita mereka\". Dan tipu daya orang-orang kafir itu tak lain hanyalah sia-sia (belaka).",
      "ar": "فَلَمَّا جَاۤءَهُم بِٱلۡحَقِّ مِنۡ عِندِنَا قَالُوا۟ ٱقۡتُلُوۤا۟ أَبۡنَاۤءَ ٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ وَٱسۡتَحۡیُوا۟ نِسَاۤءَهُمۡۚ وَمَا كَیۡدُ ٱلۡكَـٰفِرِینَ إِلَّا فِی ضَلَـٰلࣲ\n"
    }
  },
  {
    "id": 4159,
    "surahId": 40,
    "ayahNumber": 26,
    "arabicText": "وَقَالَ فِرۡعَوۡنُ ذَرُونِیۤ أَقۡتُلۡ مُوسَىٰ وَلۡیَدۡعُ رَبَّهُۥۤۖ إِنِّیۤ أَخَافُ أَن یُبَدِّلَ دِینَكُمۡ أَوۡ أَن یُظۡهِرَ فِی ٱلۡأَرۡضِ ٱلۡفَسَادَ\n",
    "translations": {
      "en": "And Pharaoh said: “Leave it to me to slay Moses - and let him invoke his [alleged] sustainer! Behold, I fear lest he cause you to change your religion, or lest he cause corruption to prevail in the land!”",
      "ms": "Dan berkatalah Firaun (kepada orang-orangnya): \"Biarkanlah aku membunuh Musa, dan biarlah dia memohon kepada Tuhannya (meminta pertolongan)! Sesungguhnya aku bimbang dia akan menukar ugama kamu, atau ia menimbulkan kerosakan di muka bumi\".",
      "id": "Dan berkata Fir'aun (kepada pembesar-pembesarnya): \"Biarkanlah aku membunuh Musa dan hendaklah ia memohon kepada Tuhannya, karena sesungguhnya aku khawatir dia akan menukar agamamu atau menimbulkan kerusakan di muka bumi\".",
      "ar": "وَقَالَ فِرۡعَوۡنُ ذَرُونِیۤ أَقۡتُلۡ مُوسَىٰ وَلۡیَدۡعُ رَبَّهُۥۤۖ إِنِّیۤ أَخَافُ أَن یُبَدِّلَ دِینَكُمۡ أَوۡ أَن یُظۡهِرَ فِی ٱلۡأَرۡضِ ٱلۡفَسَادَ\n"
    }
  },
  {
    "id": 4160,
    "surahId": 40,
    "ayahNumber": 27,
    "arabicText": "وَقَالَ مُوسَىٰۤ إِنِّی عُذۡتُ بِرَبِّی وَرَبِّكُم مِّن كُلِّ مُتَكَبِّرࣲ لَّا یُؤۡمِنُ بِیَوۡمِ ٱلۡحِسَابِ\n",
    "translations": {
      "en": "But Moses said: “With [Him who is] my Sus­tainer as well as your Sustainer have I indeed found refuge from everyone who, immersed in false pride, will not believe in [the coming of] the Day of Reckon­ing!”",
      "ms": "Dan (setelah mendengar ancaman itu) Nabi Musa berkata: \"Sesungguhnya aku berlindung kepada Allah Tuhanku dan Tuhan kamu - dari (angkara) tiap-tiap orang yang sombong takbur, yang tidak beriman kepada hari hitungan amal!\"",
      "id": "Dan Musa berkata: \"Sesungguhnya aku berlindung kepada Tuhanku dan Tuhanmu dari setiap orang yang menyombongkan diri yang tidak beriman kepada hari berhisab\".",
      "ar": "وَقَالَ مُوسَىٰۤ إِنِّی عُذۡتُ بِرَبِّی وَرَبِّكُم مِّن كُلِّ مُتَكَبِّرࣲ لَّا یُؤۡمِنُ بِیَوۡمِ ٱلۡحِسَابِ\n"
    }
  },
  {
    "id": 4161,
    "surahId": 40,
    "ayahNumber": 28,
    "arabicText": "وَقَالَ رَجُلࣱ مُّؤۡمِنࣱ مِّنۡ ءَالِ فِرۡعَوۡنَ یَكۡتُمُ إِیمَـٰنَهُۥۤ أَتَقۡتُلُونَ رَجُلًا أَن یَقُولَ رَبِّیَ ٱللَّهُ وَقَدۡ جَاۤءَكُم بِٱلۡبَیِّنَـٰتِ مِن رَّبِّكُمۡۖ وَإِن یَكُ كَـٰذِبࣰا فَعَلَیۡهِ كَذِبُهُۥۖ وَإِن یَكُ صَادِقࣰا یُصِبۡكُم بَعۡضُ ٱلَّذِی یَعِدُكُمۡۖ إِنَّ ٱللَّهَ لَا یَهۡدِی مَنۡ هُوَ مُسۡرِفࣱ كَذَّابࣱ\n",
    "translations": {
      "en": "At that, a believing man of Pharaoh’s family, who [until then] had concealed his faith, exclaimed: “Would you slay a man because he says, ‘God is my Sustainer’ - seeing, withal, that he has brought you all evidence of this truth from your Sustainer? Now if he be a liar, his lie will fall back on him; but if he is a man of truth, something [of the punishment] whereof he warns you is bound to befall you: for, verily, God would not grace with His guidance one who has wasted his own self by lying [about Him].",
      "ms": "Dan (pada saat itu) berkatalah pula seorang lelaki yang beriman dari orang-orang Firaun yang menyembunyikan imannya: \"Patutkah kamu membunuh seorang lelaki kerana ia menegaskan: `Tuhanku ialah Allah? ' - sedang ia telah datang kepada kamu membawa keterangan-keterangan dari Tuhan kamu? Kalau ia seorang yang berdusta maka dia lah yang akan menanggung dosa dustanya itu, dan kalau ia seorang yang benar nescaya kamu akan ditimpa oleh sebahagian dari (azab) yang dijanjikannya kepada kamu. Sesungguhnya Allah tidak memberi hidayah petunjuk kepada orang yang melampaui batas, lagi pendusta.",
      "id": "Dan seorang laki-laki yang beriman di antara pengikut-pengikut Fir'aun yang menyembunyikan imannya berkata: \"Apakah kamu akan membunuh seorang laki-laki karena dia menyatakan: \"Tuhanku ialah Allah padahal dia telah datang kepadamu dengan membawa keterangan-keterangan dari Tuhanmu. Dan jika ia seorang pendusta maka dialah yang menanggung (dosa) dustanya itu; dan jika ia seorang yang benar niscaya sebagian (bencana) yang diancamkannya kepadamu akan menimpamu\". Sesungguhnya Allah tidak menunjuki orang-orang yang melampaui batas lagi pendusta.",
      "ar": "وَقَالَ رَجُلࣱ مُّؤۡمِنࣱ مِّنۡ ءَالِ فِرۡعَوۡنَ یَكۡتُمُ إِیمَـٰنَهُۥۤ أَتَقۡتُلُونَ رَجُلًا أَن یَقُولَ رَبِّیَ ٱللَّهُ وَقَدۡ جَاۤءَكُم بِٱلۡبَیِّنَـٰتِ مِن رَّبِّكُمۡۖ وَإِن یَكُ كَـٰذِبࣰا فَعَلَیۡهِ كَذِبُهُۥۖ وَإِن یَكُ صَادِقࣰا یُصِبۡكُم بَعۡضُ ٱلَّذِی یَعِدُكُمۡۖ إِنَّ ٱللَّهَ لَا یَهۡدِی مَنۡ هُوَ مُسۡرِفࣱ كَذَّابࣱ\n"
    }
  },
  {
    "id": 4162,
    "surahId": 40,
    "ayahNumber": 29,
    "arabicText": "یَـٰقَوۡمِ لَكُمُ ٱلۡمُلۡكُ ٱلۡیَوۡمَ ظَـٰهِرِینَ فِی ٱلۡأَرۡضِ فَمَن یَنصُرُنَا مِنۢ بَأۡسِ ٱللَّهِ إِن جَاۤءَنَاۚ قَالَ فِرۡعَوۡنُ مَاۤ أُرِیكُمۡ إِلَّا مَاۤ أَرَىٰ وَمَاۤ أَهۡدِیكُمۡ إِلَّا سَبِیلَ ٱلرَّشَادِ\n",
    "translations": {
      "en": "“O my people! Yours is the dominion today, [and] most eminent are you on earth: but who will rescue us from God’s punishment, once it befalls us?” Said Pharaoh: “I but want to make you see what I see myself; and I would never make you follow any path but that of rectitude!”",
      "ms": "\"Wahai kaumku! Pada hari ini kepunyaan kamulah kuasa memerintah dengan bermaharajalela di muka bumi (Mesir dan sekitarnya; tetapi kiranya keadaan bertukar) maka siapakah yang akan membela kita dari azab Allah kalau azab itu datang menimpa kita?\" Firaun berkata: \" Aku tidak mengesyorkan kepada kamu melainkan dengan apa yang aku pandang (elok dijalankan), dan aku tidak menunjukkan kepada kamu melainkan jalan yang benar\".",
      "id": "(Musa berkata): \"Hai kaumku, untukmulah kerajaan pada hari ini dengan berkuasa di muka bumi. Siapakah yang akan menolong kita dari azab Allah jika azab itu menimpa kita!\" Fir'aun berkata: \"Aku tidak mengemukakan kepadamu, melainkan apa yang aku pandang baik; dan aku tiada menunjukkan kepadamu selain jalan yang benar\".",
      "ar": "یَـٰقَوۡمِ لَكُمُ ٱلۡمُلۡكُ ٱلۡیَوۡمَ ظَـٰهِرِینَ فِی ٱلۡأَرۡضِ فَمَن یَنصُرُنَا مِنۢ بَأۡسِ ٱللَّهِ إِن جَاۤءَنَاۚ قَالَ فِرۡعَوۡنُ مَاۤ أُرِیكُمۡ إِلَّا مَاۤ أَرَىٰ وَمَاۤ أَهۡدِیكُمۡ إِلَّا سَبِیلَ ٱلرَّشَادِ\n"
    }
  },
  {
    "id": 4163,
    "surahId": 40,
    "ayahNumber": 30,
    "arabicText": "وَقَالَ ٱلَّذِیۤ ءَامَنَ یَـٰقَوۡمِ إِنِّیۤ أَخَافُ عَلَیۡكُم مِّثۡلَ یَوۡمِ ٱلۡأَحۡزَابِ\n",
    "translations": {
      "en": "Thereupon exclaimed he who had attained to faith: “O my people! Verily, I fear for you the like of what one day befell those others who were leagued together [against God’s truth] –",
      "ms": "Dan berkatalah pula orang yang beriman itu: \"Wahai kaumku! Sesungguhnya aku bimbang kamu akan ditimpa (kebinasaan) sebagaimana yang telah menimpa kaum-kaum yang bergabung (menentang Rasul-rasulnya)!",
      "id": "Dan orang yang beriman itu berkata: \"Hai kaumku, sesungguhnya aku khawatir kamu akan ditimpa (bencana) seperti peristiwa kehancuran golongan yang bersekutu.",
      "ar": "وَقَالَ ٱلَّذِیۤ ءَامَنَ یَـٰقَوۡمِ إِنِّیۤ أَخَافُ عَلَیۡكُم مِّثۡلَ یَوۡمِ ٱلۡأَحۡزَابِ\n"
    }
  },
  {
    "id": 4164,
    "surahId": 40,
    "ayahNumber": 31,
    "arabicText": "مِثۡلَ دَأۡبِ قَوۡمِ نُوحࣲ وَعَادࣲ وَثَمُودَ وَٱلَّذِینَ مِنۢ بَعۡدِهِمۡۚ وَمَا ٱللَّهُ یُرِیدُ ظُلۡمࣰا لِّلۡعِبَادِ\n",
    "translations": {
      "en": "the like of what happened to Noah’s people, and to [the tribes of] Ad and Thamud and those who came after them! And, withal, God does not will any wrong for His crea­tures.",
      "ms": "\"(Iaitu) seperti keadaan kaum Nabi Nuh, dan Aad (kaum Nabi Hud), dan Thamud (kaum Nabi Soleh), serta orang-orang yang datang kemudian daripada mereka (seperti kaum Nabi Lut). Dan (ingatlah) Allah tidak menghendaki berbuat kezaliman kepada hamba-hambaNya.",
      "id": "(Yakni) seperti keadaan kaum Nuh, 'Aad, Tsamud dan orang-orang yang datang sesudah mereka. Dan Allah tidak menghendaki berbuat kezaliman terhadap hamba-hamba-Nya.",
      "ar": "مِثۡلَ دَأۡبِ قَوۡمِ نُوحࣲ وَعَادࣲ وَثَمُودَ وَٱلَّذِینَ مِنۢ بَعۡدِهِمۡۚ وَمَا ٱللَّهُ یُرِیدُ ظُلۡمࣰا لِّلۡعِبَادِ\n"
    }
  },
  {
    "id": 4165,
    "surahId": 40,
    "ayahNumber": 32,
    "arabicText": "وَیَـٰقَوۡمِ إِنِّیۤ أَخَافُ عَلَیۡكُمۡ یَوۡمَ ٱلتَّنَادِ\n",
    "translations": {
      "en": "“And, O my people, I fear for you [the coming of] that Day of [Judgment - the Day when you will be] calling unto one another [in distress] –",
      "ms": "\"Dan, wahai kaumku! Sesungguhnya aku bimbang kamu akan ditimpa azab seksa hari (kiamat) yang padanya masing-masing menjerit-jerit memanggil (memohon pertolongan),",
      "id": "Hai kaumku, sesungguhnya aku khawatir terhadapmu akan siksaan hari panggil-memanggil.",
      "ar": "وَیَـٰقَوۡمِ إِنِّیۤ أَخَافُ عَلَیۡكُمۡ یَوۡمَ ٱلتَّنَادِ\n"
    }
  },
  {
    "id": 4166,
    "surahId": 40,
    "ayahNumber": 33,
    "arabicText": "یَوۡمَ تُوَلُّونَ مُدۡبِرِینَ مَا لَكُم مِّنَ ٱللَّهِ مِنۡ عَاصِمࣲۗ وَمَن یُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادࣲ\n",
    "translations": {
      "en": "the Day when you will [wish to] turn your backs and flee, having none to defend you against God: for he whom God lets go astray can never find any guide.",
      "ms": "\"(Iaitu) hari kamu berpaling undur melarikan diri; padahal semasa itu tidak ada sesiapapun yang dapat menyelamatkan kamu dari azab Allah. Dan (ingatlah) sesiapa yang disesatkan Allah (disebabkan pilihannya yang salah), maka tiada sesiapapun yang dapat memberi hidayah petunjuk kepadanya.",
      "id": "(yaitu) hari (ketika) kamu (lari) berpaling ke belakang, tidak ada bagimu seorangpun yang menyelamatkan kamu dari (azab) Allah, dan siapa yang disesatkan Allah, niscaya tidak ada baginya seorangpun yang akan memberi petunjuk.",
      "ar": "یَوۡمَ تُوَلُّونَ مُدۡبِرِینَ مَا لَكُم مِّنَ ٱللَّهِ مِنۡ عَاصِمࣲۗ وَمَن یُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادࣲ\n"
    }
  },
  {
    "id": 4167,
    "surahId": 40,
    "ayahNumber": 34,
    "arabicText": "وَلَقَدۡ جَاۤءَكُمۡ یُوسُفُ مِن قَبۡلُ بِٱلۡبَیِّنَـٰتِ فَمَا زِلۡتُمۡ فِی شَكࣲّ مِّمَّا جَاۤءَكُم بِهِۦۖ حَتَّىٰۤ إِذَا هَلَكَ قُلۡتُمۡ لَن یَبۡعَثَ ٱللَّهُ مِنۢ بَعۡدِهِۦ رَسُولࣰاۚ كَذَ ٰ⁠لِكَ یُضِلُّ ٱللَّهُ مَنۡ هُوَ مُسۡرِفࣱ مُّرۡتَابٌ\n",
    "translations": {
      "en": "“And [remember:] it was to you that Joseph came aforetime with all evidence of the truth; but you never ceased to throw doubt on all [the messages] that he brought you - so much so that when he died, you said, ‘Never will God send any apostle [even] after him!’ “In this way God lets go astray such as waste their own selves by throwing suspicion [on His revela­tions] –",
      "ms": "\"Dan demi sesungguhnya! Nabi Yusuf telah datang kepada kamu dahulu dengan membawa keterangan-keterangan (yang membuktikan kerasulannya), maka kamu tetap juga dalam keraguan mengenai apa yang disampaikannya kepada kamu sehingga apabila ia mati, kamu berkata: Allah tidak akan mengutuskan lagi Rasul sesudahnya; demikianlah Allah menyesatkan sesiapa yang melampau kederhakaannya, lagi yang ragu-ragu kepercayaannya (terhadap balasan Tuhannya), -",
      "id": "Dan sesungguhnya telah datang Yusuf kepadamu dengan membawa keterangan-keterangan, tetapi kamu senantiasa dalam keraguan tentang apa yang dibawanya kepadamu, hingga ketika dia meninggal, kamu berkata: \"Allah tidak akan mengirim seorang (rasulpun) sesudahnya. Demikianlah Allah menyesatkan orang-orang yang melampaui batas dan ragu-ragu.",
      "ar": "وَلَقَدۡ جَاۤءَكُمۡ یُوسُفُ مِن قَبۡلُ بِٱلۡبَیِّنَـٰتِ فَمَا زِلۡتُمۡ فِی شَكࣲّ مِّمَّا جَاۤءَكُم بِهِۦۖ حَتَّىٰۤ إِذَا هَلَكَ قُلۡتُمۡ لَن یَبۡعَثَ ٱللَّهُ مِنۢ بَعۡدِهِۦ رَسُولࣰاۚ كَذَ ٰ⁠لِكَ یُضِلُّ ٱللَّهُ مَنۡ هُوَ مُسۡرِفࣱ مُّرۡتَابٌ\n"
    }
  },
  {
    "id": 4168,
    "surahId": 40,
    "ayahNumber": 35,
    "arabicText": "ٱلَّذِینَ یُجَـٰدِلُونَ فِیۤ ءَایَـٰتِ ٱللَّهِ بِغَیۡرِ سُلۡطَـٰنٍ أَتَىٰهُمۡۖ كَبُرَ مَقۡتًا عِندَ ٱللَّهِ وَعِندَ ٱلَّذِینَ ءَامَنُوا۟ۚ كَذَ ٰ⁠لِكَ یَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرࣲ جَبَّارࣲ\n",
    "translations": {
      "en": "such as would call God’s messages in question without having any evidence therefor: [a sin] exceedingly loathsome in the sight of God and of those who have attained to faith. It is in this way that God sets a seal on every arrogant, self-exalting heart.”",
      "ms": "\"(Iaitu) orang-orang yang membantah mengenai maksud ayat-ayat Allah dengan tidak ada sebarang bukti yang sampai kepada mereka (dari pihak yang diakui benarnya). (Bantahan yang demikian) besar kebenciannya dan kemurkaannya di sisi hukum Allah dan di sisi bawaan orang-orang yang beriman. Demikianlah Allah meteraikan atas hati tiap-tiap orang yang sombong takbur, lagi bermaharajalela pencerobohannya!\"",
      "id": "(Yaitu) orang-orang yang memperdebatkan ayat-ayat Allah tanpa alasan yang sampai kepada mereka. Amat besar kemurkaan (bagi mereka) di sisi Allah dan di sisi orang-orang yang beriman. Demikianlah Allah mengunci mati hati orang yang sombong dan sewenang-wenang.",
      "ar": "ٱلَّذِینَ یُجَـٰدِلُونَ فِیۤ ءَایَـٰتِ ٱللَّهِ بِغَیۡرِ سُلۡطَـٰنٍ أَتَىٰهُمۡۖ كَبُرَ مَقۡتًا عِندَ ٱللَّهِ وَعِندَ ٱلَّذِینَ ءَامَنُوا۟ۚ كَذَ ٰ⁠لِكَ یَطۡبَعُ ٱللَّهُ عَلَىٰ كُلِّ قَلۡبِ مُتَكَبِّرࣲ جَبَّارࣲ\n"
    }
  },
  {
    "id": 4169,
    "surahId": 40,
    "ayahNumber": 36,
    "arabicText": "وَقَالَ فِرۡعَوۡنُ یَـٰهَـٰمَـٰنُ ٱبۡنِ لِی صَرۡحࣰا لَّعَلِّیۤ أَبۡلُغُ ٱلۡأَسۡبَـٰبَ\n",
    "translations": {
      "en": "But Pharaoh said: “O Haman! Build me a lofty tower, that haply I may attain to the [right] means",
      "ms": "Dan Firaun pula berkata: \"Hai Haman! Binalah untukku sebuah bangunan yang tinggi, semoga aku sampai ke jalan-jalan (yang aku hendak menujunya)",
      "id": "Dan berkatalah Fir'aun: \"Hai Haman, buatkanlah bagiku sebuah bangunan yang tinggi supaya aku sampai ke pintu-pintu,",
      "ar": "وَقَالَ فِرۡعَوۡنُ یَـٰهَـٰمَـٰنُ ٱبۡنِ لِی صَرۡحࣰا لَّعَلِّیۤ أَبۡلُغُ ٱلۡأَسۡبَـٰبَ\n"
    }
  },
  {
    "id": 4170,
    "surahId": 40,
    "ayahNumber": 37,
    "arabicText": "أَسۡبَـٰبَ ٱلسَّمَـٰوَ ٰ⁠تِ فَأَطَّلِعَ إِلَىٰۤ إِلَـٰهِ مُوسَىٰ وَإِنِّی لَأَظُنُّهُۥ كَـٰذِبࣰاۚ وَكَذَ ٰ⁠لِكَ زُیِّنَ لِفِرۡعَوۡنَ سُوۤءُ عَمَلِهِۦ وَصُدَّ عَنِ ٱلسَّبِیلِۚ وَمَا كَیۡدُ فِرۡعَوۡنَ إِلَّا فِی تَبَابࣲ\n",
    "translations": {
      "en": "the means of approach to the heavens - and that [thus] I may have a look at the god of Moses: for, behold, I am indeed certain that he is a liar!” And thus, goodly seemed unto Pharaoh the evil of his own doings, and so he was barred from the path [of truth]: and Pharaoh’s guile did not lead to aught but ruin.",
      "ms": "\"(Iaitu) ke pintu-pintu langit, supaya aku dapat melihat Tuhan Musa; dan sesungguhnya aku percaya Musa itu seorang pendusta!\" Demikianlah diperhiaskan (oleh Syaitan) kepada Firaun akan perbuatannya yang buruk itu untuk dipandang baik, serta ia dihalangi dari jalan yang benar; dan tipu daya Firaun itu tidak membawanya melainkan ke dalam kerugian dan kebinasaan.",
      "id": "(yaitu) pintu-pintu langit, supaya aku dapat melihat Tuhan Musa dan sesungguhnya aku memandangnya seorang pendusta\". Demikianlah dijadikan Fir'aun memandang baik perbuatan yang buruk itu, dan dia dihalangi dari jalan (yang benar); dan tipu daya Fir'aun itu tidak lain hanyalah membawa kerugian.",
      "ar": "أَسۡبَـٰبَ ٱلسَّمَـٰوَ ٰ⁠تِ فَأَطَّلِعَ إِلَىٰۤ إِلَـٰهِ مُوسَىٰ وَإِنِّی لَأَظُنُّهُۥ كَـٰذِبࣰاۚ وَكَذَ ٰ⁠لِكَ زُیِّنَ لِفِرۡعَوۡنَ سُوۤءُ عَمَلِهِۦ وَصُدَّ عَنِ ٱلسَّبِیلِۚ وَمَا كَیۡدُ فِرۡعَوۡنَ إِلَّا فِی تَبَابࣲ\n"
    }
  },
  {
    "id": 4171,
    "surahId": 40,
    "ayahNumber": 38,
    "arabicText": "وَقَالَ ٱلَّذِیۤ ءَامَنَ یَـٰقَوۡمِ ٱتَّبِعُونِ أَهۡدِكُمۡ سَبِیلَ ٱلرَّشَادِ\n",
    "translations": {
      "en": "Still, the man who had attained to faith went on: “O my people! Follow me: I shall guide you onto the path of rectitude!",
      "ms": "Dan berkatalah pula orang beriman itu: \"Wahai kaumku! Turutlah (nasihatku), aku akan menunjukkan kepada kamu jalan yang benar.",
      "id": "Orang yang beriman itu berkata: \"Hai kaumku, ikutilah aku, aku akan menunjukkan kepadamu jalan yang benar.",
      "ar": "وَقَالَ ٱلَّذِیۤ ءَامَنَ یَـٰقَوۡمِ ٱتَّبِعُونِ أَهۡدِكُمۡ سَبِیلَ ٱلرَّشَادِ\n"
    }
  },
  {
    "id": 4172,
    "surahId": 40,
    "ayahNumber": 39,
    "arabicText": "یَـٰقَوۡمِ إِنَّمَا هَـٰذِهِ ٱلۡحَیَوٰةُ ٱلدُّنۡیَا مَتَـٰعࣱ وَإِنَّ ٱلۡـَٔاخِرَةَ هِیَ دَارُ ٱلۡقَرَارِ\n",
    "translations": {
      "en": "“O my people! This worldly life is but a brief enjoyment, whereas, behold, the life to come is the home abiding.",
      "ms": "\"Wahai kaumku! Sesungguhnya kehidupan dunia ini hanyalah kesenangan (untuk sementara waktu sahaja), dan sesungguhnya hari akhirat itulah sahaja negeri yang kekal.",
      "id": "Hai kaumku, sesungguhnya kehidupan dunia ini hanyalah kesenangan (sementara) dan sesungguhnya akhirat itulah negeri yang kekal.",
      "ar": "یَـٰقَوۡمِ إِنَّمَا هَـٰذِهِ ٱلۡحَیَوٰةُ ٱلدُّنۡیَا مَتَـٰعࣱ وَإِنَّ ٱلۡـَٔاخِرَةَ هِیَ دَارُ ٱلۡقَرَارِ\n"
    }
  },
  {
    "id": 4173,
    "surahId": 40,
    "ayahNumber": 40,
    "arabicText": "مَنۡ عَمِلَ سَیِّئَةࣰ فَلَا یُجۡزَىٰۤ إِلَّا مِثۡلَهَاۖ وَمَنۡ عَمِلَ صَـٰلِحࣰا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَأُو۟لَـٰۤىِٕكَ یَدۡخُلُونَ ٱلۡجَنَّةَ یُرۡزَقُونَ فِیهَا بِغَیۡرِ حِسَابࣲ\n",
    "translations": {
      "en": "[There,] anyone who has done a bad deed will be requited with no more than the like thereof, whereas anyone, be it man or woman, who has done righteous deeds and is a believer withal - all such will enter paradise, wherein they shall be blest with good beyond all reckoning!",
      "ms": "\"Sesiapa yang mengerjakan sesuatu perbuatan jahat maka ia tidak dibalas melainkan dengan kejahatan yang sebanding dengannya; dan sesiapa yang mengerjakan amal soleh - dari lelaki atau perempuan - sedang ia beriman, maka mereka itu akan masuk Syurga; mereka beroleh rezeki di dalam Syurga itu dengan tidak dihitung.",
      "id": "Barangsiapa mengerjakan perbuatan jahat, maka dia tidak akan dibalasi melainkan sebanding dengan kejahatan itu. Dan barangsiapa mengerjakan amal yang saleh baik laki-laki maupun perempuan sedang ia dalam keadaan beriman, maka mereka akan masuk surga, mereka diberi rezeki di dalamnya tanpa hisab.",
      "ar": "مَنۡ عَمِلَ سَیِّئَةࣰ فَلَا یُجۡزَىٰۤ إِلَّا مِثۡلَهَاۖ وَمَنۡ عَمِلَ صَـٰلِحࣰا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَأُو۟لَـٰۤىِٕكَ یَدۡخُلُونَ ٱلۡجَنَّةَ یُرۡزَقُونَ فِیهَا بِغَیۡرِ حِسَابࣲ\n"
    }
  },
  {
    "id": 4174,
    "surahId": 40,
    "ayahNumber": 41,
    "arabicText": "۞ وَیَـٰقَوۡمِ مَا لِیۤ أَدۡعُوكُمۡ إِلَى ٱلنَّجَوٰةِ وَتَدۡعُونَنِیۤ إِلَى ٱلنَّارِ\n",
    "translations": {
      "en": "“And, O my people, how is it that I summon you to salvation, the while you summon me to the fire?",
      "ms": "\"Dan wahai kaumku! Apa halnya aku dengan kamu? Aku mengajak kamu kepada keselamatan, dan kamu pula mengajakku ke neraka?",
      "id": "Hai kaumku, bagaimanakah kamu, aku menyeru kamu kepada keselamatan, tetapi kamu menyeru aku ke neraka?",
      "ar": "۞ وَیَـٰقَوۡمِ مَا لِیۤ أَدۡعُوكُمۡ إِلَى ٱلنَّجَوٰةِ وَتَدۡعُونَنِیۤ إِلَى ٱلنَّارِ\n"
    }
  },
  {
    "id": 4175,
    "surahId": 40,
    "ayahNumber": 42,
    "arabicText": "تَدۡعُونَنِی لِأَكۡفُرَ بِٱللَّهِ وَأُشۡرِكَ بِهِۦ مَا لَیۡسَ لِی بِهِۦ عِلۡمࣱ وَأَنَا۠ أَدۡعُوكُمۡ إِلَى ٱلۡعَزِیزِ ٱلۡغَفَّـٰرِ\n",
    "translations": {
      "en": "- [for] you call upon me to deny [the one­ness of] God and to ascribe a share in His divinity to aught of which I cannot [possibly] have any knowl­edge the while I summon you to [a cognition of] the Almighty, the All-Forgiving!",
      "ms": "\"Kamu mengajakku supaya aku kufur (tidak percayakan keesaan) Allah dan mempersekutukanNya dengan apa yang aku tidak mempunyai pengetahuan mengenainya, padahal aku mengajak kamu beriman kepada Allah Yang Maha Kuasa, lagi Maha Pengampun?",
      "id": "(Kenapa) kamu menyeruku supaya kafir kepada Allah dan mempersekutukan-Nya dengan apa yang tidak kuketahui padahal aku menyeru kamu (beriman) kepada Yang Maha Perkasa lagi Maha Pengampun?",
      "ar": "تَدۡعُونَنِی لِأَكۡفُرَ بِٱللَّهِ وَأُشۡرِكَ بِهِۦ مَا لَیۡسَ لِی بِهِۦ عِلۡمࣱ وَأَنَا۠ أَدۡعُوكُمۡ إِلَى ٱلۡعَزِیزِ ٱلۡغَفَّـٰرِ\n"
    }
  },
  {
    "id": 4176,
    "surahId": 40,
    "ayahNumber": 43,
    "arabicText": "لَا جَرَمَ أَنَّمَا تَدۡعُونَنِیۤ إِلَیۡهِ لَیۡسَ لَهُۥ دَعۡوَةࣱ فِی ٱلدُّنۡیَا وَلَا فِی ٱلۡـَٔاخِرَةِ وَأَنَّ مَرَدَّنَاۤ إِلَى ٱللَّهِ وَأَنَّ ٱلۡمُسۡرِفِینَ هُمۡ أَصۡحَـٰبُ ٱلنَّارِ\n",
    "translations": {
      "en": "“There is no doubt that what you summon me to is something that has no claim to being invoked either in this world or in the life to come - as [there is no doubt] that unto God is our return, and that they who have wasted their own selves shall find them­selves in the fire:",
      "ms": "\"Tidak syak lagi, bahawa makhluk-makhluk yang kamu ajak aku menyembahnya itu tidak dapat menyahut sebarang seruan (atau memberikan sebarang pertolongan) sama ada di dunia atau di akhirat; dan sesungguhnya tempat kembali kita semua ialah kepada Allah, dan sebenarnya orang-orang yang melampau kejahatannya itu, merekalah ahli neraka.",
      "id": "Sudah pasti bahwa apa yang kamu seru supaya aku (beriman) kepadanya tidak dapat memperkenankan seruan apapun baik di dunia maupun di akhirat. Dan sesungguhnya kita kembali kepada Allah dan sesungguhnya orang-orang yang melampaui batas, mereka itulah penghuni neraka.",
      "ar": "لَا جَرَمَ أَنَّمَا تَدۡعُونَنِیۤ إِلَیۡهِ لَیۡسَ لَهُۥ دَعۡوَةࣱ فِی ٱلدُّنۡیَا وَلَا فِی ٱلۡـَٔاخِرَةِ وَأَنَّ مَرَدَّنَاۤ إِلَى ٱللَّهِ وَأَنَّ ٱلۡمُسۡرِفِینَ هُمۡ أَصۡحَـٰبُ ٱلنَّارِ\n"
    }
  },
  {
    "id": 4177,
    "surahId": 40,
    "ayahNumber": 44,
    "arabicText": "فَسَتَذۡكُرُونَ مَاۤ أَقُولُ لَكُمۡۚ وَأُفَوِّضُ أَمۡرِیۤ إِلَى ٱللَّهِۚ إِنَّ ٱللَّهَ بَصِیرُۢ بِٱلۡعِبَادِ\n",
    "translations": {
      "en": "and at that time you will [have cause to] remember what I am telling you [now]. “But [as for me,] I commit myself unto God: for, verily, God sees all that is in [the hearts of] His servants.”",
      "ms": "\"(Kiranya kamu tetap berdegil sekarang) maka kamu sudah tentu akan mengetahui kebenaran apa yang aku katakan kepada kamu; dan aku sentiasa menyerahkan urusanku bulat-bulat kepada Allah (untuk memeliharaku); sesungguhnya Allah Maha Melihat akan keadaan hamba-hambaNya\".",
      "id": "Kelak kamu akan ingat kepada apa yang kukatakan kepada kamu. Dan aku menyerahkan urusanku kepada Allah. Sesungguhnya Allah Maha Melihat akan hamba-hamba-Nya\".",
      "ar": "فَسَتَذۡكُرُونَ مَاۤ أَقُولُ لَكُمۡۚ وَأُفَوِّضُ أَمۡرِیۤ إِلَى ٱللَّهِۚ إِنَّ ٱللَّهَ بَصِیرُۢ بِٱلۡعِبَادِ\n"
    }
  },
  {
    "id": 4178,
    "surahId": 40,
    "ayahNumber": 45,
    "arabicText": "فَوَقَىٰهُ ٱللَّهُ سَیِّـَٔاتِ مَا مَكَرُوا۟ۖ وَحَاقَ بِـَٔالِ فِرۡعَوۡنَ سُوۤءُ ٱلۡعَذَابِ\n",
    "translations": {
      "en": "And God preserved him from the evil of their scheming, whereas suffering vile was to encompass Pharaoh’s folk:",
      "ms": "(Dengan keikhlasannya dan penyerahan dirinya kepada Allah) maka ia diselamatkan oleh Allah dari angkara tipu daya mereka; dan Firaun bersama-sama kaumnya ditimpa azab seksa yang seburuk-buruknya,",
      "id": "Maka Allah memeliharanya dari kejahatan tipu daya mereka, dan Fir'aun beserta kaumnya dikepung oleh azab yang amat buruk.",
      "ar": "فَوَقَىٰهُ ٱللَّهُ سَیِّـَٔاتِ مَا مَكَرُوا۟ۖ وَحَاقَ بِـَٔالِ فِرۡعَوۡنَ سُوۤءُ ٱلۡعَذَابِ\n"
    }
  },
  {
    "id": 4179,
    "surahId": 40,
    "ayahNumber": 46,
    "arabicText": "ٱلنَّارُ یُعۡرَضُونَ عَلَیۡهَا غُدُوࣰّا وَعَشِیࣰّاۚ وَیَوۡمَ تَقُومُ ٱلسَّاعَةُ أَدۡخِلُوۤا۟ ءَالَ فِرۡعَوۡنَ أَشَدَّ ٱلۡعَذَابِ\n",
    "translations": {
      "en": "the fire [of the hereafter - that fire] which they had been made to contemplate [in vain], morning and evening: for on the Day when the Last Hour dawns [God will say], “Make Phar­aoh’s folk enter upon suffering most severe!”",
      "ms": "Mereka didedahkan kepada bahang api neraka pada waktu pagi dan petang (semasa mereka berada dalam alam Barzakh); dan pada hari berlakunya kiamat (diperintahkan kepada malaikat): \"Masukkanlah Firaun dan pengikut-pengikutnya ke dalam azab seksa api neraka yang seberat-beratnya!\"",
      "id": "Kepada mereka dinampakkan neraka pada pagi dan petang, dan pada hari terjadinya Kiamat. (Dikatakan kepada malaikat): \"Masukkanlah Fir'aun dan kaumnya ke dalam azab yang sangat keras\".",
      "ar": "ٱلنَّارُ یُعۡرَضُونَ عَلَیۡهَا غُدُوࣰّا وَعَشِیࣰّاۚ وَیَوۡمَ تَقُومُ ٱلسَّاعَةُ أَدۡخِلُوۤا۟ ءَالَ فِرۡعَوۡنَ أَشَدَّ ٱلۡعَذَابِ\n"
    }
  },
  {
    "id": 4180,
    "surahId": 40,
    "ayahNumber": 47,
    "arabicText": "وَإِذۡ یَتَحَاۤجُّونَ فِی ٱلنَّارِ فَیَقُولُ ٱلضُّعَفَـٰۤؤُا۟ لِلَّذِینَ ٱسۡتَكۡبَرُوۤا۟ إِنَّا كُنَّا لَكُمۡ تَبَعࣰا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا نَصِیبࣰا مِّنَ ٱلنَّارِ\n",
    "translations": {
      "en": "AND LO! They [who in life were wont to deny the truth] will contend with one another in the fire [of the hereafter]; and then the weak will say unto those who had gloried in their arrogance, “Behold, we were but your followers: can you, then, relieve us of some [of our] share of this fire?”",
      "ms": "Dan (ingatkanlah perkara yang berlaku) semasa orang-orang yang kafir dan yang menderhaka berbantah-bantahan dalam neraka, iaitu orang-orang yang lemah (yang menjadi pengikut) berkata kepada pemimpin-pemimpinnya yang sombong takbur: \"Sesungguhnya kami telah menjadi pengikut-pengikut kamu, maka dapatkah kamu menolak dari kami sebahagian daripada azab neraka ini?\"",
      "id": "Dan (ingatlah), ketika mereka berbantah-bantah dalam neraka, maka orang-orang yang lemah berkata kepada orang-orang yang menyombongkan diri: \"Sesungguhnya kami adalah pengikut-pengikutmu, maka dapatkah kamu menghindarkan dari kami sebahagian azab api neraka?\"",
      "ar": "وَإِذۡ یَتَحَاۤجُّونَ فِی ٱلنَّارِ فَیَقُولُ ٱلضُّعَفَـٰۤؤُا۟ لِلَّذِینَ ٱسۡتَكۡبَرُوۤا۟ إِنَّا كُنَّا لَكُمۡ تَبَعࣰا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا نَصِیبࣰا مِّنَ ٱلنَّارِ\n"
    }
  },
  {
    "id": 4181,
    "surahId": 40,
    "ayahNumber": 48,
    "arabicText": "قَالَ ٱلَّذِینَ ٱسۡتَكۡبَرُوۤا۟ إِنَّا كُلࣱّ فِیهَاۤ إِنَّ ٱللَّهَ قَدۡ حَكَمَ بَیۡنَ ٱلۡعِبَادِ\n",
    "translations": {
      "en": "[to which] they who had [once] been arrogant will reply, “Behold, we are all in it [together]! Verily, God has judged between His creatures!”",
      "ms": "Orang-orang yang sombong angkuh itu menjawab: \"Sebenarnya kita semua menderita bersama-sama dalam neraka (tidak ada jalan untuk kita melepaskan diri), kerana sesungguhnya Allah telah menetapkan hukumanNya di antara sekalian hambaNya \"",
      "id": "Orang-orang yang menyombongkan diri menjawab: \"Sesungguhnya kita semua sama-sama dalam neraka karena sesungguhnya Allah telah menetapkan keputusan antara hamba-hamba-(Nya)\".",
      "ar": "قَالَ ٱلَّذِینَ ٱسۡتَكۡبَرُوۤا۟ إِنَّا كُلࣱّ فِیهَاۤ إِنَّ ٱللَّهَ قَدۡ حَكَمَ بَیۡنَ ٱلۡعِبَادِ\n"
    }
  },
  {
    "id": 4182,
    "surahId": 40,
    "ayahNumber": 49,
    "arabicText": "وَقَالَ ٱلَّذِینَ فِی ٱلنَّارِ لِخَزَنَةِ جَهَنَّمَ ٱدۡعُوا۟ رَبَّكُمۡ یُخَفِّفۡ عَنَّا یَوۡمࣰا مِّنَ ٱلۡعَذَابِ\n",
    "translations": {
      "en": "And they who are in the fire will say to the keepers of hell, “Pray unto your Sustainer that He lighten, [though it be] for one day [only], this suffering of ours!”",
      "ms": "Dan berkatalah pula orang-orang yang ada dalam neraka kepada malaikat-malaikat penjaga neraka Jahannam: \"Pohonkanlah kepada Tuhan kamu, supaya Ia meringankan sedikit azab seksa dari kami, barang sehari\".",
      "id": "Dan orang-orang yang berada dalam neraka berkata kepada penjaga-penjaga neraka Jahannam: \"Mohonkanlah kepada Tuhanmu supaya Dia meringankan azab dari kami barang sehari\".",
      "ar": "وَقَالَ ٱلَّذِینَ فِی ٱلنَّارِ لِخَزَنَةِ جَهَنَّمَ ٱدۡعُوا۟ رَبَّكُمۡ یُخَفِّفۡ عَنَّا یَوۡمࣰا مِّنَ ٱلۡعَذَابِ\n"
    }
  },
  {
    "id": 4183,
    "surahId": 40,
    "ayahNumber": 50,
    "arabicText": "قَالُوۤا۟ أَوَلَمۡ تَكُ تَأۡتِیكُمۡ رُسُلُكُم بِٱلۡبَیِّنَـٰتِۖ قَالُوا۟ بَلَىٰۚ قَالُوا۟ فَٱدۡعُوا۟ۗ وَمَا دُعَـٰۤؤُا۟ ٱلۡكَـٰفِرِینَ إِلَّا فِی ضَلَـٰلٍ\n",
    "translations": {
      "en": "[But the keepers of hell] will ask, “Is it not [true] that your apostles came unto you with all evidence of the truth?” Those [in the fire] will reply, “Yea, indeed.” [And the keepers of hell] will say, “Pray, then!” - for the prayer of those who deny the truth cannot lead to aught but delusion.",
      "ms": "Malaikat penjaga neraka menjawab: \"Bukankah kamu telah didatangi Rasul-rasul kamu dengan membawa keterangan-keterangan (yang menyatakan akibat perbuatan derhaka kamu)?\" Mereka menjawab: \"Ya, telah datang\". Malaikat itu berkata: \"Jika demikian, maka berdoalah kamu sendiri. Dan doa permohonan orang-orang yang kafir pada saat ini hanya menyebabkan mereka berada dalam keadaan dukacita dan kecewa sahaja\".",
      "id": "Penjaga Jahannam berkata: \"Dan apakah belum datang kepada kamu rasul-rasulmu dengan membawa keterangan-keterangan?\" Mereka menjawab: \"Benar, sudah datang\". Penjaga-penjaga Jahannam berkata: \"Berdoalah kamu\". Dan doa orang-orang kafir itu hanyalah sia-sia belaka.",
      "ar": "قَالُوۤا۟ أَوَلَمۡ تَكُ تَأۡتِیكُمۡ رُسُلُكُم بِٱلۡبَیِّنَـٰتِۖ قَالُوا۟ بَلَىٰۚ قَالُوا۟ فَٱدۡعُوا۟ۗ وَمَا دُعَـٰۤؤُا۟ ٱلۡكَـٰفِرِینَ إِلَّا فِی ضَلَـٰلٍ\n"
    }
  },
  {
    "id": 4184,
    "surahId": 40,
    "ayahNumber": 51,
    "arabicText": "إِنَّا لَنَنصُرُ رُسُلَنَا وَٱلَّذِینَ ءَامَنُوا۟ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَیَوۡمَ یَقُومُ ٱلۡأَشۡهَـٰدُ\n",
    "translations": {
      "en": "BEHOLD, We shall indeed succour Our apostles and those who have attained to faith, [both] in this world’s life and on the Day when all the witnesses shall stand up",
      "ms": "Sesungguhnya Kami tetap membela serta mempertahankan Rasul-rasul Kami dan orang-orang yang beriman - dalam kehidupan dunia ini dan pada saat bangkitnya saksi-saksi (pada hari kiamat)",
      "id": "Sesungguhnya Kami menolong rasul-rasul Kami dan orang-orang yang beriman dalam kehidupan dunia dan pada hari berdirinya saksi-saksi (hari kiamat),",
      "ar": "إِنَّا لَنَنصُرُ رُسُلَنَا وَٱلَّذِینَ ءَامَنُوا۟ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَیَوۡمَ یَقُومُ ٱلۡأَشۡهَـٰدُ\n"
    }
  },
  {
    "id": 4185,
    "surahId": 40,
    "ayahNumber": 52,
    "arabicText": "یَوۡمَ لَا یَنفَعُ ٱلظَّـٰلِمِینَ مَعۡذِرَتُهُمۡۖ وَلَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوۤءُ ٱلدَّارِ\n",
    "translations": {
      "en": "the Day when their excuses will be of no avail to the evildoers, seeing that their lot will be rejection from all that is good, and a woeful hereafter.",
      "ms": "(Iaitu) pada hari yang tidak berguna bagi orang-orang yang zalim dalihan-dalihan mereka untuk melepaskan diri, dan mereka akan beroleh laknat, serta mereka beroleh seburuk-buruk tempat tinggal.",
      "id": "(yaitu) hari yang tidak berguna bagi orang-orang zalim permintaan maafnya dan bagi merekalah laknat dan bagi merekalah tempat tinggal yang buruk.",
      "ar": "یَوۡمَ لَا یَنفَعُ ٱلظَّـٰلِمِینَ مَعۡذِرَتُهُمۡۖ وَلَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوۤءُ ٱلدَّارِ\n"
    }
  },
  {
    "id": 4186,
    "surahId": 40,
    "ayahNumber": 53,
    "arabicText": "وَلَقَدۡ ءَاتَیۡنَا مُوسَى ٱلۡهُدَىٰ وَأَوۡرَثۡنَا بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ ٱلۡكِتَـٰبَ\n",
    "translations": {
      "en": "And, indeed, We bestowed aforetime [Our] guidance on Moses, and [thus] made the children of Israel heirs to the divine writ [revealed to him]",
      "ms": "Dan demi sesungguhnya! Kami telah memberikan Nabi Musa hidayah petunjuk dan Kami berikan kaum Bani Israil mewarisi Kitab Taurat,",
      "id": "Dan sesungguhnya telah Kami berikan petunjuk kepada Musa; dan Kami wariskan Taurat kepada Bani Israil,",
      "ar": "وَلَقَدۡ ءَاتَیۡنَا مُوسَى ٱلۡهُدَىٰ وَأَوۡرَثۡنَا بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ ٱلۡكِتَـٰبَ\n"
    }
  },
  {
    "id": 4187,
    "surahId": 40,
    "ayahNumber": 54,
    "arabicText": "هُدࣰى وَذِكۡرَىٰ لِأُو۟لِی ٱلۡأَلۡبَـٰبِ\n",
    "translations": {
      "en": "as a [means of] guidance and a reminder for those who were endowed with insight:",
      "ms": "Sebagai hidayah petunjuk dan peringatan bagi orang-orang yang berakal sempurna.",
      "id": "untuk menjadi petunjuk dan peringatan bagi orang-orang yang berfikir.",
      "ar": "هُدࣰى وَذِكۡرَىٰ لِأُو۟لِی ٱلۡأَلۡبَـٰبِ\n"
    }
  },
  {
    "id": 4188,
    "surahId": 40,
    "ayahNumber": 55,
    "arabicText": "فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّ وَٱسۡتَغۡفِرۡ لِذَنۢبِكَ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ بِٱلۡعَشِیِّ وَٱلۡإِبۡكَـٰرِ\n",
    "translations": {
      "en": "hence, remain thou patient in adversity - for, verily, God’s promise always comes true - and ask forgiveness for thy sins, and extol thy Sustainer’s glory and praise by night and by day.",
      "ms": "(Setelah engkau mengetahui perihal Nabi Musa dan umatnya) maka bersabarlah (wahai Muhammad, dalam perjuangan menegakkan Islam); sesungguhnya janji Allah (untuk menjayakanmu) adalah benar. Dan pohonlah ampun bagi salah silapmu, serta bertasbihlah dengan memuji Tuhanmu pada waktu pagi dan petang.",
      "id": "Maka bersabarlah kamu, karena sesungguhnya janji Allah itu benar, dan mohonlah ampunan untuk dosamu dan bertasbihlah seraya memuji Tuhanmu pada waktu petang dan pagi.",
      "ar": "فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّ وَٱسۡتَغۡفِرۡ لِذَنۢبِكَ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ بِٱلۡعَشِیِّ وَٱلۡإِبۡكَـٰرِ\n"
    }
  },
  {
    "id": 4189,
    "surahId": 40,
    "ayahNumber": 56,
    "arabicText": "إِنَّ ٱلَّذِینَ یُجَـٰدِلُونَ فِیۤ ءَایَـٰتِ ٱللَّهِ بِغَیۡرِ سُلۡطَـٰنٍ أَتَىٰهُمۡ إِن فِی صُدُورِهِمۡ إِلَّا كِبۡرࣱ مَّا هُم بِبَـٰلِغِیهِۚ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِیعُ ٱلۡبَصِیرُ\n",
    "translations": {
      "en": "Behold, as for those who call God’s messages in question without having any evidence therefore in their hearts is nothing but overweening self-con­ceit, which they will never be able to satisfy: seek thou, then, refuge with God - for, verily, He alone is all-hearing, all-seeing!",
      "ms": "Sesungguhnya orang-orang yang membantah mengenai maksud ayat-ayat Tuhanmu dengan tidak berdasarkan sebarang bukti yang sampai kepada mereka (dari pihak yang diakui benarnya), tidak ada dalam dada mereka melainkan perasaan mahukan kebesaran (untuk mengatasimu), kemahuan yang mereka tidak sekali-kali akan dapat mencapainya. Oleh itu mintalah perlindungan kepada Allah (dari angkara mereka); sesungguhnya Dia lah jua Yang Maha Mendengar, lagi Maha Melihat.",
      "id": "Sesungguhhnya orang-orang yang memperdebatkan tentang ayat-ayat Allah tanpa alasan yang sampai kepada mereka tidak ada dalam dada mereka melainkan hanyalah (keinginan akan) kebesaran yang mereka sekali-kali tiada akan mencapainya, maka mintalah perlindungan kepada Allah. Sesungguhnya Dia Maha Mendengar lagi Maha Melihat.",
      "ar": "إِنَّ ٱلَّذِینَ یُجَـٰدِلُونَ فِیۤ ءَایَـٰتِ ٱللَّهِ بِغَیۡرِ سُلۡطَـٰنٍ أَتَىٰهُمۡ إِن فِی صُدُورِهِمۡ إِلَّا كِبۡرࣱ مَّا هُم بِبَـٰلِغِیهِۚ فَٱسۡتَعِذۡ بِٱللَّهِۖ إِنَّهُۥ هُوَ ٱلسَّمِیعُ ٱلۡبَصِیرُ\n"
    }
  },
  {
    "id": 4190,
    "surahId": 40,
    "ayahNumber": 57,
    "arabicText": "لَخَلۡقُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ أَكۡبَرُ مِنۡ خَلۡقِ ٱلنَّاسِ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "Greater indeed than the creation of man is the creation of the heavens and the earth: yet most men do not understand [what this implies].",
      "ms": "Demi sesungguhnya, menciptakan langit dan bumi (dari tiada kepada ada) lebih besar (dan lebih menakjubkan) daripada menciptakan manusia dan menghidupkannya semula (sesudah matinya); akan tetapi kebanyakan manusia (yang mengingkari hari kiamat) tidak mengetahui.",
      "id": "Sesungguhnya penciptaan langit dan bumi lebih besar daripada penciptaan manusia akan tetapi kebanyakan manusia tidak mengetahui.",
      "ar": "لَخَلۡقُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ أَكۡبَرُ مِنۡ خَلۡقِ ٱلنَّاسِ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 4191,
    "surahId": 40,
    "ayahNumber": 58,
    "arabicText": "وَمَا یَسۡتَوِی ٱلۡأَعۡمَىٰ وَٱلۡبَصِیرُ وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَلَا ٱلۡمُسِیۤءُۚ قَلِیلࣰا مَّا تَتَذَكَّرُونَ\n",
    "translations": {
      "en": "But [then,] the blind and the seeing are not equal; and neither [can] they who have attained to faith and do good works and the doers of evil [be deemed equal]. How seldom do you keep this in mind!",
      "ms": "Dan sememangnya tidaklah sama orang yang buta dan orang yang melihat, dan juga tidaklah sama orang-orang yang beriman serta beramal soleh dengan orang yang melakukan kejahatan. (Meskipun hakikat ini jelas nyata, tetapi) sedikit sangat kamu beringat dan insaf.",
      "id": "Dan tidaklah sama orang yang buta dengan orang yang melihat, dan tidaklah (pula sama) orang-orang yang beriman serta mengerjakan amal saleh dengan orang-orang yang durhaka. Sedikit sekali kamu mengambil pelajaran.",
      "ar": "وَمَا یَسۡتَوِی ٱلۡأَعۡمَىٰ وَٱلۡبَصِیرُ وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَلَا ٱلۡمُسِیۤءُۚ قَلِیلࣰا مَّا تَتَذَكَّرُونَ\n"
    }
  },
  {
    "id": 4192,
    "surahId": 40,
    "ayahNumber": 59,
    "arabicText": "إِنَّ ٱلسَّاعَةَ لَـَٔاتِیَةࣱ لَّا رَیۡبَ فِیهَا وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Verily, the Last Hour is sure to come: of this there is no doubt; yet most men will not believe it.",
      "ms": "Sesungguhnya hari kiamat tetap akan datang, tidak ada sebarang syak tentang kedatangannya; akan tetapi kebanyakan manusia tidak beriman (akan hakikat itu).",
      "id": "Sesungguhnya hari kiamat pasti akan datang, tidak ada keraguan tentangnya, akan tetapi kebanyakan manusia tiada beriman.",
      "ar": "إِنَّ ٱلسَّاعَةَ لَـَٔاتِیَةࣱ لَّا رَیۡبَ فِیهَا وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 4193,
    "surahId": 40,
    "ayahNumber": 60,
    "arabicText": "وَقَالَ رَبُّكُمُ ٱدۡعُونِیۤ أَسۡتَجِبۡ لَكُمۡۚ إِنَّ ٱلَّذِینَ یَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِی سَیَدۡخُلُونَ جَهَنَّمَ دَاخِرِینَ\n",
    "translations": {
      "en": "But your Sustainer says: “Call unto Me, [and] I shall respond to you! Verily, they who are too proud to worship Me will enter hell, abased!”",
      "ms": "Dan Tuhan kamu berfirman: \"Berdoalah kamu kepadaKu nescaya Aku perkenankan doa permohonan kamu. Sesungguhnya orang-orang yang sombong takbur daripada beribadat dan berdoa kepadaKu, akan masuk neraka Jahannam dalam keadaan hina.",
      "id": "Dan Tuhanmu berfirman: \"Berdoalah kepada-Ku, niscaya akan Kuperkenankan bagimu. Sesungguhnya orang-orang yang menyombongkan diri dari menyembah-Ku akan masuk neraka Jahannam dalam keadaan hina dina\".",
      "ar": "وَقَالَ رَبُّكُمُ ٱدۡعُونِیۤ أَسۡتَجِبۡ لَكُمۡۚ إِنَّ ٱلَّذِینَ یَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِی سَیَدۡخُلُونَ جَهَنَّمَ دَاخِرِینَ\n"
    }
  },
  {
    "id": 4194,
    "surahId": 40,
    "ayahNumber": 61,
    "arabicText": "ٱللَّهُ ٱلَّذِی جَعَلَ لَكُمُ ٱلَّیۡلَ لِتَسۡكُنُوا۟ فِیهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَشۡكُرُونَ\n",
    "translations": {
      "en": "IT IS GOD who has made the night for you, so that you might rest therein, and the day, to make [you] see. Behold, God is indeed limitless in His bounty unto man - but most men are ungrateful.",
      "ms": "Allah yang menjadikan malam untuk kamu supaya kamu berehat padanya, dan menjadikan siang terang-benderang (supaya kamu berusaha). Sesungguhnya Allah sentiasa melimpah-limpah kurniaNya kepada manusia seluruhnya, akan tetapi kebanyakan manusia tidak bersyukur.",
      "id": "Allah-lah yang menjadikan malam untuk kamu supaya kamu beristirahat padanya; dan menjadikan siang terang benderang. Sesungguhnya Allah benar-benar mempunyal karunia yang dilimpahkan atas manusia, akan tetapi kebanyakan manusia tidak bersyukur.",
      "ar": "ٱللَّهُ ٱلَّذِی جَعَلَ لَكُمُ ٱلَّیۡلَ لِتَسۡكُنُوا۟ فِیهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَشۡكُرُونَ\n"
    }
  },
  {
    "id": 4195,
    "surahId": 40,
    "ayahNumber": 62,
    "arabicText": "ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمۡ خَـٰلِقُ كُلِّ شَیۡءࣲ لَّاۤ إِلَـٰهَ إِلَّا هُوَۖ فَأَنَّىٰ تُؤۡفَكُونَ\n",
    "translations": {
      "en": "Such is God, your Sustainer, the Creator of all that exists: there is no deity save Him. How perverted, then, are your minds!",
      "ms": "Yang bersifat demikian ialah Allah, Tuhan kamu; yang menciptakan tiap-tiap sesuatu (dari tiada kepada ada); tiada Tuhan (yang berhak disembah) melainkan Dia; maka bagaimana kamu dapat dipalingkan (daripada menyembahNya)?",
      "id": "Yang demikian itu adalah Allah, Tuhanmu, Pencipta segala sesuatu, tiada Tuhan (yang berhak disembah) melainkan Dia; maka bagaimanakah kamu dapat dipalingkan?",
      "ar": "ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمۡ خَـٰلِقُ كُلِّ شَیۡءࣲ لَّاۤ إِلَـٰهَ إِلَّا هُوَۖ فَأَنَّىٰ تُؤۡفَكُونَ\n"
    }
  },
  {
    "id": 4196,
    "surahId": 40,
    "ayahNumber": 63,
    "arabicText": "كَذَ ٰ⁠لِكَ یُؤۡفَكُ ٱلَّذِینَ كَانُوا۟ بِـَٔایَـٰتِ ٱللَّهِ یَجۡحَدُونَ\n",
    "translations": {
      "en": "[For] thus it is: perverted are the minds of those who knowingly reject God’s messages.",
      "ms": "Sebagaimana terpalingnya mereka itu (daripada menyembah Allah), terpaling juga orang-orang yang mengingkari keterangan-keterangan Allah.",
      "id": "Seperti demikianlah dipalingkan orang-orang yang selalu mengingkari ayat-ayat Allah.",
      "ar": "كَذَ ٰ⁠لِكَ یُؤۡفَكُ ٱلَّذِینَ كَانُوا۟ بِـَٔایَـٰتِ ٱللَّهِ یَجۡحَدُونَ\n"
    }
  },
  {
    "id": 4197,
    "surahId": 40,
    "ayahNumber": 64,
    "arabicText": "ٱللَّهُ ٱلَّذِی جَعَلَ لَكُمُ ٱلۡأَرۡضَ قَرَارࣰا وَٱلسَّمَاۤءَ بِنَاۤءࣰ وَصَوَّرَكُمۡ فَأَحۡسَنَ صُوَرَكُمۡ وَرَزَقَكُم مِّنَ ٱلطَّیِّبَـٰتِۚ ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمۡۖ فَتَبَارَكَ ٱللَّهُ رَبُّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "It is God who has made the earth a resting- place for you and the sky a canopy, and has formed you - and formed you so well and provided for you sustenance out of the good things of life. Such is God, your Sustainer: hallowed, then, is God, the Sustainer of all the worlds!",
      "ms": "Allah yang menjadikan bumi sebagai tempat penetapan untuk kamu, dan langit sebagai bumbung yang kukuh binaannya; dan Ia membentuk kamu lalu memperelokkan rupa kamu, serta dikurniakan kepada kamu dari benda-benda yang baik lagi halal. Yang demikian (kekuasaanNya dan kemurahanNya) ialah Allah Tuhan kamu; maka nyatalah kelebihan dan kemurahan Allah, Tuhan sekalian alam.",
      "id": "Allah-lah yang menjadikan bumi bagi kamu tempat menetap dan langit sebagai atap, dan membentuk kamu lalu membaguskan rupamu serta memberi kamu rezeki dengan sebahagian yang baik-baik. Yang demikian itu adalah Allah Tuhanmu, Maha Agung Allah, Tuhan semesta alam.",
      "ar": "ٱللَّهُ ٱلَّذِی جَعَلَ لَكُمُ ٱلۡأَرۡضَ قَرَارࣰا وَٱلسَّمَاۤءَ بِنَاۤءࣰ وَصَوَّرَكُمۡ فَأَحۡسَنَ صُوَرَكُمۡ وَرَزَقَكُم مِّنَ ٱلطَّیِّبَـٰتِۚ ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمۡۖ فَتَبَارَكَ ٱللَّهُ رَبُّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 4198,
    "surahId": 40,
    "ayahNumber": 65,
    "arabicText": "هُوَ ٱلۡحَیُّ لَاۤ إِلَـٰهَ إِلَّا هُوَ فَٱدۡعُوهُ مُخۡلِصِینَ لَهُ ٱلدِّینَۗ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "He is the Ever-Living; there is no deity save Him: call, then, unto Him [alone], sincere in your faith in Him. All praise is due to God, the Sustainer of all the worlds!",
      "ms": "Dia lah Yang Tetap Hidup; tiada Tuhan (yang berhak disembah) melainkan Dia; maka sembahlah kamu akan Dia dengan mengikhlaskan amal ugama kamu kepadaNya semata-mata. Segala puji tertentu bagi Allah Tuhan yang memelihara dan mentadbirkan sekalian alam.",
      "id": "Dialah Yang hidup kekal, tiada Tuhan (yang berhak disembah) melainkan Dia; maka sembahlah Dia dengan memurnikan ibadat kepada-Nya. Segala puji bagi Allah Tuhan semesta alam.",
      "ar": "هُوَ ٱلۡحَیُّ لَاۤ إِلَـٰهَ إِلَّا هُوَ فَٱدۡعُوهُ مُخۡلِصِینَ لَهُ ٱلدِّینَۗ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 4199,
    "surahId": 40,
    "ayahNumber": 66,
    "arabicText": "۞ قُلۡ إِنِّی نُهِیتُ أَنۡ أَعۡبُدَ ٱلَّذِینَ تَدۡعُونَ مِن دُونِ ٱللَّهِ لَمَّا جَاۤءَنِیَ ٱلۡبَیِّنَـٰتُ مِن رَّبِّی وَأُمِرۡتُ أَنۡ أُسۡلِمَ لِرَبِّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "Say: “Since all evidence of the truth has come to me from my Sustainer, I am forbidden to worship [any of] those beings whom you invoke instead of God; and I am bidden to surrender myself to the Sustainer of all the worlds.”",
      "ms": "Katakanlah (wahai Muhammad): \"Sesungguhnya aku dilarang menyembah benda-benda yang kamu sembah yang lain dari Allah - setelah datang kepadaku keterangan-keterangan yang jelas nyata dari Tuhanku; dan aku diperintahkan supaya tunduk taat bulat-bulat kepada perintah Tuhan sekalian alam\".",
      "id": "Katakanlah (ya Muhammad): \"Sesungguhnya aku dilarang menyembah sembahan yang kamu sembah selain Allah setelah datang kepadaku keterangan-keterangan dari Tuhanku; dan aku diperintahkan supaya tunduk patuh kepada Tuhan semesta alam.",
      "ar": "۞ قُلۡ إِنِّی نُهِیتُ أَنۡ أَعۡبُدَ ٱلَّذِینَ تَدۡعُونَ مِن دُونِ ٱللَّهِ لَمَّا جَاۤءَنِیَ ٱلۡبَیِّنَـٰتُ مِن رَّبِّی وَأُمِرۡتُ أَنۡ أُسۡلِمَ لِرَبِّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 4200,
    "surahId": 40,
    "ayahNumber": 67,
    "arabicText": "هُوَ ٱلَّذِی خَلَقَكُم مِّن تُرَابࣲ ثُمَّ مِن نُّطۡفَةࣲ ثُمَّ مِنۡ عَلَقَةࣲ ثُمَّ یُخۡرِجُكُمۡ طِفۡلࣰا ثُمَّ لِتَبۡلُغُوۤا۟ أَشُدَّكُمۡ ثُمَّ لِتَكُونُوا۟ شُیُوخࣰاۚ وَمِنكُم مَّن یُتَوَفَّىٰ مِن قَبۡلُۖ وَلِتَبۡلُغُوۤا۟ أَجَلࣰا مُّسَمࣰّى وَلَعَلَّكُمۡ تَعۡقِلُونَ\n",
    "translations": {
      "en": "It is He who creates you out of dust, and then out of a drop of sperm, and then out of a germ-cell; and then He brings you forth as children; and then [He ordains] that you reach maturity, and then, that you grow old - though some of you [He causes to] die earlier -: and [all this He ordains] so that you might reach a term set [by Him], and that you might [learn to] use your reason.",
      "ms": "Dia lah yang menciptakan kamu dari tanah, kemudian dari (setitis) air benih, kemudian dari sebuku darah beku, kemudian dari seketul daging; kemudian Ia mengeluarkan kamu berupa kanak-kanak; kemudian kamu (dipelihara) hingga sampai ke peringkat umur dewasa; kemudian kamu (dipanjangkan umur) hingga sampai menjadi tua. Dan (dalam pada itu) ada di antara kamu yang dimatikan sebelum itu. (Allah melakukan kejadian yang demikian) supaya kamu sampai ke masa yang ditentukan (untuk menerima balasan); dan supaya kamu memahami (hikmat-hikmat kejadian itu dan kekuasaan Tuhan).",
      "id": "Dialah yang menciptakan kamu dari tanah kemudian dari setetes mani, sesudah itu dari segumpal darah, kemudian dilahirkannya kamu sebagai seorang anak, kemudian (kamu dibiarkan hidup) supaya kamu sampai kepada masa (dewasa), kemudian (dibiarkan kamu hidup lagi) sampai tua, di antara kamu ada yang diwafatkan sebelum itu. (Kami perbuat demikian) supaya kamu sampai kepada ajal yang ditentukan dan supaya kamu memahami(nya).",
      "ar": "هُوَ ٱلَّذِی خَلَقَكُم مِّن تُرَابࣲ ثُمَّ مِن نُّطۡفَةࣲ ثُمَّ مِنۡ عَلَقَةࣲ ثُمَّ یُخۡرِجُكُمۡ طِفۡلࣰا ثُمَّ لِتَبۡلُغُوۤا۟ أَشُدَّكُمۡ ثُمَّ لِتَكُونُوا۟ شُیُوخࣰاۚ وَمِنكُم مَّن یُتَوَفَّىٰ مِن قَبۡلُۖ وَلِتَبۡلُغُوۤا۟ أَجَلࣰا مُّسَمࣰّى وَلَعَلَّكُمۡ تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 4201,
    "surahId": 40,
    "ayahNumber": 68,
    "arabicText": "هُوَ ٱلَّذِی یُحۡیِۦ وَیُمِیتُۖ فَإِذَا قَضَىٰۤ أَمۡرࣰا فَإِنَّمَا یَقُولُ لَهُۥ كُن فَیَكُونُ\n",
    "translations": {
      "en": "It is He who grants life and deals death; and when He wills a thing to be, He but says unto it, “Be” - and it is.",
      "ms": "Dia lah yang menghidupkan dan mematikan; oleh itu apabila Ia menetapkan jadinya sesuatu perkara maka Ia hanya berfirman kepadanya: \"Jadilah engkau!\" Lalu menjadilah ia.",
      "id": "Dialah yang menghidupkan dan mematikan, maka apabila Dia menetapkan sesuatu urusan, Dia hanya bekata kepadanya: \"Jadilah\", maka jadilah ia.",
      "ar": "هُوَ ٱلَّذِی یُحۡیِۦ وَیُمِیتُۖ فَإِذَا قَضَىٰۤ أَمۡرࣰا فَإِنَّمَا یَقُولُ لَهُۥ كُن فَیَكُونُ\n"
    }
  },
  {
    "id": 4202,
    "surahId": 40,
    "ayahNumber": 69,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ یُجَـٰدِلُونَ فِیۤ ءَایَـٰتِ ٱللَّهِ أَنَّىٰ یُصۡرَفُونَ\n",
    "translations": {
      "en": "ART THOU NOT aware of how far they who call God’s messages in question have lost sight of the truth?",
      "ms": "Tidakkah engkau melihat dan merasa hairan terhadap orang-orang yang membantah mengenai maksud ayat-ayat Allah, bagaimana mereka telah dipalingkan (dari kebenaran)?",
      "id": "Apakah kamu tidak melihat kepada orang-orang yang membantah ayat-ayat Allah? Bagaimanakah mereka dapat dipalingkan?",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ یُجَـٰدِلُونَ فِیۤ ءَایَـٰتِ ٱللَّهِ أَنَّىٰ یُصۡرَفُونَ\n"
    }
  },
  {
    "id": 4203,
    "surahId": 40,
    "ayahNumber": 70,
    "arabicText": "ٱلَّذِینَ كَذَّبُوا۟ بِٱلۡكِتَـٰبِ وَبِمَاۤ أَرۡسَلۡنَا بِهِۦ رُسُلَنَاۖ فَسَوۡفَ یَعۡلَمُونَ\n",
    "translations": {
      "en": "they who give the lie to this divine writ and [thus] to all [the messages] with which We sent forth Our apostles [of old]? But in time they will come to know [how blind they have been: they will know it on Judgment Day],",
      "ms": "Iaitu orang-orang yang mendustakan Al-Quran dan segala yang dibawa oleh Rasul-rasul Kami yang telah Kami utus; maka mereka akan mengetahui kelak.",
      "id": "(Yaitu) orang-orang yang mendustakan Al Kitab (Al Quran) dan wahyu yang dibawa oleh rasul-rasul Kami yang telah Kami utus. Kelak mereka akan mengetahui,",
      "ar": "ٱلَّذِینَ كَذَّبُوا۟ بِٱلۡكِتَـٰبِ وَبِمَاۤ أَرۡسَلۡنَا بِهِۦ رُسُلَنَاۖ فَسَوۡفَ یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 4204,
    "surahId": 40,
    "ayahNumber": 71,
    "arabicText": "إِذِ ٱلۡأَغۡلَـٰلُ فِیۤ أَعۡنَـٰقِهِمۡ وَٱلسَّلَـٰسِلُ یُسۡحَبُونَ\n",
    "translations": {
      "en": "when they shall have to carry the shackles and chains [of their own making] around their necks,",
      "ms": "Ketika belenggu dan rantai dipasung di leher mereka, sambil mereka, diseret",
      "id": "ketika belenggu dan rantai dipasang di leher mereka, seraya mereka diseret,",
      "ar": "إِذِ ٱلۡأَغۡلَـٰلُ فِیۤ أَعۡنَـٰقِهِمۡ وَٱلسَّلَـٰسِلُ یُسۡحَبُونَ\n"
    }
  },
  {
    "id": 4205,
    "surahId": 40,
    "ayahNumber": 72,
    "arabicText": "فِی ٱلۡحَمِیمِ ثُمَّ فِی ٱلنَّارِ یُسۡجَرُونَ\n",
    "translations": {
      "en": "and are dragged into burning despair, and in the end become fuel for the fire [of hell].",
      "ms": "Ke dalam air panas yang menggelegak; kemudian mereka dibakar dalam api neraka;",
      "id": "ke dalam air yang sangat panas, kemudian mereka dibakar dalam api,",
      "ar": "فِی ٱلۡحَمِیمِ ثُمَّ فِی ٱلنَّارِ یُسۡجَرُونَ\n"
    }
  },
  {
    "id": 4206,
    "surahId": 40,
    "ayahNumber": 73,
    "arabicText": "ثُمَّ قِیلَ لَهُمۡ أَیۡنَ مَا كُنتُمۡ تُشۡرِكُونَ\n",
    "translations": {
      "en": "And then they will be asked: “Where now are those [powers] to which you were wont to ascribe divinity",
      "ms": "Akhirnya dikatakan kepada mereka: \"Mana dia berhala-berhala yang kamu dahulu sekutukan -",
      "id": "kemudian dikatakan kepada mereka: \"Manakah berhala-berhala yang selalu kamu persekutukan,",
      "ar": "ثُمَّ قِیلَ لَهُمۡ أَیۡنَ مَا كُنتُمۡ تُشۡرِكُونَ\n"
    }
  },
  {
    "id": 4207,
    "surahId": 40,
    "ayahNumber": 74,
    "arabicText": "مِن دُونِ ٱللَّهِۖ قَالُوا۟ ضَلُّوا۟ عَنَّا بَل لَّمۡ نَكُن نَّدۡعُوا۟ مِن قَبۡلُ شَیۡـࣰٔاۚ كَذَ ٰ⁠لِكَ یُضِلُّ ٱللَّهُ ٱلۡكَـٰفِرِینَ\n",
    "translations": {
      "en": "side by side with God?” They will answer: “They have forsaken us - or, rather, what we were wont to invoke aforetime did not exist at all!” And they will be told:] “It is thus that God lets the deniers of the truth go astray:",
      "ms": "\"(Dengan menyembahnya atau memujanya) selain Allah?\" Mereka menjawab: \"Benda-benda itu telah hilang lenyap dari kami, bahkan yang sebenarnya kami dahulu tidak pernah sekutukan sesuatu pun (dengan Allah)\". (Sebagaimana Allah menjadikan mereka sesat), demikian pula Allah menyesatkan orang-orang yang kufur ingkar (menentang maksud ayat-ayatNya).",
      "id": "(yang kamu sembah) selain Allah?\" Mereka menjawab: \"Mereka telah hilang lenyap dari kami, bahkan kami dahulu tiada pernah menyembah sesuatu\". Seperti demikianlah Allah menyesatkan orang-orang kafir.",
      "ar": "مِن دُونِ ٱللَّهِۖ قَالُوا۟ ضَلُّوا۟ عَنَّا بَل لَّمۡ نَكُن نَّدۡعُوا۟ مِن قَبۡلُ شَیۡـࣰٔاۚ كَذَ ٰ⁠لِكَ یُضِلُّ ٱللَّهُ ٱلۡكَـٰفِرِینَ\n"
    }
  },
  {
    "id": 4208,
    "surahId": 40,
    "ayahNumber": 75,
    "arabicText": "ذَ ٰ⁠لِكُم بِمَا كُنتُمۡ تَفۡرَحُونَ فِی ٱلۡأَرۡضِ بِغَیۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَمۡرَحُونَ\n",
    "translations": {
      "en": "this is an out­come of your having arrogantly exulted on earth without any [concern for what is] right, and of your having been so full of self-conceit!",
      "ms": "(Lalu dikatakan kepada mereka setelah ditimpakan dengan azab seksa): \"Balasan buruk yang demikian ini disebabkan kamu dahulu bersukaria di muka bumi dengan cara yang salah (pada hukum Tuhan), dan disebabkan kamu bersenang lenang dan bermegah-megah dengan berleluasa (dalam maksiat).",
      "id": "Yang demikian itu disebabkan karena kamu bersuka ria di muka bumi dengan tidak benar dan karena kamu selalu bersuka ria (dalam kemaksiatan).",
      "ar": "ذَ ٰ⁠لِكُم بِمَا كُنتُمۡ تَفۡرَحُونَ فِی ٱلۡأَرۡضِ بِغَیۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَمۡرَحُونَ\n"
    }
  },
  {
    "id": 4209,
    "surahId": 40,
    "ayahNumber": 76,
    "arabicText": "ٱدۡخُلُوۤا۟ أَبۡوَ ٰ⁠بَ جَهَنَّمَ خَـٰلِدِینَ فِیهَاۖ فَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِینَ\n",
    "translations": {
      "en": "Enter [now] the gates of hell, therein to abide: and how vile an abode for all who are given to false pride!”",
      "ms": "\"Masukilah pintu-pintu neraka Jahannam kekalah kamu di dalamnya; maka seburuk-buruk tempat bagi orang-orang yang sombong takbur ialah neraka Jahannam\".",
      "id": "(Dikatakan kepada mereka): \"Masuklah kamu ke pintu-pintu neraka Jahannam, sedang kamu kekal di dalamnya. Maka itulah seburuk-buruk tempat bagi orang-orang yang sombong\".",
      "ar": "ٱدۡخُلُوۤا۟ أَبۡوَ ٰ⁠بَ جَهَنَّمَ خَـٰلِدِینَ فِیهَاۖ فَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِینَ\n"
    }
  },
  {
    "id": 4210,
    "surahId": 40,
    "ayahNumber": 77,
    "arabicText": "فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّۚ فَإِمَّا نُرِیَنَّكَ بَعۡضَ ٱلَّذِی نَعِدُهُمۡ أَوۡ نَتَوَفَّیَنَّكَ فَإِلَیۡنَا یُرۡجَعُونَ\n",
    "translations": {
      "en": "HENCE, remain thou patient in adversity - for, verily, God’s promise always comes true. And whether We show thee [in this world] something of what We hold in store for those [deniers of the truth], or whether We cause thee to die [ere that retribution takes place - know that, in the end], it is unto Us that they will be brought back.",
      "ms": "Maka bersabarlah (wahai Muhammad), sesungguhnya janji Allah (menyeksa musuh-musuhmu itu) adalah benar; oleh itu kiranya Kami perlihatkan kepadamu sebahagian dari azab yang Kami janjikan kepada mereka, ataupun Kami wafatkanmu sebelum itu, (maka tetaplah mereka akan menerima balasan azab) kerana kepada Kamilah mereka akan dikembalikan.",
      "id": "Maka bersabarlah kamu, sesungguhnya janji Allah adalah benar; maka meskipun Kami perlihatkan kepadamu sebagian siksa yang Kami ancamkan kepada mereka ataupun Kami wafatkan kamu (sebelum ajal menimpa mereka), namun kepada Kami sajalah mereka dikembalikan.",
      "ar": "فَٱصۡبِرۡ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّۚ فَإِمَّا نُرِیَنَّكَ بَعۡضَ ٱلَّذِی نَعِدُهُمۡ أَوۡ نَتَوَفَّیَنَّكَ فَإِلَیۡنَا یُرۡجَعُونَ\n"
    }
  },
  {
    "id": 4211,
    "surahId": 40,
    "ayahNumber": 78,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلࣰا مِّن قَبۡلِكَ مِنۡهُم مَّن قَصَصۡنَا عَلَیۡكَ وَمِنۡهُم مَّن لَّمۡ نَقۡصُصۡ عَلَیۡكَۗ وَمَا كَانَ لِرَسُولٍ أَن یَأۡتِیَ بِـَٔایَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ فَإِذَا جَاۤءَ أَمۡرُ ٱللَّهِ قُضِیَ بِٱلۡحَقِّ وَخَسِرَ هُنَالِكَ ٱلۡمُبۡطِلُونَ\n",
    "translations": {
      "en": "And, indeed, [O Muhammad,] We sent forth apostles before thy time; some of them We have mentioned to thee, and some of them We have not mentioned to thee. And it was not given to any apostle to bring forth a miracle other than by God’s leave. Yet when God’s will becomes manifest, judgment will [already] have been passed in all justice, and lost will be, then and there, all who tried to reduce to nothing [whatever they could not understand].",
      "ms": "Dan demi sesungguhnya! Kami telah mengutus beberapa Rasul sebelummu; di antara mereka ada yang Kami ceritakan perihalnya kepadamu, dan ada pula di antaranya yang tidak Kami ceritakan kepada kamu. Dan tidaklah harus bagi seseorang Rasul membawa sesuatu keterangan atau menunjukkan sesuatu mukjizat melainkan dengan izin Allah; (maka janganlah diingkari apa yang dibawa oleh Rasul) kerana apabila datang perintah Allah (menimpakan azab) diputuskan hukum dengan adil; pada saat itu rugilah orang-orang yang berpegang kepada perkara yang salah.",
      "id": "Dan sesungguhnya telah Kami utus beberapa orang rasul sebelum kamu, di antara mereka ada yang Kami ceritakan kepadamu dan di antara mereka ada (pula) yang tidak Kami ceritakan kepadamu. Tidak dapat bagi seorang rasul membawa suatu mukjizat, melainkan dengan seizin Allah; maka apabila telah datang perintah Allah, diputuskan (semua perkara) dengan adil. Dan ketika itu rugilah orang-orang yang berpegang kepada yang batil.",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلࣰا مِّن قَبۡلِكَ مِنۡهُم مَّن قَصَصۡنَا عَلَیۡكَ وَمِنۡهُم مَّن لَّمۡ نَقۡصُصۡ عَلَیۡكَۗ وَمَا كَانَ لِرَسُولٍ أَن یَأۡتِیَ بِـَٔایَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ فَإِذَا جَاۤءَ أَمۡرُ ٱللَّهِ قُضِیَ بِٱلۡحَقِّ وَخَسِرَ هُنَالِكَ ٱلۡمُبۡطِلُونَ\n"
    }
  },
  {
    "id": 4212,
    "surahId": 40,
    "ayahNumber": 79,
    "arabicText": "ٱللَّهُ ٱلَّذِی جَعَلَ لَكُمُ ٱلۡأَنۡعَـٰمَ لِتَرۡكَبُوا۟ مِنۡهَا وَمِنۡهَا تَأۡكُلُونَ\n",
    "translations": {
      "en": "It is God who [at all times works wonders for you: thus, He] provides for you [all manner of] livestock, so that on some of them you may ride, and from some derive your food,",
      "ms": "Allah yang menjadikan binatang ternak bagi kamu; sebahagian di antaranya untuk kamu menunggangnya, dan sebahagian lagi untuk kamu makan.",
      "id": "Allahlah yang menjadikan binatang ternak untuk kamu, sebagiannya untuk kamu kendarai dan sebagiannya untuk kamu makan.",
      "ar": "ٱللَّهُ ٱلَّذِی جَعَلَ لَكُمُ ٱلۡأَنۡعَـٰمَ لِتَرۡكَبُوا۟ مِنۡهَا وَمِنۡهَا تَأۡكُلُونَ\n"
    }
  },
  {
    "id": 4213,
    "surahId": 40,
    "ayahNumber": 80,
    "arabicText": "وَلَكُمۡ فِیهَا مَنَـٰفِعُ وَلِتَبۡلُغُوا۟ عَلَیۡهَا حَاجَةࣰ فِی صُدُورِكُمۡ وَعَلَیۡهَا وَعَلَى ٱلۡفُلۡكِ تُحۡمَلُونَ\n",
    "translations": {
      "en": "and find [yet other] benefits in them; and that through them you may attain to the fulfillment of [many] a heartfelt need: for on them, as on ships, you are borne [through life].",
      "ms": "Dan kamu pula beroleh berbagai faedah pada binatang ternak itu, dan supaya kamu dapat memenuhi sesuatu hajat yang ada dalam hati kamu dengan menggunakan binatang itu; dan di atas binatang-binatang ternak itu, serta di atas kapal-kapal, kamu diangkut.",
      "id": "Dan (ada lagi) manfaat-manfaat yang lain pada binatang ternak itu untuk kamu dan supaya kamu mencapai suatu keperluan yang tersimpan dalam hati dengan mengendarainya. Dan kamu dapat diangkut dengan mengendarai binatang-binatang itu dan dengan mengendarai bahtera.",
      "ar": "وَلَكُمۡ فِیهَا مَنَـٰفِعُ وَلِتَبۡلُغُوا۟ عَلَیۡهَا حَاجَةࣰ فِی صُدُورِكُمۡ وَعَلَیۡهَا وَعَلَى ٱلۡفُلۡكِ تُحۡمَلُونَ\n"
    }
  },
  {
    "id": 4214,
    "surahId": 40,
    "ayahNumber": 81,
    "arabicText": "وَیُرِیكُمۡ ءَایَـٰتِهِۦ فَأَیَّ ءَایَـٰتِ ٱللَّهِ تُنكِرُونَ\n",
    "translations": {
      "en": "And [thus] He displays His wonders before you: which, then, of God’s wonders can you still deny?",
      "ms": "Dan Ia memperlihatkan kepada kamu tanda-tanda kebesaranNya dan kekuasaanNya (melalui Rasul-rasulNya dan pada makhluk-makhluk yang dijadikanNya); maka di antara tanda-tanda kesempurnaan Allah, yang mana satu, yang kamu ingkari?",
      "id": "Dan Dia memperlihatkan kepada kamu tanda-tanda (kekuasaan-Nya); maka tanda-tanda (kekuasaan) Allah yang manakah yang kamu ingkari?",
      "ar": "وَیُرِیكُمۡ ءَایَـٰتِهِۦ فَأَیَّ ءَایَـٰتِ ٱللَّهِ تُنكِرُونَ\n"
    }
  },
  {
    "id": 4215,
    "surahId": 40,
    "ayahNumber": 82,
    "arabicText": "أَفَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَیَنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلَّذِینَ مِن قَبۡلِهِمۡۚ كَانُوۤا۟ أَكۡثَرَ مِنۡهُمۡ وَأَشَدَّ قُوَّةࣰ وَءَاثَارࣰا فِی ٱلۡأَرۡضِ فَمَاۤ أَغۡنَىٰ عَنۡهُم مَّا كَانُوا۟ یَكۡسِبُونَ\n",
    "translations": {
      "en": "HAVE THEY, then, never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before their time? More numerous were they, and greater in power than they are, and in the impact which they left on earth: but all that they ever achieved was of no avail to them –",
      "ms": "Selain dari itu, tidakkah mereka telah berjalan dan mengembara di muka bumi, dengan itu tidakkah mereka memerhatikan bagaimana kesudahan orang-orang yang terdahulu dari mereka (yang telah dibinasakan dengan sebab dosa-dosanya)? Orang-orang itu lebih ramai dari mereka, dan lebih dari mereka tentang kekuatan tenaga dan tentang kesan-kesan usaha pembangunan di muka bumi. Dalam pada itu, apa yang telah diusahakan oleh orang-orang itu, tidak dapat menolongnya sedikitpun.",
      "id": "Maka apakah mereka tiada mengadakan perjalanan di muka bumi lalu memperhatikan betapa kesudahan orang-orang yang sebelum mereka. Adalah orang-orang yang sebelum mereka itu lebih hebat kekuatannya dan (lebih banyak) bekas-bekas mereka di muka bumi, maka apa yang mereka usahakan itu tidak dapat menolong mereka.",
      "ar": "أَفَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَیَنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلَّذِینَ مِن قَبۡلِهِمۡۚ كَانُوۤا۟ أَكۡثَرَ مِنۡهُمۡ وَأَشَدَّ قُوَّةࣰ وَءَاثَارࣰا فِی ٱلۡأَرۡضِ فَمَاۤ أَغۡنَىٰ عَنۡهُم مَّا كَانُوا۟ یَكۡسِبُونَ\n"
    }
  },
  {
    "id": 4216,
    "surahId": 40,
    "ayahNumber": 83,
    "arabicText": "فَلَمَّا جَاۤءَتۡهُمۡ رُسُلُهُم بِٱلۡبَیِّنَـٰتِ فَرِحُوا۟ بِمَا عِندَهُم مِّنَ ٱلۡعِلۡمِ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n",
    "translations": {
      "en": "for when their apostles came to them with all evidence of the truth, they arrogantly exulted in whatever knowledge they [already] possessed: and [so, in the end,] they were overwhelmed by the very thing which they were wont to deride.",
      "ms": "Kerana pada masa mereka didatangi oleh Rasul-rasul yang diutus kepada mereka dengan membawa keterangan-keterangan (untuk menyelamatkan mereka, mereka mengejek-ejeknya, dan) mereka bergembira dengan pengetahuan yang ada pada mereka (yang mengenai keduniaan semata-mata); dan dengan yang demikian mereka pun diliputi oleh azab yang mereka ejek-ejek dahulu.",
      "id": "Maka tatkala datang kepada mereka rasul-rasul (yang diutus kepada) mereka dengan membawa ketarangan-keterangan, mereka merasa senang dengan pengetahuan yang ada pada mereka dan mereka dikepung oleh azab Allah yang selalu mereka perolok-olokkan itu.",
      "ar": "فَلَمَّا جَاۤءَتۡهُمۡ رُسُلُهُم بِٱلۡبَیِّنَـٰتِ فَرِحُوا۟ بِمَا عِندَهُم مِّنَ ٱلۡعِلۡمِ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n"
    }
  },
  {
    "id": 4217,
    "surahId": 40,
    "ayahNumber": 84,
    "arabicText": "فَلَمَّا رَأَوۡا۟ بَأۡسَنَا قَالُوۤا۟ ءَامَنَّا بِٱللَّهِ وَحۡدَهُۥ وَكَفَرۡنَا بِمَا كُنَّا بِهِۦ مُشۡرِكِینَ\n",
    "translations": {
      "en": "And then, when they [clearly] beheld Our punishment, they said: “We have come to believe in the One God, and we have renounced all belief in that to which we were wont to ascribe a share in His divinity!”",
      "ms": "Maka ketika mereka melihat azab Kami, mereka berkata: \"Kami beriman kepada Allah semata-mata, dan kami kufur ingkar kepada benda-benda yang dengan sebabnya kami menjadi musyrik\".",
      "id": "Maka tatkala mereka melihat azab Kami, mereka berkata: \"Kami beriman hanya kepada Allah saja, dan kami kafir kepada sembahan-sembahan yang telah kami persekutukan dengan Allah\".",
      "ar": "فَلَمَّا رَأَوۡا۟ بَأۡسَنَا قَالُوۤا۟ ءَامَنَّا بِٱللَّهِ وَحۡدَهُۥ وَكَفَرۡنَا بِمَا كُنَّا بِهِۦ مُشۡرِكِینَ\n"
    }
  },
  {
    "id": 4218,
    "surahId": 40,
    "ayahNumber": 85,
    "arabicText": "فَلَمۡ یَكُ یَنفَعُهُمۡ إِیمَـٰنُهُمۡ لَمَّا رَأَوۡا۟ بَأۡسَنَاۖ سُنَّتَ ٱللَّهِ ٱلَّتِی قَدۡ خَلَتۡ فِی عِبَادِهِۦۖ وَخَسِرَ هُنَالِكَ ٱلۡكَـٰفِرُونَ\n",
    "translations": {
      "en": "But their attaining to faith after they had beheld Our punishment could not possibly benefit them such being the way of God that has always obtained for His creatures -: and so, then and there, lost were they who had denied the truth.",
      "ms": "Maka iman yang mereka katakan semasa melihat azab Kami, tidak berguna lagi kepada mereka; yang demikian adalah menurut \"Sunnatullah\" (undang-undang peraturan Allah) yang telah berlaku kepada hamba-hambaNya. Dan pada saat itu rugilah orang-orang yang kufur ingkar.",
      "id": "Maka iman mereka tiada berguna bagi mereka tatkala mereka telah melihat siksa Kami. Itulah sunnah Allah yang telah berlaku terhadap hamba-hamba-Nya. Dan di waktu itu binasalah orang-orang kafir.",
      "ar": "فَلَمۡ یَكُ یَنفَعُهُمۡ إِیمَـٰنُهُمۡ لَمَّا رَأَوۡا۟ بَأۡسَنَاۖ سُنَّتَ ٱللَّهِ ٱلَّتِی قَدۡ خَلَتۡ فِی عِبَادِهِۦۖ وَخَسِرَ هُنَالِكَ ٱلۡكَـٰفِرُونَ\n"
    }
  }
]