[
  {
    "id": 4273,
    "surahId": 42,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ حمۤ\n",
    "translations": {
      "en": "Ha. Mim.",
      "ms": "Haa, Miim.",
      "id": "Haa Miim.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ حمۤ\n"
    }
  },
  {
    "id": 4274,
    "surahId": 42,
    "ayahNumber": 2,
    "arabicText": "عۤسۤقۤ\n",
    "translations": {
      "en": "Ayn. Sin. Qaf.",
      "ms": "Ain, Siin, Qaaf.",
      "id": "'Ain Siin Qaaf.",
      "ar": "عۤسۤقۤ\n"
    }
  },
  {
    "id": 4275,
    "surahId": 42,
    "ayahNumber": 3,
    "arabicText": "كَذَ ٰ⁠لِكَ یُوحِیۤ إِلَیۡكَ وَإِلَى ٱلَّذِینَ مِن قَبۡلِكَ ٱللَّهُ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n",
    "translations": {
      "en": "THUS has God, the Almighty, the Wise, revealed [the truth] unto thee, [O Muhammad,] and unto those who preceded thee:",
      "ms": "Sebagaimana yang terkandung dalam surah ini dan surah-surah yang lain - diwahyukan kepadamu (wahai Muhammad) dan kepada Rasul-rasul yang terdahulu daripadamu, oleh Allah Yang Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Demikianlah Allah Yang Maha Perkasa lagi Maha Bijaksana, mewahyukan kepada kamu dan kepada orang-orang sebelum kamu.",
      "ar": "كَذَ ٰ⁠لِكَ یُوحِیۤ إِلَیۡكَ وَإِلَى ٱلَّذِینَ مِن قَبۡلِكَ ٱللَّهُ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n"
    }
  },
  {
    "id": 4276,
    "surahId": 42,
    "ayahNumber": 4,
    "arabicText": "لَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَلِیُّ ٱلۡعَظِیمُ\n",
    "translations": {
      "en": "His is all that is in the heavens and all that is on earth; and most exalted, tremendous is He.",
      "ms": "Dia lah yang mempunyai dan menguasai segala yang ada di langit dan yang ada di bumi; dan Dia lah Yang Tertinggi keadaanNya, lagi Maha Besar (kekuasaanNya).",
      "id": "Kepunyaan-Nya-lah apa yang ada di langit dan apa yang ada di bumi. Dan Dialah yang Maha Tinggi lagi Maha Besar.",
      "ar": "لَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَلِیُّ ٱلۡعَظِیمُ\n"
    }
  },
  {
    "id": 4277,
    "surahId": 42,
    "ayahNumber": 5,
    "arabicText": "تَكَادُ ٱلسَّمَـٰوَ ٰ⁠تُ یَتَفَطَّرۡنَ مِن فَوۡقِهِنَّۚ وَٱلۡمَلَـٰۤىِٕكَةُ یُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَیَسۡتَغۡفِرُونَ لِمَن فِی ٱلۡأَرۡضِۗ أَلَاۤ إِنَّ ٱللَّهَ هُوَ ٱلۡغَفُورُ ٱلرَّحِیمُ\n",
    "translations": {
      "en": "The uppermost heavens are well-nigh rent asunder [for awe of Him]; and the angels extol their Sustainer’s limitless glory and praise, and ask for­giveness for all who are on earth. Oh, verily, God alone is truly-forgiving, a dispenser of grace!",
      "ms": "Alam langit nyaris-nyaris pecah dari sebelah atasnya (kerana ngeri dan takutnya kepada kemurkaan Allah terhadap penduduk bumi yang lupakan kebesaran Allah sehingga menyeleweng dari jalan yang benar); dan malaikat bertasbih dengan memuji Tuhannya serta memohon ampun bagi makhluk-makhluk yang ada di bumi. Ingatlah! Sesungguhnya Allah, Dia lah Yang Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Hampir saja langit itu pecah dari sebelah atas (karena kebesaran Tuhan) dan malaikat-malaikat bertasbih serta memuji Tuhan-nya dan memohonkan ampun bagi orang-orang yang ada di bumi. Ingatlah, bahwa sesungguhnya Allah Dialah Yang Maha Pengampun lagi Penyayang.",
      "ar": "تَكَادُ ٱلسَّمَـٰوَ ٰ⁠تُ یَتَفَطَّرۡنَ مِن فَوۡقِهِنَّۚ وَٱلۡمَلَـٰۤىِٕكَةُ یُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَیَسۡتَغۡفِرُونَ لِمَن فِی ٱلۡأَرۡضِۗ أَلَاۤ إِنَّ ٱللَّهَ هُوَ ٱلۡغَفُورُ ٱلرَّحِیمُ\n"
    }
  },
  {
    "id": 4278,
    "surahId": 42,
    "ayahNumber": 6,
    "arabicText": "وَٱلَّذِینَ ٱتَّخَذُوا۟ مِن دُونِهِۦۤ أَوۡلِیَاۤءَ ٱللَّهُ حَفِیظٌ عَلَیۡهِمۡ وَمَاۤ أَنتَ عَلَیۡهِم بِوَكِیلࣲ\n",
    "translations": {
      "en": "NOW AS FOR those who take aught beside Him for their protectors - God watches them, and thou art not responsible for their conduct.",
      "ms": "Dan (sebaliknya) orang-orang yang menjadikan sesuatu yang lain dari Allah sebagai pelindung (yang disembah dan diharapkan pertolongannya), Allah sentiasa mengawasi tingkah laku mereka (serta akan membalasnya); dan engkau (wahai Muhammad hanyalah penyampai) bukanlah menjadi wakil yang menguasai soal (bawaan dan amalan) mereka.",
      "id": "Dan orang-orang yang mengambil pelindung-pelindung selain Allah, Allah mengawasi (perbuatan) mereka; dan kamu (ya Muhammad) bukanlah orang yang diserahi mengawasi mereka.",
      "ar": "وَٱلَّذِینَ ٱتَّخَذُوا۟ مِن دُونِهِۦۤ أَوۡلِیَاۤءَ ٱللَّهُ حَفِیظٌ عَلَیۡهِمۡ وَمَاۤ أَنتَ عَلَیۡهِم بِوَكِیلࣲ\n"
    }
  },
  {
    "id": 4279,
    "surahId": 42,
    "ayahNumber": 7,
    "arabicText": "وَكَذَ ٰ⁠لِكَ أَوۡحَیۡنَاۤ إِلَیۡكَ قُرۡءَانًا عَرَبِیࣰّا لِّتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَا وَتُنذِرَ یَوۡمَ ٱلۡجَمۡعِ لَا رَیۡبَ فِیهِۚ فَرِیقࣱ فِی ٱلۡجَنَّةِ وَفَرِیقࣱ فِی ٱلسَّعِیرِ\n",
    "translations": {
      "en": "[Thou art but entrusted with Our message:] and so We have revealed unto thee a discourse in the Arabic tongue in order that thou mayest warn the foremost of all cities and all who dwell around it to wit, warn [them] of the Day of the Gathering, [the coming of] which is beyond all doubt: [the Day when] some shall find themselves in paradise, and some in the blazing flame.",
      "ms": "Dan sebagaimana Kami tetapkan engkau hanya penyampai, Kami wahyukan kepadamu Al-Quran dalam bahasa Arab, supaya engkau memberi peringatan dan amaran kepada (penduduk) \"Ummul-Qura\" dan sekalian penduduk dunia di sekelilingnya, serta memberi peringatan dan amaran mengenai hari perhimpunan (hari kiamat) - yang tidak ada syak tentang masa datangnya; (pada hari itu) sepuak masuk Syurga dan sepuak lagi masuk neraka.",
      "id": "Demikianlah Kami wahyukan kepadamu Al Quran dalam bahasa Arab, supaya kamu memberi peringatan kepada ummul Qura (penduduk Mekah) dan penduduk (negeri-negeri) sekelilingnya serta memberi peringatan (pula) tentang hari berkumpul (kiamat) yang tidak ada keraguan padanya. Segolongan masuk surga, dan segolongan masuk Jahannam.",
      "ar": "وَكَذَ ٰ⁠لِكَ أَوۡحَیۡنَاۤ إِلَیۡكَ قُرۡءَانًا عَرَبِیࣰّا لِّتُنذِرَ أُمَّ ٱلۡقُرَىٰ وَمَنۡ حَوۡلَهَا وَتُنذِرَ یَوۡمَ ٱلۡجَمۡعِ لَا رَیۡبَ فِیهِۚ فَرِیقࣱ فِی ٱلۡجَنَّةِ وَفَرِیقࣱ فِی ٱلسَّعِیرِ\n"
    }
  },
  {
    "id": 4280,
    "surahId": 42,
    "ayahNumber": 8,
    "arabicText": "وَلَوۡ شَاۤءَ ٱللَّهُ لَجَعَلَهُمۡ أُمَّةࣰ وَ ٰ⁠حِدَةࣰ وَلَـٰكِن یُدۡخِلُ مَن یَشَاۤءُ فِی رَحۡمَتِهِۦۚ وَٱلظَّـٰلِمُونَ مَا لَهُم مِّن وَلِیࣲّ وَلَا نَصِیرٍ\n",
    "translations": {
      "en": "Now had God so willed, He could surely have made them all one single community: none the less, He admits unto His grace him that wills [to be admitted] whereas the evildoers shall have none to protect them and none to succour them [on Judgment Day].",
      "ms": "Dan jika Allah menghendaki, tentulah Ia menjadikan mereka satu umat (yang bersatu dalam ugama Allah yang satu); akan tetapi Allah (tidak merancang yang demikian bahkan Ia akan) memasukkan sesiapa yang dikehendakiNya ke dalam rahmatNya (menurut peraturan yang telah ditetapkan); dan orang-orang yang zalim tidak ada baginya sesiapapun yang dapat memberikan perlindungan dan pertolongan.",
      "id": "Dan kalau Allah menghendaki niscaya Allah menjadikan mereka satu umat (saja), tetapi Dia memasukkan orang-orang yang dikehendaki-Nya ke dalam rahmat-Nya. Dan orang-orang yang zalim tidak ada bagi mereka seorang pelindungpun dan tidak pula seorang penolong.",
      "ar": "وَلَوۡ شَاۤءَ ٱللَّهُ لَجَعَلَهُمۡ أُمَّةࣰ وَ ٰ⁠حِدَةࣰ وَلَـٰكِن یُدۡخِلُ مَن یَشَاۤءُ فِی رَحۡمَتِهِۦۚ وَٱلظَّـٰلِمُونَ مَا لَهُم مِّن وَلِیࣲّ وَلَا نَصِیرٍ\n"
    }
  },
  {
    "id": 4281,
    "surahId": 42,
    "ayahNumber": 9,
    "arabicText": "أَمِ ٱتَّخَذُوا۟ مِن دُونِهِۦۤ أَوۡلِیَاۤءَۖ فَٱللَّهُ هُوَ ٱلۡوَلِیُّ وَهُوَ یُحۡیِ ٱلۡمَوۡتَىٰ وَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n",
    "translations": {
      "en": "Did they, perchance, [think that they could] choose protectors other than Him? But God alone is the Protector [of all that exists], since it is He alone who brings the dead to life, and He alone who has the power to will anything.",
      "ms": "Tidaklah patut mereka menjadikan sesuatu yang lain dari Allah sebagai pelindung-pelindung (yang disembah dan dipuja) kerana Allah jualah Pelindung yang sebenar-benarnya, dan Dia lah yang menghidupkan makhluk-makhluk yang mati. Dan (ingatlah), Ia Maha Kuasa atas tiap-tiap sesuatu.",
      "id": "Atau patutkah mereka mengambil pelindung-pelindung selain Allah? Maka Allah, Dialah pelindung (yang sebenarnya) dan Dia menghidupkan orang-orang yang mati, dan Dia adalah Maha Kuasa atas segala sesuatu.",
      "ar": "أَمِ ٱتَّخَذُوا۟ مِن دُونِهِۦۤ أَوۡلِیَاۤءَۖ فَٱللَّهُ هُوَ ٱلۡوَلِیُّ وَهُوَ یُحۡیِ ٱلۡمَوۡتَىٰ وَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n"
    }
  },
  {
    "id": 4282,
    "surahId": 42,
    "ayahNumber": 10,
    "arabicText": "وَمَا ٱخۡتَلَفۡتُمۡ فِیهِ مِن شَیۡءࣲ فَحُكۡمُهُۥۤ إِلَى ٱللَّهِۚ ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبِّی عَلَیۡهِ تَوَكَّلۡتُ وَإِلَیۡهِ أُنِیبُ\n",
    "translations": {
      "en": "AND ON WHATEVER you may differ, [O believers,] the verdict thereon rests with God. [Say, therefore:] “Such is God, my Sustainer: in Him have I placed my trust, and unto Him do I always turn!”",
      "ms": "Dan (katakanlah wahai Muhammad kepada pengikut-pengikutmu): \"Apa jua perkara ugama yang kamu berselisihan padanya maka hukum pemutusnya terserah kepada Allah; Hakim yang demikian kekuasaanNya ialah Allah Tuhanku; kepadaNyalah aku berserah diri dan kepadaNyalah aku rujuk kembali (dalam segala keadaan)\".",
      "id": "Tentang sesuatu apapun kamu berselisih, maka putusannya (terserah) kepada Allah. (Yang mempunyai sifat-sifat demikian) itulah Allah Tuhanku. Kepada-Nya lah aku bertawakkal dan kepada-Nya-lah aku kembali.",
      "ar": "وَمَا ٱخۡتَلَفۡتُمۡ فِیهِ مِن شَیۡءࣲ فَحُكۡمُهُۥۤ إِلَى ٱللَّهِۚ ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبِّی عَلَیۡهِ تَوَكَّلۡتُ وَإِلَیۡهِ أُنِیبُ\n"
    }
  },
  {
    "id": 4283,
    "surahId": 42,
    "ayahNumber": 11,
    "arabicText": "فَاطِرُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَ ٰ⁠جࣰا وَمِنَ ٱلۡأَنۡعَـٰمِ أَزۡوَ ٰ⁠جࣰا یَذۡرَؤُكُمۡ فِیهِۚ لَیۡسَ كَمِثۡلِهِۦ شَیۡءࣱۖ وَهُوَ ٱلسَّمِیعُ ٱلۡبَصِیرُ\n",
    "translations": {
      "en": "The Originator [is He] of the heavens and the earth. He has given you mates of your own kind just as [He has willed that] among the beasts [there be] mates - to multiply you thereby: [but] there is nothing like unto Him, and He alone is all-hearing, all-seeing.",
      "ms": "Dia lah yang menciptakan langit dan bumi; Ia menjadikan bagi kamu pasangan-pasangan dari jenis kamu sendiri, dan menjadikan dari jenis binatang-binatang ternak pasangan-pasangan (bagi bintang-binatang itu); dengan jalan yang demikian dikembangkanNya (zuriat keturunan) kamu semua. Tiada sesuatupun yang sebanding dengan (ZatNya, sifat-sifatNya, dan pentadbiranNya) dan Dia lah Yang Maha Mendengar, lagi Maha Melihat.",
      "id": "(Dia) Pencipta langit dan bumi. Dia menjadikan bagi kamu dari jenis kamu sendiri pasangan-pasangan dan dari jenis binatang ternak pasangan-pasangan (pula), dijadikan-Nya kamu berkembang biak dengan jalan itu. Tidak ada sesuatupun yang serupa dengan Dia, dan Dialah yang Maha Mendengar dan Melihat.",
      "ar": "فَاطِرُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَ ٰ⁠جࣰا وَمِنَ ٱلۡأَنۡعَـٰمِ أَزۡوَ ٰ⁠جࣰا یَذۡرَؤُكُمۡ فِیهِۚ لَیۡسَ كَمِثۡلِهِۦ شَیۡءࣱۖ وَهُوَ ٱلسَّمِیعُ ٱلۡبَصِیرُ\n"
    }
  },
  {
    "id": 4284,
    "surahId": 42,
    "ayahNumber": 12,
    "arabicText": "لَهُۥ مَقَالِیدُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ وَیَقۡدِرُۚ إِنَّهُۥ بِكُلِّ شَیۡءٍ عَلِیمࣱ\n",
    "translations": {
      "en": "His are the keys of the heavens and the earth: He grants abundant sustenance, or gives it in scant measure, unto whomever He wills: for, behold, He has full knowledge of everything.",
      "ms": "Dia lah jua yang menguasai urusan dan perbendaharaan langit dan bumi; Ia memewahkan rezeki bagi sesiapa yang dikehendakiNya (menurut peraturan yang telah ditetapkan), dan Dia juga yang menyempitkannya (menurut peraturan itu); sesungguhnya Ia Maha Mengetahui akan tiap-tiap sesuatu.",
      "id": "Kepunyaan-Nya-lah perbendaharaan langit dan bumi; Dia melapangkan rezeki bagi siapa yang dikehendaki-Nya dan menyempitkan(nya). Sesungguhnya Dia Maha Mengetahui segala sesuatu.",
      "ar": "لَهُۥ مَقَالِیدُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ وَیَقۡدِرُۚ إِنَّهُۥ بِكُلِّ شَیۡءٍ عَلِیمࣱ\n"
    }
  },
  {
    "id": 4285,
    "surahId": 42,
    "ayahNumber": 13,
    "arabicText": "۞ شَرَعَ لَكُم مِّنَ ٱلدِّینِ مَا وَصَّىٰ بِهِۦ نُوحࣰا وَٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ وَمَا وَصَّیۡنَا بِهِۦۤ إِبۡرَ ٰ⁠هِیمَ وَمُوسَىٰ وَعِیسَىٰۤۖ أَنۡ أَقِیمُوا۟ ٱلدِّینَ وَلَا تَتَفَرَّقُوا۟ فِیهِۚ كَبُرَ عَلَى ٱلۡمُشۡرِكِینَ مَا تَدۡعُوهُمۡ إِلَیۡهِۚ ٱللَّهُ یَجۡتَبِیۤ إِلَیۡهِ مَن یَشَاۤءُ وَیَهۡدِیۤ إِلَیۡهِ مَن یُنِیبُ\n",
    "translations": {
      "en": "In matters of faith, He has ordained for you that which He had enjoined upon Noah - and into which We gave thee [O Muhammad] insight through revelation as well as that which We had enjoined upon Abraham, and Moses, and Jesus: Steadfastly uphold the [true] faith, and do not break up your unity therein. [And even though] that [unity of faith] to which thou callest them appears oppressive to those who are wont to ascribe to other beings or forces a share in His divinity, God draws unto Himself everyone who is willing, and guides unto Himself everyone who turns unto Him.",
      "ms": "Allah telah menerangkan kepada kamu - di antara perkara-perkara ugama yang Ia tetapkan hukumnya - apa yang telah diperintahkanNya kepada Nabi Nuh, dan yang telah Kami (Allah) wahyukan kepadamu (wahai Muhammad), dan juga yang telah Kami perintahkan kepada Nabi Ibrahim dan Nabi Musa serta Nabi Isa, iaitu: \"Tegakkanlah pendirian ugama, dan janganlah kamu berpecah belah atau berselisihan pada dasarnya\". Berat bagi orang-orang musyrik (untuk menerima ugama tauhid) yang engkau seru mereka kepadanya. Allah memilih serta melorongkan sesiapa yang dikehendakiNya untuk menerima ugama tauhid itu, dan memberi hidayah petunjuk kepada ugamaNya itu sesiapa yang rujuk kembali kepadaNya (dengan taat).",
      "id": "Dia telah mensyari'atkan bagi kamu tentang agama apa yang telah diwasiatkan-Nya kepada Nuh dan apa yang telah Kami wahyukan kepadamu dan apa yang telah Kami wasiatkan kepada Ibrahim, Musa dan Isa yaitu: Tegakkanlah agama dan janganlah kamu berpecah belah tentangnya. Amat berat bagi orang-orang musyrik agama yang kamu seru mereka kepadanya. Allah menarik kepada agama itu orang yang dikehendaki-Nya dan memberi petunjuk kepada (agama)-Nya orang yang kembali (kepada-Nya).",
      "ar": "۞ شَرَعَ لَكُم مِّنَ ٱلدِّینِ مَا وَصَّىٰ بِهِۦ نُوحࣰا وَٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ وَمَا وَصَّیۡنَا بِهِۦۤ إِبۡرَ ٰ⁠هِیمَ وَمُوسَىٰ وَعِیسَىٰۤۖ أَنۡ أَقِیمُوا۟ ٱلدِّینَ وَلَا تَتَفَرَّقُوا۟ فِیهِۚ كَبُرَ عَلَى ٱلۡمُشۡرِكِینَ مَا تَدۡعُوهُمۡ إِلَیۡهِۚ ٱللَّهُ یَجۡتَبِیۤ إِلَیۡهِ مَن یَشَاۤءُ وَیَهۡدِیۤ إِلَیۡهِ مَن یُنِیبُ\n"
    }
  },
  {
    "id": 4286,
    "surahId": 42,
    "ayahNumber": 14,
    "arabicText": "وَمَا تَفَرَّقُوۤا۟ إِلَّا مِنۢ بَعۡدِ مَا جَاۤءَهُمُ ٱلۡعِلۡمُ بَغۡیَۢا بَیۡنَهُمۡۚ وَلَوۡلَا كَلِمَةࣱ سَبَقَتۡ مِن رَّبِّكَ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى لَّقُضِیَ بَیۡنَهُمۡۚ وَإِنَّ ٱلَّذِینَ أُورِثُوا۟ ٱلۡكِتَـٰبَ مِنۢ بَعۡدِهِمۡ لَفِی شَكࣲّ مِّنۡهُ مُرِیبࣲ\n",
    "translations": {
      "en": "And [as for the followers of earlier revelation,] they broke up their unity, out of mutual jealousy, only after they had come to know [the truth]. And had it not been for a decree that had already gone forth from thy Sustainer, [postponing all decision] until a term set [by Him], all would indeed have been decided between them [from the outset]. As it is, behold, they who have inherited their divine writ from those who preceded them are [now] in grave doubt, amounting to suspicion, about what it por­tends.",
      "ms": "Dan umat tiap-tiap Rasul tidak berpecah belah dan berselisihan (dalam menjalankan ugama Allah) melainkan setelah sampai kepada mereka ajaran-ajaran yang memberi mereka mengetahui (apa yang disuruh dan apa yang dilarang); berlakunya (perselisihan yang demikian) semata-mata kerana hasad dengki sesama sendiri. Dan kalaulah tidak kerana telah terdahulu kalimah ketetapan dari Tuhanmu (untuk menangguhkan hukuman) hingga ke suatu masa yang tertentu, tentulah dijatuhkan hukuman azab dengan serta-merta kepada mereka. Dan sesungguhnya orang-orang yang diberikan Allah mewarisi Kitab ugama kemudian daripada mereka, berada dalam keadaan syak yang menggelisahkan terhadap Kitab itu.",
      "id": "Dan mereka (ahli kitab) tidak berpecah belah, kecuali setelah datang pada mereka ilmu pengetahuan, karena kedengkian di antara mereka. Kalau tidaklah karena sesuatu ketetapan yang telah ada dari Tuhanmu dahulunya (untuk menangguhkan azab) sampai kepada waktu yang ditentukan, pastilah mereka telah dibinasakan. Dan sesungguhnya orang-orang yang diwariskan kepada mereka Al-Kitab (Taurat dan Injil) sesudah mereka, benar-benar berada dalam keraguan yang menggoncangkan tentang kitab itu.",
      "ar": "وَمَا تَفَرَّقُوۤا۟ إِلَّا مِنۢ بَعۡدِ مَا جَاۤءَهُمُ ٱلۡعِلۡمُ بَغۡیَۢا بَیۡنَهُمۡۚ وَلَوۡلَا كَلِمَةࣱ سَبَقَتۡ مِن رَّبِّكَ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى لَّقُضِیَ بَیۡنَهُمۡۚ وَإِنَّ ٱلَّذِینَ أُورِثُوا۟ ٱلۡكِتَـٰبَ مِنۢ بَعۡدِهِمۡ لَفِی شَكࣲّ مِّنۡهُ مُرِیبࣲ\n"
    }
  },
  {
    "id": 4287,
    "surahId": 42,
    "ayahNumber": 15,
    "arabicText": "فَلِذَ ٰ⁠لِكَ فَٱدۡعُۖ وَٱسۡتَقِمۡ كَمَاۤ أُمِرۡتَۖ وَلَا تَتَّبِعۡ أَهۡوَاۤءَهُمۡۖ وَقُلۡ ءَامَنتُ بِمَاۤ أَنزَلَ ٱللَّهُ مِن كِتَـٰبࣲۖ وَأُمِرۡتُ لِأَعۡدِلَ بَیۡنَكُمُۖ ٱللَّهُ رَبُّنَا وَرَبُّكُمۡۖ لَنَاۤ أَعۡمَـٰلُنَا وَلَكُمۡ أَعۡمَـٰلُكُمۡۖ لَا حُجَّةَ بَیۡنَنَا وَبَیۡنَكُمُۖ ٱللَّهُ یَجۡمَعُ بَیۡنَنَاۖ وَإِلَیۡهِ ٱلۡمَصِیرُ\n",
    "translations": {
      "en": "Because of this, then, summon [all mankind], and pursue the right course, as thou hast been bidden [by God]; and do not follow their likes and dislikes, but say: “I believe in whatever revelation God has be­stowed from on high; and I am bidden to bring about equity in your mutual views. God is our Sustainer as well as your Sustainer. To us shall be accounted our deeds, and to you, your deeds. Let there be no contention between us and you: God will bring us all together - for with Him is all journeys’ end.”",
      "ms": "Oleh kerana yang demikian itu, maka serulah (mereka - wahai Muhammad - kepada berugama dengan betul), serta tetap teguhlah engkau menjalankannya sebagaimana yang diperintahkan kepadamu, dan janganlah engkau menurut kehendak hawa nafsu mereka; sebaliknya katakanlah: \"Aku beriman kepada segala Kitab yang diturunkan oleh Allah, dan aku diperintahkan supaya berlaku adil di antara kamu. Allah jualah Tuhan kami dan Tuhan kamu. Bagi kami amal kami dan bagi kamu amal kamu. Tidaklah patut ada sebarang pertengkaran antara kami dengan kamu (kerana kebenaran telah jelas nyata). Allah akan menghimpunkan kita bersama (pada hari kiamat), dan kepadaNyalah tempat kembali semuanya (untuk dihakimi dan diberi balasan)\".",
      "id": "Maka karena itu serulah (mereka kepada agama ini) dan tetaplah sebagai mana diperintahkan kepadamu dan janganlah mengikuti hawa nafsu mereka dan katakanlah: \"Aku beriman kepada semua Kitab yang diturunkan Allah dan aku diperintahkan supaya berlaku adil diantara kamu. Allah-lah Tuhan kami dan Tuhan kamu. Bagi kami amal-amal kami dan bagi kamu amal-amal kamu. Tidak ada pertengkaran antara kami dan kamu, Allah mengumpulkan antara kita dan kepada-Nya-lah kembali (kita)\".",
      "ar": "فَلِذَ ٰ⁠لِكَ فَٱدۡعُۖ وَٱسۡتَقِمۡ كَمَاۤ أُمِرۡتَۖ وَلَا تَتَّبِعۡ أَهۡوَاۤءَهُمۡۖ وَقُلۡ ءَامَنتُ بِمَاۤ أَنزَلَ ٱللَّهُ مِن كِتَـٰبࣲۖ وَأُمِرۡتُ لِأَعۡدِلَ بَیۡنَكُمُۖ ٱللَّهُ رَبُّنَا وَرَبُّكُمۡۖ لَنَاۤ أَعۡمَـٰلُنَا وَلَكُمۡ أَعۡمَـٰلُكُمۡۖ لَا حُجَّةَ بَیۡنَنَا وَبَیۡنَكُمُۖ ٱللَّهُ یَجۡمَعُ بَیۡنَنَاۖ وَإِلَیۡهِ ٱلۡمَصِیرُ\n"
    }
  },
  {
    "id": 4288,
    "surahId": 42,
    "ayahNumber": 16,
    "arabicText": "وَٱلَّذِینَ یُحَاۤجُّونَ فِی ٱللَّهِ مِنۢ بَعۡدِ مَا ٱسۡتُجِیبَ لَهُۥ حُجَّتُهُمۡ دَاحِضَةٌ عِندَ رَبِّهِمۡ وَعَلَیۡهِمۡ غَضَبࣱ وَلَهُمۡ عَذَابࣱ شَدِیدٌ\n",
    "translations": {
      "en": "And as for those who would [still] argue about God after He has been acknowledged [by them] all their arguments are null and void in their Sustainer’s sight, and upon them will fall [His] condemnation, and for them is suffering severe in store:",
      "ms": "Dan orang-orang yang berhujah menyangkal dan membantah tentang kebenaran ugama Allah sesudah disambut dan diterima ugamaNya itu - bantahan (dan tuduhan palsu) mereka itu sia-sia belaka di sisi Tuhan mereka. Dan mereka pula ditimpa kemurkaan (dari Allah) serta mereka beroleh azab seksa yang seberat-beratnya.",
      "id": "Dan orang-orang yang membantah (agama) Allah sesudah agama itu diterima maka bantahan mereka itu sia-sia saja, di sisi Tuhan mereka. Mereka mendapat kemurkaan (Allah) dan bagi mereka azab yang sangat keras.",
      "ar": "وَٱلَّذِینَ یُحَاۤجُّونَ فِی ٱللَّهِ مِنۢ بَعۡدِ مَا ٱسۡتُجِیبَ لَهُۥ حُجَّتُهُمۡ دَاحِضَةٌ عِندَ رَبِّهِمۡ وَعَلَیۡهِمۡ غَضَبࣱ وَلَهُمۡ عَذَابࣱ شَدِیدٌ\n"
    }
  },
  {
    "id": 4289,
    "surahId": 42,
    "ayahNumber": 17,
    "arabicText": "ٱللَّهُ ٱلَّذِیۤ أَنزَلَ ٱلۡكِتَـٰبَ بِٱلۡحَقِّ وَٱلۡمِیزَانَۗ وَمَا یُدۡرِیكَ لَعَلَّ ٱلسَّاعَةَ قَرِیبࣱ\n",
    "translations": {
      "en": "[for] it is God [Himself] who has bestowed revelation from on high, setting forth the truth, and [thus given man] a balance [wherewith to weigh right and wrong]. And for all thou knowest, the Last Hour may well be near!",
      "ms": "Allah yang menurunkan Kitab Suci dengan membawa kebenaran, dan menurunkan keterangan yang menjadi neraca keadilan. Dan apa jalannya engkau dapat mengetahui? Boleh jadi hari kiamat itu sudah hampir (masa datangnya).",
      "id": "Allah-lah yang menurunkan kitab dengan (membawa) kebenaran dan (menurunkan) neraca (keadilan). Dan tahukah kamu, boleh jadi hari kiamat itu (sudah) dekat?",
      "ar": "ٱللَّهُ ٱلَّذِیۤ أَنزَلَ ٱلۡكِتَـٰبَ بِٱلۡحَقِّ وَٱلۡمِیزَانَۗ وَمَا یُدۡرِیكَ لَعَلَّ ٱلسَّاعَةَ قَرِیبࣱ\n"
    }
  },
  {
    "id": 4290,
    "surahId": 42,
    "ayahNumber": 18,
    "arabicText": "یَسۡتَعۡجِلُ بِهَا ٱلَّذِینَ لَا یُؤۡمِنُونَ بِهَاۖ وَٱلَّذِینَ ءَامَنُوا۟ مُشۡفِقُونَ مِنۡهَا وَیَعۡلَمُونَ أَنَّهَا ٱلۡحَقُّۗ أَلَاۤ إِنَّ ٱلَّذِینَ یُمَارُونَ فِی ٱلسَّاعَةِ لَفِی ضَلَـٰلِۭ بَعِیدٍ\n",
    "translations": {
      "en": "Those who do not believe in it [mockingly] ask for its speedy advent whereas those who have attained to faith stand in awe of it, and know it to be the truth. Oh, verily, they who call the Last Hour in question have indeed gone far astray!",
      "ms": "Orang-orang yang tidak beriman kepada hari kiamat itu meminta (secara mengejek-ejek) supaya disegerakan kedatangannya, dan (sebaliknya) orang-orang yang beriman merasa takut ngeri kepadanya serta mereka mengetahui dengan yakin bahawa ia adalah benar. Ketahuilah! Sesungguhnya orang-orang yang membantah mengenai hari kiamat itu, tetap berada dalam kesesatan yang jauh terpesong.",
      "id": "Orang-orang yang tidak beriman kepada hari kiamat meminta supaya hari itu segera didatangkan dan orang-orang yang beriman merasa takut kepadanya dan mereka yakin bahwa kiamat itu adalah benar (akan terjadi). Ketahuilah bahwa sesungguhnya orang-orang yang membantah tentang terjadinya kiamat itu benar-benar dalam kesesatan yang jauh.",
      "ar": "یَسۡتَعۡجِلُ بِهَا ٱلَّذِینَ لَا یُؤۡمِنُونَ بِهَاۖ وَٱلَّذِینَ ءَامَنُوا۟ مُشۡفِقُونَ مِنۡهَا وَیَعۡلَمُونَ أَنَّهَا ٱلۡحَقُّۗ أَلَاۤ إِنَّ ٱلَّذِینَ یُمَارُونَ فِی ٱلسَّاعَةِ لَفِی ضَلَـٰلِۭ بَعِیدٍ\n"
    }
  },
  {
    "id": 4291,
    "surahId": 42,
    "ayahNumber": 19,
    "arabicText": "ٱللَّهُ لَطِیفُۢ بِعِبَادِهِۦ یَرۡزُقُ مَن یَشَاۤءُۖ وَهُوَ ٱلۡقَوِیُّ ٱلۡعَزِیزُ\n",
    "translations": {
      "en": "GOD is most kind unto His creatures: He provides sustenance for whomever He wills - for He alone is powerful, almighty!",
      "ms": "Allah Maha Lembut tadbirNya (serta melimpah-limpah kebaikan dan belas kasihanNya) kepada hamba-hambaNya; Ia memberi rezeki kepada sesiapa yang dikehendakiNya (menurut peraturan yang telah ditetapkan), dan Dia lah Yang Maha Kuat, lagi Maha Kuasa.",
      "id": "Allah Maha lembut terhadap hamba-hamba-Nya; Dia memberi rezeki kepada yang di kehendaki-Nya dan Dialah Yang Maha Kuat lagi Maha Perkasa.",
      "ar": "ٱللَّهُ لَطِیفُۢ بِعِبَادِهِۦ یَرۡزُقُ مَن یَشَاۤءُۖ وَهُوَ ٱلۡقَوِیُّ ٱلۡعَزِیزُ\n"
    }
  },
  {
    "id": 4292,
    "surahId": 42,
    "ayahNumber": 20,
    "arabicText": "مَن كَانَ یُرِیدُ حَرۡثَ ٱلۡـَٔاخِرَةِ نَزِدۡ لَهُۥ فِی حَرۡثِهِۦۖ وَمَن كَانَ یُرِیدُ حَرۡثَ ٱلدُّنۡیَا نُؤۡتِهِۦ مِنۡهَا وَمَا لَهُۥ فِی ٱلۡـَٔاخِرَةِ مِن نَّصِیبٍ\n",
    "translations": {
      "en": "To him who desires a harvest in the life to come, We shall grant an increase in his harvest; whereas to him who desires [but] a harvest in this world, We [may] give something thereof - but he will have no share in [the blessings of] the life to come.",
      "ms": "Sesiapa yang menghendaki (dengan amal usahanya) mendapat faedah di akhirat, Kami akan memberinya mendapat tambahan pada faedah yang dikehendakinya; dan sesiapa yang menghendaki (dengan amal usahanya) kebaikan di dunia semata-mata, Kami beri kepadanya dari kebaikan dunia itu (sekadar yang Kami tentukan), dan ia tidak akan beroleh sesuatu bahagian pun di akhirat kelak.",
      "id": "Barang siapa yang menghendaki keuntungan di akhirat akan Kami tambah keuntungan itu baginya dan barang siapa yang menghendaki keuntungan di dunia Kami berikan kepadanya sebagian dari keuntungan dunia dan tidak ada baginya suatu bahagianpun di akhirat.",
      "ar": "مَن كَانَ یُرِیدُ حَرۡثَ ٱلۡـَٔاخِرَةِ نَزِدۡ لَهُۥ فِی حَرۡثِهِۦۖ وَمَن كَانَ یُرِیدُ حَرۡثَ ٱلدُّنۡیَا نُؤۡتِهِۦ مِنۡهَا وَمَا لَهُۥ فِی ٱلۡـَٔاخِرَةِ مِن نَّصِیبٍ\n"
    }
  },
  {
    "id": 4293,
    "surahId": 42,
    "ayahNumber": 21,
    "arabicText": "أَمۡ لَهُمۡ شُرَكَـٰۤؤُا۟ شَرَعُوا۟ لَهُم مِّنَ ٱلدِّینِ مَا لَمۡ یَأۡذَنۢ بِهِ ٱللَّهُۚ وَلَوۡلَا كَلِمَةُ ٱلۡفَصۡلِ لَقُضِیَ بَیۡنَهُمۡۗ وَإِنَّ ٱلظَّـٰلِمِینَ لَهُمۡ عَذَابٌ أَلِیمࣱ\n",
    "translations": {
      "en": "Is it that they [who care for no more than this world] believe in forces supposed to have a share in God’s divinity, which enjoin upon them as a moral law something that God has never allowed? Now were it not for [God’s] decree on the final judgment, all would indeed have been decided be­tween them [in this world]: but, verily, grievous suffering awaits the evildoers [in the life to come].",
      "ms": "Patutkah mereka mempunyai sekutu-sekutu yang menentukan - mana-mana bahagian dari ugama mereka - sebarang undang-undang yang tidak diizinkan oleh Allah? Dan kalaulah tidak kerana kalimah ketetapan yang menjadi pemutus (dari Allah, untuk menangguhkan hukuman hingga ke suatu masa yang tertentu), tentulah dijatuhkan azab dengan serta-merta kepada mereka (yang berbuat demikian). Dan sesungguhnya orang-orang yang zalim itu akan beroleh azab seksa yang tidak terperi sakitnya.",
      "id": "Apakah mereka mempunyai sembahan-sembahan selain Allah yang mensyariatkan untuk mereka agama yang tidak diizinkan Allah? Sekiranya tak ada ketetapan yang menentukan (dari Allah) tentulah mereka telah dibinasakan. Dan sesungguhnya orang-orang yang zalim itu akan memperoleh azab yang amat pedih.",
      "ar": "أَمۡ لَهُمۡ شُرَكَـٰۤؤُا۟ شَرَعُوا۟ لَهُم مِّنَ ٱلدِّینِ مَا لَمۡ یَأۡذَنۢ بِهِ ٱللَّهُۚ وَلَوۡلَا كَلِمَةُ ٱلۡفَصۡلِ لَقُضِیَ بَیۡنَهُمۡۗ وَإِنَّ ٱلظَّـٰلِمِینَ لَهُمۡ عَذَابٌ أَلِیمࣱ\n"
    }
  },
  {
    "id": 4294,
    "surahId": 42,
    "ayahNumber": 22,
    "arabicText": "تَرَى ٱلظَّـٰلِمِینَ مُشۡفِقِینَ مِمَّا كَسَبُوا۟ وَهُوَ وَاقِعُۢ بِهِمۡۗ وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فِی رَوۡضَاتِ ٱلۡجَنَّاتِۖ لَهُم مَّا یَشَاۤءُونَ عِندَ رَبِّهِمۡۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡفَضۡلُ ٱلۡكَبِیرُ\n",
    "translations": {
      "en": "[In that life to come,] thou wilt see the evil­doers full of fear at [the thought of] what they have earned: for [now] it is bound to fall back upon them. And in the flowering meadows of the gardens [of paradise thou wilt see] those who have attained to faith and done righteous deeds: all that they might desire shall they have with their Sustainer: [and] this, this is the great bounty –",
      "ms": "(Pada hari kiamat) engkau akan melihat orang-orang yang zalim takut ngeri (akan balasan buruk) bagi kejahatan-kejahatan yang mereka telah lakukan, sedang azab seksa itu tetap menimpa mereka. Dan orang-orang yang beriman serta beramal soleh (bersenang-lenang) dalam taman-taman Syurga; mereka beroleh apa sahaja yang mereka ingini di sisi Tuhan mereka; yang demikian itu ialah limpah kurnia yang besar.",
      "id": "Kamu lihat orang-orang yang zalim sangat ketakutan karena kejahatan-kejahatan yang telah mereka kerjakan, sedang siksaan menimpa mereka. Dan orang-orang yang beriman serta mengerjakan amal saleh (berada) di dalam taman-taman surga, mereka memperoleh apa yang mereka kehendaki di sisi Tuhan mereka. Yang demikian itu adalah karunia yang besar.",
      "ar": "تَرَى ٱلظَّـٰلِمِینَ مُشۡفِقِینَ مِمَّا كَسَبُوا۟ وَهُوَ وَاقِعُۢ بِهِمۡۗ وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فِی رَوۡضَاتِ ٱلۡجَنَّاتِۖ لَهُم مَّا یَشَاۤءُونَ عِندَ رَبِّهِمۡۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡفَضۡلُ ٱلۡكَبِیرُ\n"
    }
  },
  {
    "id": 4295,
    "surahId": 42,
    "ayahNumber": 23,
    "arabicText": "ذَ ٰ⁠لِكَ ٱلَّذِی یُبَشِّرُ ٱللَّهُ عِبَادَهُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِۗ قُل لَّاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ أَجۡرًا إِلَّا ٱلۡمَوَدَّةَ فِی ٱلۡقُرۡبَىٰۗ وَمَن یَقۡتَرِفۡ حَسَنَةࣰ نَّزِدۡ لَهُۥ فِیهَا حُسۡنًاۚ إِنَّ ٱللَّهَ غَفُورࣱ شَكُورٌ\n",
    "translations": {
      "en": "that [bounty] whereof God gives the glad tiding to such of His servants as attain to faith and do righteous deeds. Say [O Prophet]: “No reward do I ask of you for this [message] other than [that you should] love your fellow-men.” For, if anyone gains [the merit of] a good deed, We shall grant him through it an increase of good: and, verily, God is much-forgiving, ever responsive to gratitude.",
      "ms": "(Limpah kurnia yang besar) itulah yang Allah gembirakan (dengannya): hamba-hambaNya yang beriman dan beramal soleh. Katakanlah (wahai Muhammad): \"Aku tidak meminta kepada kamu sebarang upah tentang ajaran Islam yang aku sampaikan itu, (yang aku minta) hanyalah kasih mesra (kamu terhadapku) disebabkan pertalian kerabat (yang menghubungkan daku dengan kamu supaya aku tidak disakiti)\". Dan sesiapa yang mengerjakan sesuatu perkara yang baik, Kami tambahi kebaikan baginya (dengan menggandakan pahala) kebaikannya itu. Sesungguhnya Allah Maha Pengampun, lagi sentiasa membalas dengan sebaik-baiknya (akan orang-orang yang bersyukur kepadaNya).",
      "id": "Itulah (karunia) yang (dengan itu) Allah menggembirakan hamba-hamba-Nya yang beriman dan mengerjakan amal yang saleh. Katakanlah: \"Aku tidak meminta kepadamu sesuatu upahpun atas seruanku kecuali kasih sayang dalam kekeluargaan\". Dan siapa yang mengerjakan kebaikan akan Kami tambahkan baginya kebaikan pada kebaikannya itu. Sesungguhnya Allah Maha Pengampun lagi Maha Mensyukuri.",
      "ar": "ذَ ٰ⁠لِكَ ٱلَّذِی یُبَشِّرُ ٱللَّهُ عِبَادَهُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِۗ قُل لَّاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ أَجۡرًا إِلَّا ٱلۡمَوَدَّةَ فِی ٱلۡقُرۡبَىٰۗ وَمَن یَقۡتَرِفۡ حَسَنَةࣰ نَّزِدۡ لَهُۥ فِیهَا حُسۡنًاۚ إِنَّ ٱللَّهَ غَفُورࣱ شَكُورٌ\n"
    }
  },
  {
    "id": 4296,
    "surahId": 42,
    "ayahNumber": 24,
    "arabicText": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبࣰاۖ فَإِن یَشَإِ ٱللَّهُ یَخۡتِمۡ عَلَىٰ قَلۡبِكَۗ وَیَمۡحُ ٱللَّهُ ٱلۡبَـٰطِلَ وَیُحِقُّ ٱلۡحَقَّ بِكَلِمَـٰتِهِۦۤۚ إِنَّهُۥ عَلِیمُۢ بِذَاتِ ٱلصُّدُورِ\n",
    "translations": {
      "en": "DO THEY, perchance, say, “[Muhammad] has attri­buted his own lying inventions to God”? But then, had God so willed, He could have sealed thy heart [forever]: for God blots out all falsehood, and by His words proves the truth to be true. Verily, He has full knowledge of what is in the hearts [of men];",
      "ms": "(Orang-orang kafir tidak mengakui kerasulan Nabi Muhammad) bahkan mereka mengatakan: \"Ia telah mereka-reka perkara dusta terhadap Allah\" (Sebenarnya tidak patut mereka berkata demikian) kerana Allah berkuasa - jika Ia menghendaki - menutup hatimu (dan ingatanmu daripada menyatakan apa yang engkau telah nyatakan itu, tetapi Allah tidak menghendaki yang demikian, bahkan Ia memberi kuasa menyampaikan perintahNya, maka semua kenyataan yang engkau sampaikan adalah benar belaka). Dan sememangnya Allah tetap menghapuskan perkara yang salah serta Ia menetapkan yang benar dengan kalimah-kalimah wahyuNya dan keputusanNya. Sesungguhnya Ia Maha Mengetahui akan segala (isi hati) yang terkandung di dalam dada.",
      "id": "Bahkan mereka mengatakan: \"Dia (Muhammad) telah mengada-adakan dusta terhadap Allah\". Maka jika Allah menghendaki niscaya Dia mengunci mati hatimu; dan Allah menghapuskan yang batil dan membenarkan yang hak dengan kalimat-kalimat-Nya (Al Quran). Sesungguhnya Dia Maha Mengetahui segala isi hati.",
      "ar": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبࣰاۖ فَإِن یَشَإِ ٱللَّهُ یَخۡتِمۡ عَلَىٰ قَلۡبِكَۗ وَیَمۡحُ ٱللَّهُ ٱلۡبَـٰطِلَ وَیُحِقُّ ٱلۡحَقَّ بِكَلِمَـٰتِهِۦۤۚ إِنَّهُۥ عَلِیمُۢ بِذَاتِ ٱلصُّدُورِ\n"
    }
  },
  {
    "id": 4297,
    "surahId": 42,
    "ayahNumber": 25,
    "arabicText": "وَهُوَ ٱلَّذِی یَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَیَعۡفُوا۟ عَنِ ٱلسَّیِّـَٔاتِ وَیَعۡلَمُ مَا تَفۡعَلُونَ\n",
    "translations": {
      "en": "and it is He who accepts repen­tance from His servants, and pardons bad deeds, and knows all that you do,",
      "ms": "Dan Dia lah Tuhan yang menerima taubat dari hamba-hambaNya (yang bertaubat) serta memaafkan kejahatan-kejahatan (yang mereka lakukan); dan Ia mengetahui akan apa yang kamu semua kerjakan.",
      "id": "Dan Dialah yang menerima taubat dari hamba-hamba-Nya dan memaafkan kesalahan-kesalahan dan mengetahui apa yang kamu kerjakan,",
      "ar": "وَهُوَ ٱلَّذِی یَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَیَعۡفُوا۟ عَنِ ٱلسَّیِّـَٔاتِ وَیَعۡلَمُ مَا تَفۡعَلُونَ\n"
    }
  },
  {
    "id": 4298,
    "surahId": 42,
    "ayahNumber": 26,
    "arabicText": "وَیَسۡتَجِیبُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَیَزِیدُهُم مِّن فَضۡلِهِۦۚ وَٱلۡكَـٰفِرُونَ لَهُمۡ عَذَابࣱ شَدِیدࣱ\n",
    "translations": {
      "en": "and responds unto all who attain to faith and do righteous deeds; and [it is He who, in the life to come,] will give them, out of His bounty, far more [than they will have deserved], whereas for the deniers of the truth there is [but] suffering severe in store.",
      "ms": "Dan Ia memperkenankan doa permohonan orang-orang yang beriman serta beramal soleh, dan Ia menambahi mereka dari limpah kurniaNya (selain dari yang mereka pohonkan). Dan (sebaliknya) orang-orang yang kafir, disediakan bagi mereka azab seksa yang seberat-beratnya.",
      "id": "dan Dia memperkenankan (doa) orang-orang yang beriman serta mengerjakan amal yang saleh dan menambah (pahala) kepada mereka dari karunia-Nya. Dan orang-orang yang kafir bagi mereka azab yang sangat keras.",
      "ar": "وَیَسۡتَجِیبُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَیَزِیدُهُم مِّن فَضۡلِهِۦۚ وَٱلۡكَـٰفِرُونَ لَهُمۡ عَذَابࣱ شَدِیدࣱ\n"
    }
  },
  {
    "id": 4299,
    "surahId": 42,
    "ayahNumber": 27,
    "arabicText": "۞ وَلَوۡ بَسَطَ ٱللَّهُ ٱلرِّزۡقَ لِعِبَادِهِۦ لَبَغَوۡا۟ فِی ٱلۡأَرۡضِ وَلَـٰكِن یُنَزِّلُ بِقَدَرࣲ مَّا یَشَاۤءُۚ إِنَّهُۥ بِعِبَادِهِۦ خَبِیرُۢ بَصِیرࣱ\n",
    "translations": {
      "en": "For, if God were to grant [in this world] abundant sustenance to [all of] His servants, they would behave on earth with wanton insolence: but as it is, He bestows [His grace] from on high in due measure, as He wills: for, verily, He is fully aware of [the needs of] His creatures, and sees them all.",
      "ms": "Dan kalaulah Allah memewahkan rezeki bagi setiap hambaNya, nescaya mereka akan melampaui batas di bumi (dengan perbuatan-perbuatan liar durjana); akan tetapi Allah menurunkan (rezekiNya itu) menurut kadar yang tertentu sebagaimana yang dikehendakiNya. Sesungguhnya Ia Mengetahui dengan mendalam akan segala keadaan hambaNya, lagi Melihat dengan nyata.",
      "id": "Dan jikalau Allah melapangkan rezeki kepada hamba-hamba-Nya tentulah mereka akan melampaui batas di muka bumi, tetapi Allah menurunkan apa yang dikehendaki-Nya dengan ukuran. Sesungguhnya Dia Maha Mengetahui (keadaan) hamba-hamba-Nya lagi Maha Melihat.",
      "ar": "۞ وَلَوۡ بَسَطَ ٱللَّهُ ٱلرِّزۡقَ لِعِبَادِهِۦ لَبَغَوۡا۟ فِی ٱلۡأَرۡضِ وَلَـٰكِن یُنَزِّلُ بِقَدَرࣲ مَّا یَشَاۤءُۚ إِنَّهُۥ بِعِبَادِهِۦ خَبِیرُۢ بَصِیرࣱ\n"
    }
  },
  {
    "id": 4300,
    "surahId": 42,
    "ayahNumber": 28,
    "arabicText": "وَهُوَ ٱلَّذِی یُنَزِّلُ ٱلۡغَیۡثَ مِنۢ بَعۡدِ مَا قَنَطُوا۟ وَیَنشُرُ رَحۡمَتَهُۥۚ وَهُوَ ٱلۡوَلِیُّ ٱلۡحَمِیدُ\n",
    "translations": {
      "en": "And it is He who sends down rain after [men] have lost all hope, and unfolds His grace [thereby]: for He alone is [their] Protector, the One to whom all praise is due.",
      "ms": "Dan Dia lah yang menurunkan hujan setelah mereka berputus asa, dan Ia pula menyebarkan rahmatNya merata-rata. Dan (ingatlah) Dia lah pengawal (yang melimpahkan ihsanNya), lagi Yang Maha Terpuji.",
      "id": "Dan Dialah Yang menurunkan hujan sesudah mereka berputus asa dan menyebarkan rahmat-Nya. Dan Dialah Yang Maha Pelindung lagi Maha Terpuji.",
      "ar": "وَهُوَ ٱلَّذِی یُنَزِّلُ ٱلۡغَیۡثَ مِنۢ بَعۡدِ مَا قَنَطُوا۟ وَیَنشُرُ رَحۡمَتَهُۥۚ وَهُوَ ٱلۡوَلِیُّ ٱلۡحَمِیدُ\n"
    }
  },
  {
    "id": 4301,
    "surahId": 42,
    "ayahNumber": 29,
    "arabicText": "وَمِنۡ ءَایَـٰتِهِۦ خَلۡقُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَمَا بَثَّ فِیهِمَا مِن دَاۤبَّةࣲۚ وَهُوَ عَلَىٰ جَمۡعِهِمۡ إِذَا یَشَاۤءُ قَدِیرࣱ\n",
    "translations": {
      "en": "And among His signs is the [very] creation of the heavens and the earth, and of all the living creatures which He has caused to multiply throughout them: and [since He has created them,] He has [also] the power to gather them [unto Him­self] whenever He wills.",
      "ms": "Dan di antara tanda-tanda kekuasaanNya ialah kejadian langit dan bumi serta segala yang Ia biakkan pada keduanya dari makhluk-makhluk yang melata; dan Ia Maha Kuasa menghimpunkan mereka semuanya apabila Ia kehendaki (melakukannya).",
      "id": "Di antara (ayat-ayat) tanda-tanda-Nya ialah menciptakan langit dan bumi dan makhluk-makhluk yang melata Yang Dia sebarkan pada keduanya. Dan Dia Maha Kuasa mengumpulkan semuanya apabila dikehendaki-Nya.",
      "ar": "وَمِنۡ ءَایَـٰتِهِۦ خَلۡقُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَمَا بَثَّ فِیهِمَا مِن دَاۤبَّةࣲۚ وَهُوَ عَلَىٰ جَمۡعِهِمۡ إِذَا یَشَاۤءُ قَدِیرࣱ\n"
    }
  },
  {
    "id": 4302,
    "surahId": 42,
    "ayahNumber": 30,
    "arabicText": "وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ\n",
    "translations": {
      "en": "Now whatever calamity may befall you [on Judgment Day] will be an outcome of what your own hands have wrought, although He pardons much;",
      "ms": "Dan apa jua yang menimpa kamu dari sesuatu kesusahan (atau bala bencana), maka ia adalah disebabkan apa yang kamu lakukan (dari perbuatan-perbuatan yang salah dan berdosa); dan (dalam pada itu) Allah memaafkan sebahagian besar dari dosa-dosa kamu.",
      "id": "Dan apa saja musibah yang menimpa kamu maka adalah disebabkan oleh perbuatan tanganmu sendiri, dan Allah memaafkan sebagian besar (dari kesalahan-kesalahanmu).",
      "ar": "وَمَاۤ أَصَـٰبَكُم مِّن مُّصِیبَةࣲ فَبِمَا كَسَبَتۡ أَیۡدِیكُمۡ وَیَعۡفُوا۟ عَن كَثِیرࣲ\n"
    }
  },
  {
    "id": 4303,
    "surahId": 42,
    "ayahNumber": 31,
    "arabicText": "وَمَاۤ أَنتُم بِمُعۡجِزِینَ فِی ٱلۡأَرۡضِۖ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِیࣲّ وَلَا نَصِیرࣲ\n",
    "translations": {
      "en": "and you cannot elude Him on earth, and you will have none to protect you from God [in the life to come], and none to bring you succour.",
      "ms": "Dan kamu tidak akan dapat melemahkan kuasa Allah (daripada menimpakan kamu dengan bala bencana, walaupun kamu melarikan diri di mana sahaja) di muka bumi (atau di langit); dan kamu juga tidak akan beroleh sesiapapun yang lain dari Allah. - sebagai pelindung atau pemberi pertolongan.",
      "id": "Dan kamu tidak dapat melepaskan diri (dari azab Allah) di muka bumi, dan kamu tidak memperoleh seorang pelindung dan tidak pula penolong selain Allah.",
      "ar": "وَمَاۤ أَنتُم بِمُعۡجِزِینَ فِی ٱلۡأَرۡضِۖ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِن وَلِیࣲّ وَلَا نَصِیرࣲ\n"
    }
  },
  {
    "id": 4304,
    "surahId": 42,
    "ayahNumber": 32,
    "arabicText": "وَمِنۡ ءَایَـٰتِهِ ٱلۡجَوَارِ فِی ٱلۡبَحۡرِ كَٱلۡأَعۡلَـٰمِ\n",
    "translations": {
      "en": "And among His signs are the ships that sail like [floating] mountains through the seas:",
      "ms": "Dan di antara tanda-tanda kekuasaanNya ialah kapal-kapal (yang besar tinggi) seperti gunung, belayar laju merempuh lautan.",
      "id": "Dan di antara tanda-tanda kekuasaan-Nya ialah kapal-kapal di tengah (yang berlayar) di laut seperti gunung-gunung.",
      "ar": "وَمِنۡ ءَایَـٰتِهِ ٱلۡجَوَارِ فِی ٱلۡبَحۡرِ كَٱلۡأَعۡلَـٰمِ\n"
    }
  },
  {
    "id": 4305,
    "surahId": 42,
    "ayahNumber": 33,
    "arabicText": "إِن یَشَأۡ یُسۡكِنِ ٱلرِّیحَ فَیَظۡلَلۡنَ رَوَاكِدَ عَلَىٰ ظَهۡرِهِۦۤۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّكُلِّ صَبَّارࣲ شَكُورٍ\n",
    "translations": {
      "en": "if He so wills, He stills the wind, and then they lie motion­less on the sea’s surface - [and] herein, behold, there are messages indeed for all who are wholly patient in adversity and deeply grateful [to God];",
      "ms": "Jika Ia kehendaki, Ia menghentikan tiupan angin, maka tinggalah kapal-kapal itu terapung-apung di muka lautan. Sesungguhnya yang demikian mengandungi tanda-tanda (yang besar pengajarannya) bagi tiap-tiap seorang (mukmin) yang sentiasa bersikap sabar, lagi sentiasa bersyukur.",
      "id": "Jika Dia menghendaki, Dia akan menenangkan angin, maka jadilah kapal-kapal itu terhenti di permukaan laut. Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaannya) bagi setiap orang yang banyak bersabar dan banyak bersyukur,",
      "ar": "إِن یَشَأۡ یُسۡكِنِ ٱلرِّیحَ فَیَظۡلَلۡنَ رَوَاكِدَ عَلَىٰ ظَهۡرِهِۦۤۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّكُلِّ صَبَّارࣲ شَكُورٍ\n"
    }
  },
  {
    "id": 4306,
    "surahId": 42,
    "ayahNumber": 34,
    "arabicText": "أَوۡ یُوبِقۡهُنَّ بِمَا كَسَبُوا۟ وَیَعۡفُ عَن كَثِیرࣲ\n",
    "translations": {
      "en": "or else He may cause them to perish because of what they have wrought; and [withal,] He pardons much.",
      "ms": "Atau (jika Ia kehendaki) Ia binasakan kapal-kapal itu disebabkan dosa-dosa yang dilakukan oleh orang-orangnya, (lalu setengahnya dibiarkan mati lemas) dan (setengahnya diselamatkan dengan jalan) Ia memaafkan sebahagian besar dari dosa-dosa mereka.",
      "id": "atau kapal-kapal itu dibinasakan-Nya karena perbuatan mereka atau Dia memberi maaf sebagian besar (dari mereka).",
      "ar": "أَوۡ یُوبِقۡهُنَّ بِمَا كَسَبُوا۟ وَیَعۡفُ عَن كَثِیرࣲ\n"
    }
  },
  {
    "id": 4307,
    "surahId": 42,
    "ayahNumber": 35,
    "arabicText": "وَیَعۡلَمَ ٱلَّذِینَ یُجَـٰدِلُونَ فِیۤ ءَایَـٰتِنَا مَا لَهُم مِّن مَّحِیصࣲ\n",
    "translations": {
      "en": "And let them know, those who call Our mes­sages in question, that for them there is no escape.",
      "ms": "(Berlakunya yang demikian supaya nyata kekuasaan Kami) dan supaya orang-orang yang membantah ayat-ayat keterangan Kami mengetahui, bahawa mereka tidak akan dapat jalan melepaskan diri (dari azab seksa).",
      "id": "Dan supaya orang-orang yang membantah ayat-ayat (kekuasaan) Kami mengetahui bahwa mereka sekali-kali tidak akan memperoleh jalan ke luar (dari siksaan).",
      "ar": "وَیَعۡلَمَ ٱلَّذِینَ یُجَـٰدِلُونَ فِیۤ ءَایَـٰتِنَا مَا لَهُم مِّن مَّحِیصࣲ\n"
    }
  },
  {
    "id": 4308,
    "surahId": 42,
    "ayahNumber": 36,
    "arabicText": "فَمَاۤ أُوتِیتُم مِّن شَیۡءࣲ فَمَتَـٰعُ ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۚ وَمَا عِندَ ٱللَّهِ خَیۡرࣱ وَأَبۡقَىٰ لِلَّذِینَ ءَامَنُوا۟ وَعَلَىٰ رَبِّهِمۡ یَتَوَكَّلُونَ\n",
    "translations": {
      "en": "AND [remember that] whatever you are given [now] is but for the [passing] enjoyment of life in this world - whereas that which is with God is far better and more enduring. [It shall be given] to all who attain to faith and in their Sustainer place their trust;",
      "ms": "Oleh itu, apa jua yang diberikan kepada kamu, maka ia hanyalah nikmat kesenangan hidup di dunia ini sahaja, dan (sebaliknya) apa yang ada di sisi Allah (dari pahala hari akhirat) adalah lebih baik dan lebih kekal bagi orang-orang yang beriman dan yang berserah bulat-bulat kepada Tuhannya;",
      "id": "Maka sesuatu yang diberikan kepadamu, itu adalah kenikmatan hidup di dunia; dan yang ada pada sisi Allah lebih baik dan lebih kekal bagi orang-orang yang beriman, dan hanya kepada Tuhan mereka, mereka bertawakkal.",
      "ar": "فَمَاۤ أُوتِیتُم مِّن شَیۡءࣲ فَمَتَـٰعُ ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۚ وَمَا عِندَ ٱللَّهِ خَیۡرࣱ وَأَبۡقَىٰ لِلَّذِینَ ءَامَنُوا۟ وَعَلَىٰ رَبِّهِمۡ یَتَوَكَّلُونَ\n"
    }
  },
  {
    "id": 4309,
    "surahId": 42,
    "ayahNumber": 37,
    "arabicText": "وَٱلَّذِینَ یَجۡتَنِبُونَ كَبَـٰۤىِٕرَ ٱلۡإِثۡمِ وَٱلۡفَوَ ٰ⁠حِشَ وَإِذَا مَا غَضِبُوا۟ هُمۡ یَغۡفِرُونَ\n",
    "translations": {
      "en": "and who shun the more heinous sins and abominations; and who, whenever they are moved to anger, readily forgive;",
      "ms": "Dan juga (lebih baik dan lebih kekal bagi) orang-orang yang menjauhi dosa-dosa besar serta perbuatan-perbuatan yang keji; dan apabila mereka marah (disebabkan perbuatan yang tidak patut terhadap mereka), mereka memaafkannya;",
      "id": "Dan (bagi) orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji, dan apabila mereka marah mereka memberi maaf.",
      "ar": "وَٱلَّذِینَ یَجۡتَنِبُونَ كَبَـٰۤىِٕرَ ٱلۡإِثۡمِ وَٱلۡفَوَ ٰ⁠حِشَ وَإِذَا مَا غَضِبُوا۟ هُمۡ یَغۡفِرُونَ\n"
    }
  },
  {
    "id": 4310,
    "surahId": 42,
    "ayahNumber": 38,
    "arabicText": "وَٱلَّذِینَ ٱسۡتَجَابُوا۟ لِرَبِّهِمۡ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَمۡرُهُمۡ شُورَىٰ بَیۡنَهُمۡ وَمِمَّا رَزَقۡنَـٰهُمۡ یُنفِقُونَ\n",
    "translations": {
      "en": "and who respond to [the call of] their Sustainer and are constant in prayer; and whose rule [in all matters of common concern] is consultation among themselves; and who spend on others out of what We provide for them as sustenance;",
      "ms": "Dan juga (lebih baik dan lebih kekal bagi) orang-orang yang menyahut dan menyambut perintah Tuhannya serta mendirikan sembahyang dengan sempurna; dan urusan mereka dijalankan secara bermesyuarat sesama mereka; dan mereka pula mendermakan sebahagian dari apa yang Kami beri kepadanya;",
      "id": "Dan (bagi) orang-orang yang menerima (mematuhi) seruan Tuhannya dan mendirikan shalat, sedang urusan mereka (diputuskan) dengan musyawarat antara mereka; dan mereka menafkahkan sebagian dari rezeki yang Kami berikan kepada mereka.",
      "ar": "وَٱلَّذِینَ ٱسۡتَجَابُوا۟ لِرَبِّهِمۡ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَمۡرُهُمۡ شُورَىٰ بَیۡنَهُمۡ وَمِمَّا رَزَقۡنَـٰهُمۡ یُنفِقُونَ\n"
    }
  },
  {
    "id": 4311,
    "surahId": 42,
    "ayahNumber": 39,
    "arabicText": "وَٱلَّذِینَ إِذَاۤ أَصَابَهُمُ ٱلۡبَغۡیُ هُمۡ یَنتَصِرُونَ\n",
    "translations": {
      "en": "and who, whenever tyranny afflicts them, defend themselves.",
      "ms": "Dan juga (lebih baik dan lebih kekal bagi) orang-orang yang apabila ditimpa sesuatu perbuatan secara zalim, mereka hanya bertindak membela diri (sepadan dan tidak melampaui batas).",
      "id": "Dan ( bagi) orang-orang yang apabila mereka diperlakukan dengan zalim mereka membela diri.",
      "ar": "وَٱلَّذِینَ إِذَاۤ أَصَابَهُمُ ٱلۡبَغۡیُ هُمۡ یَنتَصِرُونَ\n"
    }
  },
  {
    "id": 4312,
    "surahId": 42,
    "ayahNumber": 40,
    "arabicText": "وَجَزَ ٰ⁠ۤؤُا۟ سَیِّئَةࣲ سَیِّئَةࣱ مِّثۡلُهَاۖ فَمَنۡ عَفَا وَأَصۡلَحَ فَأَجۡرُهُۥ عَلَى ٱللَّهِۚ إِنَّهُۥ لَا یُحِبُّ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "But [remember that an attempt at] requiting evil may, too, become an evil: hence, whoever par­dons [his foe] and makes peace, his reward rests with God - for, verily, He does not love evildoers.",
      "ms": "Dan (jika kamu hendak membalas maka) balasan sesuatu kejahatan ialah kejahatan yang bersamaan dengannya; dalam pada itu sesiapa yang memaafkan (kejahatan orang) dan berbuat baik (kepadanya), maka pahalanya tetap dijamin oleh Allah (dengan diberi balasan yang sebaik-baiknya). Sesungguhnya Allah tidak suka kepada orang-orang yang berlaku zalim.",
      "id": "Dan balasan suatu kejahatan adalah kejahatan yang serupa, maka barang siapa memaafkan dan berbuat baik maka pahalanya atas (tanggungan) Allah. Sesungguhnya Dia tidak menyukai orang-orang yang zalim.",
      "ar": "وَجَزَ ٰ⁠ۤؤُا۟ سَیِّئَةࣲ سَیِّئَةࣱ مِّثۡلُهَاۖ فَمَنۡ عَفَا وَأَصۡلَحَ فَأَجۡرُهُۥ عَلَى ٱللَّهِۚ إِنَّهُۥ لَا یُحِبُّ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 4313,
    "surahId": 42,
    "ayahNumber": 41,
    "arabicText": "وَلَمَنِ ٱنتَصَرَ بَعۡدَ ظُلۡمِهِۦ فَأُو۟لَـٰۤىِٕكَ مَا عَلَیۡهِم مِّن سَبِیلٍ\n",
    "translations": {
      "en": "Yet indeed, as for any who defend themselves after having been wronged - no blame whatever attaches to them:",
      "ms": "Dan sesungguhnya orang yang bertindak membela diri setelah ia dizalimi, maka mereka yang demikian keadaannya, tidak ada sebarang jalan hendak menyalahkan mereka.",
      "id": "Dan sesungguhnya orang-orang yang membela diri sesudah teraniaya, tidak ada satu dosapun terhadap mereka.",
      "ar": "وَلَمَنِ ٱنتَصَرَ بَعۡدَ ظُلۡمِهِۦ فَأُو۟لَـٰۤىِٕكَ مَا عَلَیۡهِم مِّن سَبِیلٍ\n"
    }
  },
  {
    "id": 4314,
    "surahId": 42,
    "ayahNumber": 42,
    "arabicText": "إِنَّمَا ٱلسَّبِیلُ عَلَى ٱلَّذِینَ یَظۡلِمُونَ ٱلنَّاسَ وَیَبۡغُونَ فِی ٱلۡأَرۡضِ بِغَیۡرِ ٱلۡحَقِّۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ عَذَابٌ أَلِیمࣱ\n",
    "translations": {
      "en": "blame attaches but to those who oppress [other] people and behave outrageously on earth, offending against all right: for them there is grievous suffering in store!",
      "ms": "Sesungguhnya jalan (untuk menyalahkan) hanyalah terhadap orang-orang yang melakukan kezaliman kepada manusia dan bermaharajalela di muka bumi dengan tiada sebarang alasan yang benar. Mereka itulah orang-orang yang beroleh azab seksa yang tidak berperi sakitnya.",
      "id": "Sesungguhnya dosa itu atas orang-orang yang berbuat zalim kepada manusia dan melampaui batas di muka bumi tanpa hak. Mereka itu mendapat azab yang pedih.",
      "ar": "إِنَّمَا ٱلسَّبِیلُ عَلَى ٱلَّذِینَ یَظۡلِمُونَ ٱلنَّاسَ وَیَبۡغُونَ فِی ٱلۡأَرۡضِ بِغَیۡرِ ٱلۡحَقِّۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ عَذَابٌ أَلِیمࣱ\n"
    }
  },
  {
    "id": 4315,
    "surahId": 42,
    "ayahNumber": 43,
    "arabicText": "وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَ ٰ⁠لِكَ لَمِنۡ عَزۡمِ ٱلۡأُمُورِ\n",
    "translations": {
      "en": "But withal, if one is patient in adversity and forgives - this, behold, is indeed something to set one’s heart upon!",
      "ms": "Dalam pada itu (ingatlah), orang yang bersabar dan memaafkan (kesalahan orang terhadapnya), sesungguhnya yang demikian itu adalah dari perkara-perkara yang dikehendaki diambil berat (melakukannya).",
      "id": "Tetapi orang yang bersabar dan memaafkan, sesungguhnya (perbuatan) yang demikian itu termasuk hal-hal yang diutamakan.",
      "ar": "وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَ ٰ⁠لِكَ لَمِنۡ عَزۡمِ ٱلۡأُمُورِ\n"
    }
  },
  {
    "id": 4316,
    "surahId": 42,
    "ayahNumber": 44,
    "arabicText": "وَمَن یُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِن وَلِیࣲّ مِّنۢ بَعۡدِهِۦۗ وَتَرَى ٱلظَّـٰلِمِینَ لَمَّا رَأَوُا۟ ٱلۡعَذَابَ یَقُولُونَ هَلۡ إِلَىٰ مَرَدࣲّ مِّن سَبِیلࣲ\n",
    "translations": {
      "en": "AND [thus it is:] he whom God lets go astray has henceforth no protector whatever: and so thou wilt see such evildoers [on Judgment Day, and wilt hear how] they exclaim as soon as they behold the suffering [that awaits them], “Is there any way of return?”",
      "ms": "Dan sesiapa yang disesatkan oleh Allah, maka tidak ada baginya sesudah itu sesiapapun yang dapat menolongnya. Dan engkau akan melihat orang-orang yang zalim semasa mereka menyaksikan azab (pada hari kiamat) berkata: \"Adakah sebarang jalan untuk kami kembali ke dunia?\"",
      "id": "Dan siapa yang disesatkan Allah maka tidak ada baginya seorang pemimpinpun sesudah itu. Dan kamu akan melihat orang-orang yang zalim ketika mereka melihat azab berkata: \"Adakah kiranya jalan untuk kembali (ke dunia)?\"",
      "ar": "وَمَن یُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِن وَلِیࣲّ مِّنۢ بَعۡدِهِۦۗ وَتَرَى ٱلظَّـٰلِمِینَ لَمَّا رَأَوُا۟ ٱلۡعَذَابَ یَقُولُونَ هَلۡ إِلَىٰ مَرَدࣲّ مِّن سَبِیلࣲ\n"
    }
  },
  {
    "id": 4317,
    "surahId": 42,
    "ayahNumber": 45,
    "arabicText": "وَتَرَىٰهُمۡ یُعۡرَضُونَ عَلَیۡهَا خَـٰشِعِینَ مِنَ ٱلذُّلِّ یَنظُرُونَ مِن طَرۡفٍ خَفِیࣲّۗ وَقَالَ ٱلَّذِینَ ءَامَنُوۤا۟ إِنَّ ٱلۡخَـٰسِرِینَ ٱلَّذِینَ خَسِرُوۤا۟ أَنفُسَهُمۡ وَأَهۡلِیهِمۡ یَوۡمَ ٱلۡقِیَـٰمَةِۗ أَلَاۤ إِنَّ ٱلظَّـٰلِمِینَ فِی عَذَابࣲ مُّقِیمࣲ\n",
    "translations": {
      "en": "And thou wilt see them exposed to that [doom], humbling themselves in abasement, looking [around] with a furtive glance - the while those who had attained to faith will say, “Verily, lost on [this] Day of Resurrection are they who have squandered their own and their followers’ selves!” Oh, verily, the evildoers will fall into long-lasting suffering,",
      "ms": "Dan engkau juga akan melihat mereka didedahkan kepada neraka dalam keadaan tunduk membisu dengan sebab kehinaan (yang mereka rasai) sambil memandang (ke neraka itu) hanya dengan mengerling (kerana gerun takut). Dan orang-orang yang beriman pula berkata: \"Sesungguhnya orang-orang yang rugi (dengan sebenar-benarnya) ialah mereka yang merugikan dirinya sendiri dan pengikut-pengikutnya pada hari kiamat (dengan sebab mereka memilih perbuatan derhaka di dunia). Ingatlah! Sesungguhnya orang-orang yang zalim itu berada dalam azab seksa yang kekal\".",
      "id": "Dan kamu akan melihat mereka dihadapkan ke neraka dalam keadaan tunduk karena (merasa) hina, mereka melihat dengan pandangan yang lesu. Dan orang-orang yang beriman berkata: \"Sesungguhnya orang-orang yang merugi ialah orang-orang yang kehilangan diri mereka sendiri dan (kehilangan) keluarga mereka pada hari kiamat. Ingatlah, sesungguhnya orang-orang yang zalim itu berada dalam azab yang kekal.",
      "ar": "وَتَرَىٰهُمۡ یُعۡرَضُونَ عَلَیۡهَا خَـٰشِعِینَ مِنَ ٱلذُّلِّ یَنظُرُونَ مِن طَرۡفٍ خَفِیࣲّۗ وَقَالَ ٱلَّذِینَ ءَامَنُوۤا۟ إِنَّ ٱلۡخَـٰسِرِینَ ٱلَّذِینَ خَسِرُوۤا۟ أَنفُسَهُمۡ وَأَهۡلِیهِمۡ یَوۡمَ ٱلۡقِیَـٰمَةِۗ أَلَاۤ إِنَّ ٱلظَّـٰلِمِینَ فِی عَذَابࣲ مُّقِیمࣲ\n"
    }
  },
  {
    "id": 4318,
    "surahId": 42,
    "ayahNumber": 46,
    "arabicText": "وَمَا كَانَ لَهُم مِّنۡ أَوۡلِیَاۤءَ یَنصُرُونَهُم مِّن دُونِ ٱللَّهِۗ وَمَن یُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِن سَبِیلٍ\n",
    "translations": {
      "en": "and will have no protector whatever to succour them against God: for he whom God lets go astray shall find no way [of escape].",
      "ms": "Dan tiadalah bagi mereka sebarang penolong - yang lain dari Allah - yang dapat memberikan pertolongan kepada mereka; dan sesiapa yang disesatkan oleh Allah (disebabkan pilihannya yang salah) maka tidak ada baginya sebarang jalan (untuk mendapat hidayah petunjuk).",
      "id": "Dan mereka sekali-kali tidak mempunyai pelindung-pelindung yang dapat menolong mereka selain Allah. Dan siapa yang disesatkan Allah maka tidaklah ada baginya satu jalanpun (untuk mendapat petunjuk).",
      "ar": "وَمَا كَانَ لَهُم مِّنۡ أَوۡلِیَاۤءَ یَنصُرُونَهُم مِّن دُونِ ٱللَّهِۗ وَمَن یُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِن سَبِیلٍ\n"
    }
  },
  {
    "id": 4319,
    "surahId": 42,
    "ayahNumber": 47,
    "arabicText": "ٱسۡتَجِیبُوا۟ لِرَبِّكُم مِّن قَبۡلِ أَن یَأۡتِیَ یَوۡمࣱ لَّا مَرَدَّ لَهُۥ مِنَ ٱللَّهِۚ مَا لَكُم مِّن مَّلۡجَإࣲ یَوۡمَىِٕذࣲ وَمَا لَكُم مِّن نَّكِیرࣲ\n",
    "translations": {
      "en": "[Hence, O men,] respond to your Sustainer before there comes, at God’s behest, a Day on which there will be no turning back: [for] on that Day you will have no place of refuge, and neither will you be able to deny aught [of the wrong that you have done].",
      "ms": "Sahut dan sambutlah seruan Tuhan kamu (yang mengajak kamu beriman), sebelum datangnya dari Allah - hari yang tidak dapat ditolak; pada hari itu tidak ada bagi kamu tempat berlindung (dari azabNya), dan tidak ada pula bagi kamu sebarang alasan untuk menafikan (kesalahan yang kamu telah lakukan).",
      "id": "Patuhilah seruan Tuhanmu sebelum datang dari Allah suatu hari yang tidak dapat ditolak kedatangannya. Kamu tidak memperoleh tempat berlindung pada hari itu dan tidak (pula) dapat mengingkari (dosa-dosamu).",
      "ar": "ٱسۡتَجِیبُوا۟ لِرَبِّكُم مِّن قَبۡلِ أَن یَأۡتِیَ یَوۡمࣱ لَّا مَرَدَّ لَهُۥ مِنَ ٱللَّهِۚ مَا لَكُم مِّن مَّلۡجَإࣲ یَوۡمَىِٕذࣲ وَمَا لَكُم مِّن نَّكِیرࣲ\n"
    }
  },
  {
    "id": 4320,
    "surahId": 42,
    "ayahNumber": 48,
    "arabicText": "فَإِنۡ أَعۡرَضُوا۟ فَمَاۤ أَرۡسَلۡنَـٰكَ عَلَیۡهِمۡ حَفِیظًاۖ إِنۡ عَلَیۡكَ إِلَّا ٱلۡبَلَـٰغُۗ وَإِنَّاۤ إِذَاۤ أَذَقۡنَا ٱلۡإِنسَـٰنَ مِنَّا رَحۡمَةࣰ فَرِحَ بِهَاۖ وَإِن تُصِبۡهُمۡ سَیِّئَةُۢ بِمَا قَدَّمَتۡ أَیۡدِیهِمۡ فَإِنَّ ٱلۡإِنسَـٰنَ كَفُورࣱ\n",
    "translations": {
      "en": "BUT IF they turn away [from thee, O Prophet, know that] We have not sent thee to be their keeper: thou art not bound to do more than deliver the message [entrusted to thee]. And, behold, [such as turn away from Our mes­sages are but impelled by the weakness and incon­stancy of human nature: thus,] when We give man a taste of Our grace, he is prone to exult in it; but if misfortune befalls [any of] them in result of what their own hands have sent forth, then, behold, man shows how bereft he is of all gratitude!",
      "ms": "Oleh itu, jika mereka berpaling ingkar, maka Kami tidak mengutusmu (wahai Muhammad) sebagai pengawas terhadap mereka; tugasmu tidak lain hanyalah menyampaikan (apa yang diperintahkan kepadamu). Dan (ingatlah) sesungguhnya apabila Kami memberi manusia merasai sesuatu rahmat dari Kami, ia bergembira dengannya; dan (sebaliknya) jika mereka ditimpa sesuatu kesusahan disebabkan dosa-dosa yang mereka lakukan, maka (mereka segera membantah serta melupakan rahmat yang mereka telah menikmatinya, kerana) sesungguhnya manusia itu sangat tidak mengenang nikmat-nikmat Tuhannya.",
      "id": "Jika mereka berpaling maka Kami tidak mengutus kamu sebagai pengawas bagi mereka. Kewajibanmu tidak lain hanyalah menyampaikan (risalah). Sesungguhnya apabila Kami merasakan kepada manusia sesuatu rahmat dari Kami dia bergembira ria karena rahmat itu. Dan jika mereka ditimpa kesusahan disebabkan perbuatan tangan mereka sendiri (niscaya mereka ingkar) karena sesungguhnya manusia itu amat ingkar (kepada nikmat).",
      "ar": "فَإِنۡ أَعۡرَضُوا۟ فَمَاۤ أَرۡسَلۡنَـٰكَ عَلَیۡهِمۡ حَفِیظًاۖ إِنۡ عَلَیۡكَ إِلَّا ٱلۡبَلَـٰغُۗ وَإِنَّاۤ إِذَاۤ أَذَقۡنَا ٱلۡإِنسَـٰنَ مِنَّا رَحۡمَةࣰ فَرِحَ بِهَاۖ وَإِن تُصِبۡهُمۡ سَیِّئَةُۢ بِمَا قَدَّمَتۡ أَیۡدِیهِمۡ فَإِنَّ ٱلۡإِنسَـٰنَ كَفُورࣱ\n"
    }
  },
  {
    "id": 4321,
    "surahId": 42,
    "ayahNumber": 49,
    "arabicText": "لِّلَّهِ مُلۡكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ یَخۡلُقُ مَا یَشَاۤءُۚ یَهَبُ لِمَن یَشَاۤءُ إِنَـٰثࣰا وَیَهَبُ لِمَن یَشَاۤءُ ٱلذُّكُورَ\n",
    "translations": {
      "en": "God’s alone is the dominion over the heavens and the earth. He creates whatever He wills: He bestows the gift of female offspring on whomever He wills, and the gift of male offspring on whomever He wills;",
      "ms": "Bagi Allah jualah hak milik segala yang ada di langit dan di bumi; Ia menciptakan apa yang dikehendakiNya; Ia mengurniakan anak-anak perempuan kepada sesiapa yang dikehendakiNya, dan mengurniakan anak-anak lelaki kepada sesiapa yang dikehendakiNya.",
      "id": "Kepunyaan Allah-lah kerajaan langit dan bumi, Dia menciptakan apa yang Dia kehendaki. Dia memberikan anak-anak perempuan kepada siapa yang Dia kehendaki dan memberikan anak-anak lelaki kepada siapa yang Dia kehendaki,",
      "ar": "لِّلَّهِ مُلۡكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ یَخۡلُقُ مَا یَشَاۤءُۚ یَهَبُ لِمَن یَشَاۤءُ إِنَـٰثࣰا وَیَهَبُ لِمَن یَشَاۤءُ ٱلذُّكُورَ\n"
    }
  },
  {
    "id": 4322,
    "surahId": 42,
    "ayahNumber": 50,
    "arabicText": "أَوۡ یُزَوِّجُهُمۡ ذُكۡرَانࣰا وَإِنَـٰثࣰاۖ وَیَجۡعَلُ مَن یَشَاۤءُ عَقِیمًاۚ إِنَّهُۥ عَلِیمࣱ قَدِیرࣱ\n",
    "translations": {
      "en": "or He gives both male and female [to whomever He wills], and causes to be barren whomever He wills: for, verily, He is all-knowing, infinite in His power.",
      "ms": "Atau Ia mengurniakan mereka kedua-duanya - anak-anak lelaki dan perempuan, dan Ia juga menjadikan sesiapa yang dikehendakiNya: mandul. Sesungguhnya Ia Maha Mengetahui, lagi Maha Kuasa.",
      "id": "atau Dia menganugerahkan kedua jenis laki-laki dan perempuan (kepada siapa) yang dikehendaki-Nya, dan Dia menjadikan mandul siapa yang Dia kehendaki. Sesungguhnya Dia Maha Mengetahui lagi Maha Kuasa.",
      "ar": "أَوۡ یُزَوِّجُهُمۡ ذُكۡرَانࣰا وَإِنَـٰثࣰاۖ وَیَجۡعَلُ مَن یَشَاۤءُ عَقِیمًاۚ إِنَّهُۥ عَلِیمࣱ قَدِیرࣱ\n"
    }
  },
  {
    "id": 4323,
    "surahId": 42,
    "ayahNumber": 51,
    "arabicText": "۞ وَمَا كَانَ لِبَشَرٍ أَن یُكَلِّمَهُ ٱللَّهُ إِلَّا وَحۡیًا أَوۡ مِن وَرَاۤىِٕ حِجَابٍ أَوۡ یُرۡسِلَ رَسُولࣰا فَیُوحِیَ بِإِذۡنِهِۦ مَا یَشَاۤءُۚ إِنَّهُۥ عَلِیٌّ حَكِیمࣱ\n",
    "translations": {
      "en": "And it is not given to mortal man that God should speak unto him otherwise than through sudden inspiration, or [by a voice, as it were,] from behind a veil, or by sending an apostle to reveal, by His leave, whatever He wills [to reveal]: for, verily, He is exalted, wise.",
      "ms": "Dan tidaklah layak bagi seseorang manusia bahawa Allah berkata-kata dengannya kecuali dengan jalan wahyu (dengan diberi ilham atau mimpi), atau dari sebalik dinding (dengan mendengar suara sahaja), atau dengan mengutuskan utusan (malaikat) lalu utusan itu menyampaikan wahyu kepadanya dengan izin Allah akan apa yang dikehendakiNya. Sesungguhnya Allah Maha Tinggi keadaanNya, lagi Maha Bijaksana.",
      "id": "Dan tidak mungkin bagi seorang manusiapun bahwa Allah berkata-kata dengan dia kecuali dengan perantaraan wahyu atau dibelakang tabir atau dengan mengutus seorang utusan (malaikat) lalu diwahyukan kepadanya dengan seizin-Nya apa yang Dia kehendaki. Sesungguhnya Dia Maha Tinggi lagi Maha Bijaksana.",
      "ar": "۞ وَمَا كَانَ لِبَشَرٍ أَن یُكَلِّمَهُ ٱللَّهُ إِلَّا وَحۡیًا أَوۡ مِن وَرَاۤىِٕ حِجَابٍ أَوۡ یُرۡسِلَ رَسُولࣰا فَیُوحِیَ بِإِذۡنِهِۦ مَا یَشَاۤءُۚ إِنَّهُۥ عَلِیٌّ حَكِیمࣱ\n"
    }
  },
  {
    "id": 4324,
    "surahId": 42,
    "ayahNumber": 52,
    "arabicText": "وَكَذَ ٰ⁠لِكَ أَوۡحَیۡنَاۤ إِلَیۡكَ رُوحࣰا مِّنۡ أَمۡرِنَاۚ مَا كُنتَ تَدۡرِی مَا ٱلۡكِتَـٰبُ وَلَا ٱلۡإِیمَـٰنُ وَلَـٰكِن جَعَلۡنَـٰهُ نُورࣰا نَّهۡدِی بِهِۦ مَن نَّشَاۤءُ مِنۡ عِبَادِنَاۚ وَإِنَّكَ لَتَهۡدِیۤ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "And thus, too, [O Muhammad,] have We revealed unto thee a life-giving message, [coming] at Our behest. [Ere this message came unto thee,] thou didst not know what revelation is, nor what faith [implies]: but [now] We have caused this [message] to be a light, whereby We guide whom We will of Our ser­vants: and, verily, [on the strength thereof] thou, too, shalt guide [men] onto the straight way –",
      "ms": "Dan demikianlah Kami wahyukan kepadamu (Muhammad) - Al-Quran sebagai roh (yang menghidupkan hati perintah Kami; engkau tidak pernah mengetahui (sebelum diwahyukan kepadamu): apakah Kitab (Al-Quran) itu dan tidak juga mengetahui apakah iman itu; akan tetapi Kami jadikan Al-Quran: cahaya yang menerangi, Kami beri petunjuk dengannya sesiapa yang Kami kehendaki di antara hamba-hamba Kami. Dan sesungguhnya engkau (wahai Muhammad) adalah memberi petunjuk dengan Al-Quran itu ke jalan yang lurus,",
      "id": "Dan demikianlah Kami wahyukan kepadamu wahyu (Al Quran) dengan perintah Kami. Sebelumnya kamu tidaklah mengetahui apakah Al Kitab (Al Quran) dan tidak pula mengetahui apakah iman itu, tetapi Kami menjadikan Al Quran itu cahaya, yang Kami tunjuki dengan dia siapa yang kami kehendaki di antara hamba-hamba Kami. Dan sesungguhnya kamu benar-benar memberi petunjuk kepada jalan yang lurus.",
      "ar": "وَكَذَ ٰ⁠لِكَ أَوۡحَیۡنَاۤ إِلَیۡكَ رُوحࣰا مِّنۡ أَمۡرِنَاۚ مَا كُنتَ تَدۡرِی مَا ٱلۡكِتَـٰبُ وَلَا ٱلۡإِیمَـٰنُ وَلَـٰكِن جَعَلۡنَـٰهُ نُورࣰا نَّهۡدِی بِهِۦ مَن نَّشَاۤءُ مِنۡ عِبَادِنَاۚ وَإِنَّكَ لَتَهۡدِیۤ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 4325,
    "surahId": 42,
    "ayahNumber": 53,
    "arabicText": "صِرَ ٰ⁠طِ ٱللَّهِ ٱلَّذِی لَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ أَلَاۤ إِلَى ٱللَّهِ تَصِیرُ ٱلۡأُمُورُ\n",
    "translations": {
      "en": "the way that leads to God, to whom all that is in the heavens and all that is on earth belongs. Oh, verily, with God is the beginning and the end of all things!",
      "ms": "Iaitu jalan Allah yang memiliki dan menguasai segala yang ada di langit dan yang ada di bumi. Ingatlah! Kepada Allah jualah kembali segala urusan.",
      "id": "(Yaitu) jalan Allah yang kepunyaan-Nya segala apa yang ada di langit dan apa yang ada di bumi. Ingatlah, bahwa kepada Allah-lah kembali semua urusan.",
      "ar": "صِرَ ٰ⁠طِ ٱللَّهِ ٱلَّذِی لَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ أَلَاۤ إِلَى ٱللَّهِ تَصِیرُ ٱلۡأُمُورُ\n"
    }
  }
]