[
  {
    "id": 4584,
    "surahId": 48,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ إِنَّا فَتَحۡنَا لَكَ فَتۡحࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "VERILY, [O Muhammad,] We have laid open before thee a manifest victory,",
      "ms": "Sesungguhnya Kami telah membuka bagi perjuanganmu (wahai Muhammad) satu jalan kemenangan yang jelas nyata,",
      "id": "Sesungguhnya Kami telah memberikan kepadamu kemenangan yang nyata,",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ إِنَّا فَتَحۡنَا لَكَ فَتۡحࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 4585,
    "surahId": 48,
    "ayahNumber": 2,
    "arabicText": "لِّیَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَیُتِمَّ نِعۡمَتَهُۥ عَلَیۡكَ وَیَهۡدِیَكَ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n",
    "translations": {
      "en": "so that God might show His forgiveness of all thy faults, past as well as future, and [thus] bestow upon thee the full measure of His blessings, and guide thee on a straight way,",
      "ms": "Kemenangan yang dengan sebabnya Allah mengampunkan salah dan silapmu yang telah lalu dan yang terkemudian, dan menyempurnakan nikmatNya kepadamu, serta menambahkanmu hidayah ke jalan yang lurus (dalam mengembangkan Islam dan melaksanakan hukum-hukumnya).",
      "id": "supaya Allah memberi ampunan kepadamu terhadap dosamu yang telah lalu dan yang akan datang serta menyempurnakan nikmat-Nya atasmu dan memimpin kamu kepada jalan yang lurus,",
      "ar": "لِّیَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَیُتِمَّ نِعۡمَتَهُۥ عَلَیۡكَ وَیَهۡدِیَكَ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n"
    }
  },
  {
    "id": 4586,
    "surahId": 48,
    "ayahNumber": 3,
    "arabicText": "وَیَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِیزًا\n",
    "translations": {
      "en": "and [show] that God will succour thee with [His] mighty succour.",
      "ms": "Dan dengan sebabnya Allah memberikanmu pertolongan (untuk mencapai kejayaan) dengan sepunuh-penuh dan sehandal-handal pertolongan (yang tidak ada bandingannya).",
      "id": "dan supaya Allah menolongmu dengan pertolongan yang kuat (banyak).",
      "ar": "وَیَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِیزًا\n"
    }
  },
  {
    "id": 4587,
    "surahId": 48,
    "ayahNumber": 4,
    "arabicText": "هُوَ ٱلَّذِیۤ أَنزَلَ ٱلسَّكِینَةَ فِی قُلُوبِ ٱلۡمُؤۡمِنِینَ لِیَزۡدَادُوۤا۟ إِیمَـٰنࣰا مَّعَ إِیمَـٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "It is He who from on high has bestowed inner peace upon the hearts of the believers, so that - seeing that God’s are all the forces of the heavens and the earth, and that God is all-knowing, truly wise - they might grow yet more firm in their faith;",
      "ms": "(Tuhan yang membuka jalan kemenangan itu) Dia lah yang menurunkan semangat tenang tenteram ke dalam hati orang-orang yang beriman (semasa mereka meradang terhadap angkara musuh) supaya mereka bertambah iman dan yakin beserta dengan iman dan keyakinan mereka yang sedia ada; pada hal Allah menguasai tentera langit dan bumi (untuk menolong mereka); dan Allah adalah Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "Dialah yang telah menurunkan ketenangan ke dalam hati orang-orang mukmin supaya keimanan mereka bertambah di samping keimanan mereka (yang telah ada). Dan kepunyaan Allah-lah tentara langit dan bumi dan adalah Allah Maha Mengetahui lagi Maha Bijaksana,",
      "ar": "هُوَ ٱلَّذِیۤ أَنزَلَ ٱلسَّكِینَةَ فِی قُلُوبِ ٱلۡمُؤۡمِنِینَ لِیَزۡدَادُوۤا۟ إِیمَـٰنࣰا مَّعَ إِیمَـٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 4588,
    "surahId": 48,
    "ayahNumber": 5,
    "arabicText": "لِّیُدۡخِلَ ٱلۡمُؤۡمِنِینَ وَٱلۡمُؤۡمِنَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَا وَیُكَفِّرَ عَنۡهُمۡ سَیِّـَٔاتِهِمۡۚ وَكَانَ ذَ ٰ⁠لِكَ عِندَ ٱللَّهِ فَوۡزًا عَظِیمࣰا\n",
    "translations": {
      "en": "[and] that He might admit the believers, both men and women, into gardens through which running waters flow, therein to abide, and that He might efface their [past bad] deeds: and that is, in the sight of God, indeed a triumph supreme!",
      "ms": "(Allah melakukan yang demikian) supaya ia memasukkan orang-orang yang beriman - lelaki dan perempuan - ke dalam Syurga yang mengalir di bawahnya beberapa sungai; dengan keadaan kekal mereka di dalamnya, serta menghapuskan dosa-dosa mereka; dan adalah yang demikian itu pada sisi Allah merupakan kejayaan yang besar (untuk mereka);",
      "id": "supaya Dia memasukkan orang-orang mukmin laki-laki dan perempuan ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya dan supaya Dia menutupi kesalahan-kesalahan mereka. Dan yang demikian itu adalah keberuntungan yang besar di sisi Allah,",
      "ar": "لِّیُدۡخِلَ ٱلۡمُؤۡمِنِینَ وَٱلۡمُؤۡمِنَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَا وَیُكَفِّرَ عَنۡهُمۡ سَیِّـَٔاتِهِمۡۚ وَكَانَ ذَ ٰ⁠لِكَ عِندَ ٱللَّهِ فَوۡزًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 4589,
    "surahId": 48,
    "ayahNumber": 6,
    "arabicText": "وَیُعَذِّبَ ٱلۡمُنَـٰفِقِینَ وَٱلۡمُنَـٰفِقَـٰتِ وَٱلۡمُشۡرِكِینَ وَٱلۡمُشۡرِكَـٰتِ ٱلظَّاۤنِّینَ بِٱللَّهِ ظَنَّ ٱلسَّوۡءِۚ عَلَیۡهِمۡ دَاۤىِٕرَةُ ٱلسَّوۡءِۖ وَغَضِبَ ٱللَّهُ عَلَیۡهِمۡ وَلَعَنَهُمۡ وَأَعَدَّ لَهُمۡ جَهَنَّمَۖ وَسَاۤءَتۡ مَصِیرࣰا\n",
    "translations": {
      "en": "And [God has willed] to impose suffering [in the life to come] on the hypocrites, both men and women, and on those who ascribe divinity to aught beside Him, both men and women: all who entertain evil thoughts about God. Evil encompasses them from all sides, and God’s condemnation rests upon them; and He has rejected them [from His grace], and has readied hell for them: and how evil a journey’s end!",
      "ms": "Dan supaya Ia menyeksa orang-orang munafik - lelaki dan perempuan, dan orang-orang musyrik - lelaki dan perempuan, yang menyangka terhadap Allah dengan sangkaan yang buruk (bahawa Ia akan mengecewakan RasulNya). Atas merekalah tertimpanya bala bencana yang dibawa oleh peredaran zaman; dan (selain itu) Allah murkai mereka dan melaknatkan mereka serta menyediakan untuk mereka neraka Jahannam; sedang neraka Jahannam itu adalah seburuk-buruk tempat kembali.",
      "id": "dan supaya Dia mengazab orang-orang munafik laki-laki dan perempuan dan orang-orang musyrik laki-laki dan perempuan yang mereka itu berprasangka buruk terhadap Allah. Mereka akan mendapat giliran (kebinasaan) yang amat buruk dan Allah memurkai dan mengutuk mereka serta menyediakan bagi mereka neraka Jahannam. Dan (neraka Jahannam) itulah sejahat-jahat tempat kembali.",
      "ar": "وَیُعَذِّبَ ٱلۡمُنَـٰفِقِینَ وَٱلۡمُنَـٰفِقَـٰتِ وَٱلۡمُشۡرِكِینَ وَٱلۡمُشۡرِكَـٰتِ ٱلظَّاۤنِّینَ بِٱللَّهِ ظَنَّ ٱلسَّوۡءِۚ عَلَیۡهِمۡ دَاۤىِٕرَةُ ٱلسَّوۡءِۖ وَغَضِبَ ٱللَّهُ عَلَیۡهِمۡ وَلَعَنَهُمۡ وَأَعَدَّ لَهُمۡ جَهَنَّمَۖ وَسَاۤءَتۡ مَصِیرࣰا\n"
    }
  },
  {
    "id": 4590,
    "surahId": 48,
    "ayahNumber": 7,
    "arabicText": "وَلِلَّهِ جُنُودُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمًا\n",
    "translations": {
      "en": "For, God’s are all the forces of the heavens and the earth; and God is indeed almighty, truly wise!",
      "ms": "Dan Allah menguasai tentera langit dan bumi (untuk menyeksa orang-orang yang derhaka); dan Allah adalah Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Dan kepunyaan Allah-lah tentara langit dan bumi. Dan adalah Allah Maha Perkasa lagi Maha Bijaksana.",
      "ar": "وَلِلَّهِ جُنُودُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمًا\n"
    }
  },
  {
    "id": 4591,
    "surahId": 48,
    "ayahNumber": 8,
    "arabicText": "إِنَّاۤ أَرۡسَلۡنَـٰكَ شَـٰهِدࣰا وَمُبَشِّرࣰا وَنَذِیرࣰا\n",
    "translations": {
      "en": "VERILY, [O Muhammad,] We have sent thee as a witness [to the truth], and as a herald of glad tidings and a warner –",
      "ms": "Sesungguhnya Kami telah mengutusmu (wahai Muhammad) sebagai Rasul yang menjadi saksi (yang diterima keterangannya), dan sebagai pembawa berita gembira (kepada orang-orang yang beriman), serta pemberi amaran (kepada orang-orang yang ingkar).",
      "id": "Sesungguhnya Kami mengutus kamu sebagai saksi, pembawa berita gembira dan pemberi peringatan,",
      "ar": "إِنَّاۤ أَرۡسَلۡنَـٰكَ شَـٰهِدࣰا وَمُبَشِّرࣰا وَنَذِیرࣰا\n"
    }
  },
  {
    "id": 4592,
    "surahId": 48,
    "ayahNumber": 9,
    "arabicText": "لِّتُؤۡمِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُۚ وَتُسَبِّحُوهُ بُكۡرَةࣰ وَأَصِیلًا\n",
    "translations": {
      "en": "so that you [O men] might believe in God and His Apostle, and might honour Him, and revere Him, and extol His limitless glory from morn to evening.",
      "ms": "(Kami mengutusmu wahai Muhammad) supaya engkau dan umatmu beriman kepada Allah dan RasulNya, dan supaya kamu kuatkan ugamaNya serta memuliakanNya, dan supaya kamu beribadat kepadaNya pada waktu pagi dan petang.",
      "id": "supaya kamu sekalian beriman kepada Allah dan Rasul-Nya, menguatkan (agama)Nya, membesarkan-Nya. Dan bertasbih kepada-Nya di waktu pagi dan petang.",
      "ar": "لِّتُؤۡمِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُۚ وَتُسَبِّحُوهُ بُكۡرَةࣰ وَأَصِیلًا\n"
    }
  },
  {
    "id": 4593,
    "surahId": 48,
    "ayahNumber": 10,
    "arabicText": "إِنَّ ٱلَّذِینَ یُبَایِعُونَكَ إِنَّمَا یُبَایِعُونَ ٱللَّهَ یَدُ ٱللَّهِ فَوۡقَ أَیۡدِیهِمۡۚ فَمَن نَّكَثَ فَإِنَّمَا یَنكُثُ عَلَىٰ نَفۡسِهِۦۖ وَمَنۡ أَوۡفَىٰ بِمَا عَـٰهَدَ عَلَیۡهُ ٱللَّهَ فَسَیُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "Behold, all who pledge their allegiance to thee pledge their allegiance to God: the hand of God is over their hands. Hence, he who breaks his oath, breaks it only to his own hurt; whereas he who remains true to what he has pledged unto God, on him will He bestow a reward supreme.",
      "ms": "Sesungguhnya orang-orang yang memberi pengakuan taat setia kepadamu (wahai Muhammad - untuk berjuang menentang musuh), mereka hanyasanya memberikan pengakuan taat setia kepada Allah; Allah mengawasi keadaan mereka memberikan taat setia itu (untuk membalasnya). Oleh itu, sesiapa yang tidak menyempurnakan janji setianya maka bahaya tidak menyempurnakan itu hanya menimpa dirinya; dan sesiapa yang menyempurnakan apa yang telah dijanjikannya kepada Allah, maka Allah akan memberi kepadanya pahala yang besar.",
      "id": "Bahwasanya orang-orang yang berjanji setia kepada kamu sesungguhnya mereka berjanji setia kepada Allah. Tangan Allah di atas tangan mereka, maka barangsiapa yang melanggar janjinya niscaya akibat ia melanggar janji itu akan menimpa dirinya sendiri dan barangsiapa menepati janjinya kepada Allah maka Allah akan memberinya pahala yang besar.",
      "ar": "إِنَّ ٱلَّذِینَ یُبَایِعُونَكَ إِنَّمَا یُبَایِعُونَ ٱللَّهَ یَدُ ٱللَّهِ فَوۡقَ أَیۡدِیهِمۡۚ فَمَن نَّكَثَ فَإِنَّمَا یَنكُثُ عَلَىٰ نَفۡسِهِۦۖ وَمَنۡ أَوۡفَىٰ بِمَا عَـٰهَدَ عَلَیۡهُ ٱللَّهَ فَسَیُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 4594,
    "surahId": 48,
    "ayahNumber": 11,
    "arabicText": "سَیَقُولُ لَكَ ٱلۡمُخَلَّفُونَ مِنَ ٱلۡأَعۡرَابِ شَغَلَتۡنَاۤ أَمۡوَ ٰ⁠لُنَا وَأَهۡلُونَا فَٱسۡتَغۡفِرۡ لَنَاۚ یَقُولُونَ بِأَلۡسِنَتِهِم مَّا لَیۡسَ فِی قُلُوبِهِمۡۚ قُلۡ فَمَن یَمۡلِكُ لَكُم مِّنَ ٱللَّهِ شَیۡـًٔا إِنۡ أَرَادَ بِكُمۡ ضَرًّا أَوۡ أَرَادَ بِكُمۡ نَفۡعَۢاۚ بَلۡ كَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ خَبِیرَۢا\n",
    "translations": {
      "en": "Those of the bedouin who stayed behind will say unto thee: “[The need to take care of] our chat­tels and our families kept us busy: do then, [O Prophet,] ask God to forgive us!” [Thus,] they will utter with their tongues something that is not in their hearts. Say: “Who, then, has it in his power to avert from you aught that God may have willed, whether it be His will to harm you or to confer a benefit on you? Nay, but God is fully aware of what you do!",
      "ms": "Orang-orang \"A'raab\" (kaum Arab Badwi) yang ketinggalan tidak turut (bersama-sama denganmu ke Hudaibiyah), akan berkata kepadamu (wahai Muhammad): \"Kami telah dihalangi oleh urusan menjaga keselamatan harta benda dan anak isteri kami; oleh itu, pohonkanlah ampun kepada Allah untuk kami\". Mereka berkata dengan lidahnya apa yang tidak ada dalam hatinya. Katakanlah (wahai Muhammad: \"Jika demikian sebab ketinggalan kamu) maka adakah sesiapa yang berkuasa mempertahankan kamu daripada terkena atau menerima sesuatu ketetapan dari Allah jika Ia tetapkan kamu ditimpa bahaya atau beroleh manfaat? (Tidak ada sesiapapun, dan apa yang kamu katakan itu bukanlah menjadi sebab) bahkan Allah adalah Maha Mendalam pengetahuanNya tentang sebab ketinggalan yang kamu lakukan itu (dan Ia akan membalasnya).",
      "id": "Orang-orang Badwi yang tertinggal (tidak turut ke Hudaibiyah) akan mengatakan: \"Harta dan keluarga kami telah merintangi kami, maka mohonkanlah ampunan untuk kami\"; mereka mengucapkan dengan lidahnya apa yang tidak ada dalam hatinya. Katakanlah: \"Maka siapakah (gerangan) yang dapat menghalang-halangi kehendak Allah jika Dia menghendaki kemudharatan bagimu atau jika Dia menghendaki manfaat bagimu. Sebenarnya Allah Maha Mengetahui apa yang kamu kerjakan.",
      "ar": "سَیَقُولُ لَكَ ٱلۡمُخَلَّفُونَ مِنَ ٱلۡأَعۡرَابِ شَغَلَتۡنَاۤ أَمۡوَ ٰ⁠لُنَا وَأَهۡلُونَا فَٱسۡتَغۡفِرۡ لَنَاۚ یَقُولُونَ بِأَلۡسِنَتِهِم مَّا لَیۡسَ فِی قُلُوبِهِمۡۚ قُلۡ فَمَن یَمۡلِكُ لَكُم مِّنَ ٱللَّهِ شَیۡـًٔا إِنۡ أَرَادَ بِكُمۡ ضَرًّا أَوۡ أَرَادَ بِكُمۡ نَفۡعَۢاۚ بَلۡ كَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ خَبِیرَۢا\n"
    }
  },
  {
    "id": 4595,
    "surahId": 48,
    "ayahNumber": 12,
    "arabicText": "بَلۡ ظَنَنتُمۡ أَن لَّن یَنقَلِبَ ٱلرَّسُولُ وَٱلۡمُؤۡمِنُونَ إِلَىٰۤ أَهۡلِیهِمۡ أَبَدࣰا وَزُیِّنَ ذَ ٰ⁠لِكَ فِی قُلُوبِكُمۡ وَظَنَنتُمۡ ظَنَّ ٱلسَّوۡءِ وَكُنتُمۡ قَوۡمَۢا بُورࣰا\n",
    "translations": {
      "en": "Nay, you thought that the Apostle and the believers would never return to their kith and kin: and this seemed goodly to your hearts. And you entertained [such] evil thoughts because you have always been people devoid of all good!”",
      "ms": "\"(Itu bukanlah sebabnya) bahkan sebabnya kamu telah menyangka bahawa Rasulullah dan orang-orang yang beriman (yang pergi berperang akan binasa semuanya dan) tidak akan kembali lagi kepada akan isteri dan keluarga masing-masing selama-lamanya; dan sangkaan yang demikian itu diperelokkan (oleh Syaitan) di dalam hati kamu (serta menerimanya); dan lagi kamu telah menyangka berbagai-bagai sangkaan yang buruk (terhadap ugama Allah yang dibawa oleh RasulNya); dan (dengan itu) menjadilah kamu kaum yang rosak binasa\".",
      "id": "Tetapi kamu menyangka bahwa Rasul dan orang-orang mukmin tidak sekali-kali akan kembali kepada keluarga mereka selama-lamanya dan syaitan telah menjadikan kamu memandang baik dalam hatimu persangkaan itu, dan kamu telah menyangka dengan sangkaan yang buruk dan kamu menjadi kaum yang binasa.",
      "ar": "بَلۡ ظَنَنتُمۡ أَن لَّن یَنقَلِبَ ٱلرَّسُولُ وَٱلۡمُؤۡمِنُونَ إِلَىٰۤ أَهۡلِیهِمۡ أَبَدࣰا وَزُیِّنَ ذَ ٰ⁠لِكَ فِی قُلُوبِكُمۡ وَظَنَنتُمۡ ظَنَّ ٱلسَّوۡءِ وَكُنتُمۡ قَوۡمَۢا بُورࣰا\n"
    }
  },
  {
    "id": 4596,
    "surahId": 48,
    "ayahNumber": 13,
    "arabicText": "وَمَن لَّمۡ یُؤۡمِنۢ بِٱللَّهِ وَرَسُولِهِۦ فَإِنَّاۤ أَعۡتَدۡنَا لِلۡكَـٰفِرِینَ سَعِیرࣰا\n",
    "translations": {
      "en": "Now as for those who will not believe in God and His Apostle - verily, We have readied a blazing flame for all [such] deniers of the truth!",
      "ms": "Dan (ingatlah bahawa) sesiapa yang tidak beriman kepada Allah dan RasulNya, maka sesungguhnya Kami sediakan bagi orang-orang kafir itu api neraka yang menjulang-julang.",
      "id": "Dan barangsiapa yang tidak beriman kepada Allah dan Rasul-Nya maka sesungguhnya Kami menyediakan untuk orang-orang yang kafir neraka yang bernyala-nyala.",
      "ar": "وَمَن لَّمۡ یُؤۡمِنۢ بِٱللَّهِ وَرَسُولِهِۦ فَإِنَّاۤ أَعۡتَدۡنَا لِلۡكَـٰفِرِینَ سَعِیرࣰا\n"
    }
  },
  {
    "id": 4597,
    "surahId": 48,
    "ayahNumber": 14,
    "arabicText": "وَلِلَّهِ مُلۡكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ یَغۡفِرُ لِمَن یَشَاۤءُ وَیُعَذِّبُ مَن یَشَاۤءُۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "But God’s is the dominion over the heavens and the earth: He forgives whomever He wills, and imposes suffering on whomever He wills - and [withal,] He is indeed much-forgiving, a dispenser of grace.",
      "ms": "Dan (ingatlah juga bahawa) kuasa pemerintahan langit dan bumi adalah hak kepunyaan Allah, Ia berkuasa mengampunkan sesiapa yang dikehendakiNya, dan Ia juga berkuasa menyeksa sesiapa yang dikehendakiNya; dan Allah adalah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Dan hanya kepunyaan Allah-lah kerajaan langit dan bumi. Dia memberikan ampun kepada siapa yang dikehendaki-Nya dan mengazab siapa yang dikehendaki-Nya. Dan Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "وَلِلَّهِ مُلۡكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ یَغۡفِرُ لِمَن یَشَاۤءُ وَیُعَذِّبُ مَن یَشَاۤءُۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 4598,
    "surahId": 48,
    "ayahNumber": 15,
    "arabicText": "سَیَقُولُ ٱلۡمُخَلَّفُونَ إِذَا ٱنطَلَقۡتُمۡ إِلَىٰ مَغَانِمَ لِتَأۡخُذُوهَا ذَرُونَا نَتَّبِعۡكُمۡۖ یُرِیدُونَ أَن یُبَدِّلُوا۟ كَلَـٰمَ ٱللَّهِۚ قُل لَّن تَتَّبِعُونَا كَذَ ٰ⁠لِكُمۡ قَالَ ٱللَّهُ مِن قَبۡلُۖ فَسَیَقُولُونَ بَلۡ تَحۡسُدُونَنَاۚ بَلۡ كَانُوا۟ لَا یَفۡقَهُونَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "As soon as you [O believers] are about to set forth on a war that promises booty, those who stayed behind [aforetime] will surely say, “Allow us to go with you” - [thus showing that] they would like to alter the Word of God. Say: “By no means shall you go with us: God has declared aforetime [to whom all spoils shall belong].” Thereupon they will [surely] answer, “Nay, but you begrudge us [our share of booty]!” Nay, they can grasp but so little of the truth!",
      "ms": "Orang-orang (munafik) yang tidak turut berjuang (bersama-sama kamu) akan berkata semasa kamu pergi (mengepong musuh serta) mendapat harta rampasan perang: Biarkanlah kami turut serta dengan kamu!\" Mereka (dengan itu) hendak mengubah janji Allah (yang menentukan hanya orang-orang yang turut hadir di Hudaibiyah sahaja yang berhak mendapat harta rampasan perang itu). Katakanlah (wahai Muhammad): \"Kamu tidak dibenarkan sama sekali turut serta dengan kami; demikianlah Allah menegaskan (larangan itu) semenjak dahulu lagi\". Mereka akan berkata pula: \"(Bukan Tuhan yang melarang) bahkan kamu dengki kepada kami\", (apa yang mereka katakan itu tidaklah benar), bahkan mereka tidak faham kecuali sedikit sahaja; (mereka hanya faham tentang kehidupan dan kesenangan dunia semata-mata).",
      "id": "Orang-orang Badwi yang tertinggal itu akan berkata apabila kamu berangkat untuk mengambil barang rampasan: \"Biarkanlah kami, niscaya kami mengikuti kamu\"; mereka hendak merubah janji Allah. Katakanlah: \"Kamu sekali-kali tidak (boleh) mengikuti kami; demikian Allah telah menetapkan sebelumnya\"; mereka akan mengatakan: \"Sebenarnya kamu dengki kepada kami\". Bahkan mereka tidak mengerti melainkan sedikit sekali.",
      "ar": "سَیَقُولُ ٱلۡمُخَلَّفُونَ إِذَا ٱنطَلَقۡتُمۡ إِلَىٰ مَغَانِمَ لِتَأۡخُذُوهَا ذَرُونَا نَتَّبِعۡكُمۡۖ یُرِیدُونَ أَن یُبَدِّلُوا۟ كَلَـٰمَ ٱللَّهِۚ قُل لَّن تَتَّبِعُونَا كَذَ ٰ⁠لِكُمۡ قَالَ ٱللَّهُ مِن قَبۡلُۖ فَسَیَقُولُونَ بَلۡ تَحۡسُدُونَنَاۚ بَلۡ كَانُوا۟ لَا یَفۡقَهُونَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 4599,
    "surahId": 48,
    "ayahNumber": 16,
    "arabicText": "قُل لِّلۡمُخَلَّفِینَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُو۟لِی بَأۡسࣲ شَدِیدࣲ تُقَـٰتِلُونَهُمۡ أَوۡ یُسۡلِمُونَۖ فَإِن تُطِیعُوا۟ یُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنࣰاۖ وَإِن تَتَوَلَّوۡا۟ كَمَا تَوَلَّیۡتُم مِّن قَبۡلُ یُعَذِّبۡكُمۡ عَذَابًا أَلِیمࣰا\n",
    "translations": {
      "en": "Say unto those bedouin who stayed behind: “In time you will be called upon [to fight] against people of great prowess in war: you will have to fight against them [until you die] or they surrender. And then, if you heed [that call], God will bestow on you a goodly reward; but if you turn away as you turned away this time, He will chastise you with grievous chastisement.”",
      "ms": "Katakanlah (wahai Muhammad) kepada orang-orang yang tidak turut berjuang (bersama-samamu) dari kalangan kaum-kaum Arab Badwi: \"Kamu akan diajak menentang satu kaum (penceroboh) yang sangat kuat gagah supaya kamu memeranginya, atau mereka menurut perintah Islam (secara damai). Jika kamu taat (menjalankan perintah Allah ini), Allah akan mengurniakan kamu dengan balasan yang baik (di dunia dan akhirat), dan kalau kamu berpaling ingkar seperti keingkaran dahulu, nescaya Allah akan menyeksa kamu dengan azab yang tidak terperi sakitnya\".",
      "id": "Katakanlah kepada orang-orang Badwi yang tertinggal: \"Kamu akan diajak untuk (memerangi) kaum yang mempunyai kekuatan yang besar, kamu akan memerangi mereka atau mereka menyerah (masuk Islam). Maka jika kamu patuhi (ajakan itu) niscaya Allah akan memberikan kepadamu pahala yang baik dan jika kamu berpaling sebagaimana kamu telah berpaling sebelumnya, niscaya Dia akan mengazab kamu dengan azab yang pedih\".",
      "ar": "قُل لِّلۡمُخَلَّفِینَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُو۟لِی بَأۡسࣲ شَدِیدࣲ تُقَـٰتِلُونَهُمۡ أَوۡ یُسۡلِمُونَۖ فَإِن تُطِیعُوا۟ یُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنࣰاۖ وَإِن تَتَوَلَّوۡا۟ كَمَا تَوَلَّیۡتُم مِّن قَبۡلُ یُعَذِّبۡكُمۡ عَذَابًا أَلِیمࣰا\n"
    }
  },
  {
    "id": 4600,
    "surahId": 48,
    "ayahNumber": 17,
    "arabicText": "لَّیۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجࣱ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجࣱ وَلَا عَلَى ٱلۡمَرِیضِ حَرَجࣱۗ وَمَن یُطِعِ ٱللَّهَ وَرَسُولَهُۥ یُدۡخِلۡهُ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ وَمَن یَتَوَلَّ یُعَذِّبۡهُ عَذَابًا أَلِیمࣰا\n",
    "translations": {
      "en": "No blame attaches to the blind, nor does blame attach to the lame, nor does blame attach to the sick [for staying away from a war in God’s cause]; but whoever heeds [the call of] God and His Apostle [in deed or in heart], him will He admit into gardens through which running waters flow; whereas him who turns away will He chastise with grievous chastise­ment.",
      "ms": "Tidaklah menjadi salah kepada orang buta, dan tidaklah menjadi salah kepada orang tempang, dan tidaklah menjadi salah kepada orang sakit (tidak turut berperang, kerana masing-masing ada uzurnya). Dan (ingatlah), sesiapa yang taat kepada Allah dan RasulNya, akan dimasukkanNya ke dalam Syurga yang mengalir di bawahnya beberapa sungai; dan sesiapa yang berpaling ingkar, akan diseksaNya dengan azab yang tidak terperi sakitnya.",
      "id": "Tiada dosa atas orang-orang yang buta dan atas orang yang pincang dan atas orang yang sakit (apabila tidak ikut berperang). Dan barangsiapa yang taat kepada Allah dan Rasul-Nya; niscaya Allah akan memasukkannya ke dalam surga yang mengalir di bawahnya sungai-sungai dan barang siapa yang berpaling niscaya akan diazab-Nya dengan azab yang pedih.",
      "ar": "لَّیۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجࣱ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجࣱ وَلَا عَلَى ٱلۡمَرِیضِ حَرَجࣱۗ وَمَن یُطِعِ ٱللَّهَ وَرَسُولَهُۥ یُدۡخِلۡهُ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ وَمَن یَتَوَلَّ یُعَذِّبۡهُ عَذَابًا أَلِیمࣰا\n"
    }
  },
  {
    "id": 4601,
    "surahId": 48,
    "ayahNumber": 18,
    "arabicText": "۞ لَّقَدۡ رَضِیَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِینَ إِذۡ یُبَایِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِی قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِینَةَ عَلَیۡهِمۡ وَأَثَـٰبَهُمۡ فَتۡحࣰا قَرِیبࣰا\n",
    "translations": {
      "en": "INDEED, well-pleased was God with the believers when they pledged their allegiance unto thee [O Muhammad] under that tree, for He knew what was in their hearts; and so He bestowed inner peace upon them from on high, and rewarded them with [the glad tiding of] a victory soon to come",
      "ms": "Demi sesungguhnya! Allah reda akan orang-orang yang beriman, ketika mereka memberikan pengakuan taat setia kepadamu (wahai Muhammad) di bawah naungan pohon (yang termaklum di Hudaibiyah); maka (dengan itu) ternyata apa yang sedia diketahuiNya tentang (kebenaran iman dan taat setia) yang ada dalam hati mereka, lalu Ia menurunkan semangat tenang tenteram kepada mereka, dan membalas mereka dengan kemenangan yang dekat masa datangnya;",
      "id": "Sesungguhnya Allah telah ridha terhadap orang-orang mukmin ketika mereka berjanji setia kepadamu di bawah pohon, maka Allah mengetahui apa yang ada dalam hati mereka lalu menurunkan ketenangan atas mereka dan memberi balasan kepada mereka dengan kemenangan yang dekat (waktunya).",
      "ar": "۞ لَّقَدۡ رَضِیَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِینَ إِذۡ یُبَایِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِی قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِینَةَ عَلَیۡهِمۡ وَأَثَـٰبَهُمۡ فَتۡحࣰا قَرِیبࣰا\n"
    }
  },
  {
    "id": 4602,
    "surahId": 48,
    "ayahNumber": 19,
    "arabicText": "وَمَغَانِمَ كَثِیرَةࣰ یَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n",
    "translations": {
      "en": "and [of] many war-gains which they would achieve: for God is indeed almighty, wise.",
      "ms": "Dan juga dengan banyak harta rampasan perang, yang mereka akan dapat mengambilnya. Dan (ingatlah), Allah adalah Maha kuasa, lagi Maha Bijaksana.",
      "id": "Serta harta rampasan yang banyak yang dapat mereka ambil. Dan adalah Allah Maha Perkasa lagi Maha Bijaksana.",
      "ar": "وَمَغَانِمَ كَثِیرَةࣰ یَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 4603,
    "surahId": 48,
    "ayahNumber": 20,
    "arabicText": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِیرَةࣰ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَـٰذِهِۦ وَكَفَّ أَیۡدِیَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَایَةࣰ لِّلۡمُؤۡمِنِینَ وَیَهۡدِیَكُمۡ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n",
    "translations": {
      "en": "[O you who believe!] God has promised you many war-gains which you shall yet achieve; and He has vouchsafed you these [worldly gains] well in advance, and has stayed from you the hands of [hostile] people, so that this [your inner strength] may become a symbol to the believers [who will come after you], and that He may guide you all on a straight way.",
      "ms": "(Sebagai memuliakan orang-orang yang memberi pengakuan taat setianya di Hudaibiyah, Tuhan menujukan firmannya kepada mereka): Allah menjanjikan kepada kamu harta rampasan yang banyak yang kamu akan mengambilnya, lalu Ia menyegerakan untuk kamu harta rampasan perang ini, serta Ia telah menahan tangan manusia (pihak musuh di situ) daripada menyerang kamu; (Allah melakukan yang demikian supaya kamu beroleh manfaat) dan supaya menjadi tanda (yang membuktikan kebenaran janjiNya) bagi orang-orang yang beriman, dan juga supaya Ia menambahkan kamu hidayah ke jalan yang lurus.",
      "id": "Allah menjanjikan kepada kamu harta rampasan yang banyak yang dapat kamu ambil, maka disegerakan-Nya harta rampasan ini untukmu dan Dia menahan tangan manusia dari (membinasakan)mu (agar kamu mensyukuri-Nya) dan agar hal itu menjadi bukti bagi orang-orang mukmin dan agar Dia menunjuki kamu kepada jalan yang lurus.",
      "ar": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِیرَةࣰ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَـٰذِهِۦ وَكَفَّ أَیۡدِیَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَایَةࣰ لِّلۡمُؤۡمِنِینَ وَیَهۡدِیَكُمۡ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n"
    }
  },
  {
    "id": 4604,
    "surahId": 48,
    "ayahNumber": 21,
    "arabicText": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُوا۟ عَلَیۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣰا\n",
    "translations": {
      "en": "And there are yet other [gains] which are still beyond your grasp, [but] which God has already encompassed [for you]: for God has the power to will anything.",
      "ms": "Dan ada lagi harta rampasan lain yang kamu belum dapat menguasainya, (tetapi) Allah telah memelihara harta itu dengan kekuasaanNya (untuk kamu mendapatnya); dan (ingatlah), Allah adalah Maha Kuasa atas tiap-tiap sesuatu.",
      "id": "Dan (telah menjanjikan pula kemenangan-kemenangan) yang lain (atas negeri-negeri) yang kamu belum dapat menguasainya yang sungguh Allah telah menentukan-Nya. Dan adalah Allah Maha Kuasa atas segala sesuatu.",
      "ar": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُوا۟ عَلَیۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣰا\n"
    }
  },
  {
    "id": 4605,
    "surahId": 48,
    "ayahNumber": 22,
    "arabicText": "وَلَوۡ قَـٰتَلَكُمُ ٱلَّذِینَ كَفَرُوا۟ لَوَلَّوُا۟ ٱلۡأَدۡبَـٰرَ ثُمَّ لَا یَجِدُونَ وَلِیࣰّا وَلَا نَصِیرࣰا\n",
    "translations": {
      "en": "And [now,] if they who are bent on denying the truth should fight against you, they will indeed turn their backs [in flight], and will find none to protect them and none to bring them succour:",
      "ms": "Dan sekiranya orang-orang kafir (dari penduduk Makkah) itu memerangi kamu (di Hudaibiyah), tentulah mereka akan berpaling melarikan diri dengan kekalahan; kemudian mereka tidak akan beroleh sesiapapun yang menjadi pelindung atau memberikan pertolongan.",
      "id": "Dan sekiranya orang-orang kafir itu memerangi kamu pastilah mereka berbalik melarikan diri ke belakang (kalah) kemudian mereka tiada memperoleh pelindung dan tidak (pula) penolong.",
      "ar": "وَلَوۡ قَـٰتَلَكُمُ ٱلَّذِینَ كَفَرُوا۟ لَوَلَّوُا۟ ٱلۡأَدۡبَـٰرَ ثُمَّ لَا یَجِدُونَ وَلِیࣰّا وَلَا نَصِیرࣰا\n"
    }
  },
  {
    "id": 4606,
    "surahId": 48,
    "ayahNumber": 23,
    "arabicText": "سُنَّةَ ٱللَّهِ ٱلَّتِی قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِیلࣰا\n",
    "translations": {
      "en": "such being God’s way which has ever obtained in the past - and never wilt thou find any change in God’s way!",
      "ms": "(Kekalahan orang-orang yang menentang Rasul Allah sudah tetap menurut) \"Sunnatullah\" (peraturan Allah) yang telah berlaku semenjak dahulu lagi; dan engkau tidak akan mendapati sebarang perubahan bagi cara dan peraturan Allah itu.",
      "id": "Sebagai suatu sunnatullah yang telah berlaku sejak dahulu, kamu sekali-kali tiada akan menemukan perubahan bagi sunnatullah itu.",
      "ar": "سُنَّةَ ٱللَّهِ ٱلَّتِی قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِیلࣰا\n"
    }
  },
  {
    "id": 4607,
    "surahId": 48,
    "ayahNumber": 24,
    "arabicText": "وَهُوَ ٱلَّذِی كَفَّ أَیۡدِیَهُمۡ عَنكُمۡ وَأَیۡدِیَكُمۡ عَنۡهُم بِبَطۡنِ مَكَّةَ مِنۢ بَعۡدِ أَنۡ أَظۡفَرَكُمۡ عَلَیۡهِمۡۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِیرًا\n",
    "translations": {
      "en": "And He it is who, in the valley of Mecca, stayed their hands from you, and your hands from them, after He had enabled you to vanquish them; and God saw indeed what you were doing.",
      "ms": "Dan Dia lah yang telah menahan tangan mereka (yang musyrik) daripada melakukan perkara yang buruk terhadap kamu, dan tangan kamu daripada berbuat demikian kepada mereka di kawasan Makkah, sesudah Ia menjadikan kamu dapat menewaskan mereka. Dan (ingatlah), Allah adalah Maha Melihat akan segala yang kamu kerjakan.",
      "id": "Dan Dialah yang menahan tangan mereka dari (membinasakan) kamu dan (menahan) tangan kamu dari (membinasakan) mereka di tengah kota Mekah sesudah Allah memenangkan kamu atas mereka, dan adalah Allah Maha Melihat apa yang kamu kerjakan.",
      "ar": "وَهُوَ ٱلَّذِی كَفَّ أَیۡدِیَهُمۡ عَنكُمۡ وَأَیۡدِیَكُمۡ عَنۡهُم بِبَطۡنِ مَكَّةَ مِنۢ بَعۡدِ أَنۡ أَظۡفَرَكُمۡ عَلَیۡهِمۡۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِیرًا\n"
    }
  },
  {
    "id": 4608,
    "surahId": 48,
    "ayahNumber": 25,
    "arabicText": "هُمُ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَٱلۡهَدۡیَ مَعۡكُوفًا أَن یَبۡلُغَ مَحِلَّهُۥۚ وَلَوۡلَا رِجَالࣱ مُّؤۡمِنُونَ وَنِسَاۤءࣱ مُّؤۡمِنَـٰتࣱ لَّمۡ تَعۡلَمُوهُمۡ أَن تَطَـُٔوهُمۡ فَتُصِیبَكُم مِّنۡهُم مَّعَرَّةُۢ بِغَیۡرِ عِلۡمࣲۖ لِّیُدۡخِلَ ٱللَّهُ فِی رَحۡمَتِهِۦ مَن یَشَاۤءُۚ لَوۡ تَزَیَّلُوا۟ لَعَذَّبۡنَا ٱلَّذِینَ كَفَرُوا۟ مِنۡهُمۡ عَذَابًا أَلِیمًا\n",
    "translations": {
      "en": "[It was not for your enemies sake that He stayed your hands from them: for] it was they who were bent on denying the truth, and who debarred you from the Inviolable House of Worship and prevented your offering from reaching its destina­tion. And had it not been for the believing men and believing women [in Mecca], whom you might have unwittingly trampled underfoot, and on whose account you might have become guilty, without knowing it, of a grievous wrong-: [had it not been for this, you would have been allowed to fight your way into the city: but you were forbidden to fight] so that [in time] God might admit to His grace whomever He wills. Had they [who deserve Our mercy and they whom We have condemned] been clearly discernible [to you], We would indeed have imposed grievous suffering [at your hands] on such of them as were bent on denying the truth.",
      "ms": "Mereka itulah orang-orang yang kafir dan menghalang kamu daripada masuk ke masjid Al-Haraam (Makkah Al-Mukarramah) serta (menyebabkan) binatang-binatang korban (yang kamu bawa): tertahan dari sampai ke tempat sembelihannya. Dan kalaulah tidak kerana kemungkinan kamu akan melakukan pembunuhan yang tidak sengaja terhadap beberapa orang yang beriman, lelaki dan perempuan, yang ada di antara orang-orang kafir itu, pada hal kamu tidak mengetahui mereka beriman, yang akibatnya kamu akan menanggung kesusahan dan dukacita disebabkan pembunuhan mereka, - (tentulah diizinkan kamu menyerang kaum musyrik yang mengancam kamu itu). (Tetapi tidak diizinkan) kerana Allah hendak memasukkan sesiapa yang dikehendakiNya ke dalam rahmatNya. Kalaulah mereka (penduduk Makkah - yang beriman dan yang musyrik) itu berpisahan (di antara satu puak dengan yang lain), tentulah Kami menyeksa orang-orang yang kafir dari mereka dengan seksa (di dunia) yang tidak terperi sakitnya.",
      "id": "Merekalah orang-orang yang kafir yang menghalangi kamu dari (masuk) Masjidil Haram dan menghalangi hewan korban sampai ke tempat (penyembelihan)nya. Dan kalau tidaklah karena laki-laki yang mukmin dan perempuan-perempuan yang mukmin yang tiada kamu ketahui, bahwa kamu akan membunuh mereka yang menyebabkan kamu ditimpa kesusahan tanpa pengetahuanmu (tentulah Allah tidak akan menahan tanganmu dari membinasakan mereka). Supaya Allah memasukkan siapa yang dikehendaki-Nya ke dalam rahmat-Nya. Sekiranya mereka tidak bercampur-baur, tentulah Kami akan mengazab orang-orang yag kafir di antara mereka dengan azab yang pedih.",
      "ar": "هُمُ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَٱلۡهَدۡیَ مَعۡكُوفًا أَن یَبۡلُغَ مَحِلَّهُۥۚ وَلَوۡلَا رِجَالࣱ مُّؤۡمِنُونَ وَنِسَاۤءࣱ مُّؤۡمِنَـٰتࣱ لَّمۡ تَعۡلَمُوهُمۡ أَن تَطَـُٔوهُمۡ فَتُصِیبَكُم مِّنۡهُم مَّعَرَّةُۢ بِغَیۡرِ عِلۡمࣲۖ لِّیُدۡخِلَ ٱللَّهُ فِی رَحۡمَتِهِۦ مَن یَشَاۤءُۚ لَوۡ تَزَیَّلُوا۟ لَعَذَّبۡنَا ٱلَّذِینَ كَفَرُوا۟ مِنۡهُمۡ عَذَابًا أَلِیمًا\n"
    }
  },
  {
    "id": 4609,
    "surahId": 48,
    "ayahNumber": 26,
    "arabicText": "إِذۡ جَعَلَ ٱلَّذِینَ كَفَرُوا۟ فِی قُلُوبِهِمُ ٱلۡحَمِیَّةَ حَمِیَّةَ ٱلۡجَـٰهِلِیَّةِ فَأَنزَلَ ٱللَّهُ سَكِینَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِینَ وَأَلۡزَمَهُمۡ كَلِمَةَ ٱلتَّقۡوَىٰ وَكَانُوۤا۟ أَحَقَّ بِهَا وَأَهۡلَهَاۚ وَكَانَ ٱللَّهُ بِكُلِّ شَیۡءٍ عَلِیمࣰا\n",
    "translations": {
      "en": "Whereas they who are bent on denying the truth harboured a stubborn disdain in their hearts - the stubborn disdain [born] of ignorance God bestowed from on high His [gift of] inner peace upon His Apostle and the believers, and bound them to the spirit of God-consciousness: for they were most worthy of this [divine gift], and deserved it well. And God has full knowledge of all things.",
      "ms": "(Ingatlah dan kenangkanlah ihsan Tuhan kepada kamu) ketika orang-orang yang kafir itu menimbulkan perasaan sombong angkuh yang ada dalam hati mereka (terhadap kebenaran Islam) - perasaan sombong angkuh secara Jahiliyah (yang menyebabkan kamu panas hati dan terharu), lalu Allah menurunkan semangat tenang tenteram kepada RasulNya dan kepada orang-orang yang beriman (sehingga tercapailah perdamaian), serta meminta mereka tetap berpegang kepada \"Kalimah Taqwa\", sedang mereka (di sisi Allah) adalah orang-orang yang sangat berhak dengan \"kalimah Taqwa\" itu serta menjadi ahlinya. Dan (ingatlah), Allah adalah Maha Mengetahui akan tiap-tiap sesuatu.",
      "id": "Ketika orang-orang kafir menanamkan dalam hati mereka kesombongan (yaitu) kesombongan jahiliyah lalu Allah menurunkan ketenangan kepada Rasul-Nya, dan kepada orang-orang mukmin dan Allah mewajibkan kepada mereka kalimat-takwa dan adalah mereka berhak dengan kalimat takwa itu dan patut memilikinya. Dan adalah Allah Maha Mengetahui segala sesuatu.",
      "ar": "إِذۡ جَعَلَ ٱلَّذِینَ كَفَرُوا۟ فِی قُلُوبِهِمُ ٱلۡحَمِیَّةَ حَمِیَّةَ ٱلۡجَـٰهِلِیَّةِ فَأَنزَلَ ٱللَّهُ سَكِینَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِینَ وَأَلۡزَمَهُمۡ كَلِمَةَ ٱلتَّقۡوَىٰ وَكَانُوۤا۟ أَحَقَّ بِهَا وَأَهۡلَهَاۚ وَكَانَ ٱللَّهُ بِكُلِّ شَیۡءٍ عَلِیمࣰا\n"
    }
  },
  {
    "id": 4610,
    "surahId": 48,
    "ayahNumber": 27,
    "arabicText": "لَّقَدۡ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءۡیَا بِٱلۡحَقِّۖ لَتَدۡخُلُنَّ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ إِن شَاۤءَ ٱللَّهُ ءَامِنِینَ مُحَلِّقِینَ رُءُوسَكُمۡ وَمُقَصِّرِینَ لَا تَخَافُونَۖ فَعَلِمَ مَا لَمۡ تَعۡلَمُوا۟ فَجَعَلَ مِن دُونِ ذَ ٰ⁠لِكَ فَتۡحࣰا قَرِیبًا\n",
    "translations": {
      "en": "Indeed, God has shown the truth in His Apostle’s true vision: most certainly shall you enter the Inviolable House of Worship, if God so wills, in full security, with your heads shaved or your hair cut short, without any fear: for He has [always] known that which you yourselves could not know. And He has ordained [for you], besides this, a victory soon to come.",
      "ms": "Demi sesungguhnya! Allah tetap menyatakan benar RasulNya dalam perkara mimpi itu dengan kenyataan yang sebenar; iaitu sesungguhnya kamu tetap akan memasuki Masjid Al-Haraam - insya Allah (pada masa yang ditentukanNya) - dalam keadaan aman (menyempurnakan ibadat umrah kamu) dengan mencukur kepala kamu, dan kalau (tidak pun) menggunting sedikit rambutnya, serta kamu tidak merasa takut (akan pengkhianatan musuh sehingga kamu keluar balik dari situ). (Allah mengangguhkan berlakunya kenyataan itu) kerana Ia mengetahui (adanya feadah dalam penangguhan itu) yang kamu tidak mengetahuinya; maka Ia menyediakan sebelum (terlaksananya mimpi) itu, satu kemenangan yang dekat (masa berlakunnya).",
      "id": "Sesungguhnya Allah akan membuktikan kepada Rasul-Nya, tentang kebenaran mimpinya dengan sebenarnya (yaitu) bahwa sesungguhnya kamu pasti akan memasuki Masjidil Haram, insya Allah dalam keadaan aman, dengan mencukur rambut kepala dan mengguntingnya, sedang kamu tidak merasa takut. Maka Allah mengetahui apa yang tiada kamu ketahui dan Dia memberikan sebelum itu kemenangan yang dekat.",
      "ar": "لَّقَدۡ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءۡیَا بِٱلۡحَقِّۖ لَتَدۡخُلُنَّ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ إِن شَاۤءَ ٱللَّهُ ءَامِنِینَ مُحَلِّقِینَ رُءُوسَكُمۡ وَمُقَصِّرِینَ لَا تَخَافُونَۖ فَعَلِمَ مَا لَمۡ تَعۡلَمُوا۟ فَجَعَلَ مِن دُونِ ذَ ٰ⁠لِكَ فَتۡحࣰا قَرِیبًا\n"
    }
  },
  {
    "id": 4611,
    "surahId": 48,
    "ayahNumber": 28,
    "arabicText": "هُوَ ٱلَّذِیۤ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِینِ ٱلۡحَقِّ لِیُظۡهِرَهُۥ عَلَى ٱلدِّینِ كُلِّهِۦۚ وَكَفَىٰ بِٱللَّهِ شَهِیدࣰا\n",
    "translations": {
      "en": "He it is who has sent forth His Apostle with the [task of spreading] guidance and the religion of truth, to the end that He make it prevail over every [false] religion; and none can bear witness [to the truth] as God does.",
      "ms": "(Allah yang menyatakan itu) Dia lah yang telah mengutus RasulNya (Muhammad, s.a.w) dengan membawa hidayah petunjuk dan ugama yang benar (ugama Islam), supaya Dia memenangkannya dan meninggikannya atas segala bawaan ugama yang lain; dan cukuplah Allah menjadi Saksi (tentang kebenaran apa yang dibawa oleh RasulNya itu).",
      "id": "Dialah yang mengutus Rasul-Nya dengan membawa petunjuk dan agama yang hak agar dimenangkan-Nya terhadap semua agama. Dan cukuplah Allah sebagai saksi.",
      "ar": "هُوَ ٱلَّذِیۤ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِینِ ٱلۡحَقِّ لِیُظۡهِرَهُۥ عَلَى ٱلدِّینِ كُلِّهِۦۚ وَكَفَىٰ بِٱللَّهِ شَهِیدࣰا\n"
    }
  },
  {
    "id": 4612,
    "surahId": 48,
    "ayahNumber": 29,
    "arabicText": "مُّحَمَّدࣱ رَّسُولُ ٱللَّهِۚ وَٱلَّذِینَ مَعَهُۥۤ أَشِدَّاۤءُ عَلَى ٱلۡكُفَّارِ رُحَمَاۤءُ بَیۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعࣰا سُجَّدࣰا یَبۡتَغُونَ فَضۡلࣰا مِّنَ ٱللَّهِ وَرِضۡوَ ٰ⁠نࣰاۖ سِیمَاهُمۡ فِی وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَ ٰ⁠لِكَ مَثَلُهُمۡ فِی ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِی ٱلۡإِنجِیلِ كَزَرۡعٍ أَخۡرَجَ شَطۡـَٔهُۥ فَـَٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ یُعۡجِبُ ٱلزُّرَّاعَ لِیَغِیظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ مِنۡهُم مَّغۡفِرَةࣰ وَأَجۡرًا عَظِیمَۢا\n",
    "translations": {
      "en": "MUHAMMAD is God’s Apostle; and those who are [truly] with him are firm and unyielding towards all deniers of the truth, [yet] full of mercy towards one another. Thou canst see them bowing down, pros­trating themselves [in prayer], seeking favour with God and [His] goodly acceptance: their marks are on their faces, traced by prostration. This is their parable in the Torah as well as their parable in the Gospel: [they are] like a seed that brings forth its shoot, and then He strengthens it, so that it grows stout, and [in the end] stands firm upon its stem, delighting the sowers. [Thus will God cause the believers to grow in strength,] so that through them He might confound the deniers of the truth. [But] unto such of them as may [yet] attain to faith and do righteous deeds, God has promised forgiveness and a reward supreme.",
      "ms": "Nabi Muhammad (s.a.w) ialah Rasul Allah; dan orang-orang yang bersama dengannya bersikap keras dan tegas terhadap orang-orang kafir yang (memusuhi Islam), dan sebaiknya bersikap kasih sayang serta belas kasihan kasihan sesama sendiri (umat Islam). Engkau melihat mereka tetap beribadat rukuk dan sujud, dengan mengharapkan limpah kurnia (pahala) dari Tuhan mereka serta mengharapkan keredaanNya. Tanda yang menunjukkan mereka (sebagai orang-orang yang soleh) terdapat muka mereka - dari kesan sujud (dan ibadat mereka yang ikhlas). Demikianlah sifat mereka yang tersebut di dalam Kitab Taurat; dan sifat mereka di dalam Kitab Injil pula ialah: (bahawa mereka diibaratkan) sebagai pokok tanaman yang mengeluarkan anak dan tunasnya, lalu anak dan tunasnya itu menyuburkannya, sehingga ia menjadi kuat, lalu ia tegap berdiri di atas (pangkal) batangnya dengan keadaan yang mengkagumkan orang-orang yang menanamnya. (Allah menjadikan sahabat-sahabat Nabi Muhammad, s.a.w dan pengikut-pengikutnya kembang biak serta kuat gagah sedemikian itu) kerana Ia hendak menjadikan orang-orang kafir merana dengan perasaan marah dan hasad dengki - dengan kembang biaknya umat Islam itu. (Dan selain itu) Allah telah menjanjikan orang-orang yang beriman dan beramal soleh dari mereka, keampunan dan pahala yang besar.",
      "id": "Muhammad itu adalah utusan Allah dan orang-orang yang bersama dengan dia adalah keras terhadap orang-orang kafir, tetapi berkasih sayang sesama mereka. Kamu lihat mereka ruku' dan sujud mencari karunia Allah dan keridhaan-Nya, tanda-tanda mereka tampak pada muka mereka dari bekas sujud. Demikianlah sifat-sifat mereka dalam Taurat dan sifat-sifat mereka dalam Injil, yaitu seperti tanaman yang mengeluarkan tunasnya maka tunas itu menjadikan tanaman itu kuat lalu menjadi besarlah dia dan tegak lurus di atas pokoknya; tanaman itu menyenangkan hati penanam-penanamnya karena Allah hendak menjengkelkan hati orang-orang kafir (dengan kekuatan orang-orang mukmin). Allah menjanjikan kepada orang-orang yang beriman dan mengerjakan amal yang saleh di antara mereka ampunan dan pahala yang besar.",
      "ar": "مُّحَمَّدࣱ رَّسُولُ ٱللَّهِۚ وَٱلَّذِینَ مَعَهُۥۤ أَشِدَّاۤءُ عَلَى ٱلۡكُفَّارِ رُحَمَاۤءُ بَیۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعࣰا سُجَّدࣰا یَبۡتَغُونَ فَضۡلࣰا مِّنَ ٱللَّهِ وَرِضۡوَ ٰ⁠نࣰاۖ سِیمَاهُمۡ فِی وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَ ٰ⁠لِكَ مَثَلُهُمۡ فِی ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِی ٱلۡإِنجِیلِ كَزَرۡعٍ أَخۡرَجَ شَطۡـَٔهُۥ فَـَٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ یُعۡجِبُ ٱلزُّرَّاعَ لِیَغِیظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ مِنۡهُم مَّغۡفِرَةࣰ وَأَجۡرًا عَظِیمَۢا\n"
    }
  }
]