[
  {
    "id": 1902,
    "surahId": 16,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ أَتَىٰۤ أَمۡرُ ٱللَّهِ فَلَا تَسۡتَعۡجِلُوهُۚ سُبۡحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا یُشۡرِكُونَ\n",
    "translations": {
      "en": "GOD'S JUDGMENT is [bound to] come: do not, therefore, call for its speedy advent! Limitless is He in His glory and sublimely exalted above anything to which men may ascribe a share in His divinity!",
      "ms": "Telah hampir datangnya janji yang telah ditetapkan oleh Allah, maka janganlah kamu minta disegerakan. Maha suci Allah dan Maha tinggilah Ia dari perbuatan syirik yang mereka lakukan.",
      "id": "Telah pasti datangnya ketetapan Allah maka janganlah kamu meminta agar disegerakan (datang)nya. Maha Suci Allah dan Maha Tinggi dari apa yang mereka persekutukan.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ أَتَىٰۤ أَمۡرُ ٱللَّهِ فَلَا تَسۡتَعۡجِلُوهُۚ سُبۡحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا یُشۡرِكُونَ\n"
    }
  },
  {
    "id": 1903,
    "surahId": 16,
    "ayahNumber": 2,
    "arabicText": "یُنَزِّلُ ٱلۡمَلَـٰۤىِٕكَةَ بِٱلرُّوحِ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن یَشَاۤءُ مِنۡ عِبَادِهِۦۤ أَنۡ أَنذِرُوۤا۟ أَنَّهُۥ لَاۤ إِلَـٰهَ إِلَّاۤ أَنَا۠ فَٱتَّقُونِ\n",
    "translations": {
      "en": "He causes the angels to descend with this divine inspiration, [bestowed] at His behest upon whomever He wills of His servants: \"Warn [all human beings] that there is no deity save Me: be, therefore, conscious of Me!\"",
      "ms": "Ia menurunkan malaikat membawa wahyu dengan perintahNya kepada sesiapa yang dikehendakiNya dari hamba-hambaNya (yang layak menjadi Rasul); (lalu Ia berfirman kepada Rasul-rasul): \"Hendaklah kamu menegaskan kepada umat manusia bahawa tiada Tuhan melainkan Aku. Oleh itu, bertaqwalah kamu kepadaku\".",
      "id": "Dia menurunkan para malaikat dengan (membawa) wahyu dengan perintah-Nya kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya, yaitu: \"Peringatkanlah olehmu sekalian, bahwasanya tidak ada Tuhan (yang hak) melainkan Aku, maka hendaklah kamu bertakwa kepada-Ku\".",
      "ar": "یُنَزِّلُ ٱلۡمَلَـٰۤىِٕكَةَ بِٱلرُّوحِ مِنۡ أَمۡرِهِۦ عَلَىٰ مَن یَشَاۤءُ مِنۡ عِبَادِهِۦۤ أَنۡ أَنذِرُوۤا۟ أَنَّهُۥ لَاۤ إِلَـٰهَ إِلَّاۤ أَنَا۠ فَٱتَّقُونِ\n"
    }
  },
  {
    "id": 1904,
    "surahId": 16,
    "ayahNumber": 3,
    "arabicText": "خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ تَعَـٰلَىٰ عَمَّا یُشۡرِكُونَ\n",
    "translations": {
      "en": "He has created the heavens and the earth in accordance with [an inner] truth; sublimely exalted is He above anything to which men may ascribe a share in His divinity!",
      "ms": "Ia menciptakan langit dan bumi dengan cara yang sungguh layak dan berhikmat; Maha Tinggilah Ia dari perbuatan syirik yang mereka lakukan.",
      "id": "Dia menciptakan langit dan bumi dengan hak. Maha Tinggi Allah daripada apa yang mereka persekutukan.",
      "ar": "خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ تَعَـٰلَىٰ عَمَّا یُشۡرِكُونَ\n"
    }
  },
  {
    "id": 1905,
    "surahId": 16,
    "ayahNumber": 4,
    "arabicText": "خَلَقَ ٱلۡإِنسَـٰنَ مِن نُّطۡفَةࣲ فَإِذَا هُوَ خَصِیمࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "He creates man out of a [mere] drop of sperm: and lo! this same being shows himself endowed with the power to think and to argue!",
      "ms": "Ia menciptakan manusia dari air benih, (setelah sempurna kejadiannya), tiba-tiba menjadilah ia seorang pembantah yang terang jelas bantahannya.",
      "id": "Dia telah menciptakan manusia dari mani, tiba-tiba ia menjadi pembantah yang nyata.",
      "ar": "خَلَقَ ٱلۡإِنسَـٰنَ مِن نُّطۡفَةࣲ فَإِذَا هُوَ خَصِیمࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 1906,
    "surahId": 16,
    "ayahNumber": 5,
    "arabicText": "وَٱلۡأَنۡعَـٰمَ خَلَقَهَاۖ لَكُمۡ فِیهَا دِفۡءࣱ وَمَنَـٰفِعُ وَمِنۡهَا تَأۡكُلُونَ\n",
    "translations": {
      "en": "And He creates cattle: you derive warmth from them, and [various other] uses; and from them you obtain food;",
      "ms": "Dan binatang-binatang ternak itu, Ia juga menciptakannya untuk kamu; terdapat padanya benda-benda yang memanaskan tubuh dari sejuk dan beberapa faedah yang lain; dan daripadanya juga kamu makan.",
      "id": "Dan Dia telah menciptakan binatang ternak untuk kamu; padanya ada (bulu) yang menghangatkan dan berbagai-bagai manfaat, dan sebahagiannya kamu makan.",
      "ar": "وَٱلۡأَنۡعَـٰمَ خَلَقَهَاۖ لَكُمۡ فِیهَا دِفۡءࣱ وَمَنَـٰفِعُ وَمِنۡهَا تَأۡكُلُونَ\n"
    }
  },
  {
    "id": 1907,
    "surahId": 16,
    "ayahNumber": 6,
    "arabicText": "وَلَكُمۡ فِیهَا جَمَالٌ حِینَ تُرِیحُونَ وَحِینَ تَسۡرَحُونَ\n",
    "translations": {
      "en": "and you find beauty in them when you drive them home in the evenings and when you take them out to pasture in the mornings.",
      "ms": "Dan bagi kamu pada binatang-binatang ternak itu, keindahan (yang menarik hati) ketika kamu membawanya balik untuk berihat (pada waktu petang), dan ketika kamu membawanya keluar (pada waktu pagi).",
      "id": "Dan kamu memperoleh pandangan yang indah padanya, ketika kamu membawanya kembali ke kandang dan ketika kamu melepaskannya ke tempat penggembalaan.",
      "ar": "وَلَكُمۡ فِیهَا جَمَالٌ حِینَ تُرِیحُونَ وَحِینَ تَسۡرَحُونَ\n"
    }
  },
  {
    "id": 1908,
    "surahId": 16,
    "ayahNumber": 7,
    "arabicText": "وَتَحۡمِلُ أَثۡقَالَكُمۡ إِلَىٰ بَلَدࣲ لَّمۡ تَكُونُوا۟ بَـٰلِغِیهِ إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ إِنَّ رَبَّكُمۡ لَرَءُوفࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "And they carry your loads to [many] a place which [otherwise] you would be unable to reach without great hardship to yourselves. Verily, your Sustainer is most compassionate, a dispenser of grace!",
      "ms": "Dan binatang-binatang itu pula membawa barang-barang kamu ke mana-mana negeri yang kamu tidak dapat sampai kepadanya melainkan dengan menanggung susah payah. Sesungguhnya Tuhan kamu Amat melimpah belas kasihan dan rahmatNya.",
      "id": "Dan ia memikul beban-bebanmu ke suatu negeri yang kamu tidak sanggup sampai kepadanya, melainkan dengan kesukaran-kesukaran (yang memayahkan) diri. Sesungguhnya Tuhanmu benar-benar Maha Pengasih lagi Maha Penyayang,",
      "ar": "وَتَحۡمِلُ أَثۡقَالَكُمۡ إِلَىٰ بَلَدࣲ لَّمۡ تَكُونُوا۟ بَـٰلِغِیهِ إِلَّا بِشِقِّ ٱلۡأَنفُسِۚ إِنَّ رَبَّكُمۡ لَرَءُوفࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 1909,
    "surahId": 16,
    "ayahNumber": 8,
    "arabicText": "وَٱلۡخَیۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِیرَ لِتَرۡكَبُوهَا وَزِینَةࣰۚ وَیَخۡلُقُ مَا لَا تَعۡلَمُونَ\n",
    "translations": {
      "en": "And (it is He who creates] horses and mules and asses for you to ride, as well as for [their] beauty: and He will yet create things of which [today] you have no knowledge.",
      "ms": "Dan (Allah menjadikan) kuda dan baghal serta keldai untuk kamu menunggangnya, dan untuk menjadi perhiasan; dan Ia menjadikan apa yang kamu tidak mengetahuinya.",
      "id": "dan (Dia telah menciptakan) kuda, bagal dan keledai, agar kamu menungganginya dan (menjadikannya) perhiasan. Dan Allah menciptakan apa yang kamu tidak mengetahuinya.",
      "ar": "وَٱلۡخَیۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِیرَ لِتَرۡكَبُوهَا وَزِینَةࣰۚ وَیَخۡلُقُ مَا لَا تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1910,
    "surahId": 16,
    "ayahNumber": 9,
    "arabicText": "وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِیلِ وَمِنۡهَا جَاۤىِٕرࣱۚ وَلَوۡ شَاۤءَ لَهَدَىٰكُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "And [because He is your Creator,] it rests with God alone to show you the right path: yet there is [many a one] who swerves from it. However, had He so willed, He would have guided you all aright.",
      "ms": "Dan kepada Allah jualah tertentunya urusan memberi panduan yang menerangkan jalan yang lurus; dan di antara jalan-jalan yang dituju ada yang terpesong dari kebenaran; dan jika Ia kehendaki, tentulah Ia memberi petunjuk kepada kamu semua (yang menyampaikan ke jalan yang lurus itu).",
      "id": "Dan hak bagi Allah (menerangkan) jalan yang lurus, dan di antara jalan-jalan ada yang bengkok. Dan jikalau Dia menghendaki, tentulah Dia memimpin kamu semuanya (kepada jalan yang benar).",
      "ar": "وَعَلَى ٱللَّهِ قَصۡدُ ٱلسَّبِیلِ وَمِنۡهَا جَاۤىِٕرࣱۚ وَلَوۡ شَاۤءَ لَهَدَىٰكُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 1911,
    "surahId": 16,
    "ayahNumber": 10,
    "arabicText": "هُوَ ٱلَّذِیۤ أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰۖ لَّكُم مِّنۡهُ شَرَابࣱ وَمِنۡهُ شَجَرࣱ فِیهِ تُسِیمُونَ\n",
    "translations": {
      "en": "It is He who sends down water from the skies; you drink thereof, and thereof [drink] the plants upon which you pasture your beasts;",
      "ms": "Dia lah yang menurunkan hujan dari langit; sebahagian daripadanya untuk minuman kamu dan sebahagian lagi menyebabkan tumbuhnya pokok-pokok (tumbuh-tumbuhan) untuk kamu melepaskan binatang-binatang ternak: makan padanya.",
      "id": "Dialah, Yang telah menurunkan air hujan dari langit untuk kamu, sebahagiannya menjadi minuman dan sebahagiannya (menyuburkan) tumbuh-tumbuhan, yang pada (tempat tumbuhnya) kamu menggembalakan ternakmu.",
      "ar": "هُوَ ٱلَّذِیۤ أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰۖ لَّكُم مِّنۡهُ شَرَابࣱ وَمِنۡهُ شَجَرࣱ فِیهِ تُسِیمُونَ\n"
    }
  },
  {
    "id": 1912,
    "surahId": 16,
    "ayahNumber": 11,
    "arabicText": "یُنۢبِتُ لَكُم بِهِ ٱلزَّرۡعَ وَٱلزَّیۡتُونَ وَٱلنَّخِیلَ وَٱلۡأَعۡنَـٰبَ وَمِن كُلِّ ٱلثَّمَرَ ٰ⁠تِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّقَوۡمࣲ یَتَفَكَّرُونَ\n",
    "translations": {
      "en": "[and] by virtue thereof He causes crops to grow for you, and olive trees, and date palms, and grapes, and all [other] kinds of fruit: in this, behold, there is a message indeed for people who think!",
      "ms": "Ia juga menumbuhkan bagi kamu dengan sebab hujan itu tanaman-tanaman dan pokok-pokok zaitun dan tamar (kurma) serta anggur; dan juga dari segala jenis buah-buahan. Sesungguhnya yang demikian mengandungi satu tanda (yang membuktikan kekuasaan Allah) bagi kaum yang mahu berfikir.",
      "id": "Dia menumbuhkan bagi kamu dengan air hujan itu tanam-tanaman; zaitun, korma, anggur dan segala macam buah-buahan. Sesungguhnya pada yang demikian itu benar-benar ada tanda (kekuasaan Allah) bagi kaum yang memikirkan.",
      "ar": "یُنۢبِتُ لَكُم بِهِ ٱلزَّرۡعَ وَٱلزَّیۡتُونَ وَٱلنَّخِیلَ وَٱلۡأَعۡنَـٰبَ وَمِن كُلِّ ٱلثَّمَرَ ٰ⁠تِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّقَوۡمࣲ یَتَفَكَّرُونَ\n"
    }
  },
  {
    "id": 1913,
    "surahId": 16,
    "ayahNumber": 12,
    "arabicText": "وَسَخَّرَ لَكُمُ ٱلَّیۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ وَٱلنُّجُومُ مُسَخَّرَ ٰ⁠تُۢ بِأَمۡرِهِۦۤۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَعۡقِلُونَ\n",
    "translations": {
      "en": "And He has made the night and the day and the sun and the moon subservient [to His laws, so that they be of use] to you; and all the stars are subservient to His command: in this, behold, there are messages indeed for people who use their reason!",
      "ms": "Dan ia memudahkan bagi kamu malam dan siang, dan matahari serta bulan; dan bintang-bintang dimudahkan dengan perintahNya untuk keperluan-keperluan kamu. Sesungguhnya yang demikian itu mengandungi tanda-tanda (yang membuktikan kebijaksanaan Allah) bagi kaum yang mahu memahaminya.",
      "id": "Dan Dia menundukkan malam dan siang, matahari dan bulan untukmu. Dan bintang-bintang itu ditundukkan (untukmu) dengan perintah-Nya. Sesungguhnya pada yang demikian itu benar-benar ada tanda-tanda (kekuasaan Allah) bagi kaum yang memahami(nya),",
      "ar": "وَسَخَّرَ لَكُمُ ٱلَّیۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ وَٱلنُّجُومُ مُسَخَّرَ ٰ⁠تُۢ بِأَمۡرِهِۦۤۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1914,
    "surahId": 16,
    "ayahNumber": 13,
    "arabicText": "وَمَا ذَرَأَ لَكُمۡ فِی ٱلۡأَرۡضِ مُخۡتَلِفًا أَلۡوَ ٰ⁠نُهُۥۤۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّقَوۡمࣲ یَذَّكَّرُونَ\n",
    "translations": {
      "en": "And all the [beauty of] many hues-which He has created for you on earth: in this, behold, there is a message for people who (are willing to] take it to heart!",
      "ms": "Dan apa-apa jua yang dijadikan untuk kamu di bumi yang berlainan jenisnya (dimudahkan juga untuk kegunaan kamu). Sesungguhnya yang demikian itu mengandungi satu tanda (yang membuktikan kemurahan Allah) bagi kaum yang mahu mengingati nikmat Allah itu.",
      "id": "dan Dia (menundukkan pula) apa yang Dia ciptakan untuk kamu di bumi ini dengan berlain-lainan macamnya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda (kekuasaan Allah) bagi kaum yang mengambil pelajaran.",
      "ar": "وَمَا ذَرَأَ لَكُمۡ فِی ٱلۡأَرۡضِ مُخۡتَلِفًا أَلۡوَ ٰ⁠نُهُۥۤۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّقَوۡمࣲ یَذَّكَّرُونَ\n"
    }
  },
  {
    "id": 1915,
    "surahId": 16,
    "ayahNumber": 14,
    "arabicText": "وَهُوَ ٱلَّذِی سَخَّرَ ٱلۡبَحۡرَ لِتَأۡكُلُوا۟ مِنۡهُ لَحۡمࣰا طَرِیࣰّا وَتَسۡتَخۡرِجُوا۟ مِنۡهُ حِلۡیَةࣰ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ مَوَاخِرَ فِیهِ وَلِتَبۡتَغُوا۟ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ\n",
    "translations": {
      "en": "And He it is who has made the sea subservient [to His laws], so that you might eat fresh meat from it, and take from it gems which you may wear. And on that [very sea] one sees ships ploughing through the waves, so that you might [be able to] go forth in quest of some of His bounty, and thus have cause to be grateful [to Him].",
      "ms": "Dan Dia lah yang memudahkan laut, supaya kamu dapat makan daripadanya daging yang lembut hidup-hidup, dan dapat pula mengeluarkan daripadanya benda-benda perhiasan untuk kamu memakainya dan (selain itu) engkau melihat pula kapal-kapal belayar padanya; dan lagi supaya kamu dapat mencari rezeki dari limpah kurniaNya; dan supaya kamu bersyukur.",
      "id": "Dan Dialah, Allah yang menundukkan lautan (untukmu), agar kamu dapat memakan daripadanya daging yang segar (ikan), dan kamu mengeluarkan dari lautan itu perhiasan yang kamu pakai; dan kamu melihat bahtera berlayar padanya, dan supaya kamu mencari (keuntungan) dari karunia-Nya, dan supaya kamu bersyukur.",
      "ar": "وَهُوَ ٱلَّذِی سَخَّرَ ٱلۡبَحۡرَ لِتَأۡكُلُوا۟ مِنۡهُ لَحۡمࣰا طَرِیࣰّا وَتَسۡتَخۡرِجُوا۟ مِنۡهُ حِلۡیَةࣰ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ مَوَاخِرَ فِیهِ وَلِتَبۡتَغُوا۟ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ\n"
    }
  },
  {
    "id": 1916,
    "surahId": 16,
    "ayahNumber": 15,
    "arabicText": "وَأَلۡقَىٰ فِی ٱلۡأَرۡضِ رَوَ ٰ⁠سِیَ أَن تَمِیدَ بِكُمۡ وَأَنۡهَـٰرࣰا وَسُبُلࣰا لَّعَلَّكُمۡ تَهۡتَدُونَ\n",
    "translations": {
      "en": "And he has placed firm mountains on earth, lest it sway with you, and rivers and paths, so that you might find your way,",
      "ms": "Dan Ia mengadakan di bumi gunung-ganang yang menetapnya supaya ia tidak menghayun-hayunkan kamu; dan Ia mengadakan sungai-sungai serta jalan-jalan lalu lalang, supaya kamu dapat sampai ke matlamat yang kamu tuju.",
      "id": "Dan Dia menancapkan gunung-gunung di bumi supaya bumi itu tidak goncang bersama kamu, (dan Dia menciptakan) sungai-sungai dan jalan-jalan agar kamu mendapat petunjuk,",
      "ar": "وَأَلۡقَىٰ فِی ٱلۡأَرۡضِ رَوَ ٰ⁠سِیَ أَن تَمِیدَ بِكُمۡ وَأَنۡهَـٰرࣰا وَسُبُلࣰا لَّعَلَّكُمۡ تَهۡتَدُونَ\n"
    }
  },
  {
    "id": 1917,
    "surahId": 16,
    "ayahNumber": 16,
    "arabicText": "وَعَلَـٰمَـٰتࣲۚ وَبِٱلنَّجۡمِ هُمۡ یَهۡتَدُونَ\n",
    "translations": {
      "en": "as well as [various other] means of orientation: for [it is] by the stars that men find their way.",
      "ms": "Dan (Ia mengadakan) tanda-tanda panduan jalan, dan dengan bintang-bintang (pada waktu malam) mereka dapat mengetahui arah yang hendak dituju.",
      "id": "dan (Dia ciptakan) tanda-tanda (penunjuk jalan). Dan dengan bintang-bintang itulah mereka mendapat petunjuk.",
      "ar": "وَعَلَـٰمَـٰتࣲۚ وَبِٱلنَّجۡمِ هُمۡ یَهۡتَدُونَ\n"
    }
  },
  {
    "id": 1918,
    "surahId": 16,
    "ayahNumber": 17,
    "arabicText": "أَفَمَن یَخۡلُقُ كَمَن لَّا یَخۡلُقُۚ أَفَلَا تَذَكَّرُونَ\n",
    "translations": {
      "en": "IS, THEN, HE who creates comparable to any [being] that cannot create? Will you not, then, bethink yourselves?",
      "ms": "Kalau sudah demikian, adakah Allah yang menciptakan semuanya itu sama seperti makhluk-makhluk yang tidak menciptakan sesuatu? Maka patutkah kamu lalai sehingga kamu tidak mahu beringat serta memikirkannya?",
      "id": "Maka apakah (Allah) yang menciptakan itu sama dengan yang tidak dapat menciptakan (apa-apa)?. Maka mengapa kamu tidak mengambil pelajaran.",
      "ar": "أَفَمَن یَخۡلُقُ كَمَن لَّا یَخۡلُقُۚ أَفَلَا تَذَكَّرُونَ\n"
    }
  },
  {
    "id": 1919,
    "surahId": 16,
    "ayahNumber": 18,
    "arabicText": "وَإِن تَعُدُّوا۟ نِعۡمَةَ ٱللَّهِ لَا تُحۡصُوهَاۤۗ إِنَّ ٱللَّهَ لَغَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "For, should you try to count God's blessings, you could never compute them! Behold, God is indeed much-forgiving, a dispenser of grace;",
      "ms": "Dan jika kamu menghitung nikmat Allah (yang dilimpahkannya kepada kamu), tiadalah kamu akan dapat menghitungnya satu persatu; sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Dan jika kamu menghitung-hitung nikmat Allah, niscaya kamu tak dapat menentukan jumlahnya. Sesungguhnya Allah benar-benar Maha Pengampun lagi Maha Penyayang.",
      "ar": "وَإِن تَعُدُّوا۟ نِعۡمَةَ ٱللَّهِ لَا تُحۡصُوهَاۤۗ إِنَّ ٱللَّهَ لَغَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 1920,
    "surahId": 16,
    "ayahNumber": 19,
    "arabicText": "وَٱللَّهُ یَعۡلَمُ مَا تُسِرُّونَ وَمَا تُعۡلِنُونَ\n",
    "translations": {
      "en": "and God knows all that you keep secret as well as all that you bring into the open.",
      "ms": "Dan Allah mengetahui apa yang kamu sembunyikan dan apa yang kamu zahirkan.",
      "id": "Dan Allah mengetahui apa yang kamu rahasiakan dan apa yang kamu lahirkan.",
      "ar": "وَٱللَّهُ یَعۡلَمُ مَا تُسِرُّونَ وَمَا تُعۡلِنُونَ\n"
    }
  },
  {
    "id": 1921,
    "surahId": 16,
    "ayahNumber": 20,
    "arabicText": "وَٱلَّذِینَ یَدۡعُونَ مِن دُونِ ٱللَّهِ لَا یَخۡلُقُونَ شَیۡـࣰٔا وَهُمۡ یُخۡلَقُونَ\n",
    "translations": {
      "en": "Now those beings that some people invoke beside God cannot create anything, since they themselves are but created:",
      "ms": "Dan makhluk-makhluk yang mereka sembah selain dari Allah itu tidak dapat menciptakan sesuatupun, bahkah merekalah yang diciptakan.",
      "id": "Dan berhala-berhala yang mereka seru selain Allah, tidak dapat membuat sesuatu apapun, sedang berhala-berhala itu (sendiri) dibuat orang.",
      "ar": "وَٱلَّذِینَ یَدۡعُونَ مِن دُونِ ٱللَّهِ لَا یَخۡلُقُونَ شَیۡـࣰٔا وَهُمۡ یُخۡلَقُونَ\n"
    }
  },
  {
    "id": 1922,
    "surahId": 16,
    "ayahNumber": 21,
    "arabicText": "أَمۡوَ ٰ⁠تٌ غَیۡرُ أَحۡیَاۤءࣲۖ وَمَا یَشۡعُرُونَ أَیَّانَ یُبۡعَثُونَ\n",
    "translations": {
      "en": "they are dead, not living, and they do not [even] know when they will be raised from the dead!",
      "ms": "Makhluk-makhluk itu tetap akan mati, bukanlah kekal hidup; dan mereka tidak mengetahui bilakah masing-masing akan dibangkitkan (menerima balasan).",
      "id": "(Berhala-berhala itu) benda mati tidak hidup, dan berhala-berhala tidak mengetahui bilakah penyembah-penyembahnya akan dibangkitkan.",
      "ar": "أَمۡوَ ٰ⁠تٌ غَیۡرُ أَحۡیَاۤءࣲۖ وَمَا یَشۡعُرُونَ أَیَّانَ یُبۡعَثُونَ\n"
    }
  },
  {
    "id": 1923,
    "surahId": 16,
    "ayahNumber": 22,
    "arabicText": "إِلَـٰهُكُمۡ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۚ فَٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ قُلُوبُهُم مُّنكِرَةࣱ وَهُم مُّسۡتَكۡبِرُونَ\n",
    "translations": {
      "en": "Your God is the One God: but because of their false pride, the hearts of those who do not believe in the life to come refuse to admit this [truth].",
      "ms": "Tuhan kamu (yang berhak disembah) ialah Tuhan yang satu (Maha Esa); oleh itu, orang-orang yang tidak beriman kepada hari akhirat: hati mereka ingkar dan sikap zahir mereka sombong takbur (menentang kebenaran).",
      "id": "Tuhan kamu adalah Tuhan Yang Maha Esa. Maka orang-orang yang tidak beriman kepada akhirat, hati mereka mengingkari (keesaaan Allah), sedangkan mereka sendiri adalah orang-orang yang sombong.",
      "ar": "إِلَـٰهُكُمۡ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۚ فَٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ قُلُوبُهُم مُّنكِرَةࣱ وَهُم مُّسۡتَكۡبِرُونَ\n"
    }
  },
  {
    "id": 1924,
    "surahId": 16,
    "ayahNumber": 23,
    "arabicText": "لَا جَرَمَ أَنَّ ٱللَّهَ یَعۡلَمُ مَا یُسِرُّونَ وَمَا یُعۡلِنُونَۚ إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡتَكۡبِرِینَ\n",
    "translations": {
      "en": "Truly, God knows all that they keep secret as well as all that they bring into the open -[and,] behold, He does not love those who are given to arrogance,",
      "ms": "Sebenarnya, bahawa Allah mengetahui akan apa yang mereka sembunyikan dan apa yang mereka zahirkan; sesungguhnya Ia tidak suka kepada orang-orang yang sombong takbur.",
      "id": "Tidak diragukan lagi bahwa sesungguhnya Allah mengetahui apa yang mereka rahasiakan dan apa yang mereka lahirkan. Sesungguhnya Allah tidak menyukai orang-orang yang sombong.",
      "ar": "لَا جَرَمَ أَنَّ ٱللَّهَ یَعۡلَمُ مَا یُسِرُّونَ وَمَا یُعۡلِنُونَۚ إِنَّهُۥ لَا یُحِبُّ ٱلۡمُسۡتَكۡبِرِینَ\n"
    }
  },
  {
    "id": 1925,
    "surahId": 16,
    "ayahNumber": 24,
    "arabicText": "وَإِذَا قِیلَ لَهُم مَّاذَاۤ أَنزَلَ رَبُّكُمۡ قَالُوۤا۟ أَسَـٰطِیرُ ٱلۡأَوَّلِینَ\n",
    "translations": {
      "en": "and [who], whenever they are asked, \"What is it that your Sustainer has bestowed from on high?\"-are wont to answer, \"Fables of ancient times!\"",
      "ms": "Dan apabila dikatakan kepada mereka: \"Apakah yang diturunkan oleh Tuhan kamu (kepada nabi Muhammad)?\" Mereka menjawab: \"Cerita-cerita dongeng orang-orang dahulu kala\".",
      "id": "Dan apabila dikatakan kepada mereka \"Apakah yang telah diturunkan Tuhanmu?\" Mereka menjawab: \"Dongeng-dongengan orang-orang dahulu\",",
      "ar": "وَإِذَا قِیلَ لَهُم مَّاذَاۤ أَنزَلَ رَبُّكُمۡ قَالُوۤا۟ أَسَـٰطِیرُ ٱلۡأَوَّلِینَ\n"
    }
  },
  {
    "id": 1926,
    "surahId": 16,
    "ayahNumber": 25,
    "arabicText": "لِیَحۡمِلُوۤا۟ أَوۡزَارَهُمۡ كَامِلَةࣰ یَوۡمَ ٱلۡقِیَـٰمَةِ وَمِنۡ أَوۡزَارِ ٱلَّذِینَ یُضِلُّونَهُم بِغَیۡرِ عِلۡمٍۗ أَلَا سَاۤءَ مَا یَزِرُونَ\n",
    "translations": {
      "en": "Hence, on Resurrection Day they shall bear the full weight of their own burdens, as well as some of the burdens of those ignorant ones whom they have led astray: oh, how evil the load with which they shall be burdened!",
      "ms": "(Mereka dibiarkan menuduh dengan yang demikian) supaya mereka memikul dosa-dosa mereka dengan sepenuhnya pada hari kiamat, dan juga memikul sebahagian dari dosa orang-orang yang mereka sesatkan dengan tidak berdasarkan pengetahuan yang benar; sesungguhnya amatlah buruknya dosa-dosa yang mereka lakukan itu.",
      "id": "(ucapan mereka) menyebabkan mereka memikul dosa-dosanya dengan sepenuh-penuhnya pada hari kiamat, dan sebahagian dosa-dosa orang yang mereka sesatkan yang tidak mengetahui sedikitpun (bahwa mereka disesatkan). Ingatlah, amat buruklah dosa yang mereka pikul itu.",
      "ar": "لِیَحۡمِلُوۤا۟ أَوۡزَارَهُمۡ كَامِلَةࣰ یَوۡمَ ٱلۡقِیَـٰمَةِ وَمِنۡ أَوۡزَارِ ٱلَّذِینَ یُضِلُّونَهُم بِغَیۡرِ عِلۡمٍۗ أَلَا سَاۤءَ مَا یَزِرُونَ\n"
    }
  },
  {
    "id": 1927,
    "surahId": 16,
    "ayahNumber": 26,
    "arabicText": "قَدۡ مَكَرَ ٱلَّذِینَ مِن قَبۡلِهِمۡ فَأَتَى ٱللَّهُ بُنۡیَـٰنَهُم مِّنَ ٱلۡقَوَاعِدِ فَخَرَّ عَلَیۡهِمُ ٱلسَّقۡفُ مِن فَوۡقِهِمۡ وَأَتَىٰهُمُ ٱلۡعَذَابُ مِنۡ حَیۡثُ لَا یَشۡعُرُونَ\n",
    "translations": {
      "en": "Those who lived before them did, too, devise many a blasphemy -whereupon God visited with destruction all that they had ever built, [striking] at its very foundations, so that the roof fell in upon them from above and suffering befell them without their having perceived whence it came.",
      "ms": "Sebenarnya orang-orang yang terdahulu dari mereka telah menjalankan rancangan jahat (terhadap ugama Allah dan Rasul-rasulNya); maka Allah binasakan bangunan (rancangan jahat) mereka dari asas-asasnya, lalu bumbung (bangunan itu) jatuh menimpa ke atas mereka, dan mereka pula didatangi azab kebinasaan dari arah yang mereka tidak menyedarinya.",
      "id": "Sesungguhnya orang-orang yang sebelum mereka telah mengadakan makar, maka Allah menghancurkan rumah-rumah mereka dari fondasinya, lalu atap (rumah itu) jatuh menimpa mereka dari atas, dan datanglah azab itu kepada mereka dari tempat yang tidak mereka sadari.",
      "ar": "قَدۡ مَكَرَ ٱلَّذِینَ مِن قَبۡلِهِمۡ فَأَتَى ٱللَّهُ بُنۡیَـٰنَهُم مِّنَ ٱلۡقَوَاعِدِ فَخَرَّ عَلَیۡهِمُ ٱلسَّقۡفُ مِن فَوۡقِهِمۡ وَأَتَىٰهُمُ ٱلۡعَذَابُ مِنۡ حَیۡثُ لَا یَشۡعُرُونَ\n"
    }
  },
  {
    "id": 1928,
    "surahId": 16,
    "ayahNumber": 27,
    "arabicText": "ثُمَّ یَوۡمَ ٱلۡقِیَـٰمَةِ یُخۡزِیهِمۡ وَیَقُولُ أَیۡنَ شُرَكَاۤءِیَ ٱلَّذِینَ كُنتُمۡ تُشَـٰۤقُّونَ فِیهِمۡۚ قَالَ ٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ إِنَّ ٱلۡخِزۡیَ ٱلۡیَوۡمَ وَٱلسُّوۤءَ عَلَى ٱلۡكَـٰفِرِینَ\n",
    "translations": {
      "en": "And then, on Resurrection Day, He will cover them [all] with ignominy, and will say: \"Where, now, are those beings to whom you ascribed a share in My divinity, [and] for whose sake you cut yourselves off [from My guidance]?\" [Whereupon] those who [in their lifetime] were endowed with knowledge will say: \"Verily, ignominy and misery [have fallen] this day upon those who have been denying the truth-",
      "ms": "Kemudian pada hari kiamat, Allah menghinakan mereka (dengan azab seksa) sambil bertanya: \"Mana dia sekutu-sekutuKu yang kamu berperi-peri memusuhi (Nabi-nabi dan orang-orang yang beriman) untuk membela mereka?\" (Pada ketika itu) berkatalah orang-orang yang beroleh ilmu pengetahuan: \"Sesungguhnya kehinaan hari ini dan azab seksa, adalah tertimpa kepada orang-orang yang kafir;",
      "id": "Kemudian Allah menghinakan mereka di hari kiamat, dan berfirman: \"Di manakah sekutu-sekutu-Ku itu (yang karena membelanya) kamu selalu memusuhi mereka (nabi-nabi dan orang-orang mukmin)?\" Berkatalah orang-orang yang telah diberi ilmu: \"Sesungguhnya kehinaan dan azab hari ini ditimpakan atas orang-orang yang kafir\",",
      "ar": "ثُمَّ یَوۡمَ ٱلۡقِیَـٰمَةِ یُخۡزِیهِمۡ وَیَقُولُ أَیۡنَ شُرَكَاۤءِیَ ٱلَّذِینَ كُنتُمۡ تُشَـٰۤقُّونَ فِیهِمۡۚ قَالَ ٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ إِنَّ ٱلۡخِزۡیَ ٱلۡیَوۡمَ وَٱلسُّوۤءَ عَلَى ٱلۡكَـٰفِرِینَ\n"
    }
  },
  {
    "id": 1929,
    "surahId": 16,
    "ayahNumber": 28,
    "arabicText": "ٱلَّذِینَ تَتَوَفَّىٰهُمُ ٱلۡمَلَـٰۤىِٕكَةُ ظَالِمِیۤ أَنفُسِهِمۡۖ فَأَلۡقَوُا۟ ٱلسَّلَمَ مَا كُنَّا نَعۡمَلُ مِن سُوۤءِۭۚ بَلَىٰۤۚ إِنَّ ٱللَّهَ عَلِیمُۢ بِمَا كُنتُمۡ تَعۡمَلُونَ\n",
    "translations": {
      "en": "those whom the angels have gathered in death while they were still sinning against themselves!\" Then will they [who are thus arraigned] proffer their submission, [saying:] \"We did not [mean to] do any evil! [But they will be answered:] \"Yea, verily, God has full knowledge of all that you were doing!",
      "ms": "(Iaitu) mereka yang diambil nyawanya oleh malaikat dalam keadaan mereka menganiaya diri sendiri (dengan kekufurannya).\" Lalu mereka tunduk menyerah (ketika melihat azab sambil berkata): \"Kami tiada melakukan sesuatu kejahatan\". (Malaikat menjawab): \"Bahkan (kamu ada melakukannya); sesungguhnya Allah Maha Mengetahui akan apa yang kamu telah kerjakan\".",
      "id": "(yaitu) orang-orang yang dimatikan oleh para malaikat dalam keadaan berbuat zalim kepada diri mereka sendiri, lalu mereka menyerah diri (sambil berkata); \"Kami sekali-kali tidak ada mengerjakan sesuatu kejahatanpun\". (Malaikat menjawab): \"Ada, sesungguhnya Allah Maha Mengetahui apa yang telah kamu kerjakan\".",
      "ar": "ٱلَّذِینَ تَتَوَفَّىٰهُمُ ٱلۡمَلَـٰۤىِٕكَةُ ظَالِمِیۤ أَنفُسِهِمۡۖ فَأَلۡقَوُا۟ ٱلسَّلَمَ مَا كُنَّا نَعۡمَلُ مِن سُوۤءِۭۚ بَلَىٰۤۚ إِنَّ ٱللَّهَ عَلِیمُۢ بِمَا كُنتُمۡ تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1930,
    "surahId": 16,
    "ayahNumber": 29,
    "arabicText": "فَٱدۡخُلُوۤا۟ أَبۡوَ ٰ⁠بَ جَهَنَّمَ خَـٰلِدِینَ فِیهَاۖ فَلَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِینَ\n",
    "translations": {
      "en": "Hence, enter the gates of hell, therein to abide!\" And evil, indeed, shall be the state of all who are given to false pride!",
      "ms": "\"Oleh itu, masukilah pintu-pintu neraka, tinggal kekalah kamu di dalamnya; maka sesungguhnya (neraka itu) seburuk-buruk tempat bagi orang-orang yang sombong takbur\".",
      "id": "Maka masukilah pintu-pintu neraka Jahannam, kamu kekal di dalamnya. Maka amat buruklah tempat orang-orang yang menyombongkan diri itu.",
      "ar": "فَٱدۡخُلُوۤا۟ أَبۡوَ ٰ⁠بَ جَهَنَّمَ خَـٰلِدِینَ فِیهَاۖ فَلَبِئۡسَ مَثۡوَى ٱلۡمُتَكَبِّرِینَ\n"
    }
  },
  {
    "id": 1931,
    "surahId": 16,
    "ayahNumber": 30,
    "arabicText": "۞ وَقِیلَ لِلَّذِینَ ٱتَّقَوۡا۟ مَاذَاۤ أَنزَلَ رَبُّكُمۡۚ قَالُوا۟ خَیۡرࣰاۗ لِّلَّذِینَ أَحۡسَنُوا۟ فِی هَـٰذِهِ ٱلدُّنۡیَا حَسَنَةࣱۚ وَلَدَارُ ٱلۡـَٔاخِرَةِ خَیۡرࣱۚ وَلَنِعۡمَ دَارُ ٱلۡمُتَّقِینَ\n",
    "translations": {
      "en": "But [when] those who are conscious of God are asked, \"What is it that your Sustainer has bestowed from on high?\" -they answer, \"Goodness supreme!\" Good fortune awaits, in this world, all who persevere in doing good; but their ultimate state will be far better still: for, how excellent indeed will be the state of the God-conscious [in the life to come]!",
      "ms": "Dan ditanya pula kepada orang-orang yang bertaqwa: \"Apakah yang telah diturunkan oleh tuhan yang telah diturunkan oleh Tuhan kamu?\" Mereka menjawab: \"Kebaikan\" orang-orang yang berbuat kebaikan di dunia ini beroleh balasan yang baik, dan sesungguhnya balasan negeri akhirat itu lebih baik lagi; dan memanglah negeri akhirat ialah sebaik-baik negeri bagi orang-orang yang bertaqwa.",
      "id": "Dan dikatakan kepada orang-orang yang bertakwa: \"Apakah yang telah diturunkan oleh Tuhanmu?\" Mereka menjawab: \"(Allah telah menurunkan) kebaikan\". Orang-orang yang berbuat baik di dunia ini mendapat (pembalasan) yang baik. Dan sesungguhnya kampung akhirat adalah lebih baik dan itulah sebaik-baik tempat bagi orang yang bertakwa,",
      "ar": "۞ وَقِیلَ لِلَّذِینَ ٱتَّقَوۡا۟ مَاذَاۤ أَنزَلَ رَبُّكُمۡۚ قَالُوا۟ خَیۡرࣰاۗ لِّلَّذِینَ أَحۡسَنُوا۟ فِی هَـٰذِهِ ٱلدُّنۡیَا حَسَنَةࣱۚ وَلَدَارُ ٱلۡـَٔاخِرَةِ خَیۡرࣱۚ وَلَنِعۡمَ دَارُ ٱلۡمُتَّقِینَ\n"
    }
  },
  {
    "id": 1932,
    "surahId": 16,
    "ayahNumber": 31,
    "arabicText": "جَنَّـٰتُ عَدۡنࣲ یَدۡخُلُونَهَا تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ لَهُمۡ فِیهَا مَا یَشَاۤءُونَۚ كَذَ ٰ⁠لِكَ یَجۡزِی ٱللَّهُ ٱلۡمُتَّقِینَ\n",
    "translations": {
      "en": "Gardens of perpetual bliss will they enter - [gardens] through which running waters flow - having therein all that they might desire. Thus will God reward those who are conscious of Him-",
      "ms": "(Untuk mereka) Syurga-syurga \" Adn \", yang mereka akan memasukinya, yang mengalir padanya beberapa sungai; mereka beroleh di dalam Syurga itu apa yang mereka kehendaki; demikianlah Allah membalas orang-orang yang bertaqwa,",
      "id": "(yaitu) surga 'Adn yang mereka masuk ke dalamnya, mengalir di bawahnya sungai-sungai, di dalam surga itu mereka mendapat segala apa yang mereka kehendaki. Demikianlah Allah memberi balasan kepada orang-orang yang bertakwa,",
      "ar": "جَنَّـٰتُ عَدۡنࣲ یَدۡخُلُونَهَا تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ لَهُمۡ فِیهَا مَا یَشَاۤءُونَۚ كَذَ ٰ⁠لِكَ یَجۡزِی ٱللَّهُ ٱلۡمُتَّقِینَ\n"
    }
  },
  {
    "id": 1933,
    "surahId": 16,
    "ayahNumber": 32,
    "arabicText": "ٱلَّذِینَ تَتَوَفَّىٰهُمُ ٱلۡمَلَـٰۤىِٕكَةُ طَیِّبِینَ یَقُولُونَ سَلَـٰمٌ عَلَیۡكُمُ ٱدۡخُلُوا۟ ٱلۡجَنَّةَ بِمَا كُنتُمۡ تَعۡمَلُونَ\n",
    "translations": {
      "en": "those whom the angels gather in death while they are in a state of inner purity, greeting them thus: \"Peace be upon you! Enter paradise by virtue of what you were doing [in life]!\"",
      "ms": "(Iaitu) mereka yang diambil nyawanya oleh malaikat dalam keadaan mereka bersih suci (dari kufur syirik dan maksiat), sambil malaikat itu berkata kepada mereka: \"Selamat sejahtera kepada kamu; masuklah ke dalam Syurga disebabkan amal baik yang telah kamu kerjakan\".",
      "id": "(yaitu) orang-orang yang diwafatkan dalam keadaan baik oleh para malaikat dengan mengatakan (kepada mereka): \"Salaamun'alaikum, masuklah kamu ke dalam surga itu disebabkan apa yang telah kamu kerjakan\".",
      "ar": "ٱلَّذِینَ تَتَوَفَّىٰهُمُ ٱلۡمَلَـٰۤىِٕكَةُ طَیِّبِینَ یَقُولُونَ سَلَـٰمٌ عَلَیۡكُمُ ٱدۡخُلُوا۟ ٱلۡجَنَّةَ بِمَا كُنتُمۡ تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1934,
    "surahId": 16,
    "ayahNumber": 33,
    "arabicText": "هَلۡ یَنظُرُونَ إِلَّاۤ أَن تَأۡتِیَهُمُ ٱلۡمَلَـٰۤىِٕكَةُ أَوۡ یَأۡتِیَ أَمۡرُ رَبِّكَۚ كَذَ ٰ⁠لِكَ فَعَلَ ٱلَّذِینَ مِن قَبۡلِهِمۡۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَـٰكِن كَانُوۤا۟ أَنفُسَهُمۡ یَظۡلِمُونَ\n",
    "translations": {
      "en": "ARE THEY [who deny the truth] but waiting for the angels to appear unto them, or for God's judgment to become manifest? Even thus did behave those [stubborn sinners] who lived before their time; and [when they were destroyed,] it was not God who wronged them, but it was they who had wronged themselves:",
      "ms": "(Apakah yang ditunggu-tunggu oleh mereka yang tidak beriman itu?) Mereka tidak menunggu melainkan kedatangan malaikat (yang akan mencabut nyawa mereka), atau kedatangan azab Tuhanmu (yang akan membinasakan mereka). Demikianlah juga yang dilakukan oleh orang-orang kafir yang terdahulu daripada mereka (lalu dibinasakan); dan (sebenarnya) Allah tidak menganiaya mereka, tetapi merekalah yang menganiaya diri sendiri.",
      "id": "Tidak ada yang ditunggu-tunggu orang kafir selain dari datangnya para malaikat kepada mereka atau datangnya perintah Tuhanmu. Demikianlah yang telah diperbuat oleh orang-orang (kafir) sebelum mereka. Dan Allah tidak menganiaya mereka, akan tetapi merekalah yang selalu menganiaya diri mereka sendiri,",
      "ar": "هَلۡ یَنظُرُونَ إِلَّاۤ أَن تَأۡتِیَهُمُ ٱلۡمَلَـٰۤىِٕكَةُ أَوۡ یَأۡتِیَ أَمۡرُ رَبِّكَۚ كَذَ ٰ⁠لِكَ فَعَلَ ٱلَّذِینَ مِن قَبۡلِهِمۡۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَـٰكِن كَانُوۤا۟ أَنفُسَهُمۡ یَظۡلِمُونَ\n"
    }
  },
  {
    "id": 1935,
    "surahId": 16,
    "ayahNumber": 34,
    "arabicText": "فَأَصَابَهُمۡ سَیِّـَٔاتُ مَا عَمِلُوا۟ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n",
    "translations": {
      "en": "for all the evil that they had done fell [back] upon them, and they were overwhelmed by the very thing which they had been wont to deride.",
      "ms": "Oleh itu, mereka ditimpa azab sebagai balasan perbuatan jahat yang mereka lakukan; dan azab Allah itu meliputi mereka sebagai balasan bagi apa yang mereka telah ejek-ejek dahulu.",
      "id": "Maka mereka ditimpa oleh (akibat) kejahatan perbuatan mereka dan mereka diliputi oleh azab yang selalu mereka perolok-olokan.",
      "ar": "فَأَصَابَهُمۡ سَیِّـَٔاتُ مَا عَمِلُوا۟ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n"
    }
  },
  {
    "id": 1936,
    "surahId": 16,
    "ayahNumber": 35,
    "arabicText": "وَقَالَ ٱلَّذِینَ أَشۡرَكُوا۟ لَوۡ شَاۤءَ ٱللَّهُ مَا عَبَدۡنَا مِن دُونِهِۦ مِن شَیۡءࣲ نَّحۡنُ وَلَاۤ ءَابَاۤؤُنَا وَلَا حَرَّمۡنَا مِن دُونِهِۦ مِن شَیۡءࣲۚ كَذَ ٰ⁠لِكَ فَعَلَ ٱلَّذِینَ مِن قَبۡلِهِمۡۚ فَهَلۡ عَلَى ٱلرُّسُلِ إِلَّا ٱلۡبَلَـٰغُ ٱلۡمُبِینُ\n",
    "translations": {
      "en": "Now they who ascribe divinity to aught beside God say, \"Had God so willed, we would not have worshipped aught but Him - neither we nor our forefathers; nor would we have declared aught as forbidden without a commandment from Him.\" Even thus did speak those [sinners] who lived before their time; but, then, are the apostles bound to do more than clearly deliver the message [entrusted to them]?",
      "ms": "Dan berkatalah orang-orang kafir musyrik: \"Kalaulah Allah menghendaki, tentulah kami tidak menyembah selain daripadanya sesuatupun, - (tidak) kami dan tidak juga datuk nenek kami; - dan tentulah kami tidak mengharamkan sesuatu pun dengan ketiadaan perintahnya\". Demikianlah juga yang telah dilakukan oleh orang-orang yang terdahulu daripada mereka. (Apa yang mereka katakan itu adalah salah semata-mata) kerana bukankah Rasul-rasul semuanya tidak bertanggungjawab selain daripada menyampaikan (kehendak dan hukum Allah) dengan cara yang jelas nyata?",
      "id": "Dan berkatalah orang-orang musyrik: \"Jika Allah menghendaki, niscaya kami tidak akan menyembah sesuatu apapun selain Dia, baik kami maupun bapak-bapak kami, dan tidak pula kami mengharamkan sesuatupun tanpa (izin)-Nya\". Demikianlah yang diperbuat orang-orang sebelum mereka; maka tidak ada kewajiban atas para rasul, selain dari menyampaikan (amanat Allah) dengan terang.",
      "ar": "وَقَالَ ٱلَّذِینَ أَشۡرَكُوا۟ لَوۡ شَاۤءَ ٱللَّهُ مَا عَبَدۡنَا مِن دُونِهِۦ مِن شَیۡءࣲ نَّحۡنُ وَلَاۤ ءَابَاۤؤُنَا وَلَا حَرَّمۡنَا مِن دُونِهِۦ مِن شَیۡءࣲۚ كَذَ ٰ⁠لِكَ فَعَلَ ٱلَّذِینَ مِن قَبۡلِهِمۡۚ فَهَلۡ عَلَى ٱلرُّسُلِ إِلَّا ٱلۡبَلَـٰغُ ٱلۡمُبِینُ\n"
    }
  },
  {
    "id": 1937,
    "surahId": 16,
    "ayahNumber": 36,
    "arabicText": "وَلَقَدۡ بَعَثۡنَا فِی كُلِّ أُمَّةࣲ رَّسُولًا أَنِ ٱعۡبُدُوا۟ ٱللَّهَ وَٱجۡتَنِبُوا۟ ٱلطَّـٰغُوتَۖ فَمِنۡهُم مَّنۡ هَدَى ٱللَّهُ وَمِنۡهُم مَّنۡ حَقَّتۡ عَلَیۡهِ ٱلضَّلَـٰلَةُۚ فَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَٱنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلۡمُكَذِّبِینَ\n",
    "translations": {
      "en": "And indeed, within every community have We raised up an apostle [entrusted with this message]: \"Worship God, and shun the powers of evil!\" And among those [past generations] were people whom God graced with His guidance, just as there was among them [many a one] who inevitably fell prey to grievous error: go, then, about the earth and behold what happened in the end to those who gave the lie to the truth!",
      "ms": "Dan sesungguhnya Kami telah mengutus dalam kalangan tiap-tiap umat seorang Rasul (dengan memerintahkannya menyeru mereka): \"Hendaklah kamu menyembah Allah dan jauhilah Taghut\". Maka di antara mereka (yang menerima seruan Rasul itu), ada yang diberi hidayah petunjuk oIeh Allah dan ada pula yang berhak ditimpa kesesatan. Oleh itu mengembaralah kamu di bumi, kemudian lihatlah bagaimana buruknya kesudahan umat-umat yang mendustakan Rasul-rasulnya.",
      "id": "Dan sungguhnya Kami telah mengutus rasul pada tiap-tiap umat (untuk menyerukan): \"Sembahlah Allah (saja), dan jauhilah Thaghut itu\", maka di antara umat itu ada orang-orang yang diberi petunjuk oleh Allah dan ada pula di antaranya orang-orang yang telah pasti kesesatan baginya. Maka berjalanlah kamu dimuka bumi dan perhatikanlah bagaimana kesudahan orang-orang yang mendustakan (rasul-rasul).",
      "ar": "وَلَقَدۡ بَعَثۡنَا فِی كُلِّ أُمَّةࣲ رَّسُولًا أَنِ ٱعۡبُدُوا۟ ٱللَّهَ وَٱجۡتَنِبُوا۟ ٱلطَّـٰغُوتَۖ فَمِنۡهُم مَّنۡ هَدَى ٱللَّهُ وَمِنۡهُم مَّنۡ حَقَّتۡ عَلَیۡهِ ٱلضَّلَـٰلَةُۚ فَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَٱنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلۡمُكَذِّبِینَ\n"
    }
  },
  {
    "id": 1938,
    "surahId": 16,
    "ayahNumber": 37,
    "arabicText": "إِن تَحۡرِصۡ عَلَىٰ هُدَىٰهُمۡ فَإِنَّ ٱللَّهَ لَا یَهۡدِی مَن یُضِلُّۖ وَمَا لَهُم مِّن نَّـٰصِرِینَ\n",
    "translations": {
      "en": "[As for those who are bent on denying the truth-] though thou be ever so eager to show them the right way, [know that,] verily, God does not bestow His guidance upon any whom He judges to have gone astray; and such shall have none to succour them [on Resurrection Day].",
      "ms": "Jika engkau (wahai Muhammad) terlalu tamak (inginkan mereka beroleh hidayah petunjuk, maka sesungguhnya Allah tidak memberi hidayah petunjuk kepada orang-orang yang berhak disesatkanNya; dan tiadalah bagi mereka sesiapapun yang dapat memberikan pertolongan.",
      "id": "Jika kamu sangat mengharapkan agar mereka dapat petunjuk, maka sesungguhnya Allah tiada memberi petunjuk kepada orang yang disesatkan-Nya, dan sekali-kali mereka tiada mempunyai penolong.",
      "ar": "إِن تَحۡرِصۡ عَلَىٰ هُدَىٰهُمۡ فَإِنَّ ٱللَّهَ لَا یَهۡدِی مَن یُضِلُّۖ وَمَا لَهُم مِّن نَّـٰصِرِینَ\n"
    }
  },
  {
    "id": 1939,
    "surahId": 16,
    "ayahNumber": 38,
    "arabicText": "وَأَقۡسَمُوا۟ بِٱللَّهِ جَهۡدَ أَیۡمَـٰنِهِمۡ لَا یَبۡعَثُ ٱللَّهُ مَن یَمُوتُۚ بَلَىٰ وَعۡدًا عَلَیۡهِ حَقࣰّا وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "As it is, they swear by God with their most solemn oaths, \"Never will God raise from the dead anyone who has died!\" Yea indeed! [This very thing has God promised] by a promise which He has willed upon Himself; but most people know it not.",
      "ms": "Dan mereka bersumpah dengan nama Allah dengan bersungguh-sungguh (sambil berkata): \"Allah tidak akan membangkitkan semula orang-orang yang telah mati\". (Itu tidak benar), bahkan janji Allah membangkitkan orang-orang yang telah mati) tetap benar; tetapi kebanyakan manusia tidak mengetahui.",
      "id": "Mereka bersumpah dengan nama Allah dengan sumpahnya yang sungguh-sungguh: \"Allah tidak akan akan membangkitkan orang yang mati\". (Tidak demikian), bahkan (pasti Allah akan membangkitnya), sebagai suatu janji yang benar dari Allah, akan tetapi kebanyakan manusia tiada mengetahui,",
      "ar": "وَأَقۡسَمُوا۟ بِٱللَّهِ جَهۡدَ أَیۡمَـٰنِهِمۡ لَا یَبۡعَثُ ٱللَّهُ مَن یَمُوتُۚ بَلَىٰ وَعۡدًا عَلَیۡهِ حَقࣰّا وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1940,
    "surahId": 16,
    "ayahNumber": 39,
    "arabicText": "لِیُبَیِّنَ لَهُمُ ٱلَّذِی یَخۡتَلِفُونَ فِیهِ وَلِیَعۡلَمَ ٱلَّذِینَ كَفَرُوۤا۟ أَنَّهُمۡ كَانُوا۟ كَـٰذِبِینَ\n",
    "translations": {
      "en": "[He will resurrect them] to the end that He might make clear unto them all whereon they [now] hold divergent views, and that they who are bent on denying the truth [of resurrection] might come to know that they were liars.",
      "ms": "(Allah menghidupkan semula orang-orang yang mati) untuk menerangkan kepada mereka apa yang mereka berselisihan padanya, dan supaya orang-orang kafir mengetahui bahawa mereka adalah orang-orang yang berdusta.",
      "id": "agar Allah menjelaskan kepada mereka apa yang mereka perselisihkan itu, agar orang-orang kafir itu mengetahui bahwasanya mereka adalah orang-orang yang berdusta.",
      "ar": "لِیُبَیِّنَ لَهُمُ ٱلَّذِی یَخۡتَلِفُونَ فِیهِ وَلِیَعۡلَمَ ٱلَّذِینَ كَفَرُوۤا۟ أَنَّهُمۡ كَانُوا۟ كَـٰذِبِینَ\n"
    }
  },
  {
    "id": 1941,
    "surahId": 16,
    "ayahNumber": 40,
    "arabicText": "إِنَّمَا قَوۡلُنَا لِشَیۡءٍ إِذَاۤ أَرَدۡنَـٰهُ أَن نَّقُولَ لَهُۥ كُن فَیَكُونُ\n",
    "translations": {
      "en": "Whenever We will anything to be, We but say unto it Our word \"Be\" -and it is.",
      "ms": "Sesungguhnya perkataan Kami kepada sesuatu apabila Kami kehendaki, hanyalah Kami berkata kepadanya: \"Jadilah engkau! \", maka menjadilah ia.",
      "id": "Sesungguhnya perkataan Kami terhadap sesuatu apabila Kami menghendakinya, Kami hanya mengatakan kepadanya: \"kun (jadilah)\", maka jadilah ia.",
      "ar": "إِنَّمَا قَوۡلُنَا لِشَیۡءٍ إِذَاۤ أَرَدۡنَـٰهُ أَن نَّقُولَ لَهُۥ كُن فَیَكُونُ\n"
    }
  },
  {
    "id": 1942,
    "surahId": 16,
    "ayahNumber": 41,
    "arabicText": "وَٱلَّذِینَ هَاجَرُوا۟ فِی ٱللَّهِ مِنۢ بَعۡدِ مَا ظُلِمُوا۟ لَنُبَوِّئَنَّهُمۡ فِی ٱلدُّنۡیَا حَسَنَةࣰۖ وَلَأَجۡرُ ٱلۡـَٔاخِرَةِ أَكۡبَرُۚ لَوۡ كَانُوا۟ یَعۡلَمُونَ\n",
    "translations": {
      "en": "NOW as for those who forsake the domain of evil in the cause of God, after having suffered wrong [on account of their faith] - We shall most certainly grant them a station of good fortune in this world: but their reward in the life to come will be far greater yet. If they [who deny the truth] could but understand",
      "ms": "Dan orang-orang yang berhijrah kerana Allah, sesudah mereka dianiaya (ditindas oleh musuh-musuh Islam), Kami akan menempatkan mereka di dunia ini pada tempatnya yang baik; dan sesungguhnya pahala (amal mereka yang baik itu) lebih besar di akhirat kelak, kalaulah mereka mengetahui.",
      "id": "Dan orang-orang yang berhijrah karena Allah sesudah mereka dianiaya, pasti Kami akan memberikan tempat yang bagus kepada mereka di dunia. Dan sesungguhnya pahala di akhirat adalah lebih besar, kalau mereka mengetahui,",
      "ar": "وَٱلَّذِینَ هَاجَرُوا۟ فِی ٱللَّهِ مِنۢ بَعۡدِ مَا ظُلِمُوا۟ لَنُبَوِّئَنَّهُمۡ فِی ٱلدُّنۡیَا حَسَنَةࣰۖ وَلَأَجۡرُ ٱلۡـَٔاخِرَةِ أَكۡبَرُۚ لَوۡ كَانُوا۟ یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1943,
    "surahId": 16,
    "ayahNumber": 42,
    "arabicText": "ٱلَّذِینَ صَبَرُوا۟ وَعَلَىٰ رَبِّهِمۡ یَتَوَكَّلُونَ\n",
    "translations": {
      "en": "those who, having attained to patience in adversity, in their Sustainer place their trust!",
      "ms": "Mereka itu ialah) orang-orang yang bersabar (menanggung kezaliman) dan berserah diri kepada Tuhannya.",
      "id": "(yaitu) orang-orang yang sabar dan hanya kepada Tuhan saja mereka bertawakkal.",
      "ar": "ٱلَّذِینَ صَبَرُوا۟ وَعَلَىٰ رَبِّهِمۡ یَتَوَكَّلُونَ\n"
    }
  },
  {
    "id": 1944,
    "surahId": 16,
    "ayahNumber": 43,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَا مِن قَبۡلِكَ إِلَّا رِجَالࣰا نُّوحِیۤ إِلَیۡهِمۡۖ فَسۡـَٔلُوۤا۟ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ\n",
    "translations": {
      "en": "AND [even] before thy time, [O Muhammad,] We never sent [as Our apostles] any but [mortal] men, whom We inspired: and if you have not [yet] realized this, ask the followers of [earlier] revelation,\"",
      "ms": "Dan tidaklah Kami mengutus Rasul-rasul sebelummu (wahai Muhammad), melainkan dari kalangan orang-orang lelaki, yang Kami wahyukan kepada mereka. Oleh itu bertanyalah kamu (wahai golongan musyrik) kepada orang-orang yang berpengetahuan ugama jika kamu tidak mengetahui.",
      "id": "Dan Kami tidak mengutus sebelum kamu, kecuali orang-orang lelaki yang Kami beri wahyu kepada mereka; maka bertanyalah kepada orang yang mempunyai pengetahuan jika kamu tidak mengetahui,",
      "ar": "وَمَاۤ أَرۡسَلۡنَا مِن قَبۡلِكَ إِلَّا رِجَالࣰا نُّوحِیۤ إِلَیۡهِمۡۖ فَسۡـَٔلُوۤا۟ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1945,
    "surahId": 16,
    "ayahNumber": 44,
    "arabicText": "بِٱلۡبَیِّنَـٰتِ وَٱلزُّبُرِۗ وَأَنزَلۡنَاۤ إِلَیۡكَ ٱلذِّكۡرَ لِتُبَیِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَیۡهِمۡ وَلَعَلَّهُمۡ یَتَفَكَّرُونَ\n",
    "translations": {
      "en": "[and they will tell you that their prophets, too, were but mortal men whom We had endowed] with all evidence of the truth and with books of divine wisdom. And upon thee [too] have We bestowed from on high this reminder, so that thou might make clear unto mankind all that has ever been thus bestowed upon them, and that they might take thought.",
      "ms": "(Kami utuskan Rasul-rasul itu) membawa keterangan-keterangan yang jelas nyata (yang membuktikan kebenaran mereka) dan Kitab-kitab Suci (yang menjadi panduan); dan kami pula turunkan kepadamu (wahai Muhammad) Al-Quran yang memberi peringatan, supaya engkau menerangkan kepada umat manusia akan apa yang telah diturunkan kepada mereka, dan supaya mereka memikirkannya.",
      "id": "keterangan-keterangan (mukjizat) dan kitab-kitab. Dan Kami turunkan kepadamu Al Quran, agar kamu menerangkan pada umat manusia apa yang telah diturunkan kepada mereka dan supaya mereka memikirkan,",
      "ar": "بِٱلۡبَیِّنَـٰتِ وَٱلزُّبُرِۗ وَأَنزَلۡنَاۤ إِلَیۡكَ ٱلذِّكۡرَ لِتُبَیِّنَ لِلنَّاسِ مَا نُزِّلَ إِلَیۡهِمۡ وَلَعَلَّهُمۡ یَتَفَكَّرُونَ\n"
    }
  },
  {
    "id": 1946,
    "surahId": 16,
    "ayahNumber": 45,
    "arabicText": "أَفَأَمِنَ ٱلَّذِینَ مَكَرُوا۟ ٱلسَّیِّـَٔاتِ أَن یَخۡسِفَ ٱللَّهُ بِهِمُ ٱلۡأَرۡضَ أَوۡ یَأۡتِیَهُمُ ٱلۡعَذَابُ مِنۡ حَیۡثُ لَا یَشۡعُرُونَ\n",
    "translations": {
      "en": "Can, then, they who devise evil schemes ever feel sure that God will not cause the earth to swallow them, or that suffering will not befall them without their perceiving whence [it came]? -",
      "ms": "(Setelah diterangkan yang demikian) maka adakah orang-orang yang merancang dan melakukan kejahatan-kejahatan itu merasa aman daripada ditimbuskan oleh Allah akan mereka ke dalam bumi, atau mereka didatangi azab dari arah yang mereka tidak menyedarinya?",
      "id": "maka apakah orang-orang yang membuat makar yang jahat itu, merasa aman (dari bencana) ditenggelamkannya bumi oleh Allah bersama mereka, atau datangnya azab kepada mereka dari tempat yang tidak mereka sadari,",
      "ar": "أَفَأَمِنَ ٱلَّذِینَ مَكَرُوا۟ ٱلسَّیِّـَٔاتِ أَن یَخۡسِفَ ٱللَّهُ بِهِمُ ٱلۡأَرۡضَ أَوۡ یَأۡتِیَهُمُ ٱلۡعَذَابُ مِنۡ حَیۡثُ لَا یَشۡعُرُونَ\n"
    }
  },
  {
    "id": 1947,
    "surahId": 16,
    "ayahNumber": 46,
    "arabicText": "أَوۡ یَأۡخُذَهُمۡ فِی تَقَلُّبِهِمۡ فَمَا هُم بِمُعۡجِزِینَ\n",
    "translations": {
      "en": "or that He will not take them to task [suddenly] in the midst of their comings and goings, without their being able to elude [Him],",
      "ms": "Atau Ia membinasakan mereka secara mengejut dalam masa mereka berulang alik melakukan kerja masing-masing? Kerana sebenarnya mereka tidak akan dapat melemahkan kuasa Allah.",
      "id": "atau Allah mengazab mereka diwaktu mereka dalam perjalanan, maka sekali-kali mereka tidak dapat menolak (azab itu),",
      "ar": "أَوۡ یَأۡخُذَهُمۡ فِی تَقَلُّبِهِمۡ فَمَا هُم بِمُعۡجِزِینَ\n"
    }
  },
  {
    "id": 1948,
    "surahId": 16,
    "ayahNumber": 47,
    "arabicText": "أَوۡ یَأۡخُذَهُمۡ عَلَىٰ تَخَوُّفࣲ فَإِنَّ رَبَّكُمۡ لَرَءُوفࣱ رَّحِیمٌ\n",
    "translations": {
      "en": "or take them to task through slow decay? And yet, behold, your Sustainer is most compassionate, a dispenser of grace!",
      "ms": "Atau Ia membinasakan mereka (dan harta benda mereka) sedikit demi sedikit? Kerana sesungguhnya Tuhan kamu Amat melimpah belas kasihan dan rahmatNya.",
      "id": "atau Allah mengazab mereka dengan berangsur-angsur (sampai binasa). Maka sesungguhnya Tuhanmu adalah Maha Pengasih lagi Maha Penyayang.",
      "ar": "أَوۡ یَأۡخُذَهُمۡ عَلَىٰ تَخَوُّفࣲ فَإِنَّ رَبَّكُمۡ لَرَءُوفࣱ رَّحِیمٌ\n"
    }
  },
  {
    "id": 1949,
    "surahId": 16,
    "ayahNumber": 48,
    "arabicText": "أَوَلَمۡ یَرَوۡا۟ إِلَىٰ مَا خَلَقَ ٱللَّهُ مِن شَیۡءࣲ یَتَفَیَّؤُا۟ ظِلَـٰلُهُۥ عَنِ ٱلۡیَمِینِ وَٱلشَّمَاۤىِٕلِ سُجَّدࣰا لِّلَّهِ وَهُمۡ دَ ٰ⁠خِرُونَ\n",
    "translations": {
      "en": "HAVE, THEN, they [who deny the truth] never considered any of the things that God has created _ (how] their shadows turn right and left, prostrating themselves before God and utterly submissive [to His will]?",
      "ms": "Tidakkah mereka melihat dan memikirkan segala yang telah dijadikan oleh Allah, yang beredar (berpindah-randah) bayang-bayangnya ke kanan dan ke kiri (pada pagi dan petang), dengan keadaan tunduk menurut peraturan dan kehendak Allah, sedang mereka merendah diri?",
      "id": "Dan apakah mereka tidak memperhatikan segala sesuatu yang telah diciptakan Allah yang bayangannya berbolak-balik ke kanan dan ke kiri dalam keadaan sujud kepada Allah, sedang mereka berendah diri?",
      "ar": "أَوَلَمۡ یَرَوۡا۟ إِلَىٰ مَا خَلَقَ ٱللَّهُ مِن شَیۡءࣲ یَتَفَیَّؤُا۟ ظِلَـٰلُهُۥ عَنِ ٱلۡیَمِینِ وَٱلشَّمَاۤىِٕلِ سُجَّدࣰا لِّلَّهِ وَهُمۡ دَ ٰ⁠خِرُونَ\n"
    }
  },
  {
    "id": 1950,
    "surahId": 16,
    "ayahNumber": 49,
    "arabicText": "وَلِلَّهِ یَسۡجُدُ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِ مِن دَاۤبَّةࣲ وَٱلۡمَلَـٰۤىِٕكَةُ وَهُمۡ لَا یَسۡتَكۡبِرُونَ\n",
    "translations": {
      "en": "For, before God prostrates itself all that is in the heavens and all that is on earth - every beast that moves, and the angels: [even] these do not bear themselves with false pride:",
      "ms": "Dan bagi Allah jualah tunduk sujud apa yang ada di langit dan yang ada di bumi, dari makhluk-makhluk yang bergerak serta malaikat; sedang mereka (malaikat-malaikat itu) tidak berlaku sombong takbur (daripada beribadat dan sujud kepadaNya).",
      "id": "Dan kepada Allah sajalah bersujud segala apa yang berada di langit dan semua makhluk yang melata di bumi dan (juga) para ma]aikat, sedang mereka (malaikat) tidak menyombongkan diri.",
      "ar": "وَلِلَّهِ یَسۡجُدُ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِ مِن دَاۤبَّةࣲ وَٱلۡمَلَـٰۤىِٕكَةُ وَهُمۡ لَا یَسۡتَكۡبِرُونَ\n"
    }
  },
  {
    "id": 1951,
    "surahId": 16,
    "ayahNumber": 50,
    "arabicText": "یَخَافُونَ رَبَّهُم مِّن فَوۡقِهِمۡ وَیَفۡعَلُونَ مَا یُؤۡمَرُونَ ۩\n",
    "translations": {
      "en": "they fear their Sustainer high above them, and do whatever they are bidden to do.",
      "ms": "Mereka takut kepada Tuhan mereka yang mengatasi mereka (dengan kekuasaanNya), serta mereka mengerjakan apa yang diperintahkan.",
      "id": "Mereka takut kepada Tuhan mereka yang di atas mereka dan melaksanakan apa yang diperintahkan (kepada mereka).",
      "ar": "یَخَافُونَ رَبَّهُم مِّن فَوۡقِهِمۡ وَیَفۡعَلُونَ مَا یُؤۡمَرُونَ ۩\n"
    }
  },
  {
    "id": 1952,
    "surahId": 16,
    "ayahNumber": 51,
    "arabicText": "۞ وَقَالَ ٱللَّهُ لَا تَتَّخِذُوۤا۟ إِلَـٰهَیۡنِ ٱثۡنَیۡنِۖ إِنَّمَا هُوَ إِلَـٰهࣱ وَ ٰ⁠حِدࣱ فَإِیَّـٰیَ فَٱرۡهَبُونِ\n",
    "translations": {
      "en": "And God has said: \"Do not take to worshipping two [or more] deities. He is the One and Only God: hence, of Me, of Me alone stand in awe!\"",
      "ms": "Dan Allah berfirman: \"Janganlah kamu bertuhankan dua tuhan, kerana sesungguhnya Tuhan itu hanyalah Tuhan yang satu; maka kepada Akulah sahaja hendaknya kamu gerun gementar.",
      "id": "Allah berfirman: \"Janganlah kamu menyembah dua tuhan; sesungguhnya Dialah Tuhan Yang Maha Esa, maka hendaklah kepada-Ku saja kamu takut\".",
      "ar": "۞ وَقَالَ ٱللَّهُ لَا تَتَّخِذُوۤا۟ إِلَـٰهَیۡنِ ٱثۡنَیۡنِۖ إِنَّمَا هُوَ إِلَـٰهࣱ وَ ٰ⁠حِدࣱ فَإِیَّـٰیَ فَٱرۡهَبُونِ\n"
    }
  },
  {
    "id": 1953,
    "surahId": 16,
    "ayahNumber": 52,
    "arabicText": "وَلَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَلَهُ ٱلدِّینُ وَاصِبًاۚ أَفَغَیۡرَ ٱللَّهِ تَتَّقُونَ\n",
    "translations": {
      "en": "And His is all that is in the heavens and on earth, and to Him [alone] obedience is always due: will you, then, pay reverence to aught but Him?",
      "ms": "Dan bagiNyalah (hak milik) segala yang ada di langit dan di bumi; dan kepadaNya sahaja tertentu ibadat dan ketaatan selama-lamanya; (sesudah kamu mengetahui yang demikian) maka tidaklah patut kamu takut kepada yang lain dari Allah.",
      "id": "Dan kepunyaan-Nya-lah segala apa yang ada di langit dan di bumi, dan untuk-Nya-lah ketaatan itu selama-lamanya. Maka mengapa kamu bertakwa kepada selain Allah?",
      "ar": "وَلَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَلَهُ ٱلدِّینُ وَاصِبًاۚ أَفَغَیۡرَ ٱللَّهِ تَتَّقُونَ\n"
    }
  },
  {
    "id": 1954,
    "surahId": 16,
    "ayahNumber": 53,
    "arabicText": "وَمَا بِكُم مِّن نِّعۡمَةࣲ فَمِنَ ٱللَّهِۖ ثُمَّ إِذَا مَسَّكُمُ ٱلضُّرُّ فَإِلَیۡهِ تَجۡـَٔرُونَ\n",
    "translations": {
      "en": "For, whatever good thing comes to you, comes from God; and whenever harm befalls you, it is unto Him that you cry for help",
      "ms": "Dan apa-apa nikmat yang ada pada kamu maka adalah ia dari Allah; kemudian, apabila kamu ditimpa kesusahan maka kepadaNyalah kamu meraung meminta pertolongan.",
      "id": "Dan apa saja nikmat yang ada pada kamu, maka dari Allah-lah (datangnya), dan bila kamu ditimpa oleh kemudharatan, maka hanya kepada-Nya-lah kamu meminta pertolongan.",
      "ar": "وَمَا بِكُم مِّن نِّعۡمَةࣲ فَمِنَ ٱللَّهِۖ ثُمَّ إِذَا مَسَّكُمُ ٱلضُّرُّ فَإِلَیۡهِ تَجۡـَٔرُونَ\n"
    }
  },
  {
    "id": 1955,
    "surahId": 16,
    "ayahNumber": 54,
    "arabicText": "ثُمَّ إِذَا كَشَفَ ٱلضُّرَّ عَنكُمۡ إِذَا فَرِیقࣱ مِّنكُم بِرَبِّهِمۡ یُشۡرِكُونَ\n",
    "translations": {
      "en": "yet as soon as He has removed the harm from you, lo! some of you [begin to] ascribe to other powers a share 'in their Sustainer's divinity",
      "ms": "Kemudian, apabila Ia menghapuskan kesusahan itu daripada kamu, tiba-tiba sepuak di antara kamu mempersekutukan (sesuatu yang lain) dengan Tuhan mereka.",
      "id": "Kemudian apabila Dia telah menghilangkan kemudharatan itu dari pada kamu, tiba-tiba sebahagian dari pada kamu mempersekutukan Tuhannya dengan (yang lain),",
      "ar": "ثُمَّ إِذَا كَشَفَ ٱلضُّرَّ عَنكُمۡ إِذَا فَرِیقࣱ مِّنكُم بِرَبِّهِمۡ یُشۡرِكُونَ\n"
    }
  },
  {
    "id": 1956,
    "surahId": 16,
    "ayahNumber": 55,
    "arabicText": "لِیَكۡفُرُوا۟ بِمَاۤ ءَاتَیۡنَـٰهُمۡۚ فَتَمَتَّعُوا۟ فَسَوۡفَ تَعۡلَمُونَ\n",
    "translations": {
      "en": "[as if] to prove their ingratitude for all that We have granted them! Enjoy, then, your [brief] life: but in time you will come to know [the truth]!",
      "ms": "(Mereka melakukan yang demikian) kerana mereka kufur, tidak bersyukur akan nikmat-nikmat yang kami berikan kepada mereka. Oleh itu, bersenang-senanglah kamu (dengan nikmat-nikmat itu bagi sementara di dunia), kemudian kamu akan mengetahui (balasan buruk yang akan menimpa kamu).",
      "id": "Biarlah mereka mengingkari nikmat yang telah Kami berikan kepada mereka; maka bersenang-senanglah kamu. Kelak kamu akan mengetahui (akibatnya).",
      "ar": "لِیَكۡفُرُوا۟ بِمَاۤ ءَاتَیۡنَـٰهُمۡۚ فَتَمَتَّعُوا۟ فَسَوۡفَ تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1957,
    "surahId": 16,
    "ayahNumber": 56,
    "arabicText": "وَیَجۡعَلُونَ لِمَا لَا یَعۡلَمُونَ نَصِیبࣰا مِّمَّا رَزَقۡنَـٰهُمۡۗ تَٱللَّهِ لَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَفۡتَرُونَ\n",
    "translations": {
      "en": "As it is, they ascribe - out of what We provide for them as sustenance - a share unto things of which they know nothing. By God, you shall most certainly be called to account for all your false imagery!",
      "ms": "Dan mereka (yang musyrik itu) menentukan untuk keperluan benda-benda yang mereka tidak mengetahui hal keadaannya, sebahagian dari harta-benda yang kami kurniakan kepada mereka. Demi Allah! Sesungguhnya kamu akan ditanya kelak tentang apa yang kamu ada-adakan secara dusta itu.",
      "id": "Dan mereka sediakan untuk berhala-berhala yang mereka tiada mengetahui (kekuasaannya), satu bahagian dari rezeki yang telah Kami berikan kepada mereka. Demi Allah, sesungguhnya kamu akan ditanyai tentang apa yang telah kamu ada-adakan.",
      "ar": "وَیَجۡعَلُونَ لِمَا لَا یَعۡلَمُونَ نَصِیبࣰا مِّمَّا رَزَقۡنَـٰهُمۡۗ تَٱللَّهِ لَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَفۡتَرُونَ\n"
    }
  },
  {
    "id": 1958,
    "surahId": 16,
    "ayahNumber": 57,
    "arabicText": "وَیَجۡعَلُونَ لِلَّهِ ٱلۡبَنَـٰتِ سُبۡحَـٰنَهُۥ وَلَهُم مَّا یَشۡتَهُونَ\n",
    "translations": {
      "en": "And [thus, too,] they ascribe daughters unto God, who is limitless in His glory - whereas for themselves [they would choose, if they could, only] what they desire:",
      "ms": "Dan mereka mengatakan Allah mempunyai anak-anak perempuan. Maha Suci Ia. Sedang bagi mereka pula mereka sediakan apa yang mereka sukai (anak-anak lelaki).",
      "id": "Dan mereka menetapkan bagi Allah anak-anak perempuan. Maha Suci Allah, sedang untuk mereka sendiri (mereka tetapkan) apa yang mereka sukai (yaitu anak-anak laki-laki).",
      "ar": "وَیَجۡعَلُونَ لِلَّهِ ٱلۡبَنَـٰتِ سُبۡحَـٰنَهُۥ وَلَهُم مَّا یَشۡتَهُونَ\n"
    }
  },
  {
    "id": 1959,
    "surahId": 16,
    "ayahNumber": 58,
    "arabicText": "وَإِذَا بُشِّرَ أَحَدُهُم بِٱلۡأُنثَىٰ ظَلَّ وَجۡهُهُۥ مُسۡوَدࣰّا وَهُوَ كَظِیمࣱ\n",
    "translations": {
      "en": "for, whenever any of them is given the glad tiding of [the birth of] a girl, his face darkens, and he is filled with suppressed anger,",
      "ms": "Dan apabila dikhabarkan kepada seseorang dari mereka bahawa ia beroleh anak perempuan, muramlah mukanya sepanjang hari (kerana menanggung dukacita), sedang ia menahan perasaan marahnya dalam hati.",
      "id": "Dan apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, hitamlah (merah padamlah) mukanya, dan dia sangat marah.",
      "ar": "وَإِذَا بُشِّرَ أَحَدُهُم بِٱلۡأُنثَىٰ ظَلَّ وَجۡهُهُۥ مُسۡوَدࣰّا وَهُوَ كَظِیمࣱ\n"
    }
  },
  {
    "id": 1960,
    "surahId": 16,
    "ayahNumber": 59,
    "arabicText": "یَتَوَ ٰ⁠رَىٰ مِنَ ٱلۡقَوۡمِ مِن سُوۤءِ مَا بُشِّرَ بِهِۦۤۚ أَیُمۡسِكُهُۥ عَلَىٰ هُونٍ أَمۡ یَدُسُّهُۥ فِی ٱلتُّرَابِۗ أَلَا سَاۤءَ مَا یَحۡكُمُونَ\n",
    "translations": {
      "en": "avoiding all people because of the [alleged] evil of the glad tiding which he has received, [and debating within himself:] Shall he keep this [child] despite the contempt [which he feels for it]-or shall he bury it in the dust? Old, evil indeed is whatever they decide!",
      "ms": "Ia bersembunyi dari orang ramai kerana (merasa malu disebabkan) berita buruk yang disampaikan kepadanya (tentang ia beroleh anak perempuan; sambil ia berfikir): adakah ia akan memelihara anak itu dalam keadaan yang hina, atau ia akan menanamnya hidup-hidup dalam tanah? Ketahuilah! Sungguh jahat apa yang mereka hukumkan itu.",
      "id": "Ia menyembunyikan dirinya dari orang banyak, disebabkan buruknya berita yang disampaikan kepadanya. Apakah dia akan memeliharanya dengan menanggung kehinaan ataukah akan menguburkannya ke dalam tanah (hidup-hidup)?. Ketahuilah, alangkah buruknya apa yang mereka tetapkan itu.",
      "ar": "یَتَوَ ٰ⁠رَىٰ مِنَ ٱلۡقَوۡمِ مِن سُوۤءِ مَا بُشِّرَ بِهِۦۤۚ أَیُمۡسِكُهُۥ عَلَىٰ هُونٍ أَمۡ یَدُسُّهُۥ فِی ٱلتُّرَابِۗ أَلَا سَاۤءَ مَا یَحۡكُمُونَ\n"
    }
  },
  {
    "id": 1961,
    "surahId": 16,
    "ayahNumber": 60,
    "arabicText": "لِلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ مَثَلُ ٱلسَّوۡءِۖ وَلِلَّهِ ٱلۡمَثَلُ ٱلۡأَعۡلَىٰۚ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n",
    "translations": {
      "en": "[Thus it is that] the attribute of evil applies to all who do not believe in the life to come -whereas unto God applies the attribute of all that is most sublime: for He alone is almighty, truly wise!",
      "ms": "Bagi mereka yang tidak beriman kepada hari akhirat itu, sifat yang buruk, dan bagi Allah jualah sifat yang tertinggi; dan Dia lah jua Yang Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Orang-orang yang tidak beriman kepada kehidupan akhirat, mempunyai sifat yang buruk; dan Allah mempunyai sifat yang Maha Tinggi; dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.",
      "ar": "لِلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ مَثَلُ ٱلسَّوۡءِۖ وَلِلَّهِ ٱلۡمَثَلُ ٱلۡأَعۡلَىٰۚ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n"
    }
  },
  {
    "id": 1962,
    "surahId": 16,
    "ayahNumber": 61,
    "arabicText": "وَلَوۡ یُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِظُلۡمِهِم مَّا تَرَكَ عَلَیۡهَا مِن دَاۤبَّةࣲ وَلَـٰكِن یُؤَخِّرُهُمۡ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّىۖ فَإِذَا جَاۤءَ أَجَلُهُمۡ لَا یَسۡتَـٔۡخِرُونَ سَاعَةࣰ وَلَا یَسۡتَقۡدِمُونَ\n",
    "translations": {
      "en": "Now if God were to take men [immediately] to task for all the evil that they do [on earth], He would not leave a single living creature upon its face. However, He grants them respite until a term set [by Him]: but when the end of their term approaches, they can neither delay it by a single moment, nor can they hasten it.",
      "ms": "Dan kalaulah Allah menyeksa manusia disebabkan kezaliman mereka, tentulah Ia tidak membiarkan tinggal di muka bumi sesuatu makhluk yang bergerak; akan tetapi Ia memberi tempoh kepada mereka hingga ke suatu masa yang tertentu; kemudian apabila sampai tempoh mereka, tiadalah mereka akan dapat meminta dikemudiankan sesaatpun dan tidak pula mereka akan dapat meminta didahulukan.",
      "id": "Jikalau Allah menghukum manusia karena kezalimannya, niscaya tidak akan ditinggalkan-Nya di muka bumi sesuatupun dari makhluk yang melata, tetapi Allah menangguhkan mereka sampai kepada waktu yang ditentukan. Maka apabila telah tiba waktunya (yang ditentukan) bagi mereka, tidaklah mereka dapat mengundurkannya barang sesaatpun dan tidak (pula) mendahulukannya.",
      "ar": "وَلَوۡ یُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِظُلۡمِهِم مَّا تَرَكَ عَلَیۡهَا مِن دَاۤبَّةࣲ وَلَـٰكِن یُؤَخِّرُهُمۡ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّىۖ فَإِذَا جَاۤءَ أَجَلُهُمۡ لَا یَسۡتَـٔۡخِرُونَ سَاعَةࣰ وَلَا یَسۡتَقۡدِمُونَ\n"
    }
  },
  {
    "id": 1963,
    "surahId": 16,
    "ayahNumber": 62,
    "arabicText": "وَیَجۡعَلُونَ لِلَّهِ مَا یَكۡرَهُونَۚ وَتَصِفُ أَلۡسِنَتُهُمُ ٱلۡكَذِبَ أَنَّ لَهُمُ ٱلۡحُسۡنَىٰۚ لَا جَرَمَ أَنَّ لَهُمُ ٱلنَّارَ وَأَنَّهُم مُّفۡرَطُونَ\n",
    "translations": {
      "en": "As it is, they ascribe to God something that they [themselves] dislike -and [all the while] their tongues utter the lie that [by doing so] they earn supreme merit! Truly, they earn but the fire, and will be left out [of God's grace]!",
      "ms": "Dan mereka mengadakan bagi Allah apa yang mereka sendiri tidak menyukainya; dalam pada itu, lidah mereka memperkatakan perkara yang dusta, (kononnya) bahawa mereka akan beroleh kesudahan yang baik di sisi Allah. Tidak syak lagi, bahawa bagi merekalah api neraka, dan bahawa merekalah orang-orang yang disegerakan (masuknya ke dalam neraka).",
      "id": "Dan mereka menetapkan bagi Allah apa yang mereka sendiri membencinya, dan lidah mereka mengucapkan kedustaan, yaitu bahwa sesungguhnya merekalah yang akan mendapat kebaikan. Tiadalah diragukan bahwa nerakalah bagi mereka, dan sesungguhnya mereka segera dimasukkan (ke dalamnya).",
      "ar": "وَیَجۡعَلُونَ لِلَّهِ مَا یَكۡرَهُونَۚ وَتَصِفُ أَلۡسِنَتُهُمُ ٱلۡكَذِبَ أَنَّ لَهُمُ ٱلۡحُسۡنَىٰۚ لَا جَرَمَ أَنَّ لَهُمُ ٱلنَّارَ وَأَنَّهُم مُّفۡرَطُونَ\n"
    }
  },
  {
    "id": 1964,
    "surahId": 16,
    "ayahNumber": 63,
    "arabicText": "تَٱللَّهِ لَقَدۡ أَرۡسَلۡنَاۤ إِلَىٰۤ أُمَمࣲ مِّن قَبۡلِكَ فَزَیَّنَ لَهُمُ ٱلشَّیۡطَـٰنُ أَعۡمَـٰلَهُمۡ فَهُوَ وَلِیُّهُمُ ٱلۡیَوۡمَ وَلَهُمۡ عَذَابٌ أَلِیمࣱ\n",
    "translations": {
      "en": "By God, [O Prophet,] even before thy time have We sent apostles unto [various] communities: but [those who were bent on denying the truth have always refused to listen to Our messages because] Satan has made all their own doings seem goodly to them: and he is [as] close to them today [as he was to the sinners of yore]; hence, grievous suffering awaits them.",
      "ms": "Demi Allah! Sesungguhnya kami juga telah mengutus Rasul-rasul kepada umat-umat yang terdahulu daripadamu (wahai Muhammad), lalu Syaitan memperelokkan pada pandangan mereka yang ingkar akan amal-amal mereka yang jahat itu; maka dia lah menjadi pemimpin mereka pada hari ini; dan mereka akan beroleh azab seksa yang tidak terperi sakitnya.",
      "id": "Demi Allah, sesungguhnya Kami telah mengutus rasul-rasul Kami kepada umat-umat sebelum kamu, tetapi syaitan menjadikan umat-umat itu memandang baik perbuatan mereka (yang buruk), maka syaitan menjadi pemimpin mereka di hari itu dan bagi mereka azab yang sangat pedih.",
      "ar": "تَٱللَّهِ لَقَدۡ أَرۡسَلۡنَاۤ إِلَىٰۤ أُمَمࣲ مِّن قَبۡلِكَ فَزَیَّنَ لَهُمُ ٱلشَّیۡطَـٰنُ أَعۡمَـٰلَهُمۡ فَهُوَ وَلِیُّهُمُ ٱلۡیَوۡمَ وَلَهُمۡ عَذَابٌ أَلِیمࣱ\n"
    }
  },
  {
    "id": 1965,
    "surahId": 16,
    "ayahNumber": 64,
    "arabicText": "وَمَاۤ أَنزَلۡنَا عَلَیۡكَ ٱلۡكِتَـٰبَ إِلَّا لِتُبَیِّنَ لَهُمُ ٱلَّذِی ٱخۡتَلَفُوا۟ فِیهِ وَهُدࣰى وَرَحۡمَةࣰ لِّقَوۡمࣲ یُؤۡمِنُونَ\n",
    "translations": {
      "en": "And upon thee [too] have We bestowed from on' high this divine writ for no other reason than that thou might make clear unto them all [questions of faith] on which they have come to hold divergent views, and [thus offer] guidance and grace unto people who will believe.",
      "ms": "Dan tiadalah Kami menurunkan Al-Quran kepadamu (wahai Muhammad) melainkan supaya engkau menerangkan kepada mereka akan apa yang mereka berselisihan padanya; dan supaya menjadi petunjuk dan rahmat bagi orang-orang yang beriman.",
      "id": "Dan Kami tidak menurunkan kepadamu Al-Kitab (Al Quran) ini, melainkan agar kamu dapat menjelaskan kepada mereka apa yang mereka perselisihkan itu dan menjadi petunjuk dan rahmat bagi kaum yang beriman.",
      "ar": "وَمَاۤ أَنزَلۡنَا عَلَیۡكَ ٱلۡكِتَـٰبَ إِلَّا لِتُبَیِّنَ لَهُمُ ٱلَّذِی ٱخۡتَلَفُوا۟ فِیهِ وَهُدࣰى وَرَحۡمَةࣰ لِّقَوۡمࣲ یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 1966,
    "surahId": 16,
    "ayahNumber": 65,
    "arabicText": "وَٱللَّهُ أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَحۡیَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۤۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّقَوۡمࣲ یَسۡمَعُونَ\n",
    "translations": {
      "en": "AND GOD sends down water from the skies, giving life thereby to the earth after it had been lifeless: in this, behold, there is a message indeed for people who [are willing to] listen.",
      "ms": "Dan Allah menurunkan hujan dari langit, lalu Ia menghidupkan dengan air hujan itu akan bumi sesudah matinya; sesungguhnya pada yang demikian itu terdapat satu tanda (yang membuktikan kebijaksanaan Allah) bagi kaum yang mendengar (peringatan ini dan memahaminya).",
      "id": "Dan Allah menurunkan dari langit air (hujan) dan dengan air itu dihidupkan-Nya bumi sesudah matinya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Tuhan) bagi orang-orang yang mendengarkan (pelajaran).",
      "ar": "وَٱللَّهُ أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَحۡیَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۤۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّقَوۡمࣲ یَسۡمَعُونَ\n"
    }
  },
  {
    "id": 1967,
    "surahId": 16,
    "ayahNumber": 66,
    "arabicText": "وَإِنَّ لَكُمۡ فِی ٱلۡأَنۡعَـٰمِ لَعِبۡرَةࣰۖ نُّسۡقِیكُم مِّمَّا فِی بُطُونِهِۦ مِنۢ بَیۡنِ فَرۡثࣲ وَدَمࣲ لَّبَنًا خَالِصࣰا سَاۤىِٕغࣰا لِّلشَّـٰرِبِینَ\n",
    "translations": {
      "en": "And, behold, in the cattle [too] there is indeed a lesson for you: We give you to drink of that [fluid] which is [secreted from] within their bellies between that which is to be eliminated [from the animal's body] and [its] life-blood: milk pure and pleasant to those who drink it.",
      "ms": "Dan sesungguhnya pada binatang-binatang ternak itu, kamu beroleh pelajaran yang mendatangkan iktibar. Kami beri minum kepada kamu daripada apa yang terbit dari dalam perutnya, yang lahir dari antara hampas makanan dengan darah; (iaitu) susu yang bersih, yang mudah diminum, lagi sedap rasanya bagi orang-orang yang meminumnya.",
      "id": "Dan sesungguhnya pada binatang ternak itu benar-benar terdapat pelajaran bagi kamu. Kami memberimu minum dari pada apa yang berada dalam perutnya (berupa) susu yang bersih antara tahi dan darah, yang mudah ditelan bagi orang-orang yang meminumnya.",
      "ar": "وَإِنَّ لَكُمۡ فِی ٱلۡأَنۡعَـٰمِ لَعِبۡرَةࣰۖ نُّسۡقِیكُم مِّمَّا فِی بُطُونِهِۦ مِنۢ بَیۡنِ فَرۡثࣲ وَدَمࣲ لَّبَنًا خَالِصࣰا سَاۤىِٕغࣰا لِّلشَّـٰرِبِینَ\n"
    }
  },
  {
    "id": 1968,
    "surahId": 16,
    "ayahNumber": 67,
    "arabicText": "وَمِن ثَمَرَ ٰ⁠تِ ٱلنَّخِیلِ وَٱلۡأَعۡنَـٰبِ تَتَّخِذُونَ مِنۡهُ سَكَرࣰا وَرِزۡقًا حَسَنًاۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّقَوۡمࣲ یَعۡقِلُونَ\n",
    "translations": {
      "en": "And [We grant you nourishment] from the fruit of date-palms and vines: from it you derive intoxicants as well as wholesome sustenance -in this, behold, there is a message indeed for people who use their reason!",
      "ms": "Dan dari buah tamar (kurma) dan anggur kamu jadikan daripadanya minuman haram dan makanan serta minuman yang halal; sesungguhnya pada yang demikian itu terdapat satu tanda (yang membuktikan kekuasaan Allah) bagi orang-orang yang mahu menggunakan akalnya.",
      "id": "Dan dari buah korma dan anggur, kamu buat minimuman yang memabukkan dan rezeki yang baik. Sesunggguhnya pada yang demikian itu benar-benar terdapat tanda (kebesaran Allah) bagi orang yang memikirkan.",
      "ar": "وَمِن ثَمَرَ ٰ⁠تِ ٱلنَّخِیلِ وَٱلۡأَعۡنَـٰبِ تَتَّخِذُونَ مِنۡهُ سَكَرࣰا وَرِزۡقًا حَسَنًاۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّقَوۡمࣲ یَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1969,
    "surahId": 16,
    "ayahNumber": 68,
    "arabicText": "وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِی مِنَ ٱلۡجِبَالِ بُیُوتࣰا وَمِنَ ٱلشَّجَرِ وَمِمَّا یَعۡرِشُونَ\n",
    "translations": {
      "en": "And [consider how] thy Sustainer has inspired the bee: \"Prepare for thyself dwellings in mountains and in trees, and in what [men] may build [for thee by way of hives];",
      "ms": "Dan Tuhanmu memberi ilham kepada lebah: \"Hendaklah engkau membuat sarangmu di gunung-ganang dan di pokok-pokok kayu, dan juga di bangunan-bangunan yang didirikan oleh manusia.",
      "id": "Dan Tuhanmu mewahyukan kepada lebah: \"Buatlah sarang-sarang di bukit-bukit, di pohon-pohon kayu, dan di tempat-tempat yang dibikin manusia\",",
      "ar": "وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِی مِنَ ٱلۡجِبَالِ بُیُوتࣰا وَمِنَ ٱلشَّجَرِ وَمِمَّا یَعۡرِشُونَ\n"
    }
  },
  {
    "id": 1970,
    "surahId": 16,
    "ayahNumber": 69,
    "arabicText": "ثُمَّ كُلِی مِن كُلِّ ٱلثَّمَرَ ٰ⁠تِ فَٱسۡلُكِی سُبُلَ رَبِّكِ ذُلُلࣰاۚ یَخۡرُجُ مِنۢ بُطُونِهَا شَرَابࣱ مُّخۡتَلِفٌ أَلۡوَ ٰ⁠نُهُۥ فِیهِ شِفَاۤءࣱ لِّلنَّاسِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّقَوۡمࣲ یَتَفَكَّرُونَ\n",
    "translations": {
      "en": "and then eat of all manner of fruit, and follow humbly the paths ordained for thee by thy Sustainer.\" [And lo!] there issues from within these [bees] a fluid of many hues, wherein there is health for man. In all this, behold, there is a message indeed for people who think!",
      "ms": "Kemudian makanlah dari segala jenis bunga-bungaan dan buah-buahan (yang engkau sukai), serta turutlah jalan-jalan peraturan Tuhanmu yang diilhamkan dan dimudahkannya kepadamu\". (Dengan itu) akan keluarlah dari dalam badannya minuman (madu) yang berlainan warnanya, yang mengandungi penawar bagi manusia (dari berbagai-bagai penyakit). Sesungguhnya pada yang demikian itu, ada tanda (yang membuktikan kemurahan Allah) bagi orang-orang yang mahu berfikir.",
      "id": "kemudian makanlah dari tiap-tiap (macam) buah-buahan dan tempuhlah jalan Tuhanmu yang telah dimudahkan (bagimu). Dari perut lebah itu ke luar minuman (madu) yang bermacam-macam warnanya, di dalamnya terdapat obat yang menyembuhkan bagi manusia. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda (kebesaran Tuhan) bagi orang-orang yang memikirkan.",
      "ar": "ثُمَّ كُلِی مِن كُلِّ ٱلثَّمَرَ ٰ⁠تِ فَٱسۡلُكِی سُبُلَ رَبِّكِ ذُلُلࣰاۚ یَخۡرُجُ مِنۢ بُطُونِهَا شَرَابࣱ مُّخۡتَلِفٌ أَلۡوَ ٰ⁠نُهُۥ فِیهِ شِفَاۤءࣱ لِّلنَّاسِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّقَوۡمࣲ یَتَفَكَّرُونَ\n"
    }
  },
  {
    "id": 1971,
    "surahId": 16,
    "ayahNumber": 70,
    "arabicText": "وَٱللَّهُ خَلَقَكُمۡ ثُمَّ یَتَوَفَّىٰكُمۡۚ وَمِنكُم مَّن یُرَدُّ إِلَىٰۤ أَرۡذَلِ ٱلۡعُمُرِ لِكَیۡ لَا یَعۡلَمَ بَعۡدَ عِلۡمࣲ شَیۡـًٔاۚ إِنَّ ٱللَّهَ عَلِیمࣱ قَدِیرࣱ\n",
    "translations": {
      "en": "AND GOD has created you, and in time will cause you to die; and many a one of you is reduced in old age to a most abject state, ceasing to know anything of what he once knew so well. Verily, God is all-knowing, infinite in His power!",
      "ms": "Dan Allah yang menciptakan kamu (dari tiada kepada ada); kemudian Ia menyempurnakan tempoh umur kamu; (maka ada di antara kamu yang disegerakan matinya), dan ada pula di antara kamu yang dikembalikannya kepada peringkat umur yang lemah (peringkat tua kebudak-budakan), sehingga menjadilah ia tidak ingat akan sesuatu yang telah diketahuinya; sesungguhnya Allah Maha Mengetahui, lagi Maha Kuasa.",
      "id": "Allah menciptakan kamu, kemudian mewafatkan kamu; dan di antara kamu ada yang dikembalikan kepada umur yang paling lemah (pikun), supaya dia tidak mengetahui lagi sesuatupun yang pernah diketahuinya. Sesungguhnya Allah Maha Mengetahui lagi Maha Kuasa.",
      "ar": "وَٱللَّهُ خَلَقَكُمۡ ثُمَّ یَتَوَفَّىٰكُمۡۚ وَمِنكُم مَّن یُرَدُّ إِلَىٰۤ أَرۡذَلِ ٱلۡعُمُرِ لِكَیۡ لَا یَعۡلَمَ بَعۡدَ عِلۡمࣲ شَیۡـًٔاۚ إِنَّ ٱللَّهَ عَلِیمࣱ قَدِیرࣱ\n"
    }
  },
  {
    "id": 1972,
    "surahId": 16,
    "ayahNumber": 71,
    "arabicText": "وَٱللَّهُ فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضࣲ فِی ٱلرِّزۡقِۚ فَمَا ٱلَّذِینَ فُضِّلُوا۟ بِرَاۤدِّی رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَیۡمَـٰنُهُمۡ فَهُمۡ فِیهِ سَوَاۤءٌۚ أَفَبِنِعۡمَةِ ٱللَّهِ یَجۡحَدُونَ\n",
    "translations": {
      "en": "And on some of you God has bestowed more abundant means of sustenance than on others: and yet, they who are more abundantly favoured are [often] unwilling to share their sustenance with those whom their right hands possess, so that they [all] might be equal in this respect. Will they, then, God's blessings [thus] deny?",
      "ms": "Dan Allah telah melebihkan sebahagian dari kamu atas sebahagian yang lain pada rezeki yang dikurniakanNya; dalam pada itu, orang-orang yang diberi kelebihan itu tidak mahu memberikan sebahagian dari kelebihan hartanya kepada hamba-hamba mereka, supaya orang-orang itu dapat sama mempunyai harta. Maka mengapa mereka tergamak mengingkari nikmat Allah itu dengan perbuatan syirik?",
      "id": "Dan Allah melebihkan sebahagian kamu dari sebagian yang lain dalam hal rezeki, tetapi orang-orang yang dilebihkan (rezekinya itu) tidak mau memberikan rezeki mereka kepada budak-budak yang mereka miliki, agar mereka sama (merasakan) rezeki itu. Maka mengapa mereka mengingkari nikmat Allah?.",
      "ar": "وَٱللَّهُ فَضَّلَ بَعۡضَكُمۡ عَلَىٰ بَعۡضࣲ فِی ٱلرِّزۡقِۚ فَمَا ٱلَّذِینَ فُضِّلُوا۟ بِرَاۤدِّی رِزۡقِهِمۡ عَلَىٰ مَا مَلَكَتۡ أَیۡمَـٰنُهُمۡ فَهُمۡ فِیهِ سَوَاۤءٌۚ أَفَبِنِعۡمَةِ ٱللَّهِ یَجۡحَدُونَ\n"
    }
  },
  {
    "id": 1973,
    "surahId": 16,
    "ayahNumber": 72,
    "arabicText": "وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَ ٰ⁠جࣰا وَجَعَلَ لَكُم مِّنۡ أَزۡوَ ٰ⁠جِكُم بَنِینَ وَحَفَدَةࣰ وَرَزَقَكُم مِّنَ ٱلطَّیِّبَـٰتِۚ أَفَبِٱلۡبَـٰطِلِ یُؤۡمِنُونَ وَبِنِعۡمَتِ ٱللَّهِ هُمۡ یَكۡفُرُونَ\n",
    "translations": {
      "en": "And God has given you mates of your own kinds and has given you, through your mates, children and children's children, and has provided for you sustenance out of the good things of life. Will men, then, [continue to] believe in things false and vain, and thus blaspheme against God's blessings? -",
      "ms": "Dan Allah menjadikan bagi kamu dari diri kamu sendiri pasangan-pasangan (isteri), dan dijadikan bagi kamu dari pasangan kamu: anak-anak dan cucu-cicit, serta dikurniakan kepada kamu dari benda yang baik lagi halal; maka patutkah mereka (yang ingkar itu) percaya kepada perkara yang salah (penyembahan berhala), dan mereka kufur pula akan nikmat Allah?",
      "id": "Allah menjadikan bagi kamu isteri-isteri dari jenis kamu sendiri dan menjadikan bagimu dari isteri-isteri kamu itu, anak-anak dan cucu-cucu, dan memberimu rezeki dari yang baik-baik. Maka mengapakah mereka beriman kepada yang bathil dan mengingkari nikmat Allah?\"",
      "ar": "وَٱللَّهُ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَ ٰ⁠جࣰا وَجَعَلَ لَكُم مِّنۡ أَزۡوَ ٰ⁠جِكُم بَنِینَ وَحَفَدَةࣰ وَرَزَقَكُم مِّنَ ٱلطَّیِّبَـٰتِۚ أَفَبِٱلۡبَـٰطِلِ یُؤۡمِنُونَ وَبِنِعۡمَتِ ٱللَّهِ هُمۡ یَكۡفُرُونَ\n"
    }
  },
  {
    "id": 1974,
    "surahId": 16,
    "ayahNumber": 73,
    "arabicText": "وَیَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا یَمۡلِكُ لَهُمۡ رِزۡقࣰا مِّنَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ شَیۡـࣰٔا وَلَا یَسۡتَطِیعُونَ\n",
    "translations": {
      "en": "and will they [continue to] worship, instead of God, something that has it not within its power to provide for them any sustenance whatever from the heavens or the earth, and can do nothing at all?",
      "ms": "Dan mereka menyembah benda-benda yang lain dari Allah, yang tidak berkuasa memberikan mereka sebarang rezeki pemberian dari langit dan bumi, dan mereka pula tidak berdaya sama sekali mendapat kuasa itu.",
      "id": "Dan mereka menyembah selain Allah, sesuatu yang tidak dapat memberikan rezeki kepada mereka sedikitpun dari langit dan bumi, dan tidak berkuasa (sedikit juapun).",
      "ar": "وَیَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا یَمۡلِكُ لَهُمۡ رِزۡقࣰا مِّنَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ شَیۡـࣰٔا وَلَا یَسۡتَطِیعُونَ\n"
    }
  },
  {
    "id": 1975,
    "surahId": 16,
    "ayahNumber": 74,
    "arabicText": "فَلَا تَضۡرِبُوا۟ لِلَّهِ ٱلۡأَمۡثَالَۚ إِنَّ ٱللَّهَ یَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ\n",
    "translations": {
      "en": "Hence, do not coin any similitudes for Gods Verily, God knows [all], whereas you have no [real] knowledge.",
      "ms": "Oleh itu, janganlah kamu mengadakan sesuatu yang sebanding dengan Allah, kerana sesungguhnya Allah mengetahui (setakat mana buruknya perbuatan syirik kamu) sedang kamu tidak mengetahuinya.",
      "id": "Maka janganlah kamu mengadakan sekutu-sekutu bagi Allah. Sesungguhnya Allah mengetahui, sedang kamu tidak mengetahui.",
      "ar": "فَلَا تَضۡرِبُوا۟ لِلَّهِ ٱلۡأَمۡثَالَۚ إِنَّ ٱللَّهَ یَعۡلَمُ وَأَنتُمۡ لَا تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1976,
    "surahId": 16,
    "ayahNumber": 75,
    "arabicText": "۞ ضَرَبَ ٱللَّهُ مَثَلًا عَبۡدࣰا مَّمۡلُوكࣰا لَّا یَقۡدِرُ عَلَىٰ شَیۡءࣲ وَمَن رَّزَقۡنَـٰهُ مِنَّا رِزۡقًا حَسَنࣰا فَهُوَ یُنفِقُ مِنۡهُ سِرࣰّا وَجَهۡرًاۖ هَلۡ یَسۡتَوُۥنَۚ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "God propounds [to you] the parable of [two men-] a man enslaved, unable to do anything of his own accord, and a [free] man upon whom We have bestowed goodly sustenance [as a gift] from Ourselves, so that he can spend thereof [at will, both] secretly and openly. Can these [two] be deemed equal? All praise is due to God [alone]: but most of them do not understand it.",
      "ms": "Allah memberikan satu misal perbandingan: Seorang hamba abdi yang menjadi milik orang, yang tidak berkuasa melakukan dengan bebasnya sesuatupun; dan seorang lagi (yang merdeka) yang Kami kurniakan kepadanya pemberian yang baik (harta kekayaan) dari Kami, maka dia pun membelanjakan hartanya dengan bebasnya, sama ada secara bersembunyi atau terbuka, adakah kedua orang itu sama? Segala puji tertentu bagi Allah (dan Allah jualah yang berhak disembah), tetapi kebanyakan mereka (yang musyrik) tidak mengetahui (hakikat tauhid itu).",
      "id": "Allah membuat perumpamaan dengan seorang hamba sahaya yang dimiliki yang tidak dapat bertindak terhadap sesuatupun dan seorang yang Kami beri rezeki yang baik dari Kami, lalu dia menafkahkan sebagian dari rezeki itu secara sembunyi dan secara terang-terangan, adakah mereka itu sama? Segala puji hanya bagi Allah, tetapi kebanyakan mereka tiada mengetahui.",
      "ar": "۞ ضَرَبَ ٱللَّهُ مَثَلًا عَبۡدࣰا مَّمۡلُوكࣰا لَّا یَقۡدِرُ عَلَىٰ شَیۡءࣲ وَمَن رَّزَقۡنَـٰهُ مِنَّا رِزۡقًا حَسَنࣰا فَهُوَ یُنفِقُ مِنۡهُ سِرࣰّا وَجَهۡرًاۖ هَلۡ یَسۡتَوُۥنَۚ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1977,
    "surahId": 16,
    "ayahNumber": 76,
    "arabicText": "وَضَرَبَ ٱللَّهُ مَثَلࣰا رَّجُلَیۡنِ أَحَدُهُمَاۤ أَبۡكَمُ لَا یَقۡدِرُ عَلَىٰ شَیۡءࣲ وَهُوَ كَلٌّ عَلَىٰ مَوۡلَىٰهُ أَیۡنَمَا یُوَجِّههُّ لَا یَأۡتِ بِخَیۡرٍ هَلۡ یَسۡتَوِی هُوَ وَمَن یَأۡمُرُ بِٱلۡعَدۡلِ وَهُوَ عَلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "And God propounds [to you] the parable of two [other] men -one of them dumb, unable to do anything of his own accord, and a sheer burden on his master: to whichever task the latter directs him, he accomplishes no good. Can such a one be considered the equal of [a wise man] who enjoins the doing of what is right and himself follows a straight way?",
      "ms": "Dan Allah memberikan satu misal perbandingan lagi: Dua orang lelaki, salah seorangnya kelu pekak dari semulajadinya, tidak dapat menyatakan apa yang difikirkannya dan tidak dapat mendengar apa yang dikatakan kepadanya; dan ia pula menjadi beban kepada orang yang menjaganya; ke mana sahaja ia diarahkan pergi oleh penjaganya, tak dapatlah dia membawa sesuatu yang berfaedah; adakah dia (yang demikian sifatnya) sama seperti orang (yang boleh berkata-kata serta dapat) menyuruh orang ramai melakukan keadilan, dan ia sendiri pula berada di atas jalan yang lurus (jalan yang benar)?",
      "id": "Dan Allah membuat (pula) perumpamaan: dua orang lelaki yang seorang bisu, tidak dapat berbuat sesuatupun dan dia menjadi beban atas penanggungnya, ke mana saja dia disuruh oleh penanggungnya itu, dia tidak dapat mendatangkan suatu kebajikanpun. Samakah orang itu dengan orang yang menyuruh berbuat keadilan, dan dia berada pula di atas jalan yang lurus?",
      "ar": "وَضَرَبَ ٱللَّهُ مَثَلࣰا رَّجُلَیۡنِ أَحَدُهُمَاۤ أَبۡكَمُ لَا یَقۡدِرُ عَلَىٰ شَیۡءࣲ وَهُوَ كَلٌّ عَلَىٰ مَوۡلَىٰهُ أَیۡنَمَا یُوَجِّههُّ لَا یَأۡتِ بِخَیۡرٍ هَلۡ یَسۡتَوِی هُوَ وَمَن یَأۡمُرُ بِٱلۡعَدۡلِ وَهُوَ عَلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 1978,
    "surahId": 16,
    "ayahNumber": 77,
    "arabicText": "وَلِلَّهِ غَیۡبُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَمَاۤ أَمۡرُ ٱلسَّاعَةِ إِلَّا كَلَمۡحِ ٱلۡبَصَرِ أَوۡ هُوَ أَقۡرَبُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n",
    "translations": {
      "en": "And, God's [alone] is the knowledge of the hidden reality of the heavens and the earth. And so, the advent of the Last Hour will but manifest itself [in a single moment,] like the twinkling of an eye, or closer still: for, behold, God has the power to will anything.",
      "ms": "Dan (ingatlah), Allah jualah yang mengetahui segala rahsia langit dan bumi; tiadalah hal kedatangan hari kiamat itu melainkan seperti sekelip mata, atau ia lebih cepat lagi; sesungguhnya Allah Maha Kuasa atas tiap-tiap sesuatu.",
      "id": "Dan kepunyaan Allah-lah segala apa yang tersembunyi di langit dan di bumi. Tidak adalah kejadian kiamat itu, melainkan seperti sekejap mata atau lebih cepat (lagi). Sesungguhnya Allah Maha Kuasa atas segala sesuatu.",
      "ar": "وَلِلَّهِ غَیۡبُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَمَاۤ أَمۡرُ ٱلسَّاعَةِ إِلَّا كَلَمۡحِ ٱلۡبَصَرِ أَوۡ هُوَ أَقۡرَبُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n"
    }
  },
  {
    "id": 1979,
    "surahId": 16,
    "ayahNumber": 78,
    "arabicText": "وَٱللَّهُ أَخۡرَجَكُم مِّنۢ بُطُونِ أُمَّهَـٰتِكُمۡ لَا تَعۡلَمُونَ شَیۡـࣰٔا وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَـٰرَ وَٱلۡأَفۡـِٔدَةَ لَعَلَّكُمۡ تَشۡكُرُونَ\n",
    "translations": {
      "en": "And God has brought you forth from your mothers' wombs knowing nothing-but He has endowed you with hearing, and sight, and minds, so that you might have cause to be grateful.",
      "ms": "Dan Allah mengeluarkan kamu dari perut ibu kamu dengan keadaan tidak mengetahui sesuatupun; dan dia mengurniakan kepada kamu pendengaran dan penglihatan serta hati akal fikiran); supaya kamu bersyukur.",
      "id": "Dan Allah mengeluarkan kamu dari perut ibumu dalam keadaan tidak mengetahui sesuatupun, dan Dia memberi kamu pendengaran, penglihatan dan hati, agar kamu bersyukur.",
      "ar": "وَٱللَّهُ أَخۡرَجَكُم مِّنۢ بُطُونِ أُمَّهَـٰتِكُمۡ لَا تَعۡلَمُونَ شَیۡـࣰٔا وَجَعَلَ لَكُمُ ٱلسَّمۡعَ وَٱلۡأَبۡصَـٰرَ وَٱلۡأَفۡـِٔدَةَ لَعَلَّكُمۡ تَشۡكُرُونَ\n"
    }
  },
  {
    "id": 1980,
    "surahId": 16,
    "ayahNumber": 79,
    "arabicText": "أَلَمۡ یَرَوۡا۟ إِلَى ٱلطَّیۡرِ مُسَخَّرَ ٰ⁠تࣲ فِی جَوِّ ٱلسَّمَاۤءِ مَا یُمۡسِكُهُنَّ إِلَّا ٱللَّهُۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Have, then, they [who deny the truth] never considered the birds, enabled [by God] to fly in mid-air, with none but God holding them aloft? In this, behold, there are messages indeed for people who will believe!",
      "ms": "Tidakkah mereka memperhatikan burung-burung yang dimudahkan terbang melayang-layang di angkasa? Tiada yang menahan mereka (dari jatuh) melainkan Allah; sesungguhnya pada yang demikian itu, ada tanda-tanda (yang membuktikan kekuasaan Allah) bagi kaum yang beriman.",
      "id": "Tidakkah mereka memperhatikan burung-burung yang dimudahkan terbang diangkasa bebas. Tidak ada yang menahannya selain daripada Allah. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Tuhan) bagi orang-orang yang beriman.",
      "ar": "أَلَمۡ یَرَوۡا۟ إِلَى ٱلطَّیۡرِ مُسَخَّرَ ٰ⁠تࣲ فِی جَوِّ ٱلسَّمَاۤءِ مَا یُمۡسِكُهُنَّ إِلَّا ٱللَّهُۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 1981,
    "surahId": 16,
    "ayahNumber": 80,
    "arabicText": "وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُیُوتِكُمۡ سَكَنࣰا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَـٰمِ بُیُوتࣰا تَسۡتَخِفُّونَهَا یَوۡمَ ظَعۡنِكُمۡ وَیَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَاۤ أَثَـٰثࣰا وَمَتَـٰعًا إِلَىٰ حِینࣲ\n",
    "translations": {
      "en": "And God has given you [the ability to build] your houses as places of rest, and has endowed you with [the skill to make] dwellings out of the skins of animals - easy for you to handle when you travel and when you camp -and [to make] furnishings and goods for temporary use of their [rough] wool and their soft, furry wool and their hair.",
      "ms": "Dan Allah menjadikan bagi kamu rumah-rumah (yang kamu dirikan itu) tempat tinggal; dan Ia menjadikan bagi kamu dari kulit binatang-binatang ternak: khemah-khemah (tempat berteduh), yang kamu mendapatinya ringan (di bawa ke mana-mana) semasa kamu merantau dan semasa kamu berhenti; dan (Ia juga menjadikan bagi kamu) dari berjenis-jenis bulu binatang-binatang ternak itu, berbagai barang perkakas rumah dan perhiasan, (untuk kamu menggunakannya) hingga ke suatu masa.",
      "id": "Dan Allah menjadikan bagimu rumah-rumahmu sebagai tempat tinggal dan Dia menjadikan bagi kamu rumah-rumah (kemah-kemah) dari kulit binatang ternak yang kamu merasa ringan (membawa)nya di waktu kamu berjalan dan waktu kamu bermukim dan (dijadikan-Nya pula) dari bulu domba, bulu unta dan bulu kambing, alat-alat rumah tangga dan perhiasan (yang kamu pakai) sampai waktu (tertentu).",
      "ar": "وَٱللَّهُ جَعَلَ لَكُم مِّنۢ بُیُوتِكُمۡ سَكَنࣰا وَجَعَلَ لَكُم مِّن جُلُودِ ٱلۡأَنۡعَـٰمِ بُیُوتࣰا تَسۡتَخِفُّونَهَا یَوۡمَ ظَعۡنِكُمۡ وَیَوۡمَ إِقَامَتِكُمۡ وَمِنۡ أَصۡوَافِهَا وَأَوۡبَارِهَا وَأَشۡعَارِهَاۤ أَثَـٰثࣰا وَمَتَـٰعًا إِلَىٰ حِینࣲ\n"
    }
  },
  {
    "id": 1982,
    "surahId": 16,
    "ayahNumber": 81,
    "arabicText": "وَٱللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَـٰلࣰا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَـٰنࣰا وَجَعَلَ لَكُمۡ سَرَ ٰ⁠بِیلَ تَقِیكُمُ ٱلۡحَرَّ وَسَرَ ٰ⁠بِیلَ تَقِیكُم بَأۡسَكُمۡۚ كَذَ ٰ⁠لِكَ یُتِمُّ نِعۡمَتَهُۥ عَلَیۡكُمۡ لَعَلَّكُمۡ تُسۡلِمُونَ\n",
    "translations": {
      "en": "And among the many objects of His creation, God has appointed for you [various] means of protection: thus, He has given you in the mountains places of shelter, and has endowed you with [the ability to make] garments to protect you from heat [and cold], as well as such garments as might protect you from your [mutual] violence. In this way does He bestow the full measure of His blessings on you, so that you might surrender yourselves unto Him.",
      "ms": "Dan Allah menjadikan bagi kamu sebahagian dari yang diciptakanNya: benda-benda untuk berteduh, dan Ia menjadikan bagi kamu sebahagian dari gunung-ganang tempat-tempat berlindung; dan Ia juga menjadikan bagi kamu pakaian-pakaian yang memelihara kamu dari panas dan sejuk, juga pakaian-pakaian yang memelihara kamu semasa berjuang. Demikianlah, Ia menyempurnakan nikmatNya kepada kamu, supaya kamu berserah diri kepadaNya dan mematuhi perintahNya.",
      "id": "Dan Allah menjadikan bagimu tempat bernaung dari apa yang telah Dia ciptakan, dan Dia jadikan bagimu tempat-tempat tinggal di gunung-gunung, dan Dia jadikan bagimu pakaian yang memeliharamu dari panas dan pakaian (baju besi) yang memelihara kamu dalam peperangan. Demikianlah Allah menyempurnakan nikmat-Nya atasmu agar kamu berserah diri (kepada-Nya).",
      "ar": "وَٱللَّهُ جَعَلَ لَكُم مِّمَّا خَلَقَ ظِلَـٰلࣰا وَجَعَلَ لَكُم مِّنَ ٱلۡجِبَالِ أَكۡنَـٰنࣰا وَجَعَلَ لَكُمۡ سَرَ ٰ⁠بِیلَ تَقِیكُمُ ٱلۡحَرَّ وَسَرَ ٰ⁠بِیلَ تَقِیكُم بَأۡسَكُمۡۚ كَذَ ٰ⁠لِكَ یُتِمُّ نِعۡمَتَهُۥ عَلَیۡكُمۡ لَعَلَّكُمۡ تُسۡلِمُونَ\n"
    }
  },
  {
    "id": 1983,
    "surahId": 16,
    "ayahNumber": 82,
    "arabicText": "فَإِن تَوَلَّوۡا۟ فَإِنَّمَا عَلَیۡكَ ٱلۡبَلَـٰغُ ٱلۡمُبِینُ\n",
    "translations": {
      "en": "BUT IF they turn away [from thee, O Prophet, remember that] thy only duty is a clear delivery of the message [entrusted to thee].",
      "ms": "Kemudian, jika mereka masih berpaling ingkar maka sesungguhnya engkau (wahai Muhammad) hanya bertanggungjawab menyampaikan perintah-perintah Allah dengan cara yang jelas nyata.",
      "id": "Jika mereka tetap berpaling, maka sesungguhnya kewajiban yang dibebankan atasmu (Muhammad) hanyalah menyampaikan (amanat Allah) dengan terang.",
      "ar": "فَإِن تَوَلَّوۡا۟ فَإِنَّمَا عَلَیۡكَ ٱلۡبَلَـٰغُ ٱلۡمُبِینُ\n"
    }
  },
  {
    "id": 1984,
    "surahId": 16,
    "ayahNumber": 83,
    "arabicText": "یَعۡرِفُونَ نِعۡمَتَ ٱللَّهِ ثُمَّ یُنكِرُونَهَا وَأَكۡثَرُهُمُ ٱلۡكَـٰفِرُونَ\n",
    "translations": {
      "en": "They [who turn away from it] are fully aware of God's blessings, but none the less they refuse to acknowledge them [as such], since most of them are given to denying the truth.",
      "ms": "Mereka mengetahui nikmat Allah (yang melimpah-limpah itu), kemudian mereka tergamak mengingkarinya; dan kebanyakan mereka pula ialah orang-orang yang kufur ingkar.",
      "id": "Mereka mengetahui nikmat Allah, kemudian mereka mengingkarinya dan kebanyakan mereka adalah orang-orang yang kafir.",
      "ar": "یَعۡرِفُونَ نِعۡمَتَ ٱللَّهِ ثُمَّ یُنكِرُونَهَا وَأَكۡثَرُهُمُ ٱلۡكَـٰفِرُونَ\n"
    }
  },
  {
    "id": 1985,
    "surahId": 16,
    "ayahNumber": 84,
    "arabicText": "وَیَوۡمَ نَبۡعَثُ مِن كُلِّ أُمَّةࣲ شَهِیدࣰا ثُمَّ لَا یُؤۡذَنُ لِلَّذِینَ كَفَرُوا۟ وَلَا هُمۡ یُسۡتَعۡتَبُونَ\n",
    "translations": {
      "en": "But one Day We shall raise up a witness out of every community, whereupon they who were bent on denying the truth will not be allowed to plead [ignorance], and neither will they be allowed to make amends.",
      "ms": "Dan (ingatkanlah kepada mereka yang musyrik tentang) hari Kami bangkitkan dari tiap-tiap umat, seorang saksi; kemudian tidak diizinkan bagi orang-orang yang kafir (memberi sebarang alasan), dan mereka pula tidak diminta memohon keredaan Allah.",
      "id": "Dan (ingatlah) akan hari (ketika) Kami bangkitkan dari tiap-tiap umat seorang saksi (rasul), kemudian tidak diizinkan kepada orang-orang yang kafir (untuk membela diri) dan tidak (pula) mereka dibolehkan meminta maaf.",
      "ar": "وَیَوۡمَ نَبۡعَثُ مِن كُلِّ أُمَّةࣲ شَهِیدࣰا ثُمَّ لَا یُؤۡذَنُ لِلَّذِینَ كَفَرُوا۟ وَلَا هُمۡ یُسۡتَعۡتَبُونَ\n"
    }
  },
  {
    "id": 1986,
    "surahId": 16,
    "ayahNumber": 85,
    "arabicText": "وَإِذَا رَءَا ٱلَّذِینَ ظَلَمُوا۟ ٱلۡعَذَابَ فَلَا یُخَفَّفُ عَنۡهُمۡ وَلَا هُمۡ یُنظَرُونَ\n",
    "translations": {
      "en": "And when they who were bent on evildoing behold the suffering [that awaits them, they will realize that] it will not be lightened for them [by virtue of their pleading]; and neither will they be granted respite.",
      "ms": "Dan apabila orang-orang yang melakukan kezaliman (dengan kekufurannya) itu melihat azab, maka tidak akan diringankan azab itu daripada mereka, dan mereka pula tidak diberi tempoh.",
      "id": "Dan apabila orang-orang zalim telah menyaksikan azab, maka tidaklah diringankan azab bagi mereka dan tidak puIa mereka diberi tangguh.",
      "ar": "وَإِذَا رَءَا ٱلَّذِینَ ظَلَمُوا۟ ٱلۡعَذَابَ فَلَا یُخَفَّفُ عَنۡهُمۡ وَلَا هُمۡ یُنظَرُونَ\n"
    }
  },
  {
    "id": 1987,
    "surahId": 16,
    "ayahNumber": 86,
    "arabicText": "وَإِذَا رَءَا ٱلَّذِینَ أَشۡرَكُوا۟ شُرَكَاۤءَهُمۡ قَالُوا۟ رَبَّنَا هَـٰۤؤُلَاۤءِ شُرَكَاۤؤُنَا ٱلَّذِینَ كُنَّا نَدۡعُوا۟ مِن دُونِكَۖ فَأَلۡقَوۡا۟ إِلَیۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَـٰذِبُونَ\n",
    "translations": {
      "en": "And when they who were wont to ascribe divinity to beings other than God behold [on Judgment Day] those beings to whom they were wont to ascribe a share in His divinity, they will exclaim: \"O our Sustainer! These are the beings to whom we ascribed a share in Thy divinity, and whom we were wont to invoke instead of Thee!\" -whereupon [those beings] will fling at them the retort: \"Behold, you have indeed been lying [to yourselves]!\"",
      "ms": "Dan apabila orang-orang musyrik melihat makhluk-makhluk dan benda-benda yang mereka jadikan sekutu-sekutu Allah, mereka berkata: \"Wahai Tuhan kami, inilah dia yang kami jadikan sekutu-sekutu (bagiMu), yang kami sembah mereka dengan meninggalkanMu\". Maka dengan serta-merta makhluk-makhluk yang puja itu menolak dakwaan mereka dengan berkata: \"Sesungguhnya kamu adalah berdusta\".",
      "id": "Dan apabila orang-orang yang mempersekutukan (Allah) melihat sekutu-sekutu mereka, mereka berkata: \"Ya Tuhan kami mereka inilah sekutu-sekutu kami yang dahulu kami sembah selain dari Engkau\". Lalu sekutu-sekutu mereka mengatakan kepada mereka: \"Sesungguhnya kamu benar-benar orang-orang yang dusta\".",
      "ar": "وَإِذَا رَءَا ٱلَّذِینَ أَشۡرَكُوا۟ شُرَكَاۤءَهُمۡ قَالُوا۟ رَبَّنَا هَـٰۤؤُلَاۤءِ شُرَكَاۤؤُنَا ٱلَّذِینَ كُنَّا نَدۡعُوا۟ مِن دُونِكَۖ فَأَلۡقَوۡا۟ إِلَیۡهِمُ ٱلۡقَوۡلَ إِنَّكُمۡ لَكَـٰذِبُونَ\n"
    }
  },
  {
    "id": 1988,
    "surahId": 16,
    "ayahNumber": 87,
    "arabicText": "وَأَلۡقَوۡا۟ إِلَى ٱللَّهِ یَوۡمَىِٕذٍ ٱلسَّلَمَۖ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n",
    "translations": {
      "en": "And on that Day will they [who had thus been sinning, belatedly] proffer their surrender to God; and all their false imagery will have forsaken them.",
      "ms": "Dan pada hari itu mereka semua menyerah diri bulat-bulat kepada Allah, dan hilang lenyaplah dari mereka (yang musyrik itu) apa yang telah mereka ada-adakan (sebagai sekutu-sekutu Allah).",
      "id": "Dan mereka menyatakan ketundukannya kepada Allah pada hari itu dan hilanglah dari mereka apa yang selalu mereka ada-adakan.",
      "ar": "وَأَلۡقَوۡا۟ إِلَى ٱللَّهِ یَوۡمَىِٕذٍ ٱلسَّلَمَۖ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n"
    }
  },
  {
    "id": 1989,
    "surahId": 16,
    "ayahNumber": 88,
    "arabicText": "ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ زِدۡنَـٰهُمۡ عَذَابࣰا فَوۡقَ ٱلۡعَذَابِ بِمَا كَانُوا۟ یُفۡسِدُونَ\n",
    "translations": {
      "en": "Upon all who were bent on denying the truth and who turned others away from the path of God will We heap suffering upon suffering in return for all the corruption that they wrought:",
      "ms": "Orang-orang yang kafir dan menghalangi (dirinya serta orang lain) dari jalan Allah, Kami tambahi mereka azab seksa di samping azab (yang menimpa mereka), disebabkan mereka membuat kerosakan.",
      "id": "Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Kami tambahkan kepada mereka siksaan di atas siksaan disebabkan mereka selalu berbuat kerusakan.",
      "ar": "ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ زِدۡنَـٰهُمۡ عَذَابࣰا فَوۡقَ ٱلۡعَذَابِ بِمَا كَانُوا۟ یُفۡسِدُونَ\n"
    }
  },
  {
    "id": 1990,
    "surahId": 16,
    "ayahNumber": 89,
    "arabicText": "وَیَوۡمَ نَبۡعَثُ فِی كُلِّ أُمَّةࣲ شَهِیدًا عَلَیۡهِم مِّنۡ أَنفُسِهِمۡۖ وَجِئۡنَا بِكَ شَهِیدًا عَلَىٰ هَـٰۤؤُلَاۤءِۚ وَنَزَّلۡنَا عَلَیۡكَ ٱلۡكِتَـٰبَ تِبۡیَـٰنࣰا لِّكُلِّ شَیۡءࣲ وَهُدࣰى وَرَحۡمَةࣰ وَبُشۡرَىٰ لِلۡمُسۡلِمِینَ\n",
    "translations": {
      "en": "for one Day We shall raise up within every community a witness against them from among themselves. And thee [too, O Prophet,] have We brought forth to bear witness regarding those [whom thy message may have reached], inasmuch as We have bestowed from on high upon thee, step by step, this divine writ, to make everything clear, and to provide guidance and grace and a glad tiding unto all who have surrendered themselves to God.",
      "ms": "Dan (ingatkanlah tentang) hari Kami bangkitkan dalam kalangan tiap-tiap umat, seorang saksi terhadap mereka, dari golongan mereka sendiri; dan Kami datangkanmu (wahai Muhammad) untuk menjadi saksi terhadap mereka ini (umatmu); dan Kami turunkan kepadamu Al-Quran menjelaskan tiap-tiap sesuatu dan menjadi hidayah petunjuk, serta membawa rahmat dan berita yang mengembirakan, bagi orang-orang Islam.",
      "id": "(Dan ingatlah) akan hari (ketika) Kami bangkitkan pada tiap-tiap umat seorang saksi atas mereka dari mereka sendiri dan Kami datangkan kamu (Muhammad) menjadi saksi atas seluruh umat manusia. Dan Kami turunkan kepadamu Al Kitab (Al Quran) untuk menjelaskan segala sesuatu dan petunjuk serta rahmat dan kabar gembira bagi orang-orang yang berserah diri.",
      "ar": "وَیَوۡمَ نَبۡعَثُ فِی كُلِّ أُمَّةࣲ شَهِیدًا عَلَیۡهِم مِّنۡ أَنفُسِهِمۡۖ وَجِئۡنَا بِكَ شَهِیدًا عَلَىٰ هَـٰۤؤُلَاۤءِۚ وَنَزَّلۡنَا عَلَیۡكَ ٱلۡكِتَـٰبَ تِبۡیَـٰنࣰا لِّكُلِّ شَیۡءࣲ وَهُدࣰى وَرَحۡمَةࣰ وَبُشۡرَىٰ لِلۡمُسۡلِمِینَ\n"
    }
  },
  {
    "id": 1991,
    "surahId": 16,
    "ayahNumber": 90,
    "arabicText": "۞ إِنَّ ٱللَّهَ یَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَـٰنِ وَإِیتَاۤىِٕ ذِی ٱلۡقُرۡبَىٰ وَیَنۡهَىٰ عَنِ ٱلۡفَحۡشَاۤءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡیِۚ یَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ\n",
    "translations": {
      "en": "BEHOLD, God enjoins justice, and the doing of good, and generosity towards [one's] fellow-men; and He forbids all that is shameful and all that runs counter to reason, as well as envy; [and] He exhorts you [repeatedly] so that you might bear [all this] in mind.",
      "ms": "Sesungguhnya Allah menyuruh berlaku adil, dan berbuat kebaikan, serta memberi bantuan kepada kaum kerabat; dan melarang daripada melakukan perbuatan-perbuatan yang keji dan mungkar serta kezaliman. Ia mengajar kamu (dengan suruhan dan laranganNya ini), supaya kamu mengambil peringatan mematuhiNya.",
      "id": "Sesungguhnya Allah menyuruh (kamu) berlaku adil dan berbuat kebajikan, memberi kepada kaum kerabat, dan Allah melarang dari perbuatan keji, kemungkaran dan permusuhan. Dia memberi pengajaran kepadamu agar kamu dapat mengambil pelajaran.",
      "ar": "۞ إِنَّ ٱللَّهَ یَأۡمُرُ بِٱلۡعَدۡلِ وَٱلۡإِحۡسَـٰنِ وَإِیتَاۤىِٕ ذِی ٱلۡقُرۡبَىٰ وَیَنۡهَىٰ عَنِ ٱلۡفَحۡشَاۤءِ وَٱلۡمُنكَرِ وَٱلۡبَغۡیِۚ یَعِظُكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ\n"
    }
  },
  {
    "id": 1992,
    "surahId": 16,
    "ayahNumber": 91,
    "arabicText": "وَأَوۡفُوا۟ بِعَهۡدِ ٱللَّهِ إِذَا عَـٰهَدتُّمۡ وَلَا تَنقُضُوا۟ ٱلۡأَیۡمَـٰنَ بَعۡدَ تَوۡكِیدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَیۡكُمۡ كَفِیلًاۚ إِنَّ ٱللَّهَ یَعۡلَمُ مَا تَفۡعَلُونَ\n",
    "translations": {
      "en": "And be true to your bond with God whenever you bind yourselves by a pledge, and do not break [your] oaths after having [freely] confirmed them and having called upon God to be witness to your good faith: behold, God knows all that you do.",
      "ms": "Dan sempurnakanlah pesanan-pesanan dan perintah-perintah Allah apabila kamu berjanji; dan janganlah kamu merombak (mencabuli) sumpah kamu sesudah kamu menguatkannya (dengan nama Allah), sedang kamu telah menjadikan Allah sebagai Penjamin kebaikan kamu; sesungguhnya Allah sedia mengetahui akan apa yang kamu lakukan.",
      "id": "Dan tepatilah perjanjian dengan Allah apabila kamu berjanji dan janganlah kamu membatalkan sumpah-sumpah(mu) itu, sesudah meneguhkannya, sedang kamu telah menjadikan Allah sebagai saksimu (terhadap sumpah-sumpahmu itu). Sesungguhnya Allah mengetahui apa yang kamu perbuat.",
      "ar": "وَأَوۡفُوا۟ بِعَهۡدِ ٱللَّهِ إِذَا عَـٰهَدتُّمۡ وَلَا تَنقُضُوا۟ ٱلۡأَیۡمَـٰنَ بَعۡدَ تَوۡكِیدِهَا وَقَدۡ جَعَلۡتُمُ ٱللَّهَ عَلَیۡكُمۡ كَفِیلًاۚ إِنَّ ٱللَّهَ یَعۡلَمُ مَا تَفۡعَلُونَ\n"
    }
  },
  {
    "id": 1993,
    "surahId": 16,
    "ayahNumber": 92,
    "arabicText": "وَلَا تَكُونُوا۟ كَٱلَّتِی نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَـٰثࣰا تَتَّخِذُونَ أَیۡمَـٰنَكُمۡ دَخَلَۢا بَیۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِیَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا یَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَیُبَیِّنَنَّ لَكُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ مَا كُنتُمۡ فِیهِ تَخۡتَلِفُونَ\n",
    "translations": {
      "en": "Hence, be not like her who breaks and completely untwists the yarn which she [herself] has spun and made strong-[be not like this by] using your oaths as a means of deceiving one another, simply because some of you may be more powerful than others.\" By all this, God but puts you to a test-and [He does it] so that on Resurrection Day He might make clear unto you all that on which you were wont to differ.",
      "ms": "Dan janganlah kamu menjadi seperti perempuan yang telah merombak satu persatu benda yang dipintalnya, sesudah ia selesai memintalnya kuat teguh; dengan kamu menjadikan sumpah kamu sebagai tipu daya (untuk mencabuli perjanjian yang telah dimeteraikan) sesama kamu, disebabkan adanya satu golongan yang lebih ramai dari golongan lain. Sesungguhnya Allah hanya mahu menguji kamu dengan yang demikian itu; dan Ia sudah tentu akan menerangkan kepada kamu, pada hari kiamat, apa yang kamu berselisihan padanya.",
      "id": "Dan janganlah kamu seperti seorang perempuan yang menguraikan benangnya yang sudah dipintal dengan kuat, menjadi cerai berai kembali, kamu menjadikan sumpah (perjanjian)mu sebagai alat penipu di antaramu, disebabkan adanya satu golongan yang lebih banyak jumlahnya dari golongan yang lain. Sesungguhnya Allah hanya menguji kamu dengan hal itu. Dan sesungguhnya di hari kiamat akan dijelaskan-Nya kepadamu apa yang dahulu kamu perselisihkan itu.",
      "ar": "وَلَا تَكُونُوا۟ كَٱلَّتِی نَقَضَتۡ غَزۡلَهَا مِنۢ بَعۡدِ قُوَّةٍ أَنكَـٰثࣰا تَتَّخِذُونَ أَیۡمَـٰنَكُمۡ دَخَلَۢا بَیۡنَكُمۡ أَن تَكُونَ أُمَّةٌ هِیَ أَرۡبَىٰ مِنۡ أُمَّةٍۚ إِنَّمَا یَبۡلُوكُمُ ٱللَّهُ بِهِۦۚ وَلَیُبَیِّنَنَّ لَكُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ مَا كُنتُمۡ فِیهِ تَخۡتَلِفُونَ\n"
    }
  },
  {
    "id": 1994,
    "surahId": 16,
    "ayahNumber": 93,
    "arabicText": "وَلَوۡ شَاۤءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةࣰ وَ ٰ⁠حِدَةࣰ وَلَـٰكِن یُضِلُّ مَن یَشَاۤءُ وَیَهۡدِی مَن یَشَاۤءُۚ وَلَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَعۡمَلُونَ\n",
    "translations": {
      "en": "For, had God so willed, He could surely have made you all one single community; however, He lets go astray him that wills [to go astray], and guides aright him that wills [to be guided]; and you will surely be called to account for all that you ever did!",
      "ms": "Dan jika Allah menghendaki, tentulah Dia menjadikan kamu satu umat (yang bersatu dalam ugama Allah yang satu); akan tetapi Allah menyesatkan sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya) dan memberi petunjuk kepada sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya); dan sesungguhnya kamu akan ditanya kelak tentang apa yang kamu telah kerjakan.",
      "id": "Dan kalau Allah menghendaki, niscaya Dia menjadikan kamu satu umat (saja), tetapi Allah menyesatkan siapa yang dikehendaki-Nya dan memberi petunjuk kepada siapa yang dikehendaki-Nya. Dan sesungguhnya kamu akan ditanya tentang apa yang telah kamu kerjakan.",
      "ar": "وَلَوۡ شَاۤءَ ٱللَّهُ لَجَعَلَكُمۡ أُمَّةࣰ وَ ٰ⁠حِدَةࣰ وَلَـٰكِن یُضِلُّ مَن یَشَاۤءُ وَیَهۡدِی مَن یَشَاۤءُۚ وَلَتُسۡـَٔلُنَّ عَمَّا كُنتُمۡ تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1995,
    "surahId": 16,
    "ayahNumber": 94,
    "arabicText": "وَلَا تَتَّخِذُوۤا۟ أَیۡمَـٰنَكُمۡ دَخَلَۢا بَیۡنَكُمۡ فَتَزِلَّ قَدَمُۢ بَعۡدَ ثُبُوتِهَا وَتَذُوقُوا۟ ٱلسُّوۤءَ بِمَا صَدَدتُّمۡ عَن سَبِیلِ ٱللَّهِ وَلَكُمۡ عَذَابٌ عَظِیمࣱ\n",
    "translations": {
      "en": "And do not use your oaths as a means of deceiving one another-or else [your] foot will slip after having been firm, and then you will have to taste the evil [consequences] of your having turned away from the path of God, with tremendous suffering awaiting you [in the life to come].",
      "ms": "Dan janganlah kamu jadikan sumpah kamu sebagai tipu daya sesama kamu, kerana dengan yang demikian itu akan menyebabkan tergelincir kaki kamu sesudah ia tetap teguh (di atas jalan yang benar); dan kamu pula akan merasai balasan buruk (di dunia) dengan sebab kamu menghalangi manusia dari jalan Allah; dan bagi kamu juga disediakan azab yang besar (di akhirat kelak).",
      "id": "Dan janganlah kamu jadikan sumpah-sumpahmu sebagai alat penipu di antaramu, yang menyebabkan tergelincir kaki(mu) sesudah kokoh tegaknya, dan kamu rasakan kemelaratan (di dunia) karena kamu menghalangi (manusia) dari jalan Allah; dan bagimu azab yang besar.",
      "ar": "وَلَا تَتَّخِذُوۤا۟ أَیۡمَـٰنَكُمۡ دَخَلَۢا بَیۡنَكُمۡ فَتَزِلَّ قَدَمُۢ بَعۡدَ ثُبُوتِهَا وَتَذُوقُوا۟ ٱلسُّوۤءَ بِمَا صَدَدتُّمۡ عَن سَبِیلِ ٱللَّهِ وَلَكُمۡ عَذَابٌ عَظِیمࣱ\n"
    }
  },
  {
    "id": 1996,
    "surahId": 16,
    "ayahNumber": 95,
    "arabicText": "وَلَا تَشۡتَرُوا۟ بِعَهۡدِ ٱللَّهِ ثَمَنࣰا قَلِیلًاۚ إِنَّمَا عِندَ ٱللَّهِ هُوَ خَیۡرࣱ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ\n",
    "translations": {
      "en": "Hence, do not barter away your bond with God for a trifling gain! Verily, that which is with God is by far the best for you, if you but knew it:",
      "ms": "Dan janganlah kamu jadikan pesanan-pesanan dan perintah Allah sebagai modal untuk mendapat keuntungan dunia yang sedikit; sesugguhnya apa yang ada di sisi Allah (dari balasan yang baik), itulah sahaja yang lebih baik bagi kamu, kalaulah kamu mengetahui.",
      "id": "Dan janganlah kamu tukar perjanjianmu dengan Allah dengan harga yang sedikit (murah), sesungguhnya apa yang ada di sisi Allah, itulah yang lebih baik bagimu jika kamu mengetahui.",
      "ar": "وَلَا تَشۡتَرُوا۟ بِعَهۡدِ ٱللَّهِ ثَمَنࣰا قَلِیلًاۚ إِنَّمَا عِندَ ٱللَّهِ هُوَ خَیۡرࣱ لَّكُمۡ إِن كُنتُمۡ تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1997,
    "surahId": 16,
    "ayahNumber": 96,
    "arabicText": "مَا عِندَكُمۡ یَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقࣲۗ وَلَنَجۡزِیَنَّ ٱلَّذِینَ صَبَرُوۤا۟ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "all that is with you is bound to come to an end, whereas that which is with God is everlasting. And most certainly shall We grant unto those who are patient in adversity their reward in accordance with the best that they ever did.",
      "ms": "(Sebenarnya) apa yang ada pada kamu akan habis dan hilang lenyap, dan apa yang ada di sisi Allah tetap kekal; dan sesungguhnya Kami membalas orang-orang sabar dengan memberikan pahala yang lebih baik dari apa yang mereka telah kerjakan.",
      "id": "Apa yang di sisimu akan lenyap, dan apa yang ada di sisi Allah adalah kekal. Dan sesungguhnya Kami akan memberi balasan kepada orang-orang yang sabar dengan pahala yang lebih baik dari apa yang telah mereka kerjakan.",
      "ar": "مَا عِندَكُمۡ یَنفَدُ وَمَا عِندَ ٱللَّهِ بَاقࣲۗ وَلَنَجۡزِیَنَّ ٱلَّذِینَ صَبَرُوۤا۟ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1998,
    "surahId": 16,
    "ayahNumber": 97,
    "arabicText": "مَنۡ عَمِلَ صَـٰلِحࣰا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَلَنُحۡیِیَنَّهُۥ حَیَوٰةࣰ طَیِّبَةࣰۖ وَلَنَجۡزِیَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "As for anyone - be it man or woman - who does righteous deeds, and is a believer withal - him shall We most certainly cause to live a good life. and most certainly shall We grant unto such as these their reward in accordance with the best that they ever did.",
      "ms": "Sesiapa yang beramal soleh, dari lelaki atau perempuan, sedang ia beriman, maka sesungguhnya Kami akan menghidupkan dia dengan kehidupan yang baik; dan sesungguhnya kami akan membalas mereka, dengan memberikan pahala yang lebih dari apa yang mereka telah kerjakan.",
      "id": "Barangsiapa yang mengerjakan amal saleh, baik laki-laki maupun perempuan dalam keadaan beriman, maka sesungguhnya akan Kami berikan kepadanya kehidupan yang baik dan sesungguhnya akan Kami beri balasan kepada mereka dengan pahala yang lebih baik dari apa yang telah mereka kerjakan.",
      "ar": "مَنۡ عَمِلَ صَـٰلِحࣰا مِّن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَلَنُحۡیِیَنَّهُۥ حَیَوٰةࣰ طَیِّبَةࣰۖ وَلَنَجۡزِیَنَّهُمۡ أَجۡرَهُم بِأَحۡسَنِ مَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1999,
    "surahId": 16,
    "ayahNumber": 98,
    "arabicText": "فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّیۡطَـٰنِ ٱلرَّجِیمِ\n",
    "translations": {
      "en": "NOW whenever thou happen to read this Qur'an, seek refuge with God from Satan, the accursed.",
      "ms": "Oleh itu, apabila engkau membaca Al-Quran, maka hendaklah engkau terlebih dahulu) memohon perlindungan kepada Allah dari hasutan Syaitan yang kena rejam.",
      "id": "Apabila kamu membaca Al Quran hendaklah kamu meminta perlindungan kepada Allah dari syaitan yang terkutuk.",
      "ar": "فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ فَٱسۡتَعِذۡ بِٱللَّهِ مِنَ ٱلشَّیۡطَـٰنِ ٱلرَّجِیمِ\n"
    }
  },
  {
    "id": 2000,
    "surahId": 16,
    "ayahNumber": 99,
    "arabicText": "إِنَّهُۥ لَیۡسَ لَهُۥ سُلۡطَـٰنٌ عَلَى ٱلَّذِینَ ءَامَنُوا۟ وَعَلَىٰ رَبِّهِمۡ یَتَوَكَّلُونَ\n",
    "translations": {
      "en": "Behold, he has no power over those who have attained to faith and in their Sustainer place their tray trust:",
      "ms": "Sesungguhnya Syaitan itu tidak mempunyai sebarang pengaruh terhadap orang-orang yang beriman dan yang berserah bulat-bulat kepada Tuhan mereka.",
      "id": "Sesungguhnya syaitan itu tidak ada kekuasaannya atas orang-orang yang beriman dan bertawakkal kepada Tuhannya.",
      "ar": "إِنَّهُۥ لَیۡسَ لَهُۥ سُلۡطَـٰنٌ عَلَى ٱلَّذِینَ ءَامَنُوا۟ وَعَلَىٰ رَبِّهِمۡ یَتَوَكَّلُونَ\n"
    }
  },
  {
    "id": 2001,
    "surahId": 16,
    "ayahNumber": 100,
    "arabicText": "إِنَّمَا سُلۡطَـٰنُهُۥ عَلَى ٱلَّذِینَ یَتَوَلَّوۡنَهُۥ وَٱلَّذِینَ هُم بِهِۦ مُشۡرِكُونَ\n",
    "translations": {
      "en": "he has power only over those who are willing to follow him, and who [thus] ascribe to him a share in God's divinity.",
      "ms": "Sesungguhnya pengaruh Syaitan itu hanyalah terhadap orang-orang yang menjadikan dia pemimpin mereka, dan orang-orang yang dengan sebab hasutannya melakukan syirik kepada Allah.",
      "id": "Sesungguhnya kekuasaannya (syaitan) hanyalah atas orang-orang yang mengambilnya jadi pemimpin dan atas orang-orang yang mempersekutukannya dengan Allah.",
      "ar": "إِنَّمَا سُلۡطَـٰنُهُۥ عَلَى ٱلَّذِینَ یَتَوَلَّوۡنَهُۥ وَٱلَّذِینَ هُم بِهِۦ مُشۡرِكُونَ\n"
    }
  },
  {
    "id": 2002,
    "surahId": 16,
    "ayahNumber": 101,
    "arabicText": "وَإِذَا بَدَّلۡنَاۤ ءَایَةࣰ مَّكَانَ ءَایَةࣲ وَٱللَّهُ أَعۡلَمُ بِمَا یُنَزِّلُ قَالُوۤا۟ إِنَّمَاۤ أَنتَ مُفۡتَرِۭۚ بَلۡ أَكۡثَرُهُمۡ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "And now that We replace one message by another -since God is fully aware of what He bestows from on high, step by step - they [who deny the truth] are wont to say, \"Thou but inventest it!\" Nay, but most of them do not understand it!",
      "ms": "Dan apabila Kami tukarkan satu ayat (Al-Quran) untuk menggantikan ayat yang lain (yang dimansukhkan), dan Allah memang mengetahui akan apa yang Ia turunkan, - berkatalah mereka (yang kafir): \"Sesungguhnya engkau (wahai Muhammad) hanyalah seorang pendusta\"; (padahal Nabi Muhammad tidak berdusta) bahkan kebanyakan mereka tidak mengetahui hakikat yang sebenarnya.",
      "id": "Dan apabila Kami letakkan suatu ayat di tempat ayat yang lain sebagai penggantinya padahal Allah lebih mengetahui apa yang diturunkan-Nya, mereka berkata: \"Sesungguhnya kamu adalah orang yang mengada-adakan saja\". Bahkan kebanyakan mereka tiada mengetahui.",
      "ar": "وَإِذَا بَدَّلۡنَاۤ ءَایَةࣰ مَّكَانَ ءَایَةࣲ وَٱللَّهُ أَعۡلَمُ بِمَا یُنَزِّلُ قَالُوۤا۟ إِنَّمَاۤ أَنتَ مُفۡتَرِۭۚ بَلۡ أَكۡثَرُهُمۡ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 2003,
    "surahId": 16,
    "ayahNumber": 102,
    "arabicText": "قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِیُثَبِّتَ ٱلَّذِینَ ءَامَنُوا۟ وَهُدࣰى وَبُشۡرَىٰ لِلۡمُسۡلِمِینَ\n",
    "translations": {
      "en": "Say: \"Holy inspiration has brought it down from thy Sustainer by stages, setting forth the truth, so that it might give firmness unto those who have attained to faith, and provide guidance and a glad tiding unto all who have surrendered themselves to God.\"",
      "ms": "Katakanlah (wahai Muhammad): Al-Quran itu diturunkan oleh Ruhul Qudus (Jibril) dari Tuhanmu dengan cara yang sungguh layak dan berhikmat, untuk meneguhkan iman orang-orang yang beriman, dan untuk menjadi hidayah petunjuk serta berita yang mengembirakan bagi orang-orang Islam.",
      "id": "Katakanlah: \"Ruhul Qudus (Jibril) menurunkan Al Quran itu dari Tuhanmu dengan benar, untuk meneguhkan (hati) orang-orang yang telah beriman, dan menjadi petunjuk serta kabar gembira bagi orang-orang yang berserah diri (kepada Allah)\".",
      "ar": "قُلۡ نَزَّلَهُۥ رُوحُ ٱلۡقُدُسِ مِن رَّبِّكَ بِٱلۡحَقِّ لِیُثَبِّتَ ٱلَّذِینَ ءَامَنُوا۟ وَهُدࣰى وَبُشۡرَىٰ لِلۡمُسۡلِمِینَ\n"
    }
  },
  {
    "id": 2004,
    "surahId": 16,
    "ayahNumber": 103,
    "arabicText": "وَلَقَدۡ نَعۡلَمُ أَنَّهُمۡ یَقُولُونَ إِنَّمَا یُعَلِّمُهُۥ بَشَرࣱۗ لِّسَانُ ٱلَّذِی یُلۡحِدُونَ إِلَیۡهِ أَعۡجَمِیࣱّ وَهَـٰذَا لِسَانٌ عَرَبِیࣱّ مُّبِینٌ\n",
    "translations": {
      "en": "And, indeed, full well do We know that they say, \"It is but a human being that imparts [all] this to him! -[notwithstanding that] the tongue of him to whom they so maliciously point is wholly outlandish, whereas this is Arabic speech, clear [in itself] and clearly showing the truth [of its source].",
      "ms": "Dan demi sesungguhnya Kami mengetahui, bahawa mereka yang musyrik itu berkata: \" Sebenarnya dia diajar oleh seorang manusia\". (Padahal) bahasa orang yang mereka sandarkan tuduhan kepadanya itu ialah bahasa asing, sedang Al-Quran ini berbahasa Arab yang fasih nyata.",
      "id": "Dan sesungguhnya Kami mengetahui bahwa mereka berkata: \"Sesungguhnya Al Quran itu diajarkan oleh seorang manusia kepadanya (Muhammad)\". Padahal bahasa orang yang mereka tuduhkan (bahwa) Muhammad belajar kepadanya bahasa 'Ajam, sedang Al Quran adalah dalam bahasa Arab yang terang.",
      "ar": "وَلَقَدۡ نَعۡلَمُ أَنَّهُمۡ یَقُولُونَ إِنَّمَا یُعَلِّمُهُۥ بَشَرࣱۗ لِّسَانُ ٱلَّذِی یُلۡحِدُونَ إِلَیۡهِ أَعۡجَمِیࣱّ وَهَـٰذَا لِسَانٌ عَرَبِیࣱّ مُّبِینٌ\n"
    }
  },
  {
    "id": 2005,
    "surahId": 16,
    "ayahNumber": 104,
    "arabicText": "إِنَّ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِـَٔایَـٰتِ ٱللَّهِ لَا یَهۡدِیهِمُ ٱللَّهُ وَلَهُمۡ عَذَابٌ أَلِیمٌ\n",
    "translations": {
      "en": "Verily, as for those who will not believe in God's messages, God does not guide them aright; and grievous suffering will be their lot [in the life to come].",
      "ms": "Sesungguhnya orang-orang yang tidak beriman kepada ayat-ayat Allah, Allah tidak akan memberi hidayah petunjuk kepada mereka, dan mereka pula beroleh azab yang tidak terperi sakitnya.",
      "id": "Sesungguhnya orang-orang yang tidak beriman kepada ayat-ayat Allah (Al Quran), Allah tidak akan memberi petunjuk kepada mereka dan bagi mereka azab yang pedih.",
      "ar": "إِنَّ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِـَٔایَـٰتِ ٱللَّهِ لَا یَهۡدِیهِمُ ٱللَّهُ وَلَهُمۡ عَذَابٌ أَلِیمٌ\n"
    }
  },
  {
    "id": 2006,
    "surahId": 16,
    "ayahNumber": 105,
    "arabicText": "إِنَّمَا یَفۡتَرِی ٱلۡكَذِبَ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِـَٔایَـٰتِ ٱللَّهِۖ وَأُو۟لَـٰۤىِٕكَ هُمُ ٱلۡكَـٰذِبُونَ\n",
    "translations": {
      "en": "It is but they who will not believe in God's messages that invent this falsehood; and it is they, they who are lying!",
      "ms": "Sebenarnya yang tergamak berdusta itu hanyalah orang-orang yang tidak beriman kepada ayat-ayat Allah, dan mereka itu ialah orang-orang yang bertabikat berdusta.",
      "id": "Sesungguhnya yang mengada-adakan kebohongan, hanyalah orang-orang yang tidak beriman kepada ayat-ayat Allah, dan mereka itulah orang-orang pendusta.",
      "ar": "إِنَّمَا یَفۡتَرِی ٱلۡكَذِبَ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِـَٔایَـٰتِ ٱللَّهِۖ وَأُو۟لَـٰۤىِٕكَ هُمُ ٱلۡكَـٰذِبُونَ\n"
    }
  },
  {
    "id": 2007,
    "surahId": 16,
    "ayahNumber": 106,
    "arabicText": "مَن كَفَرَ بِٱللَّهِ مِنۢ بَعۡدِ إِیمَـٰنِهِۦۤ إِلَّا مَنۡ أُكۡرِهَ وَقَلۡبُهُۥ مُطۡمَىِٕنُّۢ بِٱلۡإِیمَـٰنِ وَلَـٰكِن مَّن شَرَحَ بِٱلۡكُفۡرِ صَدۡرࣰا فَعَلَیۡهِمۡ غَضَبࣱ مِّنَ ٱللَّهِ وَلَهُمۡ عَذَابٌ عَظِیمࣱ\n",
    "translations": {
      "en": "As for anyone who denies God after having once attained to faith-and this, to be sure, does not apply to one who does it under duress, the while his heart remains true to his faith, but [only, to] him who willingly opens up his heart to a denial of the truth-: upon all such [falls] God's condemnation, and tremendous suffering awaits them:",
      "ms": "Sesiapa yang kufur kepada Allah sesudah ia beriman (maka baginya kemurkaan dan azab dari Allah), kecuali orang yang dipaksa (melakukan kufur) sedang hatinya tenang tenteram dengan iman; akan tetapi sesiapa yang terbuka hatinya menerima kufur maka atas mereka tertimpa kemurkaan dari Allah, dan mereka pula beroleh azab yang besar.",
      "id": "Barangsiapa yang kafir kepada Allah sesudah dia beriman (dia mendapat kemurkaan Allah), kecuali orang yang dipaksa kafir padahal hatinya tetap tenang dalam beriman (dia tidak berdosa), akan tetapi orang yang melapangkan dadanya untuk kekafiran, maka kemurkaan Allah menimpanya dan baginya azab yang besar.",
      "ar": "مَن كَفَرَ بِٱللَّهِ مِنۢ بَعۡدِ إِیمَـٰنِهِۦۤ إِلَّا مَنۡ أُكۡرِهَ وَقَلۡبُهُۥ مُطۡمَىِٕنُّۢ بِٱلۡإِیمَـٰنِ وَلَـٰكِن مَّن شَرَحَ بِٱلۡكُفۡرِ صَدۡرࣰا فَعَلَیۡهِمۡ غَضَبࣱ مِّنَ ٱللَّهِ وَلَهُمۡ عَذَابٌ عَظِیمࣱ\n"
    }
  },
  {
    "id": 2008,
    "surahId": 16,
    "ayahNumber": 107,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّهُمُ ٱسۡتَحَبُّوا۟ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا عَلَى ٱلۡـَٔاخِرَةِ وَأَنَّ ٱللَّهَ لَا یَهۡدِی ٱلۡقَوۡمَ ٱلۡكَـٰفِرِینَ\n",
    "translations": {
      "en": "all this, because they hold this world's life in greater esteem than the life to come, and because God does not bestow His guidance upon people who deny the truth.",
      "ms": "(Kekufuran mereka) yang demikian, ialah kerana mereka lebih mengutamakan kehidupan dunia daripada hari akhirat, dan kerana Allah tidak memberi hidayah petunjuk yang menyampaikan kaum yang kufur ingkar (kepada kebahagiaan di akhirat).",
      "id": "Yang demikian itu disebabkan karena sesungguhnya mereka mencintai kehidupan di dunia lebih dari akhirat, dan bahwasanya Allah tiada memberi petunjuk kepada kaum yang kafir.",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّهُمُ ٱسۡتَحَبُّوا۟ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا عَلَى ٱلۡـَٔاخِرَةِ وَأَنَّ ٱللَّهَ لَا یَهۡدِی ٱلۡقَوۡمَ ٱلۡكَـٰفِرِینَ\n"
    }
  },
  {
    "id": 2009,
    "surahId": 16,
    "ayahNumber": 108,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ طَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَسَمۡعِهِمۡ وَأَبۡصَـٰرِهِمۡۖ وَأُو۟لَـٰۤىِٕكَ هُمُ ٱلۡغَـٰفِلُونَ\n",
    "translations": {
      "en": "They whose hearts and whose hearing and whose sight God has sealed -it is they, they who are heedless!",
      "ms": "Mereka itulah orang-orang yang telah dimeteraikan Allah Taala hati mereka dan pendengaran mereka serta penglihatan mereka; dan merekalah orang-orang yang lalai.",
      "id": "Mereka itulah orang-orang yang hati, pendengaran dan penglihatannya telah dikunci mati oleh Allah, dan mereka itulah orang-orang yang lalai.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ طَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَسَمۡعِهِمۡ وَأَبۡصَـٰرِهِمۡۖ وَأُو۟لَـٰۤىِٕكَ هُمُ ٱلۡغَـٰفِلُونَ\n"
    }
  },
  {
    "id": 2010,
    "surahId": 16,
    "ayahNumber": 109,
    "arabicText": "لَا جَرَمَ أَنَّهُمۡ فِی ٱلۡـَٔاخِرَةِ هُمُ ٱلۡخَـٰسِرُونَ\n",
    "translations": {
      "en": "Truly it is they, they who in the life to come shall be the losers!",
      "ms": "Tidak syak lagi, bahawa mereka ialah orang-orang yang rugi pada hari akhirat kelak.",
      "id": "Pastilah bahwa mereka di akhirat nanti adalah orang-orang yang merugi.",
      "ar": "لَا جَرَمَ أَنَّهُمۡ فِی ٱلۡـَٔاخِرَةِ هُمُ ٱلۡخَـٰسِرُونَ\n"
    }
  },
  {
    "id": 2011,
    "surahId": 16,
    "ayahNumber": 110,
    "arabicText": "ثُمَّ إِنَّ رَبَّكَ لِلَّذِینَ هَاجَرُوا۟ مِنۢ بَعۡدِ مَا فُتِنُوا۟ ثُمَّ جَـٰهَدُوا۟ وَصَبَرُوۤا۟ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "And yet, behold, thy Sustainer [grants His forgiveness] unto those who forsake the domain of evil after having succumbed to its temptation, and who thenceforth strive hard [in God's cause] and are patient in adversity: behold, after such [repentance] thy Sustainer is indeed much-forgiving, a dispenser of grace!",
      "ms": "Kemudian, sesungguhnya Tuhanmu (memberikan pertolongan) kepada orang-orang yang telah berhijrah sesudah mereka difitnahkan (oleh kaum musyrik), kemudian mereka berjihad serta bersabar; sesungguhnya Tuhanmu - sesudah mereka menderita dan bersabar dalam perjuangan - adalah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Dan sesungguhnya Tuhanmu (pelindung) bagi orang-orang yang berhijrah sesudah menderita cobaan, kemudian mereka berjihad dan sabar; sesungguhnya Tuhanmu sesudah itu benar-benar Maha Pengampun lagi Maha Penyayang.",
      "ar": "ثُمَّ إِنَّ رَبَّكَ لِلَّذِینَ هَاجَرُوا۟ مِنۢ بَعۡدِ مَا فُتِنُوا۟ ثُمَّ جَـٰهَدُوا۟ وَصَبَرُوۤا۟ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 2012,
    "surahId": 16,
    "ayahNumber": 111,
    "arabicText": "۞ یَوۡمَ تَأۡتِی كُلُّ نَفۡسࣲ تُجَـٰدِلُ عَن نَّفۡسِهَا وَتُوَفَّىٰ كُلُّ نَفۡسࣲ مَّا عَمِلَتۡ وَهُمۡ لَا یُظۡلَمُونَ\n",
    "translations": {
      "en": "[Be conscious, then, of] the Day when every human being shall come to plead for himself [alone], and every human being shall be repaid in full for whatever he has done, and none shall be wronged.",
      "ms": "(Allah akan mengampunkan dosa-dosa mereka itu pada hari kiamat), hari tiap-tiap diri datang membela dirinya semata-mata, dan tiap-tiap diri disempurnakan balasan apa yang ia telah kerjakan (sama ada baik atau jahat), sedang mereka tidak akan dianiaya sedikit pun.",
      "id": "(Ingatlah) suatu hari (ketika) tiap-tiap diri datang untuk membela dirinya sendiri dan bagi tiap-tiap diri disempurnakan (balasan) apa yang telah dikerjakannya, sedangkan mereka tidak dianiaya (dirugikan).",
      "ar": "۞ یَوۡمَ تَأۡتِی كُلُّ نَفۡسࣲ تُجَـٰدِلُ عَن نَّفۡسِهَا وَتُوَفَّىٰ كُلُّ نَفۡسࣲ مَّا عَمِلَتۡ وَهُمۡ لَا یُظۡلَمُونَ\n"
    }
  },
  {
    "id": 2013,
    "surahId": 16,
    "ayahNumber": 112,
    "arabicText": "وَضَرَبَ ٱللَّهُ مَثَلࣰا قَرۡیَةࣰ كَانَتۡ ءَامِنَةࣰ مُّطۡمَىِٕنَّةࣰ یَأۡتِیهَا رِزۡقُهَا رَغَدࣰا مِّن كُلِّ مَكَانࣲ فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ فَأَذَ ٰ⁠قَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ وَٱلۡخَوۡفِ بِمَا كَانُوا۟ یَصۡنَعُونَ\n",
    "translations": {
      "en": "AND GOD propounds [to you] a parable: [Imagine] a town which was [once] secure and at ease, with its sustenance coming to it abundantly from all quarters, and which thereupon blasphemously refused to show gratitude for God's blessings: and therefore God caused it to taste the all-embracing misery of hunger and fear in result of all [the evil] that its people had so persistently wrought.",
      "ms": "Dan (berhubung dengan hal kaum yang kufur ingkar) Allah memberikan satu contoh: Sebuah negeri yang aman damai dan tenteram, yang didatangi rezekinya yang mewah dari tiap-tiap tempat, kemudian penduduknya kufur akan nikmat-nikmat Allah itu, maka Allah merasakannya kelaparan dan ketakutan yang meliputi keseluruhannya disebabkan apa yang mereka telah lakukan.",
      "id": "Dan Allah telah membuat suatu perumpamaan (dengan) sebuah negeri yang dahulunya aman lagi tenteram, rezekinya datang kepadanya melimpah ruah dari segenap tempat, tetapi (penduduk)nya mengingkari nikmat-nikmat Allah; karena itu Allah merasakan kepada mereka pakaian kelaparan dan ketakutan, disebabkan apa yang selalu mereka perbuat.",
      "ar": "وَضَرَبَ ٱللَّهُ مَثَلࣰا قَرۡیَةࣰ كَانَتۡ ءَامِنَةࣰ مُّطۡمَىِٕنَّةࣰ یَأۡتِیهَا رِزۡقُهَا رَغَدࣰا مِّن كُلِّ مَكَانࣲ فَكَفَرَتۡ بِأَنۡعُمِ ٱللَّهِ فَأَذَ ٰ⁠قَهَا ٱللَّهُ لِبَاسَ ٱلۡجُوعِ وَٱلۡخَوۡفِ بِمَا كَانُوا۟ یَصۡنَعُونَ\n"
    }
  },
  {
    "id": 2014,
    "surahId": 16,
    "ayahNumber": 113,
    "arabicText": "وَلَقَدۡ جَاۤءَهُمۡ رَسُولࣱ مِّنۡهُمۡ فَكَذَّبُوهُ فَأَخَذَهُمُ ٱلۡعَذَابُ وَهُمۡ ظَـٰلِمُونَ\n",
    "translations": {
      "en": "And indeed, there had come unto them an apostle from among themselves -but they gave him the lie; and therefore suffering overwhelmed them while they were thus doing wrong [to themselves].",
      "ms": "Dan demi sesungguhnya, mereka pula telah didatangi seorang Rasul dari kalangan mereka sendiri, lalu mereka mendustakannya; maka mereka pun ditimpa azab sedang mereka berkeadaan zalim.",
      "id": "Dan sesungguhnya telah datang kepada mereka seorang rasul dari mereka sendiri, tetapi mereka mendustakannya; karena itu mereka dimusnahkan azab dan mereka adalah orang-orang yang zalim.",
      "ar": "وَلَقَدۡ جَاۤءَهُمۡ رَسُولࣱ مِّنۡهُمۡ فَكَذَّبُوهُ فَأَخَذَهُمُ ٱلۡعَذَابُ وَهُمۡ ظَـٰلِمُونَ\n"
    }
  },
  {
    "id": 2015,
    "surahId": 16,
    "ayahNumber": 114,
    "arabicText": "فَكُلُوا۟ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَـٰلࣰا طَیِّبࣰا وَٱشۡكُرُوا۟ نِعۡمَتَ ٱللَّهِ إِن كُنتُمۡ إِیَّاهُ تَعۡبُدُونَ\n",
    "translations": {
      "en": "AND SO, partake of all the lawful, good things which God has provided for you as sustenance, and render thanks unto God for His blessings, if it is [truly] Him that you worship.",
      "ms": "Oleh itu, makanlah (wahai orang-orang yang beriman) dari apa yang telah dikurniakan Allah kepada kamu dari benda-benda yang halal lagi baik, dan bersyukurlah akan nikmat Allah, jika benar kamu hanya menyembahNya semata-mata.",
      "id": "Maka makanlah yang halal lagi baik dari rezeki yang telah diberikan Allah kepadamu; dan syukurilah nikmat Allah, jika kamu hanya kepada-Nya saja menyembah.",
      "ar": "فَكُلُوا۟ مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَـٰلࣰا طَیِّبࣰا وَٱشۡكُرُوا۟ نِعۡمَتَ ٱللَّهِ إِن كُنتُمۡ إِیَّاهُ تَعۡبُدُونَ\n"
    }
  },
  {
    "id": 2016,
    "surahId": 16,
    "ayahNumber": 115,
    "arabicText": "إِنَّمَا حَرَّمَ عَلَیۡكُمُ ٱلۡمَیۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِیرِ وَمَاۤ أُهِلَّ لِغَیۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَیۡرَ بَاغࣲ وَلَا عَادࣲ فَإِنَّ ٱللَّهَ غَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "He has forbidden to you only carrion, and blood, and the flesh of swine, and that over which any name other than God's has been invoked; but if one is driven [to it] by necessity - neither coveting it nor exceeding his immediate need -verily, God is much forgiving, a dispenser of grace.",
      "ms": "Sesungguhnya Allah hanya mengharamkan kepada kamu memakan bangkai, dan darah, dan daging babi, dan binatang yang disembelih tidak kerana Allah maka sesiapa terpaksa (memakannya kerana darurat) sedang ia tidak mengingininya dan tidak melampaui batas (pada kadar benda yang dimakan itu, maka tidaklah ia berdosa), sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Sesungguhnya Allah hanya mengharamkan atasmu (memakan) bangkai, darah, daging babi dan apa yang disembelih dengan menyebut nama selain Allah; tetapi barangsiapa yang terpaksa memakannya dengan tidak menganiaya dan tidak pula melampaui batas, maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "إِنَّمَا حَرَّمَ عَلَیۡكُمُ ٱلۡمَیۡتَةَ وَٱلدَّمَ وَلَحۡمَ ٱلۡخِنزِیرِ وَمَاۤ أُهِلَّ لِغَیۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَیۡرَ بَاغࣲ وَلَا عَادࣲ فَإِنَّ ٱللَّهَ غَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 2017,
    "surahId": 16,
    "ayahNumber": 116,
    "arabicText": "وَلَا تَقُولُوا۟ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ هَـٰذَا حَلَـٰلࣱ وَهَـٰذَا حَرَامࣱ لِّتَفۡتَرُوا۟ عَلَى ٱللَّهِ ٱلۡكَذِبَۚ إِنَّ ٱلَّذِینَ یَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا یُفۡلِحُونَ\n",
    "translations": {
      "en": "Hence, do not utter falsehoods by letting your tongues determine [at your own discretion], \"This is lawful and that is forbidden\", thus attributing your own lying inventions to God: for, behold, they who attribute their own lying inventions to God will never attain to a happy state!",
      "ms": "Dan janganlah kamu berdusta dengan sebab apa yang disifatkan oleh lidah kamu: \"Ini halal dan ini haram\", untuk mengada-adakan sesuatu yang dusta terhadap Allah; sesungguhnya orang-orang yang berdusta terhadap Allah tidak akan berjaya.",
      "id": "Dan janganlah kamu mengatakan terhadap apa yang disebut-sebut oleh lidahmu secara dusta \"ini halal dan ini haram\", untuk mengada-adakan kebohongan terhadap Allah. Sesungguhnya orang-orang yang mengada-adakan kebohongan terhadap Allah tiadalah beruntung.",
      "ar": "وَلَا تَقُولُوا۟ لِمَا تَصِفُ أَلۡسِنَتُكُمُ ٱلۡكَذِبَ هَـٰذَا حَلَـٰلࣱ وَهَـٰذَا حَرَامࣱ لِّتَفۡتَرُوا۟ عَلَى ٱللَّهِ ٱلۡكَذِبَۚ إِنَّ ٱلَّذِینَ یَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا یُفۡلِحُونَ\n"
    }
  },
  {
    "id": 2018,
    "surahId": 16,
    "ayahNumber": 117,
    "arabicText": "مَتَـٰعࣱ قَلِیلࣱ وَلَهُمۡ عَذَابٌ أَلِیمࣱ\n",
    "translations": {
      "en": "A brief enjoyment [may be theirs in this world] -but grievous suffering awaits them [in the life to come]!",
      "ms": "(Mereka hanya mendapat) sedikit kesenangan (di dunia), dan mereka pula akan beroleh azab seksa yang tidak terperi sakitnya.",
      "id": "(Itu adalah) kesenangan yang sedikit, dan bagi mereka azab yang pedih.",
      "ar": "مَتَـٰعࣱ قَلِیلࣱ وَلَهُمۡ عَذَابٌ أَلِیمࣱ\n"
    }
  },
  {
    "id": 2019,
    "surahId": 16,
    "ayahNumber": 118,
    "arabicText": "وَعَلَى ٱلَّذِینَ هَادُوا۟ حَرَّمۡنَا مَا قَصَصۡنَا عَلَیۡكَ مِن قَبۡلُۖ وَمَا ظَلَمۡنَـٰهُمۡ وَلَـٰكِن كَانُوۤا۟ أَنفُسَهُمۡ یَظۡلِمُونَ\n",
    "translations": {
      "en": "And [only] unto those who followed the Jewish faith did We forbid all that We have mentioned to thee ere this; and no wrong did We do to them, but it was they who persistently wronged themselves.",
      "ms": "Dan kepada orang-orang Yahudi, Kami haramkan apa yang telah kami ceritakan kepadamu dahulu; dan tiadalah Kami menganiaya mereka (dengan pengharaman itu), tetapi merekalah yang menganiaya diri mereka sendiri.",
      "id": "Dan terhadap orang-orang Yahudi, Kami haramkan apa yang telah Kami ceritakan dahulu kepadamu; dan Kami tiada menganiaya mereka, akan tetapi merekalah yang menganiaya diri mereka sendiri.",
      "ar": "وَعَلَى ٱلَّذِینَ هَادُوا۟ حَرَّمۡنَا مَا قَصَصۡنَا عَلَیۡكَ مِن قَبۡلُۖ وَمَا ظَلَمۡنَـٰهُمۡ وَلَـٰكِن كَانُوۤا۟ أَنفُسَهُمۡ یَظۡلِمُونَ\n"
    }
  },
  {
    "id": 2020,
    "surahId": 16,
    "ayahNumber": 119,
    "arabicText": "ثُمَّ إِنَّ رَبَّكَ لِلَّذِینَ عَمِلُوا۟ ٱلسُّوۤءَ بِجَهَـٰلَةࣲ ثُمَّ تَابُوا۟ مِنۢ بَعۡدِ ذَ ٰ⁠لِكَ وَأَصۡلَحُوۤا۟ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورࣱ رَّحِیمٌ\n",
    "translations": {
      "en": "And once again: Behold, thy Sustainer [shows mercy] to those who do evil out of ignorance and afterwards repent and live righteously: behold, after such [repentance] thy Sustainer is indeed much forgiving, a dispenser of grace.",
      "ms": "Kemudian, sesungguhnya Tuhanmu terhadap orang-orang yang melakukan kejahatan dengan sebab kejahilan, kemudian mereka bertaubat sesudah itu serta memperbaiki amalannya, sesungguhnya Tuhanmu sesudah (mereka bertaubat) itu, adalah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Kemudian, sesungguhnya Tuhanmu (mengampuni) bagi orang-orang yang mengerjakan kesalahan karena kebodohannya, kemudian mereka bertaubat sesudah itu dan memperbaiki (dirinya), sesungguhnya Tuhanmu sesudah itu benar-benar Maha Pengampun lagi Maha Penyayang.",
      "ar": "ثُمَّ إِنَّ رَبَّكَ لِلَّذِینَ عَمِلُوا۟ ٱلسُّوۤءَ بِجَهَـٰلَةࣲ ثُمَّ تَابُوا۟ مِنۢ بَعۡدِ ذَ ٰ⁠لِكَ وَأَصۡلَحُوۤا۟ إِنَّ رَبَّكَ مِنۢ بَعۡدِهَا لَغَفُورࣱ رَّحِیمٌ\n"
    }
  },
  {
    "id": 2021,
    "surahId": 16,
    "ayahNumber": 120,
    "arabicText": "إِنَّ إِبۡرَ ٰ⁠هِیمَ كَانَ أُمَّةࣰ قَانِتࣰا لِّلَّهِ حَنِیفࣰا وَلَمۡ یَكُ مِنَ ٱلۡمُشۡرِكِینَ\n",
    "translations": {
      "en": "VERILY, Abraham was a man who combined within himself all virtues, devoutly obeying God's will, turning away from all that is false, and not being of those who ascribe divinity to aught beside God:",
      "ms": "Sesungguhnya Nabi Ibrahim adalah merupakan \"satu umat\" (walaupun Ia seorang diri); ia takat bulat-bulat kepada Allah, lagi berdiri teguh di atas dasar tauhid; dan ia tidak pernah menjadi dari orang-orang yang musyrik.",
      "id": "Sesungguhnya Ibrahim adalah seorang imam yang dapat dijadikan teladan lagi patuh kepada Allah dan hanif. Dan sekali-kali bukanlah dia termasuk orang-orang yang mempersekutukan (Tuhan),",
      "ar": "إِنَّ إِبۡرَ ٰ⁠هِیمَ كَانَ أُمَّةࣰ قَانِتࣰا لِّلَّهِ حَنِیفࣰا وَلَمۡ یَكُ مِنَ ٱلۡمُشۡرِكِینَ\n"
    }
  },
  {
    "id": 2022,
    "surahId": 16,
    "ayahNumber": 121,
    "arabicText": "شَاكِرࣰا لِّأَنۡعُمِهِۚ ٱجۡتَبَىٰهُ وَهَدَىٰهُ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "[for he was always] grateful for the blessings granted by Him who had elected him and guided him onto a straight way.",
      "ms": "Ia sentiasa bersyukur akan nikmat-nikmat Allah; Allah telah memilihnya (menjadi Nabi) dan memberi hidayah petunjuk kepadanya ke jalan yang lurus.",
      "id": "(lagi) yang mensyukuri nikmat-nikmat Allah. Allah telah memilihnya dan menunjukinya kepada jalan yang lurus.",
      "ar": "شَاكِرࣰا لِّأَنۡعُمِهِۚ ٱجۡتَبَىٰهُ وَهَدَىٰهُ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 2023,
    "surahId": 16,
    "ayahNumber": 122,
    "arabicText": "وَءَاتَیۡنَـٰهُ فِی ٱلدُّنۡیَا حَسَنَةࣰۖ وَإِنَّهُۥ فِی ٱلۡـَٔاخِرَةِ لَمِنَ ٱلصَّـٰلِحِینَ\n",
    "translations": {
      "en": "And so We vouchsafed him good in this world; and, verily, in the life to come [too] he shall find himself among the righteous.",
      "ms": "Dan Kami telah memberikan kepadanya kebaikan di dunia; dan sesungguhnya ia pada hari akhirat adalah dari orang-orang yang soleh.",
      "id": "Dan Kami berikan kepadanya kebaikan di dunia. Dan sesungguhnya dia di akhirat benar-benar termasuk orang-orang yang saleh.",
      "ar": "وَءَاتَیۡنَـٰهُ فِی ٱلدُّنۡیَا حَسَنَةࣰۖ وَإِنَّهُۥ فِی ٱلۡـَٔاخِرَةِ لَمِنَ ٱلصَّـٰلِحِینَ\n"
    }
  },
  {
    "id": 2024,
    "surahId": 16,
    "ayahNumber": 123,
    "arabicText": "ثُمَّ أَوۡحَیۡنَاۤ إِلَیۡكَ أَنِ ٱتَّبِعۡ مِلَّةَ إِبۡرَ ٰ⁠هِیمَ حَنِیفࣰاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِینَ\n",
    "translations": {
      "en": "And lastly, We have inspired thee, [O Muhammad, with this message:] \"Follow the creed of Abraham, who turned away from all that is false, and was not of those who ascribe divinity to aught beside God;",
      "ms": "Kemudian Kami wahyukan kepadamu (wahai Muhammad): Hendaklah engkau menurut ugama Nabi Ibrahim, yang berdiri teguh di atas jalan yang benar; dan tiadalah ia dari orang-orang musyrik.",
      "id": "Kemudian Kami wahyukan kepadamu (Muhammad): \"Ikutilah agama Ibrahim seorang yang hanif\" dan bukanlah dia termasuk orang-orang yang mempersekutukan Tuhan.",
      "ar": "ثُمَّ أَوۡحَیۡنَاۤ إِلَیۡكَ أَنِ ٱتَّبِعۡ مِلَّةَ إِبۡرَ ٰ⁠هِیمَ حَنِیفࣰاۖ وَمَا كَانَ مِنَ ٱلۡمُشۡرِكِینَ\n"
    }
  },
  {
    "id": 2025,
    "surahId": 16,
    "ayahNumber": 124,
    "arabicText": "إِنَّمَا جُعِلَ ٱلسَّبۡتُ عَلَى ٱلَّذِینَ ٱخۡتَلَفُوا۟ فِیهِۚ وَإِنَّ رَبَّكَ لَیَحۡكُمُ بَیۡنَهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ فِیمَا كَانُوا۟ فِیهِ یَخۡتَلِفُونَ\n",
    "translations": {
      "en": "[and know that the observance of] the Sabbath was ordained only for those who came to hold divergent views about him; but, verily, God will judge between them on Resurrection Day with regard to all on which they were wont to differ.",
      "ms": "Sesungguhnya hari Sabtu itu dijadikan (Hari kelepasan yang wajib dihormati) atas orang-orang (Yahudi) yang telah berselisihan padanya; dan sesungguhnya Tuhanmu akan menghukum di antara mereka pada hari kiamat, tentang apa yang mereka telah berselisihan padanya.",
      "id": "Sesungguhnya diwajibkan (menghormati) hari Sabtu atas orang-orang (Yahudi) yang berselisih padanya. Dan sesungguhnya Tuhanmu benar-benar akan memberi putusan di antara mereka di hari kiamat terhadap apa yang telah mereka perselisihkan itu.",
      "ar": "إِنَّمَا جُعِلَ ٱلسَّبۡتُ عَلَى ٱلَّذِینَ ٱخۡتَلَفُوا۟ فِیهِۚ وَإِنَّ رَبَّكَ لَیَحۡكُمُ بَیۡنَهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ فِیمَا كَانُوا۟ فِیهِ یَخۡتَلِفُونَ\n"
    }
  },
  {
    "id": 2026,
    "surahId": 16,
    "ayahNumber": 125,
    "arabicText": "ٱدۡعُ إِلَىٰ سَبِیلِ رَبِّكَ بِٱلۡحِكۡمَةِ وَٱلۡمَوۡعِظَةِ ٱلۡحَسَنَةِۖ وَجَـٰدِلۡهُم بِٱلَّتِی هِیَ أَحۡسَنُۚ إِنَّ رَبَّكَ هُوَ أَعۡلَمُ بِمَن ضَلَّ عَن سَبِیلِهِۦ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِینَ\n",
    "translations": {
      "en": "CALL THOU (all mankind] unto thy Sustainer's path with wisdom and goodly exhortation, and argue with them in the most kindly manner- for, behold, thy Sustainer knows best as to who strays from His path, and best knows He as to who are the right-guided.",
      "ms": "Serulah ke jalan Tuhanmu (wahai Muhammad) dengan hikmat kebijaksanaan dan nasihat pengajaran yang baik, dan berbahaslah dengan mereka (yang engkau serukan itu) dengan cara yang lebih baik; sesungguhnya Tuhanmu Dia lah jua yang lebih mengetahui akan orang yang sesat dari jalanNya, dan Dia lah jua yang lebih mengetahui akan orang-orang yang mendapat hidayah petunjuk.",
      "id": "Serulah (manusia) kepada jalan Tuhan-mu dengan hikmah dan pelajaran yang baik dan bantahlah mereka dengan cara yang baik. Sesungguhnya Tuhanmu Dialah yang lebih mengetahui tentang siapa yang tersesat dari jalan-Nya dan Dialah yang lebih mengetahui orang-orang yang mendapat petunjuk.",
      "ar": "ٱدۡعُ إِلَىٰ سَبِیلِ رَبِّكَ بِٱلۡحِكۡمَةِ وَٱلۡمَوۡعِظَةِ ٱلۡحَسَنَةِۖ وَجَـٰدِلۡهُم بِٱلَّتِی هِیَ أَحۡسَنُۚ إِنَّ رَبَّكَ هُوَ أَعۡلَمُ بِمَن ضَلَّ عَن سَبِیلِهِۦ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِینَ\n"
    }
  },
  {
    "id": 2027,
    "surahId": 16,
    "ayahNumber": 126,
    "arabicText": "وَإِنۡ عَاقَبۡتُمۡ فَعَاقِبُوا۟ بِمِثۡلِ مَا عُوقِبۡتُم بِهِۦۖ وَلَىِٕن صَبَرۡتُمۡ لَهُوَ خَیۡرࣱ لِّلصَّـٰبِرِینَ\n",
    "translations": {
      "en": "Hence, if you have to respond to an attack (in argument], respond only to the extent of the attack levelled against you; but to bear yourselves with patience is indeed far better for (you, since God is with] those who are patient in adversity.",
      "ms": "Dan jika kamu membalas kejahatan (pihak lawan), maka hendaklah kamu membalas dengan kejahatan yang sama seperti yang telah ditimpakan kepada kamu, dan jika kamu bersabar, (maka) sesungguhnya yang demikian itu adalah lebih baik bagi orang-orang yang sabar.",
      "id": "Dan jika kamu memberikan balasan, maka balaslah dengan balasan yang sama dengan siksaan yang ditimpakan kepadamu. Akan tetapi jika kamu bersabar, sesungguhnya itulah yang lebih baik bagi orang-orang yang sabar.",
      "ar": "وَإِنۡ عَاقَبۡتُمۡ فَعَاقِبُوا۟ بِمِثۡلِ مَا عُوقِبۡتُم بِهِۦۖ وَلَىِٕن صَبَرۡتُمۡ لَهُوَ خَیۡرࣱ لِّلصَّـٰبِرِینَ\n"
    }
  },
  {
    "id": 2028,
    "surahId": 16,
    "ayahNumber": 127,
    "arabicText": "وَٱصۡبِرۡ وَمَا صَبۡرُكَ إِلَّا بِٱللَّهِۚ وَلَا تَحۡزَنۡ عَلَیۡهِمۡ وَلَا تَكُ فِی ضَیۡقࣲ مِّمَّا یَمۡكُرُونَ\n",
    "translations": {
      "en": "Endure, then, with patience (all that they who deny the truth may say] -always remembering that it is none but God who gives thee the strength to endure adversity -and do not grieve over them, and neither be distressed by the false arguments which they devise:",
      "ms": "Dan bersabarlah (wahai Muhammad terhadap perbuatan dan telatah golongan yang ingkar itu); dan tiadalah berhasil kesabaranmu melainkan dengan (memohon pertolongan) Allah; dan janganlah engkau berdukacita terhadap kedegilan mereka, dan janganlah engkau bersempit dada disebabkan tipu daya yang mereka lakukan.",
      "id": "Bersabarlah (hai Muhammad) dan tiadalah kesabaranmu itu melainkan dengan pertolongan Allah dan janganlah kamu bersedih hati terhadap (kekafiran) mereka dan janganlah kamu bersempit dada terhadap apa yang mereka tipu dayakan.",
      "ar": "وَٱصۡبِرۡ وَمَا صَبۡرُكَ إِلَّا بِٱللَّهِۚ وَلَا تَحۡزَنۡ عَلَیۡهِمۡ وَلَا تَكُ فِی ضَیۡقࣲ مِّمَّا یَمۡكُرُونَ\n"
    }
  },
  {
    "id": 2029,
    "surahId": 16,
    "ayahNumber": 128,
    "arabicText": "إِنَّ ٱللَّهَ مَعَ ٱلَّذِینَ ٱتَّقَوا۟ وَّٱلَّذِینَ هُم مُّحۡسِنُونَ\n",
    "translations": {
      "en": "for, verily, God is with those who are conscious of Him and are doers of good withal!",
      "ms": "Sesungguhnya Allah beserta orang-orang yang bertaqwa, dan orang-orang yang berusaha memperbaiki amalannya.",
      "id": "Sesungguhnya Allah beserta orang-orang yang bertakwa dan orang-orang yang berbuat kebaikan.",
      "ar": "إِنَّ ٱللَّهَ مَعَ ٱلَّذِینَ ٱتَّقَوا۟ وَّٱلَّذِینَ هُم مُّحۡسِنُونَ\n"
    }
  }
]