[
  {
    "id": 3253,
    "surahId": 28,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ طسۤمۤ\n",
    "translations": {
      "en": "Ta. Sin. Mim.",
      "ms": "Taa, Siin, Miim.",
      "id": "Thaa Siin Miim",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ طسۤمۤ\n"
    }
  },
  {
    "id": 3254,
    "surahId": 28,
    "ayahNumber": 2,
    "arabicText": "تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِ ٱلۡمُبِینِ\n",
    "translations": {
      "en": "These are messages of a divine writ clear in itself and clearly showing the truth.",
      "ms": "Inilah ayat-ayat Kitab - Al-Quran - yang memberi penjelasan.",
      "id": "Ini adalah ayat-ayat Kitab (Al Quran) yang nyata (dari Allah).",
      "ar": "تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِ ٱلۡمُبِینِ\n"
    }
  },
  {
    "id": 3255,
    "surahId": 28,
    "ayahNumber": 3,
    "arabicText": "نَتۡلُوا۟ عَلَیۡكَ مِن نَّبَإِ مُوسَىٰ وَفِرۡعَوۡنَ بِٱلۡحَقِّ لِقَوۡمࣲ یُؤۡمِنُونَ\n",
    "translations": {
      "en": "We [now] convey unto thee some of the story of Moses and Pharaoh, setting forth the truth for [the benefit of] people who will believe.",
      "ms": "Kami bacakan kepadamu (wahai Muhammad) sebahagian dari kisah Nabi Musa dan Firaun dengan keterangan yang benar bagi orang-orang yang beriman.",
      "id": "Kami membacakan kepadamu sebagian dari kisah Musa dan Fir'aun dengan benar untuk orang-orang yang beriman.",
      "ar": "نَتۡلُوا۟ عَلَیۡكَ مِن نَّبَإِ مُوسَىٰ وَفِرۡعَوۡنَ بِٱلۡحَقِّ لِقَوۡمࣲ یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 3256,
    "surahId": 28,
    "ayahNumber": 4,
    "arabicText": "إِنَّ فِرۡعَوۡنَ عَلَا فِی ٱلۡأَرۡضِ وَجَعَلَ أَهۡلَهَا شِیَعࣰا یَسۡتَضۡعِفُ طَاۤىِٕفَةࣰ مِّنۡهُمۡ یُذَبِّحُ أَبۡنَاۤءَهُمۡ وَیَسۡتَحۡیِۦ نِسَاۤءَهُمۡۚ إِنَّهُۥ كَانَ مِنَ ٱلۡمُفۡسِدِینَ\n",
    "translations": {
      "en": "Behold, Pharaoh exalted himself in the land and divided its people into castes. One group of them he deemed utterly low; he would slaughter their sons and spare (only) their women: for, behold, he was one of those who spread corruption [on earth].",
      "ms": "Sesungguhnya Firaun telah berlaku zalim di bumi (Mesir) dengan melampaui batas, serta ia menjadikan penduduknya berpuak-puak. Ia menindas sepuak di antaranya dengan membunuh anak-anak lelaki mereka dan membiarkan hidup anak-anak perempuan mereka. Sesungguhnya adalah ia dari golongan yang membuat kerosakan.",
      "id": "Sesungguhnya Fir'aun telah berbuat sewenang-wenang di muka bumi dan menjadikan penduduknya berpecah belah, dengan menindas segolongan dari mereka, menyembelih anak laki-laki mereka dan membiarkan hidup anak-anak perempuan mereka. Sesungguhnya Fir'aun termasuk orang-orang yang berbuat kerusakan.",
      "ar": "إِنَّ فِرۡعَوۡنَ عَلَا فِی ٱلۡأَرۡضِ وَجَعَلَ أَهۡلَهَا شِیَعࣰا یَسۡتَضۡعِفُ طَاۤىِٕفَةࣰ مِّنۡهُمۡ یُذَبِّحُ أَبۡنَاۤءَهُمۡ وَیَسۡتَحۡیِۦ نِسَاۤءَهُمۡۚ إِنَّهُۥ كَانَ مِنَ ٱلۡمُفۡسِدِینَ\n"
    }
  },
  {
    "id": 3257,
    "surahId": 28,
    "ayahNumber": 5,
    "arabicText": "وَنُرِیدُ أَن نَّمُنَّ عَلَى ٱلَّذِینَ ٱسۡتُضۡعِفُوا۟ فِی ٱلۡأَرۡضِ وَنَجۡعَلَهُمۡ أَىِٕمَّةࣰ وَنَجۡعَلَهُمُ ٱلۡوَ ٰ⁠رِثِینَ\n",
    "translations": {
      "en": "But it was Our will to bestow Our favour upon those [very people] who were deemed [so] utterly low in the land, and to make them forerunners in faith. and to make them heirs [to Pharaoh’s glory],",
      "ms": "Dan Kami hendak berihsan dengan memberikan pertolongan kepada kaum yang tertindas di negeri itu, dan hendak menjadikan mereka pemimpin-pemimpin, serta hendak menjadikan mereka orang-orang yang mewarisi (apa yang dimiliki oleh Firaun dan kaumnya).",
      "id": "Dan Kami hendak memberi karunia kepada orang-orang yang tertindas di bumi (Mesir) itu dan hendak menjadikan mereka pemimpin dan menjadikan mereka orang-orang yang mewarisi (bumi),",
      "ar": "وَنُرِیدُ أَن نَّمُنَّ عَلَى ٱلَّذِینَ ٱسۡتُضۡعِفُوا۟ فِی ٱلۡأَرۡضِ وَنَجۡعَلَهُمۡ أَىِٕمَّةࣰ وَنَجۡعَلَهُمُ ٱلۡوَ ٰ⁠رِثِینَ\n"
    }
  },
  {
    "id": 3258,
    "surahId": 28,
    "ayahNumber": 6,
    "arabicText": "وَنُمَكِّنَ لَهُمۡ فِی ٱلۡأَرۡضِ وَنُرِیَ فِرۡعَوۡنَ وَهَـٰمَـٰنَ وَجُنُودَهُمَا مِنۡهُم مَّا كَانُوا۟ یَحۡذَرُونَ\n",
    "translations": {
      "en": "and to establish them securely on earth, and to let Pharaoh and Haman and their hosts experience through those [children of Israel] the very thing against which they sought to protect themselves.",
      "ms": "Dan Kami hendak memberi mereka kedudukan yang kukuh di negeri itu, serta hendak memperlihatkan kepada Firaun dan Haman bersama-sama tentera mereka apa yang mereka bimbangkan dari golongan yang bertindas itu.",
      "id": "dan akan Kami teguhkan kedudukan mereka di muka bumi dan akan Kami perlihatkan kepada Fir'aun dan Haman beserta tentaranya apa yang selalu mereka khawatirkan dari mereka itu.",
      "ar": "وَنُمَكِّنَ لَهُمۡ فِی ٱلۡأَرۡضِ وَنُرِیَ فِرۡعَوۡنَ وَهَـٰمَـٰنَ وَجُنُودَهُمَا مِنۡهُم مَّا كَانُوا۟ یَحۡذَرُونَ\n"
    }
  },
  {
    "id": 3259,
    "surahId": 28,
    "ayahNumber": 7,
    "arabicText": "وَأَوۡحَیۡنَاۤ إِلَىٰۤ أُمِّ مُوسَىٰۤ أَنۡ أَرۡضِعِیهِۖ فَإِذَا خِفۡتِ عَلَیۡهِ فَأَلۡقِیهِ فِی ٱلۡیَمِّ وَلَا تَخَافِی وَلَا تَحۡزَنِیۤۖ إِنَّا رَاۤدُّوهُ إِلَیۡكِ وَجَاعِلُوهُ مِنَ ٱلۡمُرۡسَلِینَ\n",
    "translations": {
      "en": "And so, [when he was born,] We inspired [thus] the mother of Moses: Suckle him [for a time], and then, when thou hast cause to fear for him, cast him into the river, and have no fear and do not grieve - for We shall restore him to thee, and shall make him one of Our message-bearers!”",
      "ms": "Dan Kami ilhamkan kepada ibu Musa:\" Susukanlah dia; dalam pada itu, jika engkau takutkan sesuatu bahaya mengenainya (dari angkara Firaun), maka (letakkanlah dia di dalam peti dan) lepaskanlah dia ke laut; dan janganlah engkau merasa bimbang dan jangan pula berdukacita; sesungguhnya Kami akan mengembalikannya kepadamu, dan Kami akan melantiknya menjadi salah seorang dari Rasul-rasul Kami.",
      "id": "Dan kami ilhamkan kepada ibu Musa; \"Susuilah dia, dan apabila kamu khawatir terhadapnya maka jatuhkanlah dia ke sungai (Nil). Dan janganlah kamu khawatir dan janganlah (pula) bersedih hati, karena sesungguhnya Kami akan mengembalikannya kepadamu, dan menjadikannya (salah seorang) dari para rasul.",
      "ar": "وَأَوۡحَیۡنَاۤ إِلَىٰۤ أُمِّ مُوسَىٰۤ أَنۡ أَرۡضِعِیهِۖ فَإِذَا خِفۡتِ عَلَیۡهِ فَأَلۡقِیهِ فِی ٱلۡیَمِّ وَلَا تَخَافِی وَلَا تَحۡزَنِیۤۖ إِنَّا رَاۤدُّوهُ إِلَیۡكِ وَجَاعِلُوهُ مِنَ ٱلۡمُرۡسَلِینَ\n"
    }
  },
  {
    "id": 3260,
    "surahId": 28,
    "ayahNumber": 8,
    "arabicText": "فَٱلۡتَقَطَهُۥۤ ءَالُ فِرۡعَوۡنَ لِیَكُونَ لَهُمۡ عَدُوࣰّا وَحَزَنًاۗ إِنَّ فِرۡعَوۡنَ وَهَـٰمَـٰنَ وَجُنُودَهُمَا كَانُوا۟ خَـٰطِـِٔینَ\n",
    "translations": {
      "en": "And [some of] Pharaoh’s household found [and spared] him: for [We had willed] that he becomes an enemy unto them and [a source of] grief, seeing that Pharaoh and Haman and their hosts were sinners indeed!",
      "ms": "Setelah itu dia dipungut oleh orang-orang Firaun; kesudahannya dia akan menjadi musuh dan menyebabkan dukacita bagi mereka; sesungguhnya Firaun dan Haman serta orang-orangnya adalah golongan yang bersalah.",
      "id": "Maka dipungutlah ia oleh keluarga Fir'aun yang akibatnya dia menjadi musuh dan kesedihan bagi mereka. Sesungguhnya Fir'aun dan Haman beserta tentaranya adalah orang-orang yang bersalah.",
      "ar": "فَٱلۡتَقَطَهُۥۤ ءَالُ فِرۡعَوۡنَ لِیَكُونَ لَهُمۡ عَدُوࣰّا وَحَزَنًاۗ إِنَّ فِرۡعَوۡنَ وَهَـٰمَـٰنَ وَجُنُودَهُمَا كَانُوا۟ خَـٰطِـِٔینَ\n"
    }
  },
  {
    "id": 3261,
    "surahId": 28,
    "ayahNumber": 9,
    "arabicText": "وَقَالَتِ ٱمۡرَأَتُ فِرۡعَوۡنَ قُرَّتُ عَیۡنࣲ لِّی وَلَكَۖ لَا تَقۡتُلُوهُ عَسَىٰۤ أَن یَنفَعَنَاۤ أَوۡ نَتَّخِذَهُۥ وَلَدࣰا وَهُمۡ لَا یَشۡعُرُونَ\n",
    "translations": {
      "en": "Now the wife of Pharaoh said: “A joy to the eye [could this child be] for me and thee! Slay him not: he may well be of use to us, or we may adopt him as a son!” And they had no presentiment [of what he was to become].",
      "ms": "Dan (ketika melihat kanak-kanak itu) berkatalah isteri Firaun: \"(Semoga ia menjadi) cahaya mata bagiku dan bagimu; janganlah kamu membunuhnya; mudah-mudahan ia berguna kepada kita, atau kita jadikan dia anak\". Padahal mereka tidak menyedari (kesudahannya).",
      "id": "Dan berkatalah isteri Fir'aun: \"(Ia) adalah penyejuk mata hati bagiku dan bagimu. Janganlah kamu membunuhnya, mudah-mudahan ia bermanfaat kepada kita atau kita ambil ia menjadi anak\", sedang mereka tiada menyadari.",
      "ar": "وَقَالَتِ ٱمۡرَأَتُ فِرۡعَوۡنَ قُرَّتُ عَیۡنࣲ لِّی وَلَكَۖ لَا تَقۡتُلُوهُ عَسَىٰۤ أَن یَنفَعَنَاۤ أَوۡ نَتَّخِذَهُۥ وَلَدࣰا وَهُمۡ لَا یَشۡعُرُونَ\n"
    }
  },
  {
    "id": 3262,
    "surahId": 28,
    "ayahNumber": 10,
    "arabicText": "وَأَصۡبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَـٰرِغًاۖ إِن كَادَتۡ لَتُبۡدِی بِهِۦ لَوۡلَاۤ أَن رَّبَطۡنَا عَلَىٰ قَلۡبِهَا لِتَكُونَ مِنَ ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "On the morrow, however, an aching void grew up in the heart of the mother of Moses, and she would indeed have disclosed all about him had We not endowed her heart with enough strength to keep alive her faith [in Our promise].",
      "ms": "Dan (sepeninggalannya) menjadilah hati ibu Musa kosong; sesungguhnya ia nyaris-nyaris menyatakan perihal anaknya itu dengan berterus-terang jika tidaklah Kami kuatkan hatinya (dengan perasaan sabar dan tenang tenteram), supaya tetaplah ia dari orang-orang yang percaya (akan janji Allah).",
      "id": "Dan menjadi kosonglah hati ibu Musa. Sesungguhnya hampir saja ia menyatakan rahasia tentang Musa, seandainya tidak Kami teguhkan hatinya, supaya ia termasuk orang-orang yang percaya (kepada janji Allah).",
      "ar": "وَأَصۡبَحَ فُؤَادُ أُمِّ مُوسَىٰ فَـٰرِغًاۖ إِن كَادَتۡ لَتُبۡدِی بِهِۦ لَوۡلَاۤ أَن رَّبَطۡنَا عَلَىٰ قَلۡبِهَا لِتَكُونَ مِنَ ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 3263,
    "surahId": 28,
    "ayahNumber": 11,
    "arabicText": "وَقَالَتۡ لِأُخۡتِهِۦ قُصِّیهِۖ فَبَصُرَتۡ بِهِۦ عَن جُنُبࣲ وَهُمۡ لَا یَشۡعُرُونَ\n",
    "translations": {
      "en": "And so she said to his sister, “Follow him” - and [the girl] watched him from afar, while they [who had taken him in] were not aware of it,",
      "ms": "Dan berkatalah ia kepada kakak Musa: \"Pergilah cari khabar beritanya\". (Maka pergilah ia) lalu dilihatnya dari jauh sedang orang ramai tidak menyedarinya.",
      "id": "Dan berkatalah ibu Musa kepada saudara Musa yang perempuan: \"Ikutilah dia\" Maka kelihatanlah olehnya Musa dari jauh, sedang mereka tidak mengetahuinya,",
      "ar": "وَقَالَتۡ لِأُخۡتِهِۦ قُصِّیهِۖ فَبَصُرَتۡ بِهِۦ عَن جُنُبࣲ وَهُمۡ لَا یَشۡعُرُونَ\n"
    }
  },
  {
    "id": 3264,
    "surahId": 28,
    "ayahNumber": 12,
    "arabicText": "۞ وَحَرَّمۡنَا عَلَیۡهِ ٱلۡمَرَاضِعَ مِن قَبۡلُ فَقَالَتۡ هَلۡ أَدُلُّكُمۡ عَلَىٰۤ أَهۡلِ بَیۡتࣲ یَكۡفُلُونَهُۥ لَكُمۡ وَهُمۡ لَهُۥ نَـٰصِحُونَ\n",
    "translations": {
      "en": "Now from the very beginning We caused him to refuse the breast of [Egyptian] nurses; and [when his sister came to know this,] she said: “Shall I guide you to a family that might rear him for you, and look after him with good will?”",
      "ms": "Dan Kami jadikan dia dari mulanya enggan menyusu kepada perempuan-perempuan yang hendak menyusukannya; (melihatkan halnya itu), kakaknya berkata: \"Mahukah, aku tunjukkan kamu kepada penduduk sebuah rumah yang dapat memeliharanya untuk kamu, serta mereka tulus ikhlas kepadanya?\"",
      "id": "dan Kami cegah Musa dari menyusu kepada perempuan-perempuan yang mau menyusui(nya) sebelum itu; maka berkatalah saudara Musa: \"Maukah kamu aku tunjukkan kepadamu ahlul bait yang akan memeliharanya untukmu dan mereka dapat berlaku baik kepadanya?\".",
      "ar": "۞ وَحَرَّمۡنَا عَلَیۡهِ ٱلۡمَرَاضِعَ مِن قَبۡلُ فَقَالَتۡ هَلۡ أَدُلُّكُمۡ عَلَىٰۤ أَهۡلِ بَیۡتࣲ یَكۡفُلُونَهُۥ لَكُمۡ وَهُمۡ لَهُۥ نَـٰصِحُونَ\n"
    }
  },
  {
    "id": 3265,
    "surahId": 28,
    "ayahNumber": 13,
    "arabicText": "فَرَدَدۡنَـٰهُ إِلَىٰۤ أُمِّهِۦ كَیۡ تَقَرَّ عَیۡنُهَا وَلَا تَحۡزَنَ وَلِتَعۡلَمَ أَنَّ وَعۡدَ ٱللَّهِ حَقࣱّ وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "And thus We restored him to his mother, so that her eye might he gladdened, and that she might grieve no longer, and that she might know that God’s promise always comes true - even though most of them know it not!",
      "ms": "Maka (dengan jalan itu) Kami kembalikan dia kepada ibunya supaya tenang tenteram hatinya dan tidak berdukacita (disebabkan bercerai dengannya); dan supaya ia mengetahui bahawa janji Allah (untuk menyelamatkannya) adalah benar; akan tetapi kebanyakan mereka tidak mengetahui (yang demikian itu).",
      "id": "Maka kami kembalikan Musa kepada ibunya, supaya senang hatinya dan tidak berduka cita dan supaya ia mengetahui bahwa janji Allah itu adalah benar, tetapi kebanyakan manusia tidak mengetahuinya.",
      "ar": "فَرَدَدۡنَـٰهُ إِلَىٰۤ أُمِّهِۦ كَیۡ تَقَرَّ عَیۡنُهَا وَلَا تَحۡزَنَ وَلِتَعۡلَمَ أَنَّ وَعۡدَ ٱللَّهِ حَقࣱّ وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 3266,
    "surahId": 28,
    "ayahNumber": 14,
    "arabicText": "وَلَمَّا بَلَغَ أَشُدَّهُۥ وَٱسۡتَوَىٰۤ ءَاتَیۡنَـٰهُ حُكۡمࣰا وَعِلۡمࣰاۚ وَكَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "Now when [Moses] reached full manhood and had become mature [of mind]. We bestowed upon him the ability to judge [between right and wrong] as well as [innate] knowledge: for thus do We reward the doers of good.",
      "ms": "Dan ketika Musa sampai ke peringkat umurnya yang cukup kekuatannya dan sempurna, Kami beri kepadanya kebijaksanaan serta ilmu pengetahuan; dan demikian Kami membalas orang-orang yang berusaha memperbaiki amalannya.",
      "id": "Dan setelah Musa cukup umur dan sempurna akalnya, Kami berikan kepadanya hikmah (kenabian) dan pengetahuan. Dan demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.",
      "ar": "وَلَمَّا بَلَغَ أَشُدَّهُۥ وَٱسۡتَوَىٰۤ ءَاتَیۡنَـٰهُ حُكۡمࣰا وَعِلۡمࣰاۚ وَكَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 3267,
    "surahId": 28,
    "ayahNumber": 15,
    "arabicText": "وَدَخَلَ ٱلۡمَدِینَةَ عَلَىٰ حِینِ غَفۡلَةࣲ مِّنۡ أَهۡلِهَا فَوَجَدَ فِیهَا رَجُلَیۡنِ یَقۡتَتِلَانِ هَـٰذَا مِن شِیعَتِهِۦ وَهَـٰذَا مِنۡ عَدُوِّهِۦۖ فَٱسۡتَغَـٰثَهُ ٱلَّذِی مِن شِیعَتِهِۦ عَلَى ٱلَّذِی مِنۡ عَدُوِّهِۦ فَوَكَزَهُۥ مُوسَىٰ فَقَضَىٰ عَلَیۡهِۖ قَالَ هَـٰذَا مِنۡ عَمَلِ ٱلشَّیۡطَـٰنِۖ إِنَّهُۥ عَدُوࣱّ مُّضِلࣱّ مُّبِینࣱ\n",
    "translations": {
      "en": "And [one day] he entered the city at a time when [most of] its people were [resting in their houses,] unaware of what was going on [in the streets]; and there he encountered two men fighting with one another - one of his own people, and the other of his enemies. And the one who belonged to his own people cried out to him for help against him who was of his enemies - whereupon Moses struck him down with his fist, and [thus] brought about his end. [But then] he said [to himself]: “This is of Satan’s doing! Verily, he is an open foe, leading [man] astray!”",
      "ms": "Dan masuklah ia ke bandar (Mesir) dalam masa penduduknya tidak menyedarinya, lalu didapatinya di situ dua orang lelaki sedang berkelahi, - seorang dari golongannya sendiri dan yang seorang lagi dari pihak musuhnya. Maka orang yang dari golongannya meminta tolong kepadanya melawan orang yang dari pihak musuhnya; Musa pun menumbuknya lalu menyebabkan orang itu mati. (pada saat itu) Musa berkata: \"Ini adalah dari kerja Syaitan, sesungguhnya Syaitan itu musuh yang menyesatkan, yang nyata (angkaranya) \".",
      "id": "Dan Musa masuk ke kota (Memphis) ketika penduduknya sedang lengah, maka didapatinya di dalam kota itu dua orang laki-laki yang berkelahi; yang seorang dari golongannya (Bani Israil) dan seorang (lagi) dari musuhnya (kaum Fir'aun). Maka orang yang dari golongannya meminta pertolongan kepadanya, untuk mengalahkan orang yang dari musuhnya lalu Musa meninjunya, dan matilah musuhnya itu. Musa berkata: \"Ini adalah perbuatan syaitan sesungguhnya syaitan itu adalah musuh yang menyesatkan lagi nyata (permusuhannya).",
      "ar": "وَدَخَلَ ٱلۡمَدِینَةَ عَلَىٰ حِینِ غَفۡلَةࣲ مِّنۡ أَهۡلِهَا فَوَجَدَ فِیهَا رَجُلَیۡنِ یَقۡتَتِلَانِ هَـٰذَا مِن شِیعَتِهِۦ وَهَـٰذَا مِنۡ عَدُوِّهِۦۖ فَٱسۡتَغَـٰثَهُ ٱلَّذِی مِن شِیعَتِهِۦ عَلَى ٱلَّذِی مِنۡ عَدُوِّهِۦ فَوَكَزَهُۥ مُوسَىٰ فَقَضَىٰ عَلَیۡهِۖ قَالَ هَـٰذَا مِنۡ عَمَلِ ٱلشَّیۡطَـٰنِۖ إِنَّهُۥ عَدُوࣱّ مُّضِلࣱّ مُّبِینࣱ\n"
    }
  },
  {
    "id": 3268,
    "surahId": 28,
    "ayahNumber": 16,
    "arabicText": "قَالَ رَبِّ إِنِّی ظَلَمۡتُ نَفۡسِی فَٱغۡفِرۡ لِی فَغَفَرَ لَهُۥۤۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِیمُ\n",
    "translations": {
      "en": "[And] he prayed: O my Sustainer! Verily, I have sinned against myself! Grant me, then, Thy forgiveness!” And He forgave him - for, verily, He alone is truly forgiving, a dispenser of grace.",
      "ms": "Ia merayu (dengan sesalnya): \"Wahai Tuhanku, sesungguhnya aku telah menganiaya diri sendiri; oleh itu ampunkanlah - apalah jua kiranya - akan dosaku\". (Maka Allah Taala menerima taubatnya) lalu mengampunkan dosanya; sesungguhnya Allah jualah Yang Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Musa mendoa: \"Ya Tuhanku, sesungguhnya aku telah menganiaya diriku sendiri karena itu ampunilah aku\". Maka Allah mengampuninya, sesungguhnya Allah Dialah Yang Maha Pengampun lagi Maha Penyayang.",
      "ar": "قَالَ رَبِّ إِنِّی ظَلَمۡتُ نَفۡسِی فَٱغۡفِرۡ لِی فَغَفَرَ لَهُۥۤۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِیمُ\n"
    }
  },
  {
    "id": 3269,
    "surahId": 28,
    "ayahNumber": 17,
    "arabicText": "قَالَ رَبِّ بِمَاۤ أَنۡعَمۡتَ عَلَیَّ فَلَنۡ أَكُونَ ظَهِیرࣰا لِّلۡمُجۡرِمِینَ\n",
    "translations": {
      "en": "Said he: “O my Sustainer! [I vow] by all the blessings which Thou hast bestowed on me: Never­more shall I aid such as are lost in sin!”",
      "ms": "Ia merayu lagi: \"Wahai Tuhanku, demi nikmat-nikmat yang Engkau kurniakan kepadaku, (peliharalah daku) supaya aku tidak akan menjadi penyokong kepada golongan yang bersalah\".",
      "id": "Musa berkata: \"Ya Tuhanku, demi nikmat yang telah Engkau anugerahkan kepadaku, aku sekali-kali tiada akan menjadi penolong bagi orang-orang yang berdosa\".",
      "ar": "قَالَ رَبِّ بِمَاۤ أَنۡعَمۡتَ عَلَیَّ فَلَنۡ أَكُونَ ظَهِیرࣰا لِّلۡمُجۡرِمِینَ\n"
    }
  },
  {
    "id": 3270,
    "surahId": 28,
    "ayahNumber": 18,
    "arabicText": "فَأَصۡبَحَ فِی ٱلۡمَدِینَةِ خَاۤىِٕفࣰا یَتَرَقَّبُ فَإِذَا ٱلَّذِی ٱسۡتَنصَرَهُۥ بِٱلۡأَمۡسِ یَسۡتَصۡرِخُهُۥۚ قَالَ لَهُۥ مُوسَىٰۤ إِنَّكَ لَغَوِیࣱّ مُّبِینࣱ\n",
    "translations": {
      "en": "And next morning he found himself in the city, looking fearfully about him, when lo! the one who had sought his help the day before [once again] cried out to him [for help whereupon] Moses said unto him: “Behold, thou art indeed, most clearly, deeply in the wrong!",
      "ms": "Semenjak itu, tinggalah ia di bandar (Mesir) dalam keadaan cemas sambil memerhatikan (berita mengenai dirinya), maka tiba-tiba orang yang meminta pertolongan kepadanya semalam, memanggil meminta pertolongannya lagi. Musa berkata kepadanya: \"Sesungguhnya engkau ini orang yang nyata sesatnya!\"",
      "id": "Karena itu, jadilah Musa di kota itu merasa takut menunggu-nunggu dengan khawatir (akibat perbuatannya), maka tiba-tiba orang yang meminta pertolongan kemarin berteriak meminta pertolongan kepadanya. Musa berkata kepadanya: \"Sesungguhnya kamu benar-benar orang sesat yang nyata (kesesatannya)\".",
      "ar": "فَأَصۡبَحَ فِی ٱلۡمَدِینَةِ خَاۤىِٕفࣰا یَتَرَقَّبُ فَإِذَا ٱلَّذِی ٱسۡتَنصَرَهُۥ بِٱلۡأَمۡسِ یَسۡتَصۡرِخُهُۥۚ قَالَ لَهُۥ مُوسَىٰۤ إِنَّكَ لَغَوِیࣱّ مُّبِینࣱ\n"
    }
  },
  {
    "id": 3271,
    "surahId": 28,
    "ayahNumber": 19,
    "arabicText": "فَلَمَّاۤ أَنۡ أَرَادَ أَن یَبۡطِشَ بِٱلَّذِی هُوَ عَدُوࣱّ لَّهُمَا قَالَ یَـٰمُوسَىٰۤ أَتُرِیدُ أَن تَقۡتُلَنِی كَمَا قَتَلۡتَ نَفۡسَۢا بِٱلۡأَمۡسِۖ إِن تُرِیدُ إِلَّاۤ أَن تَكُونَ جَبَّارࣰا فِی ٱلۡأَرۡضِ وَمَا تُرِیدُ أَن تَكُونَ مِنَ ٱلۡمُصۡلِحِینَ\n",
    "translations": {
      "en": "But then as soon as he was about to lay violent hands on the man who was their [common] enemy, the latter exclaimed: “O Moses, dost thou intend to slay me as thou didst slay another man yesterday? Thy sole aim is to become a tyrant in this land, for thou dost not care to be of those who would set things to rights!”",
      "ms": "Maka ketika ia bersedia hendak menumbuk orang yang menjadi musuh bagi mereka berdua berkatalah orang itu: \"Wahai Musa, adakah engkau hendak membunuhku sebagaimana engkau membunuh satu jiwa semalam? Sebenarnya engkau hanyalah hendak menjadi seorang yang kejam di bumi, dan tidaklah engkau hendak menjadi seorang pendamai\".",
      "id": "Maka tatkala Musa hendak memegang dengan keras orang yang menjadi musuh keduanya, musuhnya berkata: \"Hai Musa, apakah kamu bermaksud hendak membunuhku, sebagaimana kamu kemarin telah membunuh seorang manusia? Kamu tidak bermaksud melainkan hendak menjadi orang yang berbuat sewenang-wenang di negeri (ini), dan tiadalah kamu hendak menjadi salah seorang dari orang-orang yang mengadakan perdamaian\".",
      "ar": "فَلَمَّاۤ أَنۡ أَرَادَ أَن یَبۡطِشَ بِٱلَّذِی هُوَ عَدُوࣱّ لَّهُمَا قَالَ یَـٰمُوسَىٰۤ أَتُرِیدُ أَن تَقۡتُلَنِی كَمَا قَتَلۡتَ نَفۡسَۢا بِٱلۡأَمۡسِۖ إِن تُرِیدُ إِلَّاۤ أَن تَكُونَ جَبَّارࣰا فِی ٱلۡأَرۡضِ وَمَا تُرِیدُ أَن تَكُونَ مِنَ ٱلۡمُصۡلِحِینَ\n"
    }
  },
  {
    "id": 3272,
    "surahId": 28,
    "ayahNumber": 20,
    "arabicText": "وَجَاۤءَ رَجُلࣱ مِّنۡ أَقۡصَا ٱلۡمَدِینَةِ یَسۡعَىٰ قَالَ یَـٰمُوسَىٰۤ إِنَّ ٱلۡمَلَأَ یَأۡتَمِرُونَ بِكَ لِیَقۡتُلُوكَ فَٱخۡرُجۡ إِنِّی لَكَ مِنَ ٱلنَّـٰصِحِینَ\n",
    "translations": {
      "en": "And [then and there] a man came running from the farthermost end of the city, and said: “O Moses! Behold, the great ones [of the kingdom] are deli­berating upon thy case with a view to killing thee! Begone, then: verily, I am of those who wish thee well!”",
      "ms": "Dan datanglah seorang lelaki dari hujung bandar itu dengan berlari, (lalu menyampaikan berita) dengan berkata: \"Wahai Musa, sesungguhnya pegawai-pegawai Firaun sedang mengadakan pakatan terhadapmu, mereka hendak membunuhmu; oleh itu pergilah dari sini, sesungguhnya aku adalah pemberi nasihat secara ikhlas kepadamu\".",
      "id": "Dan datanglah seorang laki-laki dari ujung kota bergegas-gegas seraya berkata: \"Hai Musa, sesungguhnya pembesar negeri sedang berunding tentang kamu untuk membunuhmu, sebab itu keluarlah (dari kota ini) sesungguhnya aku termasuk orang-orang yang memberi nasehat kepadamu\".",
      "ar": "وَجَاۤءَ رَجُلࣱ مِّنۡ أَقۡصَا ٱلۡمَدِینَةِ یَسۡعَىٰ قَالَ یَـٰمُوسَىٰۤ إِنَّ ٱلۡمَلَأَ یَأۡتَمِرُونَ بِكَ لِیَقۡتُلُوكَ فَٱخۡرُجۡ إِنِّی لَكَ مِنَ ٱلنَّـٰصِحِینَ\n"
    }
  },
  {
    "id": 3273,
    "surahId": 28,
    "ayahNumber": 21,
    "arabicText": "فَخَرَجَ مِنۡهَا خَاۤىِٕفࣰا یَتَرَقَّبُۖ قَالَ رَبِّ نَجِّنِی مِنَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "So he went forth from thence, looking fearfully about him, and prayed: “O my Sustainer! Save me from all evildoing folk!”",
      "ms": "Musa pun keluarlah dari negeri itu dalam keadaan cemas sambil memerhatikan (berita mengenai dirinya) serta berdoa dengan berkata: \"Wahai Tuhanku, selamatkanlah daku dari kaum yang zalim \".",
      "id": "Maka keluarlah Musa dari kota itu dengan rasa takut menunggu-nunggu dengan khawatir, dia berdoa: \"Ya Tuhanku, selamatkanlah aku dari orang-orang yang zalim itu\".",
      "ar": "فَخَرَجَ مِنۡهَا خَاۤىِٕفࣰا یَتَرَقَّبُۖ قَالَ رَبِّ نَجِّنِی مِنَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 3274,
    "surahId": 28,
    "ayahNumber": 22,
    "arabicText": "وَلَمَّا تَوَجَّهَ تِلۡقَاۤءَ مَدۡیَنَ قَالَ عَسَىٰ رَبِّیۤ أَن یَهۡدِیَنِی سَوَاۤءَ ٱلسَّبِیلِ\n",
    "translations": {
      "en": "And as he turned his face towards Madyan, he said [to himself]: “It may well be that my Sustainer will [thus] guide me onto the right path”",
      "ms": "Dan setelah ia (meninggalkan Mesir dalam perjalanan) menuju ke negeri Madyan, berdoalah ia dengan berkata: \"Mudah-mudahan Tuhanku menunjukkan jalan yang benar kepadaku,\".",
      "id": "Dan tatkala ia menghadap kejurusan negeri Mad-yan ia berdoa (lagi): \"Mudah-mudahan Tuhanku memimpinku ke jalan yang benar\".",
      "ar": "وَلَمَّا تَوَجَّهَ تِلۡقَاۤءَ مَدۡیَنَ قَالَ عَسَىٰ رَبِّیۤ أَن یَهۡدِیَنِی سَوَاۤءَ ٱلسَّبِیلِ\n"
    }
  },
  {
    "id": 3275,
    "surahId": 28,
    "ayahNumber": 23,
    "arabicText": "وَلَمَّا وَرَدَ مَاۤءَ مَدۡیَنَ وَجَدَ عَلَیۡهِ أُمَّةࣰ مِّنَ ٱلنَّاسِ یَسۡقُونَ وَوَجَدَ مِن دُونِهِمُ ٱمۡرَأَتَیۡنِ تَذُودَانِۖ قَالَ مَا خَطۡبُكُمَاۖ قَالَتَا لَا نَسۡقِی حَتَّىٰ یُصۡدِرَ ٱلرِّعَاۤءُۖ وَأَبُونَا شَیۡخࣱ كَبِیرࣱ\n",
    "translations": {
      "en": "NOW WHEN he arrived at the wells of Madyan, he found there a large group of men who were watering [their herds and flocks]; and at some distance from them he came upon two women who were keeping back their flock. He asked [them]: “What is the matter with you?” They answered: “We cannot water [our animals] until the herdsmen drive [theirs] home - for [we are weak and] our father is a very old man.”",
      "ms": "Dan ketika dia sampai di telaga air negeri Madyan, ia dapati di situ sekumpulan orang-orang lelaki sedang memberi minum (binatang ternak masing-masing), dan ia juga dapati di sebelah mereka dua perempuan yang sedang menahan kambing-kambingnya. dia bertanya: \"Apa hal kamu berdua?\" Mereka menjawab: \"Kami tidak memberi minum (kambing-kambing kami) sehingga pengembala-pengembala itu membawa balik binatang ternak masing-masing; dan bapa kami seorang yang terlalu tua umurnya \".",
      "id": "Dan tatkala ia sampai di sumber air negeri Mad-yan ia menjumpai di sana sekumpulan orang yang sedang meminumkan (ternaknya), dan ia menjumpai di belakang orang banyak itu, dua orang wanita yang sedang menghambat (ternaknya). Musa berkata: \"Apakah maksudmu (dengan berbuat at begitu)?\" Kedua wanita itu menjawab: \"Kami tidak dapat meminumkan (ternak kami), sebelum pengembala-pengembala itu memulangkan (ternaknya), sedang bapak kami adalah orang tua yang telah lanjut umurnya\".",
      "ar": "وَلَمَّا وَرَدَ مَاۤءَ مَدۡیَنَ وَجَدَ عَلَیۡهِ أُمَّةࣰ مِّنَ ٱلنَّاسِ یَسۡقُونَ وَوَجَدَ مِن دُونِهِمُ ٱمۡرَأَتَیۡنِ تَذُودَانِۖ قَالَ مَا خَطۡبُكُمَاۖ قَالَتَا لَا نَسۡقِی حَتَّىٰ یُصۡدِرَ ٱلرِّعَاۤءُۖ وَأَبُونَا شَیۡخࣱ كَبِیرࣱ\n"
    }
  },
  {
    "id": 3276,
    "surahId": 28,
    "ayahNumber": 24,
    "arabicText": "فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰۤ إِلَى ٱلظِّلِّ فَقَالَ رَبِّ إِنِّی لِمَاۤ أَنزَلۡتَ إِلَیَّ مِنۡ خَیۡرࣲ فَقِیرࣱ\n",
    "translations": {
      "en": "So he watered [their flock] for them: and when he withdrew into the shade and prayed: “O my Sus­tainer! Verily, in dire need am I of any good which Thou mayest bestow upon me!”",
      "ms": "Maka Musa pun memberi minum kepada binatang-binatang ternak mereka, kemudian ia pergi ke tempat teduh lalu berdoa dengan berkata: \"Wahai Tuhanku, sesungguhnya aku sangat berhajat kepada sebarang rezeki pemberian yang Engkau berikan\".",
      "id": "Maka Musa memberi minum ternak itu untuk (menolong) keduanya, kemudian dia kembali ke tempat yang teduh lalu berdoa: \"Ya Tuhanku sesungguhnya aku sangat memerlukan sesuatu kebaikan yang Engkau turunkan kepadaku\".",
      "ar": "فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰۤ إِلَى ٱلظِّلِّ فَقَالَ رَبِّ إِنِّی لِمَاۤ أَنزَلۡتَ إِلَیَّ مِنۡ خَیۡرࣲ فَقِیرࣱ\n"
    }
  },
  {
    "id": 3277,
    "surahId": 28,
    "ayahNumber": 25,
    "arabicText": "فَجَاۤءَتۡهُ إِحۡدَىٰهُمَا تَمۡشِی عَلَى ٱسۡتِحۡیَاۤءࣲ قَالَتۡ إِنَّ أَبِی یَدۡعُوكَ لِیَجۡزِیَكَ أَجۡرَ مَا سَقَیۡتَ لَنَاۚ فَلَمَّا جَاۤءَهُۥ وَقَصَّ عَلَیۡهِ ٱلۡقَصَصَ قَالَ لَا تَخَفۡۖ نَجَوۡتَ مِنَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "[Shortly] afterwards, one of the two [maidens] approached him, walking shyly, and said: “Behold, my father invites thee, so that he might duly reward thee for thy having watered [our flock] for us.” And as soon as [Moses] came unto him and told him the story [of his life], he said: “Have no fear! Thou art now safe from those evildoing folk!”",
      "ms": "Kemudian salah seorang dari perempuan dua beradik itu datang mendapatkannya dengan berjalan dalam keadaan tersipu-sipu sambil berkata:\" Sebenarnya bapaku menjemputmu untuk membalas budimu memberi minum binatang ternak kami\". Maka ketika Musa datang mendapatkannya dan menceritakan kepadanya kisah-kisah kejadian yang berlaku (mengenai dirinya) berkatalah orang tua itu kepadanya: \"Janganlah engkau bimbang, engkau telah selamat dari kaum yang zalim itu \".",
      "id": "Kemudian datanglah kepada Musa salah seorang dari kedua wanita itu berjalan kemalu-maluan, ia berkata: \"Sesungguhnya bapakku memanggil kamu agar ia memberikan balasan terhadap (kebaikan)mu memberi minum (ternak) kami\". Maka tatkala Musa mendatangi bapaknya (Syu'aib) dan menceritakan kepadanya cerita (mengenai dirinya), Syu'aib berkata: \"Janganlah kamu takut. Kamu telah selamat dari orang-orang yang zalim itu\".",
      "ar": "فَجَاۤءَتۡهُ إِحۡدَىٰهُمَا تَمۡشِی عَلَى ٱسۡتِحۡیَاۤءࣲ قَالَتۡ إِنَّ أَبِی یَدۡعُوكَ لِیَجۡزِیَكَ أَجۡرَ مَا سَقَیۡتَ لَنَاۚ فَلَمَّا جَاۤءَهُۥ وَقَصَّ عَلَیۡهِ ٱلۡقَصَصَ قَالَ لَا تَخَفۡۖ نَجَوۡتَ مِنَ ٱلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 3278,
    "surahId": 28,
    "ayahNumber": 26,
    "arabicText": "قَالَتۡ إِحۡدَىٰهُمَا یَـٰۤأَبَتِ ٱسۡتَـٔۡجِرۡهُۖ إِنَّ خَیۡرَ مَنِ ٱسۡتَـٔۡجَرۡتَ ٱلۡقَوِیُّ ٱلۡأَمِینُ\n",
    "translations": {
      "en": "Said one of the two [daughters]: “O my father! Hire him: for, behold, the best [man] that thou couldst hire is one who is [as] strong and worthy of trust [as he]!”",
      "ms": "Salah seorang di antara perempuan yang berdua itu berkata: \"Wahai ayah, ambilah dia memjadi orang upahan (mengembala kambing kita), sesungguhnya sebaik-baik orang yang ayah ambil bekerja ialah orang yang kuat, lagi amanah\".",
      "id": "Salah seorang dari kedua wanita itu berkata: \"Ya bapakku ambillah ia sebagai orang yang bekerja (pada kita), karena sesungguhnya orang yang paling baik yang kamu ambil untuk bekerja (pada kita) ialah orang yang kuat lagi dapat dipercaya\".",
      "ar": "قَالَتۡ إِحۡدَىٰهُمَا یَـٰۤأَبَتِ ٱسۡتَـٔۡجِرۡهُۖ إِنَّ خَیۡرَ مَنِ ٱسۡتَـٔۡجَرۡتَ ٱلۡقَوِیُّ ٱلۡأَمِینُ\n"
    }
  },
  {
    "id": 3279,
    "surahId": 28,
    "ayahNumber": 27,
    "arabicText": "قَالَ إِنِّیۤ أُرِیدُ أَنۡ أُنكِحَكَ إِحۡدَى ٱبۡنَتَیَّ هَـٰتَیۡنِ عَلَىٰۤ أَن تَأۡجُرَنِی ثَمَـٰنِیَ حِجَجࣲۖ فَإِنۡ أَتۡمَمۡتَ عَشۡرࣰا فَمِنۡ عِندِكَۖ وَمَاۤ أُرِیدُ أَنۡ أَشُقَّ عَلَیۡكَۚ سَتَجِدُنِیۤ إِن شَاۤءَ ٱللَّهُ مِنَ ٱلصَّـٰلِحِینَ\n",
    "translations": {
      "en": "[After some time, the father] said: “Behold, I am willing to let thee wed one of these two daughters of mine on the understanding that thou wilt remain eight years in my service; and if thou shouldst com­plete ten [years], that would be [an act of grace] from thee, for I do not want to impose any hardship on thee: [on the contrary,] thou wilt find me, if God so wills, righteous in all my dealings.”",
      "ms": "Bapa perempuan itu berkata (kepada Musa): \"Aku hendak mengahwinkanmu dengan salah seorang dari dua anak perempuanku ini, dengan syarat bahawa engkau bekerja denganku selama delapan tahun; dalam pada itu, jika engkau genapkan menjadi sepuluh tahun, maka yang demikian itu adalah dari kerelaanmu sendiri. Dan (ingatlah) aku tidak bertujuan hendak menyusahkanmu; engkau akan dapati aku Insya Allah, dari orang-orang yang baik layanannya\".",
      "id": "Berkatalah dia (Syu'aib): \"Sesungguhnya aku bermaksud menikahkan kamu dengan salah seorang dari kedua anakku ini, atas dasar bahwa kamu bekerja denganku delapan tahun dan jika kamu cukupkan sepuluh tahun maka itu adalah (suatu kebaikan) dari kamu, maka aku tidak hendak memberati kamu. Dan kamu Insya Allah akan mendapatiku termasuk orang-orang yang baik\".",
      "ar": "قَالَ إِنِّیۤ أُرِیدُ أَنۡ أُنكِحَكَ إِحۡدَى ٱبۡنَتَیَّ هَـٰتَیۡنِ عَلَىٰۤ أَن تَأۡجُرَنِی ثَمَـٰنِیَ حِجَجࣲۖ فَإِنۡ أَتۡمَمۡتَ عَشۡرࣰا فَمِنۡ عِندِكَۖ وَمَاۤ أُرِیدُ أَنۡ أَشُقَّ عَلَیۡكَۚ سَتَجِدُنِیۤ إِن شَاۤءَ ٱللَّهُ مِنَ ٱلصَّـٰلِحِینَ\n"
    }
  },
  {
    "id": 3280,
    "surahId": 28,
    "ayahNumber": 28,
    "arabicText": "قَالَ ذَ ٰ⁠لِكَ بَیۡنِی وَبَیۡنَكَۖ أَیَّمَا ٱلۡأَجَلَیۡنِ قَضَیۡتُ فَلَا عُدۡوَ ٰ⁠نَ عَلَیَّۖ وَٱللَّهُ عَلَىٰ مَا نَقُولُ وَكِیلࣱ\n",
    "translations": {
      "en": "Answered [Moses]: “Thus shall it be between me and thee! Whichever of the two terms I fulfill, let there be no ill will against me. And God be witness to all that we say!”",
      "ms": "Musa menjawab: \"Perjanjian itu adalah antaraku denganmu (tetap dihormati bersama); yang mana sahaja dari dua tempoh itu yang aku tunaikan, maka janganlah hendaknya aku disalahkan. Dan Allah jualah menjadi Pengawas terhadap apa yang kita katakan itu\".",
      "id": "Dia (Musa) berkata: \"Itulah (perjanjian) antara aku dan kamu. Mana saja dari kedua waktu yang ditentukan itu aku sempurnakan, maka tidak ada tuntutan tambahan atas diriku (lagi). Dan Allah adalah saksi atas apa yang kita ucapkan\".",
      "ar": "قَالَ ذَ ٰ⁠لِكَ بَیۡنِی وَبَیۡنَكَۖ أَیَّمَا ٱلۡأَجَلَیۡنِ قَضَیۡتُ فَلَا عُدۡوَ ٰ⁠نَ عَلَیَّۖ وَٱللَّهُ عَلَىٰ مَا نَقُولُ وَكِیلࣱ\n"
    }
  },
  {
    "id": 3281,
    "surahId": 28,
    "ayahNumber": 29,
    "arabicText": "۞ فَلَمَّا قَضَىٰ مُوسَى ٱلۡأَجَلَ وَسَارَ بِأَهۡلِهِۦۤ ءَانَسَ مِن جَانِبِ ٱلطُّورِ نَارࣰاۖ قَالَ لِأَهۡلِهِ ٱمۡكُثُوۤا۟ إِنِّیۤ ءَانَسۡتُ نَارࣰا لَّعَلِّیۤ ءَاتِیكُم مِّنۡهَا بِخَبَرٍ أَوۡ جَذۡوَةࣲ مِّنَ ٱلنَّارِ لَعَلَّكُمۡ تَصۡطَلُونَ\n",
    "translations": {
      "en": "And when Moses had fulfilled his term and was wandering with his family [in the desert], he per­ceived a fire on the slope of Mount Sinai; [and so] he said to his family: “Wait here. Behold, I perceive a fire [far away]; perhaps I may bring you from there some tiding, or [at least] a burning brand from the fire, so that you might warm yourselves.",
      "ms": "Setelah Musa menyempurnakan tempoh kerjanya itu dan (mendapat izin) berjalan dengan isterinya (kembali ke Mesir), ia melihat (dalam perjalanannya itu) api dari sebelah Gunung Tursina. (Ketika itu) berkatalah ia kepada isterinya: \"Berhentilah; sesungguhnya aku ada melihat api, semoga aku dapat membawa kepada kamu sesuatu berita dari situ, atau sepuntung dari api itu, supaya kamu dapat memanaskan diri\".",
      "id": "Maka tatkala Musa telah menyelesaikan waktu yang ditentukan dan dia berangkat dengan keluarganya, dilihatnyalah api di lereng gunung ia berkata kepada keluarganya: \"Tunggulah (di sini), sesungguhnya aku melihat api, mudah-mudahan aku dapat membawa suatu berita kepadamu dari (tempat) api itu atau (membawa) sesuluh api, agar kamu dapat menghangatkan badan\".",
      "ar": "۞ فَلَمَّا قَضَىٰ مُوسَى ٱلۡأَجَلَ وَسَارَ بِأَهۡلِهِۦۤ ءَانَسَ مِن جَانِبِ ٱلطُّورِ نَارࣰاۖ قَالَ لِأَهۡلِهِ ٱمۡكُثُوۤا۟ إِنِّیۤ ءَانَسۡتُ نَارࣰا لَّعَلِّیۤ ءَاتِیكُم مِّنۡهَا بِخَبَرٍ أَوۡ جَذۡوَةࣲ مِّنَ ٱلنَّارِ لَعَلَّكُمۡ تَصۡطَلُونَ\n"
    }
  },
  {
    "id": 3282,
    "surahId": 28,
    "ayahNumber": 30,
    "arabicText": "فَلَمَّاۤ أَتَىٰهَا نُودِیَ مِن شَـٰطِىِٕ ٱلۡوَادِ ٱلۡأَیۡمَنِ فِی ٱلۡبُقۡعَةِ ٱلۡمُبَـٰرَكَةِ مِنَ ٱلشَّجَرَةِ أَن یَـٰمُوسَىٰۤ إِنِّیۤ أَنَا ٱللَّهُ رَبُّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "But when he came close to it, a call was sounded from the right-side bank of the valley, out of the tree [burning] on blessed ground: “O Moses! Verily, I am God, the Sustainer of all the worlds!”",
      "ms": "Maka ketika ia sampai ke tempat api itu, (kedengaran) ia diseru dari tepi lembah yang di sebelah kanan, di tempat yang dilimpahi berkat, dari arah pohon kayu (yang ada di situ): \"Wahai Musa, sesungguhnya Akulah Allah Tuhan sekalian alam. (Sesungguhnya api itu adalah sebagai satu isyarat yang didatangkan oleh Allah untuk menarik perhatian Musa ke tempat itu dan bukannya zat Allah, Wallahu A'lam)",
      "id": "Maka tatkala Musa sampai ke (tempat) api itu, diserulah dia dari (arah) pinggir lembah yang sebelah kanan(nya) pada tempat yang diberkahi, dari sebatang pohon kayu, yaitu: \"Ya Musa, sesungguhnya aku adalah Allah, Tuhan semesta alam.",
      "ar": "فَلَمَّاۤ أَتَىٰهَا نُودِیَ مِن شَـٰطِىِٕ ٱلۡوَادِ ٱلۡأَیۡمَنِ فِی ٱلۡبُقۡعَةِ ٱلۡمُبَـٰرَكَةِ مِنَ ٱلشَّجَرَةِ أَن یَـٰمُوسَىٰۤ إِنِّیۤ أَنَا ٱللَّهُ رَبُّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 3283,
    "surahId": 28,
    "ayahNumber": 31,
    "arabicText": "وَأَنۡ أَلۡقِ عَصَاكَۚ فَلَمَّا رَءَاهَا تَهۡتَزُّ كَأَنَّهَا جَاۤنࣱّ وَلَّىٰ مُدۡبِرࣰا وَلَمۡ یُعَقِّبۡۚ یَـٰمُوسَىٰۤ أَقۡبِلۡ وَلَا تَخَفۡۖ إِنَّكَ مِنَ ٱلۡـَٔامِنِینَ\n",
    "translations": {
      "en": "And [then He said]: “Throw down thy staff!” But as soon as [Moses] saw it move rapidly, as if it were a snake, he drew back [in terror], and did not [dare to] return. [And God spoke to him again:] “O Moses! Draw near, and have no fear - for, behold, thou art of those who are secure [in this world and in the next]!",
      "ms": "\"Dan (sekarang) campakkanlah tongkatmu\". (Ia pun mencampaknya), maka apabila ia melihat tongkatnya itu (menjadi seekor ular besar) bergerak cepat tangkas, seolah-olah seekor ular kecil, berpalinglah ia melarikan diri dan tidak menoleh lagi. (Lalu ia diseru): \"Wahai Musa, datanglah kemari dan janganlah engkau takut. Sesungguhnya engkau dari orang-orang yang beroleh aman.",
      "id": "dan lemparkanlah tongkatmu. Maka tatkala (tongkat itu menjadi ular dan) Musa melihatnya bergerak-gerak seolah-olah dia seekor ular yang gesit, larilah ia berbalik ke belakang tanpa menoleh. (Kemudian Musa diseru): \"Hai Musa datanglah kepada-Ku dan janganlah kamu takut. Sesungguhnya kamu termasuk orang-orang yang aman.",
      "ar": "وَأَنۡ أَلۡقِ عَصَاكَۚ فَلَمَّا رَءَاهَا تَهۡتَزُّ كَأَنَّهَا جَاۤنࣱّ وَلَّىٰ مُدۡبِرࣰا وَلَمۡ یُعَقِّبۡۚ یَـٰمُوسَىٰۤ أَقۡبِلۡ وَلَا تَخَفۡۖ إِنَّكَ مِنَ ٱلۡـَٔامِنِینَ\n"
    }
  },
  {
    "id": 3284,
    "surahId": 28,
    "ayahNumber": 32,
    "arabicText": "ٱسۡلُكۡ یَدَكَ فِی جَیۡبِكَ تَخۡرُجۡ بَیۡضَاۤءَ مِنۡ غَیۡرِ سُوۤءࣲ وَٱضۡمُمۡ إِلَیۡكَ جَنَاحَكَ مِنَ ٱلرَّهۡبِۖ فَذَ ٰ⁠نِكَ بُرۡهَـٰنَانِ مِن رَّبِّكَ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِی۟هِۦۤۚ إِنَّهُمۡ كَانُوا۟ قَوۡمࣰا فَـٰسِقِینَ\n",
    "translations": {
      "en": "“[And now] put thy hand into thy bosom: it will come forth [shining] white, without blemish. And [henceforth] hold thine arm close to thyself, free of all fear. “These, then, shall be the two signs [of thy bearing a message] from thy Sustainer unto Pharaoh and his great ones - for, behold, they are people depraved!”",
      "ms": "\"Masukkanlah tanganmu melalui belahan dada bajumu, nescaya keluarlah ia putih bersinar-sinar dengan tiada cacat; dan kepitlah tanganmu di celah ketiakmu ketika merasa takut (nescaya hilanglah takutmu). Yang demikian adalah dua bukti dari Tuhanmu (untuk engkau menunjukkannya) kepada Firaun dan kaumnya. Sesungguhnya mereka itu adalah kaum yang fasik - derhaka\"",
      "id": "Masukkanlah tanganmu ke leher bajumu, niscaya ia keluar putih tidak bercacat bukan karena penyakit, dan dekapkanlah kedua tanganmu (ke dada)mu bila ketakutan, maka yang demikian itu adalah dua mukjizat dari Tuhanmu (yang akan kamu hadapkan kepada Fir'aun dan pembesar-pembesarnya). Sesungguhnya mereka adalah orang-orang yang fasik\".",
      "ar": "ٱسۡلُكۡ یَدَكَ فِی جَیۡبِكَ تَخۡرُجۡ بَیۡضَاۤءَ مِنۡ غَیۡرِ سُوۤءࣲ وَٱضۡمُمۡ إِلَیۡكَ جَنَاحَكَ مِنَ ٱلرَّهۡبِۖ فَذَ ٰ⁠نِكَ بُرۡهَـٰنَانِ مِن رَّبِّكَ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِی۟هِۦۤۚ إِنَّهُمۡ كَانُوا۟ قَوۡمࣰا فَـٰسِقِینَ\n"
    }
  },
  {
    "id": 3285,
    "surahId": 28,
    "ayahNumber": 33,
    "arabicText": "قَالَ رَبِّ إِنِّی قَتَلۡتُ مِنۡهُمۡ نَفۡسࣰا فَأَخَافُ أَن یَقۡتُلُونِ\n",
    "translations": {
      "en": "Said [Moses] “O my Sustainer! I have slain one of them, and so I fear that they will slay me.",
      "ms": "Nabi Musa merayu dengan berkata: \"Wahai Tuhanku, bahawa aku telah membunuh seorang dari kalangan mereka; oleh itu aku takut mereka akan membunuhku \"",
      "id": "Musa berkata: \"Ya Tuhanku sesungguhnya aku, telah membunuh seorang manusia dari golongan mereka, maka aku takut mereka akan membunuhku.",
      "ar": "قَالَ رَبِّ إِنِّی قَتَلۡتُ مِنۡهُمۡ نَفۡسࣰا فَأَخَافُ أَن یَقۡتُلُونِ\n"
    }
  },
  {
    "id": 3286,
    "surahId": 28,
    "ayahNumber": 34,
    "arabicText": "وَأَخِی هَـٰرُونُ هُوَ أَفۡصَحُ مِنِّی لِسَانࣰا فَأَرۡسِلۡهُ مَعِیَ رِدۡءࣰا یُصَدِّقُنِیۤۖ إِنِّیۤ أَخَافُ أَن یُكَذِّبُونِ\n",
    "translations": {
      "en": "And my brother Aaron - he is far better in speech than I am. Send him, therefore, as a helper, so that he might [more eloquently] bear witness to my speaking the truth: for I fear indeed that they will give me the lie.”",
      "ms": "\"Dan saudaraku - Harun, ia lebih fasih lidahnya daripadaku, maka utuslah dia bersama-samaku sebagai penyokong yang mengakui kebenaranku; sesungguhnya aku bimbang bahawa mereka akan mendustakan daku\".",
      "id": "Dan saudaraku Harun dia lebih fasih lidahnya daripadaku, maka utuslah dia bersamaku sebagai pembantuku untuk membenarkan (perkataan)ku; sesungguhnya aku khawatir mereka akan mendustakanku\".",
      "ar": "وَأَخِی هَـٰرُونُ هُوَ أَفۡصَحُ مِنِّی لِسَانࣰا فَأَرۡسِلۡهُ مَعِیَ رِدۡءࣰا یُصَدِّقُنِیۤۖ إِنِّیۤ أَخَافُ أَن یُكَذِّبُونِ\n"
    }
  },
  {
    "id": 3287,
    "surahId": 28,
    "ayahNumber": 35,
    "arabicText": "قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِیكَ وَنَجۡعَلُ لَكُمَا سُلۡطَـٰنࣰا فَلَا یَصِلُونَ إِلَیۡكُمَا بِـَٔایَـٰتِنَاۤۚ أَنتُمَا وَمَنِ ٱتَّبَعَكُمَا ٱلۡغَـٰلِبُونَ\n",
    "translations": {
      "en": "Said He: “We shall strengthen thine arm through thy brother, and endow both of you with power, so that they will not be able to touch you: by virtue of Our messages shall you two, and all who follow you, prevail!”",
      "ms": "Allah berfirman: \"Kami akan menguatkan tenaga dan daya-usahamu dengan saudaramu (Harun), dan Kami akan memberikan kuasa kemenangan kepada kamu berdua oleh itu mereka tidak akan sampai kepada maksud membahayakan atau mengalahkan kamu. Dengan membawa ayat-ayat keterangan Kami itu, kamu berdua serta pengikut-pengikut kamu akan menang\".",
      "id": "Allah berfirman: \"Kami akan membantumu dengan saudaramu, dan Kami berikan kepadamu berdua kekuasaan yang besar, maka mereka tidak dapat mencapaimu; (berangkatlah kamu berdua) dengan membawa mukjizat Kami, kamu berdua dan orang yang mengikuti kamulah yang akan menang.",
      "ar": "قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِیكَ وَنَجۡعَلُ لَكُمَا سُلۡطَـٰنࣰا فَلَا یَصِلُونَ إِلَیۡكُمَا بِـَٔایَـٰتِنَاۤۚ أَنتُمَا وَمَنِ ٱتَّبَعَكُمَا ٱلۡغَـٰلِبُونَ\n"
    }
  },
  {
    "id": 3288,
    "surahId": 28,
    "ayahNumber": 36,
    "arabicText": "فَلَمَّا جَاۤءَهُم مُّوسَىٰ بِـَٔایَـٰتِنَا بَیِّنَـٰتࣲ قَالُوا۟ مَا هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّفۡتَرࣰى وَمَا سَمِعۡنَا بِهَـٰذَا فِیۤ ءَابَاۤىِٕنَا ٱلۡأَوَّلِینَ\n",
    "translations": {
      "en": "But as soon as Moses came unto them with Our clear messages [Pharaoh and his great ones] said: “All this is nothing but spellbinding eloquence devised [by man]: and never did we hear [the like of] this, [nor has it ever been heard of] in the time of our forebears of old!”",
      "ms": "Setelah Nabi Musa datang kepada Firaun dan kaumnya dengan membawa ayat-ayat keterangan Kami yang terang nyata, mereka berkata: \"Apa yang engkau bawa ini hanyalah sihir yang dibuat-buat, dan kami tidak pernah mendengar tentang perkara ini dalam kalangan datuk nenek kami yang telah lalu\".",
      "id": "Maka tatkala Musa datang kepada mereka dengan (membawa) mukjizat-mukjizat Kami yang nyata, mereka berkata: \"Ini tidak lain hanyalah sihir yang dibuat-buat dan kami belum pernah mendengar (seruan yang seperti) ini pada nenek moyang kami dahulu\".",
      "ar": "فَلَمَّا جَاۤءَهُم مُّوسَىٰ بِـَٔایَـٰتِنَا بَیِّنَـٰتࣲ قَالُوا۟ مَا هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّفۡتَرࣰى وَمَا سَمِعۡنَا بِهَـٰذَا فِیۤ ءَابَاۤىِٕنَا ٱلۡأَوَّلِینَ\n"
    }
  },
  {
    "id": 3289,
    "surahId": 28,
    "ayahNumber": 37,
    "arabicText": "وَقَالَ مُوسَىٰ رَبِّیۤ أَعۡلَمُ بِمَن جَاۤءَ بِٱلۡهُدَىٰ مِنۡ عِندِهِۦ وَمَن تَكُونُ لَهُۥ عَـٰقِبَةُ ٱلدَّارِۚ إِنَّهُۥ لَا یُفۡلِحُ ٱلظَّـٰلِمُونَ\n",
    "translations": {
      "en": "And Moses replied: “My Sustainer knows best as to who comes with guidance from Him, and to whom the future belongs! Verily, never will evil­doers attain to a happy state!”",
      "ms": "Dan (bagi menjawabnya) Nabi Musa berkata: \"Tuhanku lebih mengetahui siapakah yang membawa hidayah petunjuk dari sisiNya dan siapa yang akan beroleh kesudahan yang baik di dunia ini. Sesungguhnya orang-orang yang zalim tidak akan berjaya\".",
      "id": "Musa menjawab: \"Tuhanku lebih mengetahui orang yang (patut) membawa petunjuk dari sisi-Nya dan siapa yang akan mendapat kesudahan (yang baik) di negeri akhirat. Sesungguhnya tidaklah akan mendapat kemenangan orang-orang yang zalim\".",
      "ar": "وَقَالَ مُوسَىٰ رَبِّیۤ أَعۡلَمُ بِمَن جَاۤءَ بِٱلۡهُدَىٰ مِنۡ عِندِهِۦ وَمَن تَكُونُ لَهُۥ عَـٰقِبَةُ ٱلدَّارِۚ إِنَّهُۥ لَا یُفۡلِحُ ٱلظَّـٰلِمُونَ\n"
    }
  },
  {
    "id": 3290,
    "surahId": 28,
    "ayahNumber": 38,
    "arabicText": "وَقَالَ فِرۡعَوۡنُ یَـٰۤأَیُّهَا ٱلۡمَلَأُ مَا عَلِمۡتُ لَكُم مِّنۡ إِلَـٰهٍ غَیۡرِی فَأَوۡقِدۡ لِی یَـٰهَـٰمَـٰنُ عَلَى ٱلطِّینِ فَٱجۡعَل لِّی صَرۡحࣰا لَّعَلِّیۤ أَطَّلِعُ إِلَىٰۤ إِلَـٰهِ مُوسَىٰ وَإِنِّی لَأَظُنُّهُۥ مِنَ ٱلۡكَـٰذِبِینَ\n",
    "translations": {
      "en": "Whereupon Pharaoh said: “O you nobles! I did not know that you could have any deity other than myself Well, then, O Haman, kindle me a fire for [baking bricks of] clay, and then build me a lofty tower, that haply I may have a look at the god of Moses although, behold, I am convinced that he is of those who [always] tell lies!”",
      "ms": "Dan Firaun pula berkata: \"Wahai orang-orangku, aku tidak mengetahui ada bagi kamu sebarang tuhan yang lain daripadaku; oleh itu, wahai Haman, bakarkanlah untukku batu-bata, serta binalah untukku bangunan yang tinggi, supaya aku naik melihat Tuhan Musa (yang dikatakannya itu); dan sesungguhnya aku percaya adalah Musa dari orang-orang yang berdusta\".",
      "id": "Dan berkata Fir'aun: \"Hai pembesar kaumku, aku tidak mengetahui tuhan bagimu selain aku. Maka bakarlah hai Haman untukku tanah liat kemudian buatkanlah untukku bangunan yang tinggi supaya aku dapat naik melihat Tuhan Musa, dan sesungguhnya aku benar-benar yakin bahwa dia termasuk orang-orang pendusta\".",
      "ar": "وَقَالَ فِرۡعَوۡنُ یَـٰۤأَیُّهَا ٱلۡمَلَأُ مَا عَلِمۡتُ لَكُم مِّنۡ إِلَـٰهٍ غَیۡرِی فَأَوۡقِدۡ لِی یَـٰهَـٰمَـٰنُ عَلَى ٱلطِّینِ فَٱجۡعَل لِّی صَرۡحࣰا لَّعَلِّیۤ أَطَّلِعُ إِلَىٰۤ إِلَـٰهِ مُوسَىٰ وَإِنِّی لَأَظُنُّهُۥ مِنَ ٱلۡكَـٰذِبِینَ\n"
    }
  },
  {
    "id": 3291,
    "surahId": 28,
    "ayahNumber": 39,
    "arabicText": "وَٱسۡتَكۡبَرَ هُوَ وَجُنُودُهُۥ فِی ٱلۡأَرۡضِ بِغَیۡرِ ٱلۡحَقِّ وَظَنُّوۤا۟ أَنَّهُمۡ إِلَیۡنَا لَا یُرۡجَعُونَ\n",
    "translations": {
      "en": "Thus arrogantly, without the least good sense, did he and his hosts behave on earth - just as if they thought that they would never have to appear before Us [for judgment]!",
      "ms": "Dan berlaku sombong takburlah Firaun dan tenteranya di negeri itu dengan tiada alasan yang benar, dan mereka menyangka bahawa mereka tidak akan dikembalikan kepada Kami.",
      "id": "dan berlaku angkuhlah Fir'aun dan bala tentaranya di bumi (Mesir) tanpa alasan yang benar dan mereka menyangka bahwa mereka tidak akan dikembalikan kepada Kami.",
      "ar": "وَٱسۡتَكۡبَرَ هُوَ وَجُنُودُهُۥ فِی ٱلۡأَرۡضِ بِغَیۡرِ ٱلۡحَقِّ وَظَنُّوۤا۟ أَنَّهُمۡ إِلَیۡنَا لَا یُرۡجَعُونَ\n"
    }
  },
  {
    "id": 3292,
    "surahId": 28,
    "ayahNumber": 40,
    "arabicText": "فَأَخَذۡنَـٰهُ وَجُنُودَهُۥ فَنَبَذۡنَـٰهُمۡ فِی ٱلۡیَمِّۖ فَٱنظُرۡ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "And so We seized him and his hosts and cast them into the sea: and behold what happened in the end to those evildoers:",
      "ms": "Dengan sebab itu Kami mengepungnya bersama-sama tenteranya serta Kami humbankan mereka ke dalam laut; maka perhatikanlah bagaimana buruknya kesudahan orang-orang yang zalim.",
      "id": "Maka Kami hukumlah Fir'aun dan bala tentaranya, lalu Kami lemparkan mereka ke dalam laut. Maka lihatlah bagaimana akibat orang-orang yang zalim.",
      "ar": "فَأَخَذۡنَـٰهُ وَجُنُودَهُۥ فَنَبَذۡنَـٰهُمۡ فِی ٱلۡیَمِّۖ فَٱنظُرۡ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 3293,
    "surahId": 28,
    "ayahNumber": 41,
    "arabicText": "وَجَعَلۡنَـٰهُمۡ أَىِٕمَّةࣰ یَدۡعُونَ إِلَى ٱلنَّارِۖ وَیَوۡمَ ٱلۡقِیَـٰمَةِ لَا یُنصَرُونَ\n",
    "translations": {
      "en": "[We destroyed them,] and We set them up as archetypes [of evil] that show the way to the fire [of hell]; and [whereas] no succour will come to them on Resurrection Day,",
      "ms": "Dan Kami jadikan mereka ketua-ketua (dalam kesesatan) yang mengajak ke neraka (dengan kekufurannya), dan pada hari kiamat pula mereka tidak mendapat sebarang pertolongan.",
      "id": "Dan Kami jadikan mereka pemimpin-pemimpin yang menyeru (manusia) ke neraka dan pada hari kiamat mereka tidak akan ditolong.",
      "ar": "وَجَعَلۡنَـٰهُمۡ أَىِٕمَّةࣰ یَدۡعُونَ إِلَى ٱلنَّارِۖ وَیَوۡمَ ٱلۡقِیَـٰمَةِ لَا یُنصَرُونَ\n"
    }
  },
  {
    "id": 3294,
    "surahId": 28,
    "ayahNumber": 42,
    "arabicText": "وَأَتۡبَعۡنَـٰهُمۡ فِی هَـٰذِهِ ٱلدُّنۡیَا لَعۡنَةࣰۖ وَیَوۡمَ ٱلۡقِیَـٰمَةِ هُم مِّنَ ٱلۡمَقۡبُوحِینَ\n",
    "translations": {
      "en": "We have caused a curse to follow them in this world as well; and on Resurrection Day they will find themselves among those who are bereft of all good.",
      "ms": "Dan Kami iringi mereka dengan laknat di dunia ini, dan pada hari kiamat pula adalah mereka dari orang-orang yang tersingkir (dari rahmat Kami) dengan sehina-hinanya.",
      "id": "Dan Kami ikutkanlah laknat kepada mereka di dunia ini; dan pada hari kiamat mereka termasuk orang-orang yang dijauhkan (dari rahmat Allah).",
      "ar": "وَأَتۡبَعۡنَـٰهُمۡ فِی هَـٰذِهِ ٱلدُّنۡیَا لَعۡنَةࣰۖ وَیَوۡمَ ٱلۡقِیَـٰمَةِ هُم مِّنَ ٱلۡمَقۡبُوحِینَ\n"
    }
  },
  {
    "id": 3295,
    "surahId": 28,
    "ayahNumber": 43,
    "arabicText": "وَلَقَدۡ ءَاتَیۡنَا مُوسَى ٱلۡكِتَـٰبَ مِنۢ بَعۡدِ مَاۤ أَهۡلَكۡنَا ٱلۡقُرُونَ ٱلۡأُولَىٰ بَصَاۤىِٕرَ لِلنَّاسِ وَهُدࣰى وَرَحۡمَةࣰ لَّعَلَّهُمۡ یَتَذَكَّرُونَ\n",
    "translations": {
      "en": "And [then,] indeed, after We had destroyed those earlier generations [of sinners], We vouchsafed unto Moses [Our] revelation as a means of insight for men, and as a guidance and grace, so that they might bethink themselves [of Us].",
      "ms": "Dan demi sesungguhnya, Kami berikan kepada Nabi Musa Kitab Taurat sesudah Kami binasakan kaum-kaum yang telah lalu, untuk membuka hati dan menjadi hidayah petunjuk serta membawa rahmat, semoga mereka beringat.",
      "id": "Dan sesungguhnya telah Kami berikan kepada Musa Al-Kitab (Taurat) sesudah Kami binasakan generasi-generasi yang terdahulu, untuk menjadi pelita bagi manusia dan petunjuk dan rahmat, agar mereka ingat.",
      "ar": "وَلَقَدۡ ءَاتَیۡنَا مُوسَى ٱلۡكِتَـٰبَ مِنۢ بَعۡدِ مَاۤ أَهۡلَكۡنَا ٱلۡقُرُونَ ٱلۡأُولَىٰ بَصَاۤىِٕرَ لِلنَّاسِ وَهُدࣰى وَرَحۡمَةࣰ لَّعَلَّهُمۡ یَتَذَكَّرُونَ\n"
    }
  },
  {
    "id": 3296,
    "surahId": 28,
    "ayahNumber": 44,
    "arabicText": "وَمَا كُنتَ بِجَانِبِ ٱلۡغَرۡبِیِّ إِذۡ قَضَیۡنَاۤ إِلَىٰ مُوسَى ٱلۡأَمۡرَ وَمَا كُنتَ مِنَ ٱلشَّـٰهِدِینَ\n",
    "translations": {
      "en": "NOW [as for thee, O Muhammad,] thou wert not present on the sunset slope [of Mount Sinai] when We imposed the Law upon Moses, nor wert thou among those who witnessed [his times]:",
      "ms": "Dan engkau (wahai Muhammad) tidak ada di sebelah barat (tempat Nabi Musa menerima wahyu) ketika Kami sempurnakan penyerahan Kitab Taurat kepadanya, dan engkau juga tidak termasuk dalam golongan yang menyaksikan peristiwa itu.",
      "id": "Dan tidaklah kamu (Muhammad) berada di sisi yang sebelah barat ketika Kami menyampaikan perintah kepada Musa, dan tiada pula kamu termasuk orang-orang yang menyaksikan.",
      "ar": "وَمَا كُنتَ بِجَانِبِ ٱلۡغَرۡبِیِّ إِذۡ قَضَیۡنَاۤ إِلَىٰ مُوسَى ٱلۡأَمۡرَ وَمَا كُنتَ مِنَ ٱلشَّـٰهِدِینَ\n"
    }
  },
  {
    "id": 3297,
    "surahId": 28,
    "ayahNumber": 45,
    "arabicText": "وَلَـٰكِنَّاۤ أَنشَأۡنَا قُرُونࣰا فَتَطَاوَلَ عَلَیۡهِمُ ٱلۡعُمُرُۚ وَمَا كُنتَ ثَاوِیࣰا فِیۤ أَهۡلِ مَدۡیَنَ تَتۡلُوا۟ عَلَیۡهِمۡ ءَایَـٰتِنَا وَلَـٰكِنَّا كُنَّا مُرۡسِلِینَ\n",
    "translations": {
      "en": "nay, but [between them and thee] We brought into being [many] generations, and long was their span of life. And neither didst thou dwell among the people of Madyan, conveying Our messages unto them: nay, but We have [always] been sending [Our message-bearers unto man].",
      "ms": "Akan tetapi (engkau hanya mengetahui kisah itu dengan jalan Kami memberi wahyu kenabian kepadamu disebabkan) Kami telah mengadakan beberapa umat (dari zaman Nabi Musa hingga ke zamanmu) sampai berlanjutanlah masa yang mereka lalui (serta kucar-kacirlah ugama yang mereka anuti). Dan engkau pula tidak pernah tinggal bersama-sama penduduk negeri Madyan membaca dan mempelajari dari mereka ayat-ayat keterangan Kami (tentang hal Nabi Musa di sana), tetapi Kamilah yang mengutusmu (menjadi Rasul dan memberi wahyu kepadamu mengenai hal itu).",
      "id": "Tetapi Kami telah mengadakan beberapa generasi, dan berlalulah atas mereka masa yang panjang, dan tiadalah kamu tinggal bersama-sama penduduk Mad-yan dengan membacakan ayat-ayat Kami kepada mereka, tetapi Kami telah mengutus rasul-rasul.",
      "ar": "وَلَـٰكِنَّاۤ أَنشَأۡنَا قُرُونࣰا فَتَطَاوَلَ عَلَیۡهِمُ ٱلۡعُمُرُۚ وَمَا كُنتَ ثَاوِیࣰا فِیۤ أَهۡلِ مَدۡیَنَ تَتۡلُوا۟ عَلَیۡهِمۡ ءَایَـٰتِنَا وَلَـٰكِنَّا كُنَّا مُرۡسِلِینَ\n"
    }
  },
  {
    "id": 3298,
    "surahId": 28,
    "ayahNumber": 46,
    "arabicText": "وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذۡ نَادَیۡنَا وَلَـٰكِن رَّحۡمَةࣰ مِّن رَّبِّكَ لِتُنذِرَ قَوۡمࣰا مَّاۤ أَتَىٰهُم مِّن نَّذِیرࣲ مِّن قَبۡلِكَ لَعَلَّهُمۡ یَتَذَكَّرُونَ\n",
    "translations": {
      "en": "And neither wert thou present on the slope of Mount Sinai when We called out [to Moses]: but [thou, too, art sent] as an act of thy Sustainer’s grace, to warn people to whom no warner has come before thee, so that they might bethink themselves [of Us];",
      "ms": "Dan engkau juga tidak berada dekat Gunung Tursina ketika Kami menyeru (Nabi Musa dan memberi wahyu kepadanya dahulu), tetapi (diturunkan) rahmat (Al-Quran) dari Tuhanmu (menerangkan Kisah itu) supaya engkau memberi amaran kepada kaum (mu) yang telah lama tidak didatangi sebarang Rasul pemberi amaran sebelummu, semoga mereka beroleh pengajaran (serta insaf mematuhinya).",
      "id": "Dan tiadalah kamu berada di dekat gunung Thur ketika Kami menyeru (Musa), tetapi (Kami beritahukan itu kepadamu) sebagai rahmat dari Tuhanmu, supaya kamu memberi peringatan kepada kaum (Quraisy) yang sekali-kali belum datang kepada mereka pemberi peringatan sebelum kamu agar mereka ingat.",
      "ar": "وَمَا كُنتَ بِجَانِبِ ٱلطُّورِ إِذۡ نَادَیۡنَا وَلَـٰكِن رَّحۡمَةࣰ مِّن رَّبِّكَ لِتُنذِرَ قَوۡمࣰا مَّاۤ أَتَىٰهُم مِّن نَّذِیرࣲ مِّن قَبۡلِكَ لَعَلَّهُمۡ یَتَذَكَّرُونَ\n"
    }
  },
  {
    "id": 3299,
    "surahId": 28,
    "ayahNumber": 47,
    "arabicText": "وَلَوۡلَاۤ أَن تُصِیبَهُم مُّصِیبَةُۢ بِمَا قَدَّمَتۡ أَیۡدِیهِمۡ فَیَقُولُوا۟ رَبَّنَا لَوۡلَاۤ أَرۡسَلۡتَ إِلَیۡنَا رَسُولࣰا فَنَتَّبِعَ ءَایَـٰتِكَ وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "and [We have sent thee] lest they say [on Judg­ment Day], when disaster befalls them as an outcome of what their own hands have wrought, “O our Sus­tainer, if only Thou had sent an apostle unto us, we would have followed Thy messages, and would have been among those who believe!”",
      "ms": "Dan kalau tidaklah orang-orang musyrik itu akan berkata - semasa mereka ditimpa bala bencana disebabkan perbuatan kufur dan maksiat yang mereka lakukan: \"Wahai Tuhan kami, mengapa Engkau tidak mengutuskan kepada Kami seorang Rasul supaya kami menurut ayat-ayat keteranganMu (yang dibawanya), dan supaya kami menjadi dari orang-orang yang beriman, \" (tentulah engkau wahai Muhammad tidak diutuskan kepada mereka, bahkan Kami terus menyeksa mereka).",
      "id": "Dan agar mereka tidak mengatakan ketika azab menimpa mereka disebabkan apa yang mereka kerjakan: \"Ya Tuhan kami, mengapa Engkau tidak mengutus seorang rasul kepada kami, lalu kami mengikuti ayat-ayat Engkau dan jadilah kami termasuk orang-orang mukmin\".",
      "ar": "وَلَوۡلَاۤ أَن تُصِیبَهُم مُّصِیبَةُۢ بِمَا قَدَّمَتۡ أَیۡدِیهِمۡ فَیَقُولُوا۟ رَبَّنَا لَوۡلَاۤ أَرۡسَلۡتَ إِلَیۡنَا رَسُولࣰا فَنَتَّبِعَ ءَایَـٰتِكَ وَنَكُونَ مِنَ ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 3300,
    "surahId": 28,
    "ayahNumber": 48,
    "arabicText": "فَلَمَّا جَاۤءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُوا۟ لَوۡلَاۤ أُوتِیَ مِثۡلَ مَاۤ أُوتِیَ مُوسَىٰۤۚ أَوَلَمۡ یَكۡفُرُوا۟ بِمَاۤ أُوتِیَ مُوسَىٰ مِن قَبۡلُۖ قَالُوا۟ سِحۡرَانِ تَظَـٰهَرَا وَقَالُوۤا۟ إِنَّا بِكُلࣲّ كَـٰفِرُونَ\n",
    "translations": {
      "en": "And yet, now that the truth has come unto them from Us, they say, “Why has he not been vouch­safed the like of what Moses was vouchsafed?” But did they not also, before this, deny the truth of what Moses was vouchsafed? [For] they do say, “Two examples of delusion, [seemingly] supporting each other!” And they add, “Behold, we refuse to accept either of them as true!”",
      "ms": "Maka ketika datang kepada mereka kebenaran (Al-Quran) dari sisi Kami, mereka berkata pula: \"Hendaknya (Muhammad) diberi (Kitab ugama yang diturunkan dengan sekaligus) sebagaimana Kitab Taurat yang diberikan kepada Musa\". Bukankah mereka dahulu telah kufur ingkar akan apa yang diberikan kepada Nabi Musa? Mereka berkata lagi: \"Kedua-duanya (Al-Quran dan Taurat) itu ialah sihir yang saling membantu (yang satu menyokong yang lain). \"Dan mereka berkata pula: \"Sesungguhnya kami kufur ingkar terhadap Kitab-kitab itu semuanya!\"",
      "id": "Maka tatkala datang kepada mereka kebenaran dari sisi Kami, mereka berkata: \"Mengapakah tidak diberikan kepadanya (Muhammad) seperti yang telah diberikan kepada Musa dahulu?\". Dan bukankah mereka itu telah ingkar (juga) kepada apa yang telah diberikan kepada Musa dahulu?; mereka dahulu telah berkata: \"Musa dan Harun adalah dua ahli sihir yang bantu membantu\". Dan mereka (juga) berkata: \"Sesungguhnya kami tidak mempercayai masing-masing mereka itu\".",
      "ar": "فَلَمَّا جَاۤءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُوا۟ لَوۡلَاۤ أُوتِیَ مِثۡلَ مَاۤ أُوتِیَ مُوسَىٰۤۚ أَوَلَمۡ یَكۡفُرُوا۟ بِمَاۤ أُوتِیَ مُوسَىٰ مِن قَبۡلُۖ قَالُوا۟ سِحۡرَانِ تَظَـٰهَرَا وَقَالُوۤا۟ إِنَّا بِكُلࣲّ كَـٰفِرُونَ\n"
    }
  },
  {
    "id": 3301,
    "surahId": 28,
    "ayahNumber": 49,
    "arabicText": "قُلۡ فَأۡتُوا۟ بِكِتَـٰبࣲ مِّنۡ عِندِ ٱللَّهِ هُوَ أَهۡدَىٰ مِنۡهُمَاۤ أَتَّبِعۡهُ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "Say: “Produce, then, [another] revelation from God which would offer better guidance than either of these two [and] I shall follow it, if you speak the truth!”",
      "ms": "Katakanlah (wahai Muhammad): \"Kalau demikianlah sikap kamu maka bawalah sebuah Kitab dari sisi Allah yang dapat memberi panduan lebih daripada keduanya, supaya aku menurutnya. (Bawalah dia) jika betul kamu orang-orang yang benar \".",
      "id": "Katakanlah: \"Datangkanlah olehmu sebuah kitab dari sisi Allah yang kitab itu lebih (dapat) memberi petunjuk daripada keduanya (Taurat dan Al Quran) niscaya aku mengikutinya, jika kamu sungguh orang-orang yang benar\".",
      "ar": "قُلۡ فَأۡتُوا۟ بِكِتَـٰبࣲ مِّنۡ عِندِ ٱللَّهِ هُوَ أَهۡدَىٰ مِنۡهُمَاۤ أَتَّبِعۡهُ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 3302,
    "surahId": 28,
    "ayahNumber": 50,
    "arabicText": "فَإِن لَّمۡ یَسۡتَجِیبُوا۟ لَكَ فَٱعۡلَمۡ أَنَّمَا یَتَّبِعُونَ أَهۡوَاۤءَهُمۡۚ وَمَنۡ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَیۡرِ هُدࣰى مِّنَ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا یَهۡدِی ٱلۡقَوۡمَ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "And since they cannot respond to this thy challenge, know that they are following only their own likes and dislikes: and who could be more astray than he who follows [but] his own likes and dislikes without any guidance from God? Verily, God does not grace with His guidance peo­ple who are given to evildoing!",
      "ms": "Kemudian, kalau mereka tidak dapat menerima cabaranmu (wahai Muhammad), maka ketahuilah, sesungguhnya mereka hanyalah menurut hawa nafsu mereka; dan tidak ada yang lebih sesat daripada orang yang menurut hawa nafsunya dengan tidak berdasarkan hidayah petunjuk dari Allah. Sesungguhnya Allah tidak memberi pimpinan kepada kaum yang zalim (yang berdegil dalam keingkarannya).",
      "id": "Maka jika mereka tidak menjawab (tantanganmu) ketahuilah bahwa sesungguhnya mereka hanyalah mengikuti hawa nafsu mereka (belaka). Dan siapakah yang lebih sesat daripada orang yang mengikuti hawa nafsunya dengan tidak mendapat petunjuk dari Allah sedikitpun. Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zalim.",
      "ar": "فَإِن لَّمۡ یَسۡتَجِیبُوا۟ لَكَ فَٱعۡلَمۡ أَنَّمَا یَتَّبِعُونَ أَهۡوَاۤءَهُمۡۚ وَمَنۡ أَضَلُّ مِمَّنِ ٱتَّبَعَ هَوَىٰهُ بِغَیۡرِ هُدࣰى مِّنَ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا یَهۡدِی ٱلۡقَوۡمَ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 3303,
    "surahId": 28,
    "ayahNumber": 51,
    "arabicText": "۞ وَلَقَدۡ وَصَّلۡنَا لَهُمُ ٱلۡقَوۡلَ لَعَلَّهُمۡ یَتَذَكَّرُونَ\n",
    "translations": {
      "en": "NOW, INDEED, We have caused this word [of Ours] to reach mankind step by step, so that they might [learn to] keep it in mind.",
      "ms": "Dan demi sesungguhnya Kami telah hubungkan turunnya firman-firman Kami (Al-Quran) dengan berturut-turut kepada mereka, supaya mereka beroleh peringatan (lalu beriman).",
      "id": "Dan sesungguhnya telah Kami turunkan berturut-turut perkataan ini (Al Quran) kepada mereka agar mereka mendapat pelajaran.",
      "ar": "۞ وَلَقَدۡ وَصَّلۡنَا لَهُمُ ٱلۡقَوۡلَ لَعَلَّهُمۡ یَتَذَكَّرُونَ\n"
    }
  },
  {
    "id": 3304,
    "surahId": 28,
    "ayahNumber": 52,
    "arabicText": "ٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ مِن قَبۡلِهِۦ هُم بِهِۦ یُؤۡمِنُونَ\n",
    "translations": {
      "en": "As for those unto whom We have vouchsafed revelation aforetime - they [are bound to] believe in this one [as well];",
      "ms": "Orang-orang yang Kami beri Kitab sebelum turunnya Al-Quran, mereka beriman kepadanya.",
      "id": "Orang-orang yang telah Kami datangkan kepada mereka Al Kitab sebelum Al Quran, mereka beriman (pula) dengan Al Quran itu.",
      "ar": "ٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ مِن قَبۡلِهِۦ هُم بِهِۦ یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 3305,
    "surahId": 28,
    "ayahNumber": 53,
    "arabicText": "وَإِذَا یُتۡلَىٰ عَلَیۡهِمۡ قَالُوۤا۟ ءَامَنَّا بِهِۦۤ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّنَاۤ إِنَّا كُنَّا مِن قَبۡلِهِۦ مُسۡلِمِینَ\n",
    "translations": {
      "en": "and whenever it is [clearly] conveyed unto them, they [are bound to] profess, “We have come to believe in it, for, behold, it is the truth from our Sustainer - and, verily, even before this have we surrendered ourselves unto Him!”",
      "ms": "Dan apabila Al-Quran itu dibacakan kepada mereka; mereka, berkata: \"Kami beriman kepadanya, sesungguhnya ia adalah perkara yang betul benar dari Tuhan kami; sesungguhnya kami sebelum ia diturunkan, telahpun mematuhinya \".",
      "id": "Dan apabila dibacakan (Al Quran itu) kepada mereka, mereka berkata: \"Kami beriman kepadanya; sesungguhnya; Al Quran itu adalah suatu kebenaran dari Tuhan kami, sesungguhnya kami sebelumnya adalah orang-orang yang membenarkan(nya).",
      "ar": "وَإِذَا یُتۡلَىٰ عَلَیۡهِمۡ قَالُوۤا۟ ءَامَنَّا بِهِۦۤ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّنَاۤ إِنَّا كُنَّا مِن قَبۡلِهِۦ مُسۡلِمِینَ\n"
    }
  },
  {
    "id": 3306,
    "surahId": 28,
    "ayahNumber": 54,
    "arabicText": "أُو۟لَـٰۤىِٕكَ یُؤۡتَوۡنَ أَجۡرَهُم مَّرَّتَیۡنِ بِمَا صَبَرُوا۟ وَیَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّیِّئَةَ وَمِمَّا رَزَقۡنَـٰهُمۡ یُنفِقُونَ\n",
    "translations": {
      "en": "These it is that shall receive a twofold reward for having been patient in adversity, and having repelled evil with good, and having spent on others out of what We provided for them as sus­tenance,",
      "ms": "Mereka itu akan beroleh pahala dua kali disebabkan kesabaran mereka; dan juga kerana mereka menolak kejahatan dengan kebaikan, dan mereka menderma dari apa yang Kami kurniakan kepada mereka.",
      "id": "Mereka itu diberi pahala dua kali disebabkan kesabaran mereka, dan mereka menolak kejahatan dengan kebaikan, dan sebagian dari apa yang telah Kami rezekikan kepada mereka, mereka nafkahkan.",
      "ar": "أُو۟لَـٰۤىِٕكَ یُؤۡتَوۡنَ أَجۡرَهُم مَّرَّتَیۡنِ بِمَا صَبَرُوا۟ وَیَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّیِّئَةَ وَمِمَّا رَزَقۡنَـٰهُمۡ یُنفِقُونَ\n"
    }
  },
  {
    "id": 3307,
    "surahId": 28,
    "ayahNumber": 55,
    "arabicText": "وَإِذَا سَمِعُوا۟ ٱللَّغۡوَ أَعۡرَضُوا۟ عَنۡهُ وَقَالُوا۟ لَنَاۤ أَعۡمَـٰلُنَا وَلَكُمۡ أَعۡمَـٰلُكُمۡ سَلَـٰمٌ عَلَیۡكُمۡ لَا نَبۡتَغِی ٱلۡجَـٰهِلِینَ\n",
    "translations": {
      "en": "and, whenever they heard frivolous talk, having turned away from it and said: “Unto us shall be accounted Our deeds, and unto you, your deeds. Peace be upon you - [but] we do not seek out such as are ignorant [of the meaning of right and wrong].”",
      "ms": "Dan apabila mereka mendengar perkataan yang sia-sia, mereka berpaling daripadanya sambil berkata: \"Bagi kami amal kami dan bagi kamu pula amal kamu; selamat tinggalah kamu; kami tidak ingin berdamping dengan orang-orang yang jahil\".",
      "id": "Dan apabila mereka mendengar perkataan yang tidak bermanfaat, mereka berpaling daripadanya dan mereka berkata: \"Bagi kami amal-amal kami dan bagimu amal-amalmu, kesejahteraan atas dirimu, kami tidak ingin bergaul dengan orang-orang jahil\".",
      "ar": "وَإِذَا سَمِعُوا۟ ٱللَّغۡوَ أَعۡرَضُوا۟ عَنۡهُ وَقَالُوا۟ لَنَاۤ أَعۡمَـٰلُنَا وَلَكُمۡ أَعۡمَـٰلُكُمۡ سَلَـٰمٌ عَلَیۡكُمۡ لَا نَبۡتَغِی ٱلۡجَـٰهِلِینَ\n"
    }
  },
  {
    "id": 3308,
    "surahId": 28,
    "ayahNumber": 56,
    "arabicText": "إِنَّكَ لَا تَهۡدِی مَنۡ أَحۡبَبۡتَ وَلَـٰكِنَّ ٱللَّهَ یَهۡدِی مَن یَشَاۤءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِینَ\n",
    "translations": {
      "en": "VERILY, thou canst not guide aright everyone whom thou lovest: but it is God who guides him that wills [to be guided]; and He is fully aware of all who would let themselves be guided.",
      "ms": "Sesungguhnya engkau (wahai Muhammad) tidak berkuasa memberi hidayah petunjuk kepada sesiapa yang engkau kasihi (supaya ia menerima Islam), tetapi Allah jualah yang berkuasa memberi hidayah petunjuk kepada sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya); dan Dia lah jua yang lebih mengetahui akan orang-orang yang (ada persediaan untuk) mendapat hidayah petunjuk (kepada memeluk Islam).",
      "id": "Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi, tetapi Allah memberi petunjuk kepada orang yang dikehendaki-Nya, dan Allah lebih mengetahui orang-orang yang mau menerima petunjuk.",
      "ar": "إِنَّكَ لَا تَهۡدِی مَنۡ أَحۡبَبۡتَ وَلَـٰكِنَّ ٱللَّهَ یَهۡدِی مَن یَشَاۤءُۚ وَهُوَ أَعۡلَمُ بِٱلۡمُهۡتَدِینَ\n"
    }
  },
  {
    "id": 3309,
    "surahId": 28,
    "ayahNumber": 57,
    "arabicText": "وَقَالُوۤا۟ إِن نَّتَّبِعِ ٱلۡهُدَىٰ مَعَكَ نُتَخَطَّفۡ مِنۡ أَرۡضِنَاۤۚ أَوَلَمۡ نُمَكِّن لَّهُمۡ حَرَمًا ءَامِنࣰا یُجۡبَىٰۤ إِلَیۡهِ ثَمَرَ ٰ⁠تُ كُلِّ شَیۡءࣲ رِّزۡقࣰا مِّن لَّدُنَّا وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "Now some say, “If we were to follow the guidance to which thou invitest us, we would be torn away from our very soil!” Why - have We not established for them a sanc­tuary secure, to which, as a provision from Us, shall be gathered the fruits of all (good) things? But most of them are unaware [of this truth].",
      "ms": "Dan mereka (yang kafir) berkata: \"Kalau kami menyertaimu menurut petunjuk yang engkau bawa itu, nescaya kami dengan serta merta ditangkap dan diusir dari negeri kami (oleh golongan yang menentang)\". Mengapa mereka (berkata demikian)? Bukankah kami telah melindungi mereka dan menjadikan (negeri Makkah) tempat tinggal mereka sebagai tanah suci yang aman, yang dibawa kepadanya hasil tanaman dari segala jenis, sebagai rezeki pemberian dari sisi Kami? (Benar, Kami telah menjadikan semuanya itu), tetapi kebanyakan mereka tidak memikirkan perkara itu untuk mengetahuinya (serta bersyukur).",
      "id": "Dan mereka berkata: \"Jika kami mengikuti petunjuk bersama kamu, niscaya kami akan diusir dari negeri kami\". Dan apakah Kami tidak meneguhkan kedudukan mereka dalam daerah haram (tanah suci) yang aman, yang didatangkan ke tempat itu buah-buahan dari segala macam (tumbuh-tumbuhan) untuk menjadi rezeki (bagimu) dari sisi Kami?. Tetapi kebanyakan mereka tidak mengetahui.",
      "ar": "وَقَالُوۤا۟ إِن نَّتَّبِعِ ٱلۡهُدَىٰ مَعَكَ نُتَخَطَّفۡ مِنۡ أَرۡضِنَاۤۚ أَوَلَمۡ نُمَكِّن لَّهُمۡ حَرَمًا ءَامِنࣰا یُجۡبَىٰۤ إِلَیۡهِ ثَمَرَ ٰ⁠تُ كُلِّ شَیۡءࣲ رِّزۡقࣰا مِّن لَّدُنَّا وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 3310,
    "surahId": 28,
    "ayahNumber": 58,
    "arabicText": "وَكَمۡ أَهۡلَكۡنَا مِن قَرۡیَةِۭ بَطِرَتۡ مَعِیشَتَهَاۖ فَتِلۡكَ مَسَـٰكِنُهُمۡ لَمۡ تُسۡكَن مِّنۢ بَعۡدِهِمۡ إِلَّا قَلِیلࣰاۖ وَكُنَّا نَحۡنُ ٱلۡوَ ٰ⁠رِثِینَ\n",
    "translations": {
      "en": "And how many a community that [once] exult­ed in its wanton wealth and ease of life have We destroyed, so that those dwelling-places of theirs – all but a few - have never been dwelt-in after them: for it is indeed We alone who shall remain when all else will have passed away!",
      "ms": "Dan berapa banyak Kami binasakan negeri-negeri yang penduduknya telah berlaku sombong dan tidak bersyukur dalam kehidupannya (yang serba mewah dan senang lenang). Maka itulah dia tempat-tempat tinggal mereka terbiar tidak didiami orang sesudah mereka (dibinasakan), kecuali sedikit sahaja dan sesungguhnya Kamilah yang mewarisi mereka.",
      "id": "Dan berapa banyaknya (penduduk) negeri yang telah Kami binasakan, yang sudah bersenang-senang dalam kehidupannya; maka itulah tempat kediaman mereka yang tiada di diami (lagi) sesudah mereka, kecuali sebahagian kecil. Dan Kami adalah Pewaris(nya).",
      "ar": "وَكَمۡ أَهۡلَكۡنَا مِن قَرۡیَةِۭ بَطِرَتۡ مَعِیشَتَهَاۖ فَتِلۡكَ مَسَـٰكِنُهُمۡ لَمۡ تُسۡكَن مِّنۢ بَعۡدِهِمۡ إِلَّا قَلِیلࣰاۖ وَكُنَّا نَحۡنُ ٱلۡوَ ٰ⁠رِثِینَ\n"
    }
  },
  {
    "id": 3311,
    "surahId": 28,
    "ayahNumber": 59,
    "arabicText": "وَمَا كَانَ رَبُّكَ مُهۡلِكَ ٱلۡقُرَىٰ حَتَّىٰ یَبۡعَثَ فِیۤ أُمِّهَا رَسُولࣰا یَتۡلُوا۟ عَلَیۡهِمۡ ءَایَـٰتِنَاۚ وَمَا كُنَّا مُهۡلِكِی ٱلۡقُرَىٰۤ إِلَّا وَأَهۡلُهَا ظَـٰلِمُونَ\n",
    "translations": {
      "en": "Yet, withal, thy Sustainer would never destroy a community without having [first] raised in its midst an apostle who would convey unto them Our mes­sages; and never would We destroy a community unless its people are wont to do wrong [to one another].",
      "ms": "Dan tidaklah menjadi kebiasaan Tuhanmu membinasakan mana-mana negeri sebelum Ia mengutus ke ibu negeri itu seorang Rasul yang akan membacakan kepada penduduknya ayat-ayat keterangan Kami; dan tidaklah menjadi kebiasaan Kami membinasakan mana-mana negeri melainkan setelah penduduknya berlaku zalim.",
      "id": "Dan tidak adalah Tuhanmu membinasakan kota-kota, sebelum Dia mengutus di ibukota itu seorang rasul yang membacakan ayat-ayat Kami kepada mereka; dan tidak pernah (pula) Kami membinasakan kota-kota; kecuali penduduknya dalam keadaan melakukan kezaliman.",
      "ar": "وَمَا كَانَ رَبُّكَ مُهۡلِكَ ٱلۡقُرَىٰ حَتَّىٰ یَبۡعَثَ فِیۤ أُمِّهَا رَسُولࣰا یَتۡلُوا۟ عَلَیۡهِمۡ ءَایَـٰتِنَاۚ وَمَا كُنَّا مُهۡلِكِی ٱلۡقُرَىٰۤ إِلَّا وَأَهۡلُهَا ظَـٰلِمُونَ\n"
    }
  },
  {
    "id": 3312,
    "surahId": 28,
    "ayahNumber": 60,
    "arabicText": "وَمَاۤ أُوتِیتُم مِّن شَیۡءࣲ فَمَتَـٰعُ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَزِینَتُهَاۚ وَمَا عِندَ ٱللَّهِ خَیۡرࣱ وَأَبۡقَىٰۤۚ أَفَلَا تَعۡقِلُونَ\n",
    "translations": {
      "en": "And [remember:] whatever you are given [now] is but for the [passing] enjoyment of life in this world, and for its embellishment - whereas that which is with God is [so much] better and more enduring. Will you not, then, use your reason?",
      "ms": "Dan apa jua (harta benda dan lain-lainnya) yang diberikan kepada kamu, maka adalah ia merupakan kesenangan hidup di dunia dan perhiasannya; dalam pada itu, apa jua yang ada di sisi Allah (yang disediakan untuk orang-orang yang beriman dan taat) adalah ia lebih baik dan lebih kekal; maka mengapa kamu tidak mahu memahaminya?",
      "id": "Dan apa saja yang diberikan kepada kamu, maka itu adalah kenikmatan hidup duniawi dan perhiasannya; sedang apa yang di sisi Allah adalah lebih baik dan lebih kekal. Maka apakah kamu tidak memahaminya?",
      "ar": "وَمَاۤ أُوتِیتُم مِّن شَیۡءࣲ فَمَتَـٰعُ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَزِینَتُهَاۚ وَمَا عِندَ ٱللَّهِ خَیۡرࣱ وَأَبۡقَىٰۤۚ أَفَلَا تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 3313,
    "surahId": 28,
    "ayahNumber": 61,
    "arabicText": "أَفَمَن وَعَدۡنَـٰهُ وَعۡدًا حَسَنࣰا فَهُوَ لَـٰقِیهِ كَمَن مَّتَّعۡنَـٰهُ مَتَـٰعَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا ثُمَّ هُوَ یَوۡمَ ٱلۡقِیَـٰمَةِ مِنَ ٱلۡمُحۡضَرِینَ\n",
    "translations": {
      "en": "Is, then, he to whom We have given that goodly promise which he shall see fulfilled [on his resurrection] comparable to one on whom We have bestowed [all] the enjoyments of this worldly life but who, on Resurrection Day, will find himself among those that shall be arraigned [before Us]?",
      "ms": "(Jika sudah diketahui yang demikian) maka adakah orang yang Kami janjikan kepadanya janji yang baik (balasan Syurga) lalu ia mendapatnya, sama seperti orang yang kami kurniakan menikmati kesenangan hidup di dunia kemudian ia pada hari kiamat termasuk dalam golongan yang dibawa (untuk menerima azab neraka)?",
      "id": "Maka apakah orang yang Kami janjikan kepadanya suatu janji yang baik (surga) lalu ia memperolehnya, sama dengan orang yang Kami berikan kepadanya kenikmatan hidup duniawi; kemudian dia pada hari kiamat termasuk orang-orang yang diseret (ke dalam neraka)?",
      "ar": "أَفَمَن وَعَدۡنَـٰهُ وَعۡدًا حَسَنࣰا فَهُوَ لَـٰقِیهِ كَمَن مَّتَّعۡنَـٰهُ مَتَـٰعَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا ثُمَّ هُوَ یَوۡمَ ٱلۡقِیَـٰمَةِ مِنَ ٱلۡمُحۡضَرِینَ\n"
    }
  },
  {
    "id": 3314,
    "surahId": 28,
    "ayahNumber": 62,
    "arabicText": "وَیَوۡمَ یُنَادِیهِمۡ فَیَقُولُ أَیۡنَ شُرَكَاۤءِیَ ٱلَّذِینَ كُنتُمۡ تَزۡعُمُونَ\n",
    "translations": {
      "en": "For, on that Day He will call unto them, and will ask: “Where, now, are those [beings or powers] whom you imagined to have a share in My divinity?”",
      "ms": "Dan pada hari (kiamat itu) Allah menyeru mereka lalu bertanya:\" Mana dia sekutu-sekutuKu, yang kamu anggap mereka (menjadi tuhan dan dapat memberikan pertolongan)?\"",
      "id": "Dan (ingatlah) hari (di waktu) Allah menyeru mereka, seraya berkata: \"Di manakah sekutu-sekutu-Ku yang dahulu kamu katakan?\"",
      "ar": "وَیَوۡمَ یُنَادِیهِمۡ فَیَقُولُ أَیۡنَ شُرَكَاۤءِیَ ٱلَّذِینَ كُنتُمۡ تَزۡعُمُونَ\n"
    }
  },
  {
    "id": 3315,
    "surahId": 28,
    "ayahNumber": 63,
    "arabicText": "قَالَ ٱلَّذِینَ حَقَّ عَلَیۡهِمُ ٱلۡقَوۡلُ رَبَّنَا هَـٰۤؤُلَاۤءِ ٱلَّذِینَ أَغۡوَیۡنَاۤ أَغۡوَیۡنَـٰهُمۡ كَمَا غَوَیۡنَاۖ تَبَرَّأۡنَاۤ إِلَیۡكَۖ مَا كَانُوۤا۟ إِیَّانَا یَعۡبُدُونَ\n",
    "translations": {
      "en": "[whereupon] they against whom the word [of truth] shall thus stand revealed will exclaim: O our Sustainer! Those whom we caused to err so grievously, we but caused to err as we our­selves had been erring. We [now] disavow them before Thee: it was not us that they worshipped!”",
      "ms": "Mereka yang berhak menerima hukuman (azab neraka) berkata: \"Wahai Tuhan kami, inilah mereka yang kami menyebabkan kesesatannya, kami menyebabkan mereka sesat (dengan pilihan mereka sendiri) sebagaimana kami telah sesat (dengan pilihan kami sendiri); (dengan ini) kami mengakui kepadaMu bahawa kami berlepas diri (dari kekufuran mereka). Bukanlah Kami yang mereka puja dan taati, (bahkan mereka hanya memuja dan mentaati hawa nafsu mereka sendiri)\".",
      "id": "Berkatalah orang-orang yang telah tetap hukuman atas mereka; \"Ya Tuhan kami, mereka inilah orang-orang yang kami sesatkan itu; kami telah menyesatkan mereka sebagaimana kami (sendiri) sesat, kami menyatakan berlepas diri (dari mereka) kepada Engkau, mereka sekali-kali tidak menyembah kami\".",
      "ar": "قَالَ ٱلَّذِینَ حَقَّ عَلَیۡهِمُ ٱلۡقَوۡلُ رَبَّنَا هَـٰۤؤُلَاۤءِ ٱلَّذِینَ أَغۡوَیۡنَاۤ أَغۡوَیۡنَـٰهُمۡ كَمَا غَوَیۡنَاۖ تَبَرَّأۡنَاۤ إِلَیۡكَۖ مَا كَانُوۤا۟ إِیَّانَا یَعۡبُدُونَ\n"
    }
  },
  {
    "id": 3316,
    "surahId": 28,
    "ayahNumber": 64,
    "arabicText": "وَقِیلَ ٱدۡعُوا۟ شُرَكَاۤءَكُمۡ فَدَعَوۡهُمۡ فَلَمۡ یَسۡتَجِیبُوا۟ لَهُمۡ وَرَأَوُا۟ ٱلۡعَذَابَۚ لَوۡ أَنَّهُمۡ كَانُوا۟ یَهۡتَدُونَ\n",
    "translations": {
      "en": "And [they] will be told: “Call [now] unto those [beings or powers] to whom you were wont to ascribe a share in God’s divinity!” and they will call unto them [for help], but those [fake objects of worship] will not respond to them: whereupon they will see the suffering [that awaits them - the suffering which could have been avoided] if only they had allowed them­selves to be guided!",
      "ms": "Dan dikatakan (kepada mereka): Panggilah makhluk-makhluk dan benda-benda yang kamu jadikan sekutu Allah (untuk menolong kamu)\". lalu mereka memanggilnya, tetapi makhluk-makhluk dan benda-benda itu tidak menyahut panggilan mereka; dan mereka tetap melihat azab (dengan merasa sesal) serta bercita-cita kalaulah mereka di dunia dahulu menurut petunjuk.",
      "id": "Dikatakan (kepada mereka) \"Serulah olehmu sekutu-sekutu kamu\", lalu mereka menyerunya, maka sekutu-sekutu itu tidak memperkenankan (seruan) mereka, dan mereka melihat azab. (Mereka ketika itu berkeinginan) kiranya mereka dahulu menerima petunjuk.",
      "ar": "وَقِیلَ ٱدۡعُوا۟ شُرَكَاۤءَكُمۡ فَدَعَوۡهُمۡ فَلَمۡ یَسۡتَجِیبُوا۟ لَهُمۡ وَرَأَوُا۟ ٱلۡعَذَابَۚ لَوۡ أَنَّهُمۡ كَانُوا۟ یَهۡتَدُونَ\n"
    }
  },
  {
    "id": 3317,
    "surahId": 28,
    "ayahNumber": 65,
    "arabicText": "وَیَوۡمَ یُنَادِیهِمۡ فَیَقُولُ مَاذَاۤ أَجَبۡتُمُ ٱلۡمُرۡسَلِینَ\n",
    "translations": {
      "en": "And on that Day He will call unto them, and will ask: “How did you respond to My message­ bearers?”",
      "ms": "Dan pada hari (kiamat itu) Allah menyeru mereka lalu bertanya: \"Apa jawab kamu kepada Rasul-rasul yang diutus kepada kamu dahulu?",
      "id": "Dan (ingatlah) hari (di waktu) Allah menyeru mereka, seraya berkata: \"Apakah jawabanmu kepada para rasul?\"",
      "ar": "وَیَوۡمَ یُنَادِیهِمۡ فَیَقُولُ مَاذَاۤ أَجَبۡتُمُ ٱلۡمُرۡسَلِینَ\n"
    }
  },
  {
    "id": 3318,
    "surahId": 28,
    "ayahNumber": 66,
    "arabicText": "فَعَمِیَتۡ عَلَیۡهِمُ ٱلۡأَنۢبَاۤءُ یَوۡمَىِٕذࣲ فَهُمۡ لَا یَتَسَاۤءَلُونَ\n",
    "translations": {
      "en": "but all arguments and excuses will by then have been erased from their minds, and they will not [be able to] obtain any [helpful] answer from one another.",
      "ms": "Maka gelaplah kepada mereka, pada hari itu, segala khabar berita dan peristiwa (yang telah lalu), serta menjadilah mereka tidak dapat hendak bertanya-tanyaan sesama sendiri.",
      "id": "Maka gelaplah bagi mereka segala macam alasan pada hari itu, karena itu mereka tidak saling tanya menanya.",
      "ar": "فَعَمِیَتۡ عَلَیۡهِمُ ٱلۡأَنۢبَاۤءُ یَوۡمَىِٕذࣲ فَهُمۡ لَا یَتَسَاۤءَلُونَ\n"
    }
  },
  {
    "id": 3319,
    "surahId": 28,
    "ayahNumber": 67,
    "arabicText": "فَأَمَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَـٰلِحࣰا فَعَسَىٰۤ أَن یَكُونَ مِنَ ٱلۡمُفۡلِحِینَ\n",
    "translations": {
      "en": "But as against this - anyone who repents and attains to faith and does righteous deeds may well [hope to] find himself among those who achieve a happy state [in the life to come].",
      "ms": "(Demikianlah akibat orang-orang derhaka), adapun orang yang bertaubat dan beriman serta beramal soleh, maka semoga akan menjadilah ia dari orang-orang yang berjaya.",
      "id": "Adapun orang yang bertaubat dan beriman, serta mengerjakan amal yang saleh, semoga dia termasuk orang-orang yang beruntung.",
      "ar": "فَأَمَّا مَن تَابَ وَءَامَنَ وَعَمِلَ صَـٰلِحࣰا فَعَسَىٰۤ أَن یَكُونَ مِنَ ٱلۡمُفۡلِحِینَ\n"
    }
  },
  {
    "id": 3320,
    "surahId": 28,
    "ayahNumber": 68,
    "arabicText": "وَرَبُّكَ یَخۡلُقُ مَا یَشَاۤءُ وَیَخۡتَارُۗ مَا كَانَ لَهُمُ ٱلۡخِیَرَةُۚ سُبۡحَـٰنَ ٱللَّهِ وَتَعَـٰلَىٰ عَمَّا یُشۡرِكُونَ\n",
    "translations": {
      "en": "AND [thus it is:] thy Sustainer creates whatever He wills; and He chooses [for mankind] whatever is best for them. Limitless is God in His glory, and sub­limely exalted above anything to which they may ascribe a share in His divinity!",
      "ms": "Dan Tuhanmu menciptakan apa yang dirancangkan berlakunya, dan Dia lah juga yang memilih (satu-satu dari makhlukNya untuk sesuatu tugas atau keutamaan dan kemuliaan); tidaklah layak dan tidaklah berhak bagi sesiapapun memilih (selain dari pilihan Allah). Maha Suci Allah dan Maha Tinggilah keadaanNya dari apa yang mereka sekutukan denganNya.",
      "id": "Dan Tuhanmu menciptakan apa yang Dia kehendaki dan memilihnya. Sekali-kali tidak ada pilihan bagi mereka. Maha Suci Allah dan Maha Tinggi dari apa yang mereka persekutukan (dengan Dia).",
      "ar": "وَرَبُّكَ یَخۡلُقُ مَا یَشَاۤءُ وَیَخۡتَارُۗ مَا كَانَ لَهُمُ ٱلۡخِیَرَةُۚ سُبۡحَـٰنَ ٱللَّهِ وَتَعَـٰلَىٰ عَمَّا یُشۡرِكُونَ\n"
    }
  },
  {
    "id": 3321,
    "surahId": 28,
    "ayahNumber": 69,
    "arabicText": "وَرَبُّكَ یَعۡلَمُ مَا تُكِنُّ صُدُورُهُمۡ وَمَا یُعۡلِنُونَ\n",
    "translations": {
      "en": "And thy Sustainer knows all that their hearts conceal as well as all that they bring into the open:",
      "ms": "Dan Tuhanmu mengetahui akan apa yang terpendam dalam hati mereka dan apa yang mereka zahirkan.",
      "id": "Dan Tuhanmu mengetahui apa yang disembunyikan (dalam) dada mereka dan apa yang mereka nyatakan.",
      "ar": "وَرَبُّكَ یَعۡلَمُ مَا تُكِنُّ صُدُورُهُمۡ وَمَا یُعۡلِنُونَ\n"
    }
  },
  {
    "id": 3322,
    "surahId": 28,
    "ayahNumber": 70,
    "arabicText": "وَهُوَ ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَۖ لَهُ ٱلۡحَمۡدُ فِی ٱلۡأُولَىٰ وَٱلۡـَٔاخِرَةِۖ وَلَهُ ٱلۡحُكۡمُ وَإِلَیۡهِ تُرۡجَعُونَ\n",
    "translations": {
      "en": "for He is God, save whom there is no deity. Unto Him all praise is due, at the beginning and at the end [of time]; and with Him rests all judgment; and unto Him shall you all be brought back.",
      "ms": "Dan Dia lah Allah tiada Tuhan melainkan Dia. Segala puji tertentu bagiNya, di dunia dan di akhirat; dan hanyalah Dia yang berkuasa menghukum, serta kepadaNyalah kamu semua dikembalikan.",
      "id": "Dan Dialah Allah, tidak ada Tuhan (yang berhak disembah) melainkan Dia, bagi-Nya-lah segala puji di dunia dan di akhirat, dan bagi-Nya-lah segala penentuan dan hanya kepada-Nya-lah kamu dikembalikan.",
      "ar": "وَهُوَ ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَۖ لَهُ ٱلۡحَمۡدُ فِی ٱلۡأُولَىٰ وَٱلۡـَٔاخِرَةِۖ وَلَهُ ٱلۡحُكۡمُ وَإِلَیۡهِ تُرۡجَعُونَ\n"
    }
  },
  {
    "id": 3323,
    "surahId": 28,
    "ayahNumber": 71,
    "arabicText": "قُلۡ أَرَءَیۡتُمۡ إِن جَعَلَ ٱللَّهُ عَلَیۡكُمُ ٱلَّیۡلَ سَرۡمَدًا إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ مَنۡ إِلَـٰهٌ غَیۡرُ ٱللَّهِ یَأۡتِیكُم بِضِیَاۤءٍۚ أَفَلَا تَسۡمَعُونَ\n",
    "translations": {
      "en": "Say: “Have you ever considered [this]: If God had willed that there should always be night about you, without break, until the Day of Resurrection - is there any deity other than God that could bring you light? Will you not, then, listen [to the truth]?”",
      "ms": "Katakanlah: \"Bagaimana fikiran kamu jika Allah menjadikan malam kepada kamu tetap selama-lamanya hingga ke hari kiamat; tuhan yang manakah yang lain dari Allah, yang dapat membawakan cahaya yang menerangi kepada kamu? Maka mengapa kamu tidak mahu mendengar (secara memahami dan menerima kebenaran)?\"",
      "id": "Katakanlah: \"Terangkanlah kepadaku, jika Allah menjadikan untukmu malam itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan sinar terang kepadamu? Maka apakah kamu tidak mendengar?\"",
      "ar": "قُلۡ أَرَءَیۡتُمۡ إِن جَعَلَ ٱللَّهُ عَلَیۡكُمُ ٱلَّیۡلَ سَرۡمَدًا إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ مَنۡ إِلَـٰهٌ غَیۡرُ ٱللَّهِ یَأۡتِیكُم بِضِیَاۤءٍۚ أَفَلَا تَسۡمَعُونَ\n"
    }
  },
  {
    "id": 3324,
    "surahId": 28,
    "ayahNumber": 72,
    "arabicText": "قُلۡ أَرَءَیۡتُمۡ إِن جَعَلَ ٱللَّهُ عَلَیۡكُمُ ٱلنَّهَارَ سَرۡمَدًا إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ مَنۡ إِلَـٰهٌ غَیۡرُ ٱللَّهِ یَأۡتِیكُم بِلَیۡلࣲ تَسۡكُنُونَ فِیهِۚ أَفَلَا تُبۡصِرُونَ\n",
    "translations": {
      "en": "Say: “Have you ever considered [this]: If God had willed that there should always be daylight about you, without break, until the Day of Resurrection - is there any deity other than God that could bring you [the darkness of] night, wherein you might rest? Will you not, then, see [the truth]?”",
      "ms": "katakanlah lagi: Bagaimana fikiran kamu jika Allah menjadikan siang kepada kamu tetap selama-lamanya hingga ke hari kiamat; tuhan yang manakah yang lain dari Allah, yang dapat membawakan malam kepada kamu untuk kamu berehat padanya? Maka mengapa kamu tidak mahu melihat (dalil-dalil dan bukti keesaan dan kekuasaan Allah)?\"",
      "id": "Katakanlah: \"Terangkanlah kepadaku, jika Allah menjadikan untukmu siang itu terus menerus sampai hari kiamat, siapakah Tuhan selain Allah yang akan mendatangkan malam kepadamu yang kamu beristirahat padanya? Maka apakah kamu tidak memperhatikan?\"",
      "ar": "قُلۡ أَرَءَیۡتُمۡ إِن جَعَلَ ٱللَّهُ عَلَیۡكُمُ ٱلنَّهَارَ سَرۡمَدًا إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ مَنۡ إِلَـٰهٌ غَیۡرُ ٱللَّهِ یَأۡتِیكُم بِلَیۡلࣲ تَسۡكُنُونَ فِیهِۚ أَفَلَا تُبۡصِرُونَ\n"
    }
  },
  {
    "id": 3325,
    "surahId": 28,
    "ayahNumber": 73,
    "arabicText": "وَمِن رَّحۡمَتِهِۦ جَعَلَ لَكُمُ ٱلَّیۡلَ وَٱلنَّهَارَ لِتَسۡكُنُوا۟ فِیهِ وَلِتَبۡتَغُوا۟ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ\n",
    "translations": {
      "en": "For it is out of His grace that He has made for you the night and the day, so that you might rest therein as well as seek to obtain [what you need] of His bounty: and [He gave you all this] so that you might have cause to be grateful.",
      "ms": "Dan di antara rahmat pemberianNya, Ia menjadikan untuk kamu malam dan siang (silih berganti supaya kamu berehat padanya dan supaya kamu berusaha mencari rezeki dari limpah kurniaNya, dan juga supaya kamu bersyukur.",
      "id": "Dan karena rahmat-Nya, Dia jadikan untukmu malam dan siang, supaya kamu beristirahat pada malam itu dan supaya kamu mencari sebahagian dari karunia-Nya (pada siang hari) dan agar kamu bersyukur kepada-Nya.",
      "ar": "وَمِن رَّحۡمَتِهِۦ جَعَلَ لَكُمُ ٱلَّیۡلَ وَٱلنَّهَارَ لِتَسۡكُنُوا۟ فِیهِ وَلِتَبۡتَغُوا۟ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ\n"
    }
  },
  {
    "id": 3326,
    "surahId": 28,
    "ayahNumber": 74,
    "arabicText": "وَیَوۡمَ یُنَادِیهِمۡ فَیَقُولُ أَیۡنَ شُرَكَاۤءِیَ ٱلَّذِینَ كُنتُمۡ تَزۡعُمُونَ\n",
    "translations": {
      "en": "AND ON THAT DAY He will call unto those [that shall have been arraigned before His judgment seat], and will ask: “Where, now, are those [beings or powers] whom you imagined to have a share in My divinity?”",
      "ms": "Dan (ingatlah) pada hari (kiamat), Allah akan menyeru mereka lalu bertanya: \"Mana dia sekutu-sekutuKu yang kamu sifatkan mereka (menjadi tuhan dan dapat memberikan pertolongan)?\"",
      "id": "Dan (ingatlah) hari (di waktu) Allah menyeru mereka, seraya berkata: \"Di manakah sekutu-sekutu-Ku yang dahulu kamu katakan?\"",
      "ar": "وَیَوۡمَ یُنَادِیهِمۡ فَیَقُولُ أَیۡنَ شُرَكَاۤءِیَ ٱلَّذِینَ كُنتُمۡ تَزۡعُمُونَ\n"
    }
  },
  {
    "id": 3327,
    "surahId": 28,
    "ayahNumber": 75,
    "arabicText": "وَنَزَعۡنَا مِن كُلِّ أُمَّةࣲ شَهِیدࣰا فَقُلۡنَا هَاتُوا۟ بُرۡهَـٰنَكُمۡ فَعَلِمُوۤا۟ أَنَّ ٱلۡحَقَّ لِلَّهِ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n",
    "translations": {
      "en": "And [they will remain silent: for by then] We will have called forth witnesses from within every community, and will have said [unto the sinners]: “Produce an evidence for what you have been claim­ing!” And so they will come to understand that all truth is God’s [alone]; and all their false imagery will have forsaken them.",
      "ms": "Dan (pada hari itu) Kami keluarkan dari tiap-tiap umat seorang saksi, lalu Kami katakan (kepada golongan yang kafir): \"Bawalah keterangan dan bukti kebenaran kamu\". Maka (pada saat itu) ketahuilah mereka bahawa kebenaran (hak ketuhanan) itu tertentu bagi Allah, dan (dengan itu), hilang lenyaplah dari mereka apa yang mereka ada-adakan secara dusta dahulu.",
      "id": "Dan Kami datangkan dari tiap-tiap umat seorang saksi, lalu Kami berkata \"Tunjukkanlah bukti kebenaranmu\", maka tahulah mereka bahwasanya yang hak itu kepunyaan Allah dan lenyaplah dari mereka apa yang dahulunya mereka ada-adakan.",
      "ar": "وَنَزَعۡنَا مِن كُلِّ أُمَّةࣲ شَهِیدࣰا فَقُلۡنَا هَاتُوا۟ بُرۡهَـٰنَكُمۡ فَعَلِمُوۤا۟ أَنَّ ٱلۡحَقَّ لِلَّهِ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n"
    }
  },
  {
    "id": 3328,
    "surahId": 28,
    "ayahNumber": 76,
    "arabicText": "۞ إِنَّ قَـٰرُونَ كَانَ مِن قَوۡمِ مُوسَىٰ فَبَغَىٰ عَلَیۡهِمۡۖ وَءَاتَیۡنَـٰهُ مِنَ ٱلۡكُنُوزِ مَاۤ إِنَّ مَفَاتِحَهُۥ لَتَنُوۤأُ بِٱلۡعُصۡبَةِ أُو۟لِی ٱلۡقُوَّةِ إِذۡ قَالَ لَهُۥ قَوۡمُهُۥ لَا تَفۡرَحۡۖ إِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡفَرِحِینَ\n",
    "translations": {
      "en": "[NOW,] BEHOLD, Qarun was one of the people of Moses; but he arrogantly exalted himself above them - simply because We had granted him such riches that his treasure-chests alone would surely have been too heavy a burden for a troop of ten men or even more. When [they perceived his arrogance,] his people said unto him: “Exult not [in thy wealth], for, verily, God does not love those who exult [in things vain]!",
      "ms": "Sesungguhnya Qarun adalah ia dari kaum Nabi Musa, kemudian ia berlaku sombong dan zalim terhadap mereka; dan Kami telah mengurniakannya dari berbagai jenis kekayaan yang anak-anak kuncinya menjadi beban yang sungguh berat untuk dipikul oleh sebilangan orang yang kuat sasa. (Ia berlaku sombong) ketika kaumnya berkata kepadanya: \"Janganlah engkau bermegah-megah (dengan kekayaanmu), sesungguhnya Allah tidak suka kepada orang-orang yang bermegah-megah. (seperti lagakmu itu).",
      "id": "Sesungguhnya Karun adalah termasuk kaum Musa, maka ia berlaku aniaya terhadap mereka, dan Kami telah menganugerahkan kepadanya perbendaharaan harta yang kunci-kuncinya sungguh berat dipikul oleh sejumlah orang yang kuat-kuat. (Ingatlah) ketika kaumnya berkata kepadanya: \"Janganlah kamu terlalu bangga; sesungguhnya Allah tidak menyukai orang-orang yang terlalu membanggakan diri\".",
      "ar": "۞ إِنَّ قَـٰرُونَ كَانَ مِن قَوۡمِ مُوسَىٰ فَبَغَىٰ عَلَیۡهِمۡۖ وَءَاتَیۡنَـٰهُ مِنَ ٱلۡكُنُوزِ مَاۤ إِنَّ مَفَاتِحَهُۥ لَتَنُوۤأُ بِٱلۡعُصۡبَةِ أُو۟لِی ٱلۡقُوَّةِ إِذۡ قَالَ لَهُۥ قَوۡمُهُۥ لَا تَفۡرَحۡۖ إِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡفَرِحِینَ\n"
    }
  },
  {
    "id": 3329,
    "surahId": 28,
    "ayahNumber": 77,
    "arabicText": "وَٱبۡتَغِ فِیمَاۤ ءَاتَىٰكَ ٱللَّهُ ٱلدَّارَ ٱلۡـَٔاخِرَةَۖ وَلَا تَنسَ نَصِیبَكَ مِنَ ٱلدُّنۡیَاۖ وَأَحۡسِن كَمَاۤ أَحۡسَنَ ٱللَّهُ إِلَیۡكَۖ وَلَا تَبۡغِ ٱلۡفَسَادَ فِی ٱلۡأَرۡضِۖ إِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡمُفۡسِدِینَ\n",
    "translations": {
      "en": "Seek instead, by means of what God has granted thee, [the good of] the life to come, without forget­ting, withal, thine own [rightful] share in this world; and do good [unto others] as God has done good unto thee; and seek not to spread corruption on earth: for, verily, God does not love the spreaders of corruption!”",
      "ms": "\"Dan tuntutlah dengan harta kekayaan yang telah dikurniakan Allah kepadamu akan pahala dan kebahagiaan hari akhirat dan janganlah engkau melupakan bahagianmu (keperluan dan bekalanmu) dari dunia; dan berbuat baiklah (kepada hamba-hamba Allah) sebagaimana Allah berbuat baik kepadamu (dengan pemberian nikmatNya yang melimpah-limpah); dan janganlah engkau melakukan kerosakan di muka bumi; sesungguhnya Allah tidak suka kepada orang-orang yang berbuat kerosakan \".",
      "id": "Dan carilah pada apa yang telah dianugerahkan Allah kepadamu (kebahagiaan) negeri akhirat, dan janganlah kamu melupakan bahagianmu dari (kenikmatan) duniawi dan berbuat baiklah (kepada orang lain) sebagaimana Allah telah berbuat baik, kepadamu, dan janganlah kamu berbuat kerusakan di (muka) bumi. Sesungguhnya Allah tidak menyukai orang-orang yang berbuat kerusakan.",
      "ar": "وَٱبۡتَغِ فِیمَاۤ ءَاتَىٰكَ ٱللَّهُ ٱلدَّارَ ٱلۡـَٔاخِرَةَۖ وَلَا تَنسَ نَصِیبَكَ مِنَ ٱلدُّنۡیَاۖ وَأَحۡسِن كَمَاۤ أَحۡسَنَ ٱللَّهُ إِلَیۡكَۖ وَلَا تَبۡغِ ٱلۡفَسَادَ فِی ٱلۡأَرۡضِۖ إِنَّ ٱللَّهَ لَا یُحِبُّ ٱلۡمُفۡسِدِینَ\n"
    }
  },
  {
    "id": 3330,
    "surahId": 28,
    "ayahNumber": 78,
    "arabicText": "قَالَ إِنَّمَاۤ أُوتِیتُهُۥ عَلَىٰ عِلۡمٍ عِندِیۤۚ أَوَلَمۡ یَعۡلَمۡ أَنَّ ٱللَّهَ قَدۡ أَهۡلَكَ مِن قَبۡلِهِۦ مِنَ ٱلۡقُرُونِ مَنۡ هُوَ أَشَدُّ مِنۡهُ قُوَّةࣰ وَأَكۡثَرُ جَمۡعࣰاۚ وَلَا یُسۡـَٔلُ عَن ذُنُوبِهِمُ ٱلۡمُجۡرِمُونَ\n",
    "translations": {
      "en": "Answered he: “This [wealth] has been given to me only by virtue of the knowledge that is in me!” Did he not know that God had destroyed [the arrogant of] many a generation that preceded him - people who were greater than he in power, and richer in what they had amassed? But such as are lost in sin may not be asked about, their sins.",
      "ms": "Qarun menjawab (dengan sombongnya): \"Aku diberikan harta kekayaan ini hanyalah disebabkan pengetahuan dan kepandaian yang ada padaku\". (Kalaulah Qarun bijak pandai) tidakkah ia mengetahui dan pandai memahami, bahawa Allah telah membinasakan sebelumnya, dari umat-umat yang telah lalu, orang-orang yang lebih kuat daripadanya dan lebih banyak mengumpulkan harta kekayaan ? Dan (ingatlah) orang-orang yang berdosa (apabila mereka diseksa) tidak lagi ditanya tentang dosa-dosa mereka, (kerana Allah sedia mengetahuinya).",
      "id": "Karun berkata: \"Sesungguhnya aku hanya diberi harta itu, karena ilmu yang ada padaku\". Dan apakah ia tidak mengetahui, bahwasanya Allah sungguh telah membinasakan umat-umat sebelumnya yang lebih kuat daripadanya, dan lebih banyak mengumpulkan harta? Dan tidaklah perlu ditanya kepada orang-orang yang berdosa itu, tentang dosa-dosa mereka.",
      "ar": "قَالَ إِنَّمَاۤ أُوتِیتُهُۥ عَلَىٰ عِلۡمٍ عِندِیۤۚ أَوَلَمۡ یَعۡلَمۡ أَنَّ ٱللَّهَ قَدۡ أَهۡلَكَ مِن قَبۡلِهِۦ مِنَ ٱلۡقُرُونِ مَنۡ هُوَ أَشَدُّ مِنۡهُ قُوَّةࣰ وَأَكۡثَرُ جَمۡعࣰاۚ وَلَا یُسۡـَٔلُ عَن ذُنُوبِهِمُ ٱلۡمُجۡرِمُونَ\n"
    }
  },
  {
    "id": 3331,
    "surahId": 28,
    "ayahNumber": 79,
    "arabicText": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ فِی زِینَتِهِۦۖ قَالَ ٱلَّذِینَ یُرِیدُونَ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا یَـٰلَیۡتَ لَنَا مِثۡلَ مَاۤ أُوتِیَ قَـٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِیمࣲ\n",
    "translations": {
      "en": "And so he went forth before his people in all his pomp; [and] those who cared only for the life of this world would say, “Oh, if we but had the like of what Qarun has been given! Verily, with tremendous good fortune is he endowed!”",
      "ms": "Kemudian Qarun keluar kepada kaumnya dengan memakai perhiasannya. (Pada saat itu) berkatalah orang-orang yang semata-mata inginkan kesenangan kehidupan dunia: \"Alangkah baiknya kalau kita ada kekayaan seperti yang didapati oleh Qarun! Sesungguhnya dia adalah seorang yang bernasib baik\".",
      "id": "Maka keluarlah Karun kepada kaumnya dalam kemegahannya. Berkatalah orang-orang yang menghendaki kehidupan dunia: \"Moga-moga kiranya kita mempunyai seperti apa yang telah diberikan kepada Karun; sesungguhnya ia benar-benar mempunyai keberuntungan yang besar\".",
      "ar": "فَخَرَجَ عَلَىٰ قَوۡمِهِۦ فِی زِینَتِهِۦۖ قَالَ ٱلَّذِینَ یُرِیدُونَ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا یَـٰلَیۡتَ لَنَا مِثۡلَ مَاۤ أُوتِیَ قَـٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِیمࣲ\n"
    }
  },
  {
    "id": 3332,
    "surahId": 28,
    "ayahNumber": 80,
    "arabicText": "وَقَالَ ٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ وَیۡلَكُمۡ ثَوَابُ ٱللَّهِ خَیۡرࣱ لِّمَنۡ ءَامَنَ وَعَمِلَ صَـٰلِحࣰاۚ وَلَا یُلَقَّىٰهَاۤ إِلَّا ٱلصَّـٰبِرُونَ\n",
    "translations": {
      "en": "But those who had been granted true knowl­edge said: “Woe unto you! Merit in the sight of God is by far the best for any who attains to faith and does what is right: but none save the patient in adversity can ever achieve this [blessing].”",
      "ms": "Dan berkata pula orang-orang yang diberi ilmu (di antara mereka): \"Janganlah kamu berkata demikian, pahala dari Allah lebih baik bagi orang yang beriman dan beramal soleh; dan tidak akan dapat menerima (pahala yang demikian) itu melainkan orang-orang yang sabar\".",
      "id": "Berkatalah orang-orang yang dianugerahi ilmu: \"Kecelakaan yang besarlah bagimu, pahala Allah adalah lebih baik bagi orang-orang yang beriman dan beramal saleh, dan tidak diperoleh pahala itu, kecuali oleh orang-orang yang sabar\".",
      "ar": "وَقَالَ ٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ وَیۡلَكُمۡ ثَوَابُ ٱللَّهِ خَیۡرࣱ لِّمَنۡ ءَامَنَ وَعَمِلَ صَـٰلِحࣰاۚ وَلَا یُلَقَّىٰهَاۤ إِلَّا ٱلصَّـٰبِرُونَ\n"
    }
  },
  {
    "id": 3333,
    "surahId": 28,
    "ayahNumber": 81,
    "arabicText": "فَخَسَفۡنَا بِهِۦ وَبِدَارِهِ ٱلۡأَرۡضَ فَمَا كَانَ لَهُۥ مِن فِئَةࣲ یَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلۡمُنتَصِرِینَ\n",
    "translations": {
      "en": "And thereupon We caused the earth to swallow him and his dwelling; and he had none and nothing to succour him against God, nor was he of those who could succour themselves.",
      "ms": "Lalu Kami timbuskan dia bersama-sama dengan rumahnya di dalam tanah, maka tidaklah ia mendapat sebarang golongan yang boleh menolongnya dari azab Allah\" dan ia pula tidak dapat menolong dirinya sendiri.",
      "id": "Maka Kami benamkanlah Karun beserta rumahnya ke dalam bumi. Maka tidak ada baginya suatu golonganpun yang menolongnya terhadap azab Allah. Dan tiadalah ia termasuk orang-orang (yang dapat) membela (dirinya).",
      "ar": "فَخَسَفۡنَا بِهِۦ وَبِدَارِهِ ٱلۡأَرۡضَ فَمَا كَانَ لَهُۥ مِن فِئَةࣲ یَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مِنَ ٱلۡمُنتَصِرِینَ\n"
    }
  },
  {
    "id": 3334,
    "surahId": 28,
    "ayahNumber": 82,
    "arabicText": "وَأَصۡبَحَ ٱلَّذِینَ تَمَنَّوۡا۟ مَكَانَهُۥ بِٱلۡأَمۡسِ یَقُولُونَ وَیۡكَأَنَّ ٱللَّهَ یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ مِنۡ عِبَادِهِۦ وَیَقۡدِرُۖ لَوۡلَاۤ أَن مَّنَّ ٱللَّهُ عَلَیۡنَا لَخَسَفَ بِنَاۖ وَیۡكَأَنَّهُۥ لَا یُفۡلِحُ ٱلۡكَـٰفِرُونَ\n",
    "translations": {
      "en": "And on the morrow, those who but yesterday had longed to be in his place exclaimed: “Alas [for our not having been aware] that it is indeed God [alone] who grants abundant sustenance, or gives it in scant measure, unto whichever He wills of His crea­tures! Had not God been gracious to us, He might have caused [the earth] to swallow us, too! Alas [for our having forgotten] that those who deny the truth can never attain to a happy state!”",
      "ms": "Dan orang-orang yang pada masa dahulu bercita-cita mendapat kekayaan seperti Qarun - mulai sedar sambil berkata: \"Wah! Sesungguhnya Allah memewahkan rezeki bagi sesiapa yang dikehendakiNya dari hamba-hambaNya, dan Dia lah juga yang menyempitkannya kalau tidak kerana Allah memberi pertolongan kepada kita tentulah kita akan dibinasakan dengan tertimbus di dalam tanah (seperti Qarun). Aduhai! Sesungguhnya orang-orang yang kufurkan nikmat Allah itu tidak akan berjaya!\"",
      "id": "Dan jadilah orang-orang yang kemarin mencita-citakan kedudukan Karun itu, berkata: \"Aduhai, benarlah Allah melapangkan rezeki bagi siapa yang Dia kehendaki dari hamba-hambanya dan menyempitkannya; kalau Allah tidak melimpahkan karunia-Nya atas kita benar-benar Dia telah membenamkan kita (pula). Aduhai benarlah, tidak beruntung orang-orang yang mengingkari (nikmat Allah)\".",
      "ar": "وَأَصۡبَحَ ٱلَّذِینَ تَمَنَّوۡا۟ مَكَانَهُۥ بِٱلۡأَمۡسِ یَقُولُونَ وَیۡكَأَنَّ ٱللَّهَ یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ مِنۡ عِبَادِهِۦ وَیَقۡدِرُۖ لَوۡلَاۤ أَن مَّنَّ ٱللَّهُ عَلَیۡنَا لَخَسَفَ بِنَاۖ وَیۡكَأَنَّهُۥ لَا یُفۡلِحُ ٱلۡكَـٰفِرُونَ\n"
    }
  },
  {
    "id": 3335,
    "surahId": 28,
    "ayahNumber": 83,
    "arabicText": "تِلۡكَ ٱلدَّارُ ٱلۡـَٔاخِرَةُ نَجۡعَلُهَا لِلَّذِینَ لَا یُرِیدُونَ عُلُوࣰّا فِی ٱلۡأَرۡضِ وَلَا فَسَادࣰاۚ وَٱلۡعَـٰقِبَةُ لِلۡمُتَّقِینَ\n",
    "translations": {
      "en": "As for that [happy] life in the hereafter, We grant it [only] to those who do not seek to exalt themselves on earth, nor yet to spread corruption: for the future belongs to the God-conscious.",
      "ms": "Negeri akhirat (yang telah diterangkan nikmat-nikmatnya) itu, Kami sediakan bagi orang-orang yang tidak bertujuan hendak mendapat pengaruh atau kelebihan di muka bumi dan tidak ingat hendak melakukan kerosakan; dan kesudahan yang baik adalah bagi orang-orang yang bertaqwa.",
      "id": "Negeri akhirat itu, Kami jadikan untuk orang-orang yang tidak ingin menyombongkan diri dan berbuat kerusakan di (muka) bumi. Dan kesudahan (yang baik) itu adalah bagi orang-orang yang bertakwa.",
      "ar": "تِلۡكَ ٱلدَّارُ ٱلۡـَٔاخِرَةُ نَجۡعَلُهَا لِلَّذِینَ لَا یُرِیدُونَ عُلُوࣰّا فِی ٱلۡأَرۡضِ وَلَا فَسَادࣰاۚ وَٱلۡعَـٰقِبَةُ لِلۡمُتَّقِینَ\n"
    }
  },
  {
    "id": 3336,
    "surahId": 28,
    "ayahNumber": 84,
    "arabicText": "مَن جَاۤءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَیۡرࣱ مِّنۡهَاۖ وَمَن جَاۤءَ بِٱلسَّیِّئَةِ فَلَا یُجۡزَى ٱلَّذِینَ عَمِلُوا۟ ٱلسَّیِّـَٔاتِ إِلَّا مَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "Whosoever shall come [before God] with a good deed will gain [further] good there from; but as for any who shall come with an evil deed - [know that] they who do evil deeds will not be requited with more than [the like of] what they have done.",
      "ms": "Sesiapa yang datang membawa amal baik (pada hari akhirat) maka baginya balasan yang lebih baik daripadanya; dan sesiapa yang datang membawa amal jahat, maka mereka yang melakukan kejahatan tidak di balas melainkan dengan apa yang mereka kerjakan.",
      "id": "Barangsiapa yang datang dengan (membawa) kebaikan, maka baginya (pahala) yang lebih baik daripada kebaikannya itu; dan barangsiapa yang datang dengan (membawa) kejahatan, maka tidaklah diberi pembalasan kepada orang-orang yang telah mengerjakan kejahatan itu, melainkan (seimbang) dengan apa yang dahulu mereka kerjakan.",
      "ar": "مَن جَاۤءَ بِٱلۡحَسَنَةِ فَلَهُۥ خَیۡرࣱ مِّنۡهَاۖ وَمَن جَاۤءَ بِٱلسَّیِّئَةِ فَلَا یُجۡزَى ٱلَّذِینَ عَمِلُوا۟ ٱلسَّیِّـَٔاتِ إِلَّا مَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 3337,
    "surahId": 28,
    "ayahNumber": 85,
    "arabicText": "إِنَّ ٱلَّذِی فَرَضَ عَلَیۡكَ ٱلۡقُرۡءَانَ لَرَاۤدُّكَ إِلَىٰ مَعَادࣲۚ قُل رَّبِّیۤ أَعۡلَمُ مَن جَاۤءَ بِٱلۡهُدَىٰ وَمَنۡ هُوَ فِی ضَلَـٰلࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "VERILY, [O believer,] He who has laid down this Qur’an in plain terms, making it binding on thee, will assuredly bring thee back [from death] to a life renewed. Say [unto those who reject the truth]: My Sus­tainer knows best, as to who is right-guided and who is obviously lost in error!”",
      "ms": "Sesungguhnya Allah yang mewajibkan kepadamu (beramal dan menyampaikan) Al-Quran (wahai Muhammad) sudah tentu akan menyampaikan engkau lagi kepada apa yang engkau ingini dan cintai. Katakanlah (kepada kaum yang menentangmu): \"Tuhanku amat mengetahui akan sesiapa yang membawa hidayah petunjuk dan sesiapa pula yang berada dalam kesesatan yang nyata \".",
      "id": "Sesungguhnya yang mewajibkan atasmu (melaksanakan hukum-hukum) Al Quran, benar-benar akan mengembalikan kamu ke tempat kembali. Katakanlah: \"Tuhanku mengetahui orang yang membawa petunjuk dan orang yang dalam kesesatan yang nyata\".",
      "ar": "إِنَّ ٱلَّذِی فَرَضَ عَلَیۡكَ ٱلۡقُرۡءَانَ لَرَاۤدُّكَ إِلَىٰ مَعَادࣲۚ قُل رَّبِّیۤ أَعۡلَمُ مَن جَاۤءَ بِٱلۡهُدَىٰ وَمَنۡ هُوَ فِی ضَلَـٰلࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 3338,
    "surahId": 28,
    "ayahNumber": 86,
    "arabicText": "وَمَا كُنتَ تَرۡجُوۤا۟ أَن یُلۡقَىٰۤ إِلَیۡكَ ٱلۡكِتَـٰبُ إِلَّا رَحۡمَةࣰ مِّن رَّبِّكَۖ فَلَا تَكُونَنَّ ظَهِیرࣰا لِّلۡكَـٰفِرِینَ\n",
    "translations": {
      "en": "Now [as for thyself, O believer,] thou couldst never foresee that this divine writ would [one day] be offered to thee: but [it did come to thee] by thy Sustainer’s grace. Hence, never uphold those who deny the truth [of divine guidance],",
      "ms": "Dan engkau (wahai Muhammad) tidak pernah berharap supaya Kitab Al-Qufsran ini diturunkan kepadamu, (tetapi ia diturunkan kepadamu) hanyalah sebagai rahmat dari Tuhanmu, oleh itu janganlah engkau menjadi orang-orang kafir.",
      "id": "Dan kamu tidak pernah mengharap agar Al Quran diturunkan kepadamu, tetapi ia (diturunkan) karena suatu rahmat yang besar dari Tuhanmu, sebab itu janganlah sekali-kali kamu menjadi penolong bagi orang-orang kafir.",
      "ar": "وَمَا كُنتَ تَرۡجُوۤا۟ أَن یُلۡقَىٰۤ إِلَیۡكَ ٱلۡكِتَـٰبُ إِلَّا رَحۡمَةࣰ مِّن رَّبِّكَۖ فَلَا تَكُونَنَّ ظَهِیرࣰا لِّلۡكَـٰفِرِینَ\n"
    }
  },
  {
    "id": 3339,
    "surahId": 28,
    "ayahNumber": 87,
    "arabicText": "وَلَا یَصُدُّنَّكَ عَنۡ ءَایَـٰتِ ٱللَّهِ بَعۡدَ إِذۡ أُنزِلَتۡ إِلَیۡكَۖ وَٱدۡعُ إِلَىٰ رَبِّكَۖ وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِینَ\n",
    "translations": {
      "en": "and never let them turn thee away from God’s messages after they have been bestowed upon thee from on high: instead summon [all men] to thy Sustainer. And never be of those who ascribe divinity to aught but Him,",
      "ms": "Dan janganlah mereka (yang ingkar) dapat menghalangmu (daripada menyampaikan dan beramal dengan) ayat-ayat Allah sesudah ia diturunkan kepadamu; dan serulah manusia kepada (ugama) Tuhanmu; dan janganlah engkau menjadi dari golongan yang menyertai orang-orang musyrik.",
      "id": "Dan janganlah sekali-kali mereka dapat menghalangimu dari (menyampaikan) ayat-ayat Allah, sesudah ayat-ayat itu diturunkan kepadamu, dan serulah mereka kepada (jalan) Tuhanmu, dan janganlah sekali-sekali kamu termasuk orang-orang yang mempersekutukan Tuhan.",
      "ar": "وَلَا یَصُدُّنَّكَ عَنۡ ءَایَـٰتِ ٱللَّهِ بَعۡدَ إِذۡ أُنزِلَتۡ إِلَیۡكَۖ وَٱدۡعُ إِلَىٰ رَبِّكَۖ وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِینَ\n"
    }
  },
  {
    "id": 3340,
    "surahId": 28,
    "ayahNumber": 88,
    "arabicText": "وَلَا تَدۡعُ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَۘ لَاۤ إِلَـٰهَ إِلَّا هُوَۚ كُلُّ شَیۡءٍ هَالِكٌ إِلَّا وَجۡهَهُۥۚ لَهُ ٱلۡحُكۡمُ وَإِلَیۡهِ تُرۡجَعُونَ\n",
    "translations": {
      "en": "and never call upon any other deity side by side with God. There is no deity save Him. Everything is bound to perish, save His [eternal] self. With Him rests all judgment; and unto Him shall you all be brought back.",
      "ms": "Dan janganlah engkau menyembah tuhan yang lain bersama-sama Allah. Tiada Tuhan melainkan Dia. Tiap-tiap sesuatu akan binasa melainkan Zat Allah. BagiNyalah kuasa memutuskan segala hukum, dan kepadaNyalah kamu semua dikembalikan (untuk dihitung amal masing-masing dan menerima balasan).",
      "id": "Janganlah kamu sembah di samping (menyembah) Allah, tuhan apapun yang lain. Tidak ada Tuhan (yang berhak disembah) melainkan Dia. Tiap-tiap sesuatu pasti binasa, kecuali Allah. Bagi-Nya-lah segala penentuan, dan hanya kepada-Nya-lah kamu dikembalikan.",
      "ar": "وَلَا تَدۡعُ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَۘ لَاۤ إِلَـٰهَ إِلَّا هُوَۚ كُلُّ شَیۡءٍ هَالِكٌ إِلَّا وَجۡهَهُۥۚ لَهُ ٱلۡحُكۡمُ وَإِلَیۡهِ تُرۡجَعُونَ\n"
    }
  }
]