[
  {
    "id": 4613,
    "surahId": 49,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تُقَدِّمُوا۟ بَیۡنَ یَدَیِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُوا۟ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِیعٌ عَلِیمࣱ\n",
    "translations": {
      "en": "O YOU who have attained to faith! Do not put yourselves forward in the presence of [what] God and His Apostle [may have ordained], but remain conscious of God: for, verily, God is all-hearing, all-knowing!",
      "ms": "Wahai orang-orang yang beriman! Janganlah kamu memandai-mandai (melakukan sesuatu perkara) sebelum (mendapat hukum atau kebenaran) Allah dan RasulNya; dan bertaqwalah kamu kepada Allah; sesungguhnya Allah Maha Mendengar, lagi Maha Mengetahui.",
      "id": "Hai orang-orang yang beriman, janganlah kamu mendahului Allah dan Rasulnya dan bertakwalah kepada Allah. Sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تُقَدِّمُوا۟ بَیۡنَ یَدَیِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُوا۟ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِیعٌ عَلِیمࣱ\n"
    }
  },
  {
    "id": 4614,
    "surahId": 49,
    "ayahNumber": 2,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَرۡفَعُوۤا۟ أَصۡوَ ٰ⁠تَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِیِّ وَلَا تَجۡهَرُوا۟ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَـٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ\n",
    "translations": {
      "en": "O you who have attained to faith! Do not raise your voices above the voice of the Prophet, and neither speak loudly to him, as you would speak loudly to one another, lest all your [good] deeds come to nought without your perceiving it.",
      "ms": "Wahai orang-orang yang beriman! Janganlah kamu mengangkat suara kamu melebihi suara Nabi, dan janganlah kamu menyaringkan suara (dengan lantang) semasa bercakap dengannya sebagaimana setengah kamu menyaringkan suaranya semasa bercakap dengan setengahnya yang lain. (Larangan yang demikian) supaya amal-amal kamu tidak hapus pahalanya, sedang kamu tidak menyedarinya.",
      "id": "Hai orang-orang yang beriman, janganlah kamu meninggikan suaramu melebihi suara Nabi, dan janganlah kamu berkata kepadanya dengan suara yang keras, sebagaimana kerasnya suara sebagian kamu terhadap sebagian yang lain, supaya tidak hapus (pahala) amalanmu, sedangkan kamu tidak menyadari.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَرۡفَعُوۤا۟ أَصۡوَ ٰ⁠تَكُمۡ فَوۡقَ صَوۡتِ ٱلنَّبِیِّ وَلَا تَجۡهَرُوا۟ لَهُۥ بِٱلۡقَوۡلِ كَجَهۡرِ بَعۡضِكُمۡ لِبَعۡضٍ أَن تَحۡبَطَ أَعۡمَـٰلُكُمۡ وَأَنتُمۡ لَا تَشۡعُرُونَ\n"
    }
  },
  {
    "id": 4615,
    "surahId": 49,
    "ayahNumber": 3,
    "arabicText": "إِنَّ ٱلَّذِینَ یَغُضُّونَ أَصۡوَ ٰ⁠تَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةࣱ وَأَجۡرٌ عَظِیمٌ\n",
    "translations": {
      "en": "Behold, they who lower their voices in the presence of God’s Apostle - it is they whose hearts God has tested [and opened] to consciousness of Himself; [and] theirs shall be forgiveness and a reward supreme.",
      "ms": "Sesungguhnya orang-orang yang merendahkan suaranya semasa mereka berada di sisi Rasulullah (s.a.w), - merekalah orang-orang yang telah dibersihkan Allah hati mereka untuk bertaqwa; mereka beroleh keampunan dan pahala yang besar.",
      "id": "Sesungguhnya orang yang merendahkan suaranya di sisi Rasulullah mereka itulah orang-orang yang telah diuji hati mereka oleh Allah untuk bertakwa. Bagi mereka ampunan dan pahala yang besar.",
      "ar": "إِنَّ ٱلَّذِینَ یَغُضُّونَ أَصۡوَ ٰ⁠تَهُمۡ عِندَ رَسُولِ ٱللَّهِ أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ ٱمۡتَحَنَ ٱللَّهُ قُلُوبَهُمۡ لِلتَّقۡوَىٰۚ لَهُم مَّغۡفِرَةࣱ وَأَجۡرٌ عَظِیمٌ\n"
    }
  },
  {
    "id": 4616,
    "surahId": 49,
    "ayahNumber": 4,
    "arabicText": "إِنَّ ٱلَّذِینَ یُنَادُونَكَ مِن وَرَاۤءِ ٱلۡحُجُرَ ٰ⁠تِ أَكۡثَرُهُمۡ لَا یَعۡقِلُونَ\n",
    "translations": {
      "en": "Verily, [O Prophet,] as for those who call thee from without thy private apartments - most of them do not use their reason:",
      "ms": "Sesungguhnya orang-orang yang memanggilmu dari luar bilik-bilik (tempat ahlimu, wahai Muhammad), kebanyakan mereka tidak mengerti (adab dan tata tertib).",
      "id": "Sesungguhnya orang-orang yang memanggil kamu dari luar kamar(mu) kebanyakan mereka tidak mengerti.",
      "ar": "إِنَّ ٱلَّذِینَ یُنَادُونَكَ مِن وَرَاۤءِ ٱلۡحُجُرَ ٰ⁠تِ أَكۡثَرُهُمۡ لَا یَعۡقِلُونَ\n"
    }
  },
  {
    "id": 4617,
    "surahId": 49,
    "ayahNumber": 5,
    "arabicText": "وَلَوۡ أَنَّهُمۡ صَبَرُوا۟ حَتَّىٰ تَخۡرُجَ إِلَیۡهِمۡ لَكَانَ خَیۡرࣰا لَّهُمۡۚ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "for, if they had the patience [to wait] until thou come forth to them [of thine own accord], it would be for their own good. Still, God is much forgiving, a dispenser of grace.",
      "ms": "Dan kalaulah mereka bersabar menunggu sehingga engkau keluar menemui mereka, tentulah cara yang demikian lebih baik bagi mereka; dan (ingatlah), Allah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Dan kalau sekiranya mereka bersabar sampai kamu keluar menemui mereka sesungguhnya itu lebih baik bagi mereka, dan Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "وَلَوۡ أَنَّهُمۡ صَبَرُوا۟ حَتَّىٰ تَخۡرُجَ إِلَیۡهِمۡ لَكَانَ خَیۡرࣰا لَّهُمۡۚ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 4618,
    "surahId": 49,
    "ayahNumber": 6,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِن جَاۤءَكُمۡ فَاسِقُۢ بِنَبَإࣲ فَتَبَیَّنُوۤا۟ أَن تُصِیبُوا۟ قَوۡمَۢا بِجَهَـٰلَةࣲ فَتُصۡبِحُوا۟ عَلَىٰ مَا فَعَلۡتُمۡ نَـٰدِمِینَ\n",
    "translations": {
      "en": "O YOU who have attained to faith! If any iniquitous person comes to you with a [slanderous] tale, use your discernment, lest you hurt people unwittingly and afterwards be filled with remorse for what you have done.",
      "ms": "Wahai orang-orang yang beriman! Jika datang kepada kamu seorang fasik membawa sesuatu berita, maka selidikilah (untuk menentukan) kebenarannya, supaya kamu tidak menimpakan sesuatu kaum dengan perkara yang tidak diingini - dengan sebab kejahilan kamu (mengenainya) - sehingga menjadikan kamu menyesali apa yang kamu telah lakukan.",
      "id": "Hai orang-orang yang beriman, jika datang kepadamu orang fasik membawa suatu berita, maka periksalah dengan teliti agar kamu tidak menimpakan suatu musibah kepada suatu kaum tanpa mengetahui keadaannya yang menyebabkan kamu menyesal atas perbuatanmu itu.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِن جَاۤءَكُمۡ فَاسِقُۢ بِنَبَإࣲ فَتَبَیَّنُوۤا۟ أَن تُصِیبُوا۟ قَوۡمَۢا بِجَهَـٰلَةࣲ فَتُصۡبِحُوا۟ عَلَىٰ مَا فَعَلۡتُمۡ نَـٰدِمِینَ\n"
    }
  },
  {
    "id": 4619,
    "surahId": 49,
    "ayahNumber": 7,
    "arabicText": "وَٱعۡلَمُوۤا۟ أَنَّ فِیكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ یُطِیعُكُمۡ فِی كَثِیرࣲ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَـٰكِنَّ ٱللَّهَ حَبَّبَ إِلَیۡكُمُ ٱلۡإِیمَـٰنَ وَزَیَّنَهُۥ فِی قُلُوبِكُمۡ وَكَرَّهَ إِلَیۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡیَانَۚ أُو۟لَـٰۤىِٕكَ هُمُ ٱلرَّ ٰ⁠شِدُونَ\n",
    "translations": {
      "en": "And know that God’s Apostle is among you: were he to comply with your inclinations in each and every case, you would be bound to come to harm [as a community]. But as it is, God has caused [your] faith to be dear to you, and has given it beauty in your hearts, and has made hateful to you all denial of the truth, and all iniquity, and all rebellion [against what is good]. Such indeed are they who follow the right course",
      "ms": "Dan ketahuilah! Bahawasanya dalam kalangan kamu ada Rasulullah (maka janganlah kemahuan atau pendapat kamu mendahului pentadbirannya); kalaulah ia menurut kehendak kamu dalam kebanyakan perkara, tentulah kamu akan mengalami kesukaran; akan tetapi (Rasulullah tidak menurut melainkan perkara yang diwahyukan kepadanya, dan kamu wahai orang-orang yang beriman hendaklah bersyukur kerana) Allah menjadikan iman suatu perkara yang kamu cintai serta di perhiaskannya dalam hati kamu, dan menjadikan kekufuran dan perbuatan fasik serta perbuatan derhaka itu: perkara-perkara yang kamu benci; mereka yang bersifat demikian ialah orang-orang yang tetap menurut jalan yang lurus; -",
      "id": "Dan ketahuilah olehmu bahwa di kalanganmu ada Rasulullah. Kalau ia menuruti kemauanmu dalam beberapa urusan benar-benarlah kamu mendapat kesusahan, tetapi Allah menjadikan kamu \"cinta\" kepada keimanan dan menjadikan keimanan itu indah di dalam hatimu serta menjadikan kamu benci kepada kekafiran, kefasikan, dan kedurhakaan. Mereka itulah orang-orang yang mengikuti jalan yang lurus,",
      "ar": "وَٱعۡلَمُوۤا۟ أَنَّ فِیكُمۡ رَسُولَ ٱللَّهِۚ لَوۡ یُطِیعُكُمۡ فِی كَثِیرࣲ مِّنَ ٱلۡأَمۡرِ لَعَنِتُّمۡ وَلَـٰكِنَّ ٱللَّهَ حَبَّبَ إِلَیۡكُمُ ٱلۡإِیمَـٰنَ وَزَیَّنَهُۥ فِی قُلُوبِكُمۡ وَكَرَّهَ إِلَیۡكُمُ ٱلۡكُفۡرَ وَٱلۡفُسُوقَ وَٱلۡعِصۡیَانَۚ أُو۟لَـٰۤىِٕكَ هُمُ ٱلرَّ ٰ⁠شِدُونَ\n"
    }
  },
  {
    "id": 4620,
    "surahId": 49,
    "ayahNumber": 8,
    "arabicText": "فَضۡلࣰا مِّنَ ٱللَّهِ وَنِعۡمَةࣰۚ وَٱللَّهُ عَلِیمٌ حَكِیمࣱ\n",
    "translations": {
      "en": "through God’s bounty and favour; and God is all-knowing, truly wise.",
      "ms": "(Mereka dijadikan berkeadaan demikian) sebagai limpah kurnia dan nikmat pemberian dari Allah; dan (ingatlah), Allah Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "sebagai karunia dan nikmat dari Allah. Dan Allah Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "فَضۡلࣰا مِّنَ ٱللَّهِ وَنِعۡمَةࣰۚ وَٱللَّهُ عَلِیمٌ حَكِیمࣱ\n"
    }
  },
  {
    "id": 4621,
    "surahId": 49,
    "ayahNumber": 9,
    "arabicText": "وَإِن طَاۤىِٕفَتَانِ مِنَ ٱلۡمُؤۡمِنِینَ ٱقۡتَتَلُوا۟ فَأَصۡلِحُوا۟ بَیۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَـٰتِلُوا۟ ٱلَّتِی تَبۡغِی حَتَّىٰ تَفِیۤءَ إِلَىٰۤ أَمۡرِ ٱللَّهِۚ فَإِن فَاۤءَتۡ فَأَصۡلِحُوا۟ بَیۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوۤا۟ۖ إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُقۡسِطِینَ\n",
    "translations": {
      "en": "Hence, if two groups of believers fall to fighting, make peace between them; but then, if one of the two [groups] goes on acting wrongfully towards the other, fight against the one that acts wrongfully until it reverts to God’s commandment; and if they revert, make peace between them with justice, and deal equitably [with them]: for verily, God loves those who act equitably!",
      "ms": "Dan jika dua puak dari orang-orang yang beriman berperang, maka damaikanlah di antara keduanya; jika salah satunya berlaku zalim terhadap yang lain, maka lawanlah puak yang zalim itu sehingga ia kembali mematuhi perintah Allah; jika ia kembali patuh maka damaikanlah di antara keduanya dengan adil (menurut hukum Allah), serta berlaku adillah kamu (dalam segala perkara); sesungguhnya Allah mengasihi orang-orang yang berlaku adil.",
      "id": "Dan kalau ada dua golongan dari mereka yang beriman itu berperang hendaklah kamu damaikan antara keduanya! Tapi kalau yang satu melanggar perjanjian terhadap yang lain, hendaklah yang melanggar perjanjian itu kamu perangi sampai surut kembali pada perintah Allah. Kalau dia telah surut, damaikanlah antara keduanya menurut keadilan, dan hendaklah kamu berlaku adil; sesungguhnya Allah mencintai orang-orang yang berlaku adil.",
      "ar": "وَإِن طَاۤىِٕفَتَانِ مِنَ ٱلۡمُؤۡمِنِینَ ٱقۡتَتَلُوا۟ فَأَصۡلِحُوا۟ بَیۡنَهُمَاۖ فَإِنۢ بَغَتۡ إِحۡدَىٰهُمَا عَلَى ٱلۡأُخۡرَىٰ فَقَـٰتِلُوا۟ ٱلَّتِی تَبۡغِی حَتَّىٰ تَفِیۤءَ إِلَىٰۤ أَمۡرِ ٱللَّهِۚ فَإِن فَاۤءَتۡ فَأَصۡلِحُوا۟ بَیۡنَهُمَا بِٱلۡعَدۡلِ وَأَقۡسِطُوۤا۟ۖ إِنَّ ٱللَّهَ یُحِبُّ ٱلۡمُقۡسِطِینَ\n"
    }
  },
  {
    "id": 4622,
    "surahId": 49,
    "ayahNumber": 10,
    "arabicText": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةࣱ فَأَصۡلِحُوا۟ بَیۡنَ أَخَوَیۡكُمۡۚ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ\n",
    "translations": {
      "en": "All believers are but brethren. Hence, [when­ever they are at odds,] make peace between your two brethren, and remain conscious of God, so that you might be graced with His mercy.",
      "ms": "Sebenarnya orang-orang yang beriman itu adalah bersaudara, maka damaikanlah di antara dua saudara kamu (yang bertelingkah) itu; dan bertaqwalah kepada Allah supaya kamu beroleh rahmat.",
      "id": "Orang-orang beriman itu sesungguhnya bersaudara. Sebab itu damaikanlah (perbaikilah hubungan) antara kedua saudaramu itu dan takutlah terhadap Allah, supaya kamu mendapat rahmat.",
      "ar": "إِنَّمَا ٱلۡمُؤۡمِنُونَ إِخۡوَةࣱ فَأَصۡلِحُوا۟ بَیۡنَ أَخَوَیۡكُمۡۚ وَٱتَّقُوا۟ ٱللَّهَ لَعَلَّكُمۡ تُرۡحَمُونَ\n"
    }
  },
  {
    "id": 4623,
    "surahId": 49,
    "ayahNumber": 11,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا یَسۡخَرۡ قَوۡمࣱ مِّن قَوۡمٍ عَسَىٰۤ أَن یَكُونُوا۟ خَیۡرࣰا مِّنۡهُمۡ وَلَا نِسَاۤءࣱ مِّن نِّسَاۤءٍ عَسَىٰۤ أَن یَكُنَّ خَیۡرࣰا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوۤا۟ أَنفُسَكُمۡ وَلَا تَنَابَزُوا۟ بِٱلۡأَلۡقَـٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِیمَـٰنِۚ وَمَن لَّمۡ یَتُبۡ فَأُو۟لَـٰۤىِٕكَ هُمُ ٱلظَّـٰلِمُونَ\n",
    "translations": {
      "en": "O YOU who have attained to faith! No men shall deride [other] men: it may well be that those [whom they deride] are better than themselves; and no women [shall deride other] women: it may well be that those [whom they deride] are better than them­selves. And neither shall you defame one another, nor insult one another by [opprobrious] epithets: evil is all imputation of iniquity after [one has attained to] faith; and they who [become guilty thereof and] do not repent - it is they, they who are evildoers!",
      "ms": "Wahai orang-orang yang beriman! Janganlah sesuatu puak (dari kaum lelaki) mencemuh dan merendah-rendahkan puak lelaki yang lain, (kerana) harus puak yang dicemuhkan itu lebih baik daripada mereka; dan janganlah pula sesuatu puak dari kaum perempuan mencemuh dan merendah-rendahkan puak perempuan yang lain, (kerana) harus puak yang dicemuhkan itu lebih baik daripada mereka; dan janganlah setengah kamu menyatakan keaiban setengahnya yang lain; dan janganlah pula kamu panggil-memanggil antara satu dengan yang lain dengan gelaran yang buruk. (Larangan-larangan yang tersebut menyebabkan orang yang melakukannya menjadi fasik, maka) amatlah buruknya sebutan nama fasik (kepada seseorang) sesudah ia beriman. Dan (ingatlah), sesiapa yang tidak bertaubat (daripada perbuatan fasiknya) maka merekalah orang-orang yang zalim.",
      "id": "Hai orang-orang yang beriman, janganlah sekumpulan orang laki-laki merendahkan kumpulan yang lain, boleh jadi yang ditertawakan itu lebih baik dari mereka. Dan jangan pula sekumpulan perempuan merendahkan kumpulan lainnya, boleh jadi yang direndahkan itu lebih baik. Dan janganlah suka mencela dirimu sendiri dan jangan memanggil dengan gelaran yang mengandung ejekan. Seburuk-buruk panggilan adalah (panggilan) yang buruk sesudah iman dan barangsiapa yang tidak bertobat, maka mereka itulah orang-orang yang zalim.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا یَسۡخَرۡ قَوۡمࣱ مِّن قَوۡمٍ عَسَىٰۤ أَن یَكُونُوا۟ خَیۡرࣰا مِّنۡهُمۡ وَلَا نِسَاۤءࣱ مِّن نِّسَاۤءٍ عَسَىٰۤ أَن یَكُنَّ خَیۡرࣰا مِّنۡهُنَّۖ وَلَا تَلۡمِزُوۤا۟ أَنفُسَكُمۡ وَلَا تَنَابَزُوا۟ بِٱلۡأَلۡقَـٰبِۖ بِئۡسَ ٱلِٱسۡمُ ٱلۡفُسُوقُ بَعۡدَ ٱلۡإِیمَـٰنِۚ وَمَن لَّمۡ یَتُبۡ فَأُو۟لَـٰۤىِٕكَ هُمُ ٱلظَّـٰلِمُونَ\n"
    }
  },
  {
    "id": 4624,
    "surahId": 49,
    "ayahNumber": 12,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ٱجۡتَنِبُوا۟ كَثِیرࣰا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمࣱۖ وَلَا تَجَسَّسُوا۟ وَلَا یَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَیُحِبُّ أَحَدُكُمۡ أَن یَأۡكُلَ لَحۡمَ أَخِیهِ مَیۡتࣰا فَكَرِهۡتُمُوهُۚ وَٱتَّقُوا۟ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "O you who have attained to faith! Avoid most guesswork [about one another] for, behold, some of [such] guesswork is [in itself] a sin; and do not spy upon one another, and neither allow your­selves to speak ill of one another behind your backs. Would any of you like to eat the flesh of his dead brother? Nay, you would loathe it! And be conscious of God. Verily, God is an accep­tor of repentance, a dispenser of grace!",
      "ms": "Wahai orang-orang yang beriman! Jauhilah kebanyakan dari sangkaan (supaya kamu tidak menyangka sangkaan yang dilarang) kerana sesungguhnya sebahagian dari sangkaan itu adalah dosa; dan janganlah kamu mengintip atau mencari-cari kesalahan dan keaiban orang; dan janganlah setengah kamu mengumpat setengahnya yang lain. Adakah seseorang dari kamu suka memakan daging saudaranya yang telah mati? (Jika demikian keadaan mengumpat) maka sudah tentu kamu jijik kepadanya. (Oleh itu, patuhilah larangan-larangan yang tersebut) dan bertaqwalah kamu kepada Allah; sesungguhnya Allah Penerima taubat, lagi Maha mengasihani.",
      "id": "Hai orang-orang yang beriman, jauhilah kebanyakan purba-sangka (kecurigaan), karena sebagian dari purba-sangka itu dosa. Dan janganlah mencari-cari keburukan orang dan janganlah menggunjingkan satu sama lain. Adakah seorang diantara kamu yang suka memakan daging saudaranya yang sudah mati? Maka tentulah kamu merasa jijik kepadanya. Dan bertakwalah kepada Allah. Sesungguhnya Allah Maha Penerima Taubat lagi Maha Penyayang.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ٱجۡتَنِبُوا۟ كَثِیرࣰا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمࣱۖ وَلَا تَجَسَّسُوا۟ وَلَا یَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَیُحِبُّ أَحَدُكُمۡ أَن یَأۡكُلَ لَحۡمَ أَخِیهِ مَیۡتࣰا فَكَرِهۡتُمُوهُۚ وَٱتَّقُوا۟ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 4625,
    "surahId": 49,
    "ayahNumber": 13,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَـٰكُم مِّن ذَكَرࣲ وَأُنثَىٰ وَجَعَلۡنَـٰكُمۡ شُعُوبࣰا وَقَبَاۤىِٕلَ لِتَعَارَفُوۤا۟ۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِیمٌ خَبِیرࣱ\n",
    "translations": {
      "en": "O men! Behold, We have created you all out of a male and a female, and have made you into nations and tribes, so that you might come to know one another. Verily, the noblest of you in the sight of God is the one who is most deeply conscious of Him. Behold, God is all-knowing, all-aware.",
      "ms": "Wahai umat manusia! Sesungguhnya Kami telah menciptakan kamu dari lelaki dan perempuan, dan Kami telah menjadikan kamu berbagai bangsa dan bersuku puak, supaya kamu berkenal-kenalan (dan beramah mesra antara satu dengan yang lain). Sesungguhnya semulia-mulia kamu di sisi Allah ialah orang yang lebih taqwanya di antara kamu, (bukan yang lebih keturunan atau bangsanya). Sesungguhnya Allah Maha Mengetahui, lagi Maha Mendalam PengetahuanNya (akan keadaan dan amalan kamu).",
      "id": "Hai manusia, sesungguhnya Kami menciptakan kamu dari seorang laki-laki dan seorang perempuan dan menjadikan kamu berbangsa-bangsa dan bersuku-suku supaya kamu saling kenal-mengenal. Sesungguhnya orang yang paling mulia diantara kamu disisi Allah ialah orang yang paling takwa diantara kamu. Sesungguhnya Allah Maha Mengetahui lagi Maha Mengenal.",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ إِنَّا خَلَقۡنَـٰكُم مِّن ذَكَرࣲ وَأُنثَىٰ وَجَعَلۡنَـٰكُمۡ شُعُوبࣰا وَقَبَاۤىِٕلَ لِتَعَارَفُوۤا۟ۚ إِنَّ أَكۡرَمَكُمۡ عِندَ ٱللَّهِ أَتۡقَىٰكُمۡۚ إِنَّ ٱللَّهَ عَلِیمٌ خَبِیرࣱ\n"
    }
  },
  {
    "id": 4626,
    "surahId": 49,
    "ayahNumber": 14,
    "arabicText": "۞ قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُوا۟ وَلَـٰكِن قُولُوۤا۟ أَسۡلَمۡنَا وَلَمَّا یَدۡخُلِ ٱلۡإِیمَـٰنُ فِی قُلُوبِكُمۡۖ وَإِن تُطِیعُوا۟ ٱللَّهَ وَرَسُولَهُۥ لَا یَلِتۡكُم مِّنۡ أَعۡمَـٰلِكُمۡ شَیۡـًٔاۚ إِنَّ ٱللَّهَ غَفُورࣱ رَّحِیمٌ\n",
    "translations": {
      "en": "THE BEDOUIN say, “We have attained to faith.” Say [unto them, O Muhammad]: “You have not [yet] attained to faith; you should [rather] say, ‘We have [outwardly] surrendered’ - for [true] faith has not yet entered your hearts. But if you [truly] pay heed unto God and His Apostle, He will not let the least of your deeds go to waste: for, behold, God is much-forgiving, a dispenser of grace.”",
      "ms": "Orang-orang \" A'raab\" berkata: \" Kami telah beriman\". Katakanlah (wahai Muhammad): \"Kamu belum beriman, (janganlah berkata demikian), tetapi sementara iman belum lagi meresap masuk ke dalam hati kamu berkatalah sahaja: ` kami telah Islam '. Dan (ingatlah), jika kamu taat kepada Allah RasulNya (zahir dan batin), Allah tidak akan mengurangkan sedikitpun dari pahala amal-amal kamu, kerana sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani\".",
      "id": "Orang-orang Arab Badui itu berkata: \"Kami telah beriman\". Katakanlah: \"Kamu belum beriman, tapi katakanlah 'kami telah tunduk', karena iman itu belum masuk ke dalam hatimu; dan jika kamu taat kepada Allah dan Rasul-Nya, Dia tidak akan mengurangi sedikitpun pahala amalanmu; sesungguhnya Allah Maha Pengampun lagi Maha Penyayang\".",
      "ar": "۞ قَالَتِ ٱلۡأَعۡرَابُ ءَامَنَّاۖ قُل لَّمۡ تُؤۡمِنُوا۟ وَلَـٰكِن قُولُوۤا۟ أَسۡلَمۡنَا وَلَمَّا یَدۡخُلِ ٱلۡإِیمَـٰنُ فِی قُلُوبِكُمۡۖ وَإِن تُطِیعُوا۟ ٱللَّهَ وَرَسُولَهُۥ لَا یَلِتۡكُم مِّنۡ أَعۡمَـٰلِكُمۡ شَیۡـًٔاۚ إِنَّ ٱللَّهَ غَفُورࣱ رَّحِیمٌ\n"
    }
  },
  {
    "id": 4627,
    "surahId": 49,
    "ayahNumber": 15,
    "arabicText": "إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ ثُمَّ لَمۡ یَرۡتَابُوا۟ وَجَـٰهَدُوا۟ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡ فِی سَبِیلِ ٱللَّهِۚ أُو۟لَـٰۤىِٕكَ هُمُ ٱلصَّـٰدِقُونَ\n",
    "translations": {
      "en": "[Know that true] believers are only those who have attained to faith in God and His Apostle and have left all doubt behind, and who strive hard in God’s cause with their possessions and their lives: it is they, they who are true to their word!",
      "ms": "Sesungguhnya orang-orang yang sebenar-benarnya beriman hanyalah orang-orang yang percaya kepada Allah dan RasulNya, kemudian mereka (terus percaya dengan) tidak ragu-ragu lagi, serta mereka berjuang dengan harta benda dan jiwa mereka pada jalan Allah; mereka itulah orang-orang yang benar (pengakuan imannya).",
      "id": "Sesungguhnya orang-orang yang beriman itu hanyalah orang-orang yang percaya (beriman) kepada Allah dan Rasul-Nya, kemudian mereka tidak ragu-ragu dan mereka berjuang (berjihad) dengan harta dan jiwa mereka pada jalan Allah. Mereka itulah orang-orang yang benar.",
      "ar": "إِنَّمَا ٱلۡمُؤۡمِنُونَ ٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ ثُمَّ لَمۡ یَرۡتَابُوا۟ وَجَـٰهَدُوا۟ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡ فِی سَبِیلِ ٱللَّهِۚ أُو۟لَـٰۤىِٕكَ هُمُ ٱلصَّـٰدِقُونَ\n"
    }
  },
  {
    "id": 4628,
    "surahId": 49,
    "ayahNumber": 16,
    "arabicText": "قُلۡ أَتُعَلِّمُونَ ٱللَّهَ بِدِینِكُمۡ وَٱللَّهُ یَعۡلَمُ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَٱللَّهُ بِكُلِّ شَیۡءٍ عَلِیمࣱ\n",
    "translations": {
      "en": "Say: “Do you, perchance, [want to] inform God of [the nature of] your faith although God knows all that is in the heavens and all that is on earth? Indeed, God has full knowledge of every­thing!”",
      "ms": "Katakanlah (kepada orang-orang \"A'raab\" itu wahai Muhammad): \"Patutkah kamu hendak memberitahu kepada Allah tentang ugama kamu (dengan berkata: ` kami telah beriman ')? Padahal Allah mengetahui segala yang ada di langit dan yang ada di bumi, dan Allah Maha Mengetahui akan tiap-tiap sesuatu\".",
      "id": "Katakanlah: \"Apakah kamu akan memberitahukan kepada Allah tentang agamamu, padahal Allah mengetahui apa yang di langit dan apa yang di bumi dan Allah Maha Mengetahui segala sesuatu?\"",
      "ar": "قُلۡ أَتُعَلِّمُونَ ٱللَّهَ بِدِینِكُمۡ وَٱللَّهُ یَعۡلَمُ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَٱللَّهُ بِكُلِّ شَیۡءٍ عَلِیمࣱ\n"
    }
  },
  {
    "id": 4629,
    "surahId": 49,
    "ayahNumber": 17,
    "arabicText": "یَمُنُّونَ عَلَیۡكَ أَنۡ أَسۡلَمُوا۟ۖ قُل لَّا تَمُنُّوا۟ عَلَیَّ إِسۡلَـٰمَكُمۖ بَلِ ٱللَّهُ یَمُنُّ عَلَیۡكُمۡ أَنۡ هَدَىٰكُمۡ لِلۡإِیمَـٰنِ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "Many people think that they have bestowed a favour upon thee [O Prophet] by having surrendered [to thee]. Say thou: “Deem not your surrender a favour unto me: nay, but it is God who bestows a favour upon you by showing you the way to faith - if you are true to your word!”",
      "ms": "Mereka mengira dirinya berbudi kepadamu (wahai Muhammad) dengan sebab mereka telah Islam (tidak melawan dan tidak menentang). Katakanlah (kepada mereka): \"Janganlah kamu mengira keislaman kamu itu sebagai budi kepadaku, bahkan (kalaulah sah dakwaan kamu itu sekalipun maka) Allah jualah yang berhak membangkit-bangkitkan budiNya kepada kamu, kerana Dia lah yang memimpin kamu kepada iman (yang kamu dakwakan itu), kalau betul kamu orang-orang yang benar (pengakuan imannya).",
      "id": "Mereka merasa telah memberi nikmat kepadamu dengan keislaman mereka. Katakanlah: \"Janganlah kamu merasa telah memberi nikmat kepadaku dengan keislamanmu, sebenarnya Allah, Dialah yang melimpahkan nikmat kepadamu dengan menunjuki kamu kepada keimanan jika kamu adalah orang-orang yang benar\".",
      "ar": "یَمُنُّونَ عَلَیۡكَ أَنۡ أَسۡلَمُوا۟ۖ قُل لَّا تَمُنُّوا۟ عَلَیَّ إِسۡلَـٰمَكُمۖ بَلِ ٱللَّهُ یَمُنُّ عَلَیۡكُمۡ أَنۡ هَدَىٰكُمۡ لِلۡإِیمَـٰنِ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 4630,
    "surahId": 49,
    "ayahNumber": 18,
    "arabicText": "إِنَّ ٱللَّهَ یَعۡلَمُ غَیۡبَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَٱللَّهُ بَصِیرُۢ بِمَا تَعۡمَلُونَ\n",
    "translations": {
      "en": "Verily, God knows the hidden reality of the heavens and the earth; and God sees all that you do.",
      "ms": "\"Sesungguhnya Allah mengetahui segala rahsia langit dan bumi, dan Allah Maha Melihat akan segala yang kamu kerjakan\".",
      "id": "Sesungguhnya Allah mengetahui apa yang ghaib di langit dan bumi. Dan Allah Maha Melihat apa yang kamu kerjakan.",
      "ar": "إِنَّ ٱللَّهَ یَعۡلَمُ غَیۡبَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَٱللَّهُ بَصِیرُۢ بِمَا تَعۡمَلُونَ\n"
    }
  }
]