[
  {
    "id": 3971,
    "surahId": 38,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ صۤۚ وَٱلۡقُرۡءَانِ ذِی ٱلذِّكۡرِ\n",
    "translations": {
      "en": "Sad. CONSIDER this Qur’an, endowed with all that one ought to remember!",
      "ms": "Saad; demi Al-Quran yang mempunyai kemuliaan serta mengandungi peringatan dan pengajaran.",
      "id": "Shaad, demi Al Quran yang mempunyai keagungan.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ صۤۚ وَٱلۡقُرۡءَانِ ذِی ٱلذِّكۡرِ\n"
    }
  },
  {
    "id": 3972,
    "surahId": 38,
    "ayahNumber": 2,
    "arabicText": "بَلِ ٱلَّذِینَ كَفَرُوا۟ فِی عِزَّةࣲ وَشِقَاقࣲ\n",
    "translations": {
      "en": "But nay - they who are bent on denying the truth are lost in [false] pride, and [hence] deeply in the wrong.",
      "ms": "(Orang-orang yang mengingkari kerasulanmu - wahai Muhammad - tidak berdasarkan kebenaran) bahkan mereka yang kafir itu bersifat sombong angkuh dan suka menentang kebenaran.",
      "id": "Sebenarnya orang-orang kafir itu (berada) dalam kesombongan dan permusuhan yang sengit.",
      "ar": "بَلِ ٱلَّذِینَ كَفَرُوا۟ فِی عِزَّةࣲ وَشِقَاقࣲ\n"
    }
  },
  {
    "id": 3973,
    "surahId": 38,
    "ayahNumber": 3,
    "arabicText": "كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنࣲ فَنَادَوا۟ وَّلَاتَ حِینَ مَنَاصࣲ\n",
    "translations": {
      "en": "How many a generation have We destroyed before their time [for this very sin]! And [how] they called [unto Us] when it was too late to escape!",
      "ms": "(Tidakkah mereka menyedari) berapa banyak umat-umat (yang ingkar) yang terdahulu dari mereka, Kami binasakan? Lalu mereka meminta pertolongan, padahal saat itu bukanlah saat meminta pertolongan melepaskan diri dari azab.",
      "id": "Betapa banyaknya umat sebelum mereka yang telah Kami binasakan, lalu mereka meminta tolong padahal (waktu itu) bukanlah saat untuk lari melepaskan diri.",
      "ar": "كَمۡ أَهۡلَكۡنَا مِن قَبۡلِهِم مِّن قَرۡنࣲ فَنَادَوا۟ وَّلَاتَ حِینَ مَنَاصࣲ\n"
    }
  },
  {
    "id": 3974,
    "surahId": 38,
    "ayahNumber": 4,
    "arabicText": "وَعَجِبُوۤا۟ أَن جَاۤءَهُم مُّنذِرࣱ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَـٰفِرُونَ هَـٰذَا سَـٰحِرࣱ كَذَّابٌ\n",
    "translations": {
      "en": "Now these [people] deem it strange that a warner should have come unto them from their own midst - and [so] the deniers of the truth are saying: “A [mere] spellbinder is he, a liar!",
      "ms": "Dan mereka (yang mengingkari kerasulan Nabi Muhammad itu) merasa hairan, bahawa mereka didatangi oleh seorang Rasul pemberi amaran, dari kalangan mereka sendiri. Dan mereka yang kafir itu berkata: \"Orang ini adalah seorang ahli sihir, lagi pendusta.",
      "id": "Dan mereka heran karena mereka kedatangan seorang pemberi peringatan (rasul) dari kalangan mereka; dan orang-orang kafir berkata: \"Ini adalah seorang ahli sihir yang banyak berdusta\".",
      "ar": "وَعَجِبُوۤا۟ أَن جَاۤءَهُم مُّنذِرࣱ مِّنۡهُمۡۖ وَقَالَ ٱلۡكَـٰفِرُونَ هَـٰذَا سَـٰحِرࣱ كَذَّابٌ\n"
    }
  },
  {
    "id": 3975,
    "surahId": 38,
    "ayahNumber": 5,
    "arabicText": "أَجَعَلَ ٱلۡـَٔالِهَةَ إِلَـٰهࣰا وَ ٰ⁠حِدًاۖ إِنَّ هَـٰذَا لَشَیۡءٌ عُجَابࣱ\n",
    "translations": {
      "en": "Does he claim that all the deities are [but] one God? Verily, a most strange thing is this!”",
      "ms": "\" Patutkah ia menafikan tuhan-tuhan yang berbilang itu dengan mengatakan: Tuhan hanya Satu? Sesungguhnya ini adalah satu perkara yang menakjubkan!\"",
      "id": "Mengapa ia menjadikan tuhan-tuhan itu Tuhan Yang Satu saja? Sesungguhnya ini benar-benar suatu hal yang sangat mengherankan.",
      "ar": "أَجَعَلَ ٱلۡـَٔالِهَةَ إِلَـٰهࣰا وَ ٰ⁠حِدًاۖ إِنَّ هَـٰذَا لَشَیۡءٌ عُجَابࣱ\n"
    }
  },
  {
    "id": 3976,
    "surahId": 38,
    "ayahNumber": 6,
    "arabicText": "وَٱنطَلَقَ ٱلۡمَلَأُ مِنۡهُمۡ أَنِ ٱمۡشُوا۟ وَٱصۡبِرُوا۟ عَلَىٰۤ ءَالِهَتِكُمۡۖ إِنَّ هَـٰذَا لَشَیۡءࣱ یُرَادُ\n",
    "translations": {
      "en": "And their leaders launch forth [thus]: “Go ahead, and hold steadfastly onto your deities: this, behold, is the only thing to do!",
      "ms": "Dan (ketika itu) keluarlah ketua-ketua dari kalangan mereka (memberi peransang dengan berkata): \"Jalan terus (menurut cara penyembahan datuk nenek kamu) dan tetap tekunlah menyembah tuhan-tuhan kamu. Sebenarnya sikap ini adalah satu perkara yang amat dikehendaki.",
      "id": "Dan pergilah pemimpin-pemimpin mereka (seraya berkata): \"Pergilah kamu dan tetaplah (menyembah) tuhan-tuhanmu, sesungguhnya ini benar-benar suatu hal yang dikehendaki.",
      "ar": "وَٱنطَلَقَ ٱلۡمَلَأُ مِنۡهُمۡ أَنِ ٱمۡشُوا۟ وَٱصۡبِرُوا۟ عَلَىٰۤ ءَالِهَتِكُمۡۖ إِنَّ هَـٰذَا لَشَیۡءࣱ یُرَادُ\n"
    }
  },
  {
    "id": 3977,
    "surahId": 38,
    "ayahNumber": 7,
    "arabicText": "مَا سَمِعۡنَا بِهَـٰذَا فِی ٱلۡمِلَّةِ ٱلۡـَٔاخِرَةِ إِنۡ هَـٰذَاۤ إِلَّا ٱخۡتِلَـٰقٌ\n",
    "translations": {
      "en": "Never did we hear of [a claim like] this in any faith of latter days! It is nothing but [a mortal man’s] invention!",
      "ms": "\" Kami tidak pernah mendengar tentang (soal mengesakan Tuhan) itu dalam ugama yang terakhir; perkara ini tidak lain hanyalah rekaan dan dusta semata-mata\".",
      "id": "Kami tidak pernah mendengar hal ini dalam agama yang terakhir; ini (mengesakan Allah), tidak lain hanyalah (dusta) yang diada-adakan,",
      "ar": "مَا سَمِعۡنَا بِهَـٰذَا فِی ٱلۡمِلَّةِ ٱلۡـَٔاخِرَةِ إِنۡ هَـٰذَاۤ إِلَّا ٱخۡتِلَـٰقٌ\n"
    }
  },
  {
    "id": 3978,
    "surahId": 38,
    "ayahNumber": 8,
    "arabicText": "أَءُنزِلَ عَلَیۡهِ ٱلذِّكۡرُ مِنۢ بَیۡنِنَاۚ بَلۡ هُمۡ فِی شَكࣲّ مِّن ذِكۡرِیۚ بَل لَّمَّا یَذُوقُوا۟ عَذَابِ\n",
    "translations": {
      "en": "What! Upon him alone from among all of us should a [divine] reminder have been bestowed from on high?” Nay, but it is My Own reminder that they distrust! Nay, they have not yet tasted the suffering which I do impose!",
      "ms": "(Mereka berkata lagi): Patutkah wahyu peringatan itu diturunkan kepada Muhammad (padahal orang-orang yang lebih layak ada) di antara kita?\" (Mereka bukan sahaja ingkarkan kelayakan Nabi Muhammad menerima wahyu) bahkan mereka berada dalam keraguan tentang peringatan yang Aku wahyukan (kepada Nabi Muhammad) itu, bahkan mereka belum lagi merasai azab.",
      "id": "mengapa Al Quran itu diturunkan kepadanya di antara kita?\" Sebenarnya mereka ragu-ragu terhadap Al Quran-Ku, dan sebenarnya mereka belum merasakan azab-Ku.",
      "ar": "أَءُنزِلَ عَلَیۡهِ ٱلذِّكۡرُ مِنۢ بَیۡنِنَاۚ بَلۡ هُمۡ فِی شَكࣲّ مِّن ذِكۡرِیۚ بَل لَّمَّا یَذُوقُوا۟ عَذَابِ\n"
    }
  },
  {
    "id": 3979,
    "surahId": 38,
    "ayahNumber": 9,
    "arabicText": "أَمۡ عِندَهُمۡ خَزَاۤىِٕنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِیزِ ٱلۡوَهَّابِ\n",
    "translations": {
      "en": "Or do they [think that they] own the treasures of thy Sustainer’s grace - [the grace] of the Almighty, the Giver of Gifts?",
      "ms": "Adakah di sisi mereka perbendaharaan rahmat Tuhanmu Yang Maha Kuasa, lagi Yang Maha Melimpah pemberianNya?.",
      "id": "Atau apakah mereka itu mempunyai perbendaharaan rahmat Tuhanmu Yang Maha Perkasa lagi Maha Pemberi?",
      "ar": "أَمۡ عِندَهُمۡ خَزَاۤىِٕنُ رَحۡمَةِ رَبِّكَ ٱلۡعَزِیزِ ٱلۡوَهَّابِ\n"
    }
  },
  {
    "id": 3980,
    "surahId": 38,
    "ayahNumber": 10,
    "arabicText": "أَمۡ لَهُم مُّلۡكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَمَا بَیۡنَهُمَاۖ فَلۡیَرۡتَقُوا۟ فِی ٱلۡأَسۡبَـٰبِ\n",
    "translations": {
      "en": "Or [that] the dominion over the heavens and the earth and all that is between them is theirs? Why, then, let them try to ascend [to God-like power] by all [conceivable] means!",
      "ms": "Atau adakah mereka menguasai langit dan bumi serta segala yang ada di antara keduanya?. (Kalau ada kekuasaan yang demikian) maka biarlah mereka naik mendaki langit menurut jalan-jalan yang membawa mereka ke situ (untuk mentadbirkan seluruh alam).",
      "id": "Atau apakah bagi mereka kerajaan langit dan bumi dan yang ada di antara keduanya? (Jika ada), maka hendaklah mereka menaiki tangga-tangga (ke langit).",
      "ar": "أَمۡ لَهُم مُّلۡكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَمَا بَیۡنَهُمَاۖ فَلۡیَرۡتَقُوا۟ فِی ٱلۡأَسۡبَـٰبِ\n"
    }
  },
  {
    "id": 3981,
    "surahId": 38,
    "ayahNumber": 11,
    "arabicText": "جُندࣱ مَّا هُنَالِكَ مَهۡزُومࣱ مِّنَ ٱلۡأَحۡزَابِ\n",
    "translations": {
      "en": "[But] there it is: any and all human beings, however [strongly] leagued together, are bound to suffer defeat [whenever they refuse to accept the truth].",
      "ms": "(Sebenarnya mereka hanyalah) satu pasukan tentera dari kumpulan-kumpulan (yang menentang kebenaran), yang pada suatu masa kelak tetap akan dikalahkan.",
      "id": "Suatu tentara yang besar yang berada disana dari golongan-golongan yang berserikat, pasti akan dikalahkan.",
      "ar": "جُندࣱ مَّا هُنَالِكَ مَهۡزُومࣱ مِّنَ ٱلۡأَحۡزَابِ\n"
    }
  },
  {
    "id": 3982,
    "surahId": 38,
    "ayahNumber": 12,
    "arabicText": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحࣲ وَعَادࣱ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ\n",
    "translations": {
      "en": "To the truth gave the lie aforetime Noah’s people, and [the tribe of] Ad, and Pharaoh of the [many] tent-poles,",
      "ms": "Sebelum mereka itu, kaum Nabi Nuh, dan Aad (kaum Nabi Hud), serta Firaun yang mempunyai kerajaan yang kuat, telah juga mendustakan Rasul masing-masing.",
      "id": "Telah mendustakan (rasul-rasul pula) sebelum mereka itu kaum Nuh, 'Aad, Fir'aun yang mempunyai tentara yang banyak,",
      "ar": "كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحࣲ وَعَادࣱ وَفِرۡعَوۡنُ ذُو ٱلۡأَوۡتَادِ\n"
    }
  },
  {
    "id": 3983,
    "surahId": 38,
    "ayahNumber": 13,
    "arabicText": "وَثَمُودُ وَقَوۡمُ لُوطࣲ وَأَصۡحَـٰبُ لۡـَٔیۡكَةِۚ أُو۟لَـٰۤىِٕكَ ٱلۡأَحۡزَابُ\n",
    "translations": {
      "en": "and [the tribe of] Thamud, and the people of Lot, and the dwellers of the wooded dales [of Madyan]: they all were leagued together, [as it were, in their unbelief:]",
      "ms": "Dan juga Thamud (kaum Nabi Soleh), dan kaum Nabi Lut, serta penduduk Aikah; merekalah kumpulan-kumpulan (yang menentang kebenaran).",
      "id": "dan Tsamud, kaum Luth dan penduduk Aikah. Mereka itulah golongan-golongan yang bersekutu (menentang rasul-rasul).",
      "ar": "وَثَمُودُ وَقَوۡمُ لُوطࣲ وَأَصۡحَـٰبُ لۡـَٔیۡكَةِۚ أُو۟لَـٰۤىِٕكَ ٱلۡأَحۡزَابُ\n"
    }
  },
  {
    "id": 3984,
    "surahId": 38,
    "ayahNumber": 14,
    "arabicText": "إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ\n",
    "translations": {
      "en": "not one [was there] but gave the lie to the apostles - and thereupon My retribution fell due.",
      "ms": "Tidak ada satupun dari kaum-kaum yang tersebut, melainkan telah mendustakan Rasul-rasul; maka berhaklah mereka ditimpa azab.",
      "id": "Semua mereka itu tidak lain hanyalah mendustakan rasul-rasul, maka pastilah (bagi mereka) azab-Ku.",
      "ar": "إِن كُلٌّ إِلَّا كَذَّبَ ٱلرُّسُلَ فَحَقَّ عِقَابِ\n"
    }
  },
  {
    "id": 3985,
    "surahId": 38,
    "ayahNumber": 15,
    "arabicText": "وَمَا یَنظُرُ هَـٰۤؤُلَاۤءِ إِلَّا صَیۡحَةࣰ وَ ٰ⁠حِدَةࣰ مَّا لَهَا مِن فَوَاقࣲ\n",
    "translations": {
      "en": "And they [who now deny the truth - they, too,] have but to wait for one single blast [of punishment to overtake them]: it shall not be delayed a whit.",
      "ms": "Dan orang-orang ini (yang menentang Nabi Muhammad), tidak menunggu melainkan satu jeritan suara yang tidak akan berulang lagi.",
      "id": "Tidaklah yang mereka tunggu melainkan hanya satu teriakan saja yang tidak ada baginya saat berselang.",
      "ar": "وَمَا یَنظُرُ هَـٰۤؤُلَاۤءِ إِلَّا صَیۡحَةࣰ وَ ٰ⁠حِدَةࣰ مَّا لَهَا مِن فَوَاقࣲ\n"
    }
  },
  {
    "id": 3986,
    "surahId": 38,
    "ayahNumber": 16,
    "arabicText": "وَقَالُوا۟ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبۡلَ یَوۡمِ ٱلۡحِسَابِ\n",
    "translations": {
      "en": "As it is, they say [mockingly]: “O our Sus­tainer! Hasten on to us our share [of punishment even] before the Day of Reckoning!”",
      "ms": "Dan mereka pula berkata (secara mengejek-ejek): \" Wahai Tuhan kami! Segerakanlah azab yang ditetapkan untuk kami, sebelum datangnya hari hitungan amal (yang dikatakan oleh Muhammad itu)\".",
      "id": "Dan mereka berkata: \"Ya Tuhan kami cepatkanlah untuk kami azab yang diperuntukkan bagi kami sebelum hari berhisab\".",
      "ar": "وَقَالُوا۟ رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبۡلَ یَوۡمِ ٱلۡحِسَابِ\n"
    }
  },
  {
    "id": 3987,
    "surahId": 38,
    "ayahNumber": 17,
    "arabicText": "ٱصۡبِرۡ عَلَىٰ مَا یَقُولُونَ وَٱذۡكُرۡ عَبۡدَنَا دَاوُۥدَ ذَا ٱلۡأَیۡدِۖ إِنَّهُۥۤ أَوَّابٌ\n",
    "translations": {
      "en": "[But] bear thou with patience whatever they may say, and remember Our servant David, him who was endowed with [so much] inner strength! He, verily, would always turn unto Us:",
      "ms": "Bersabarlah (wahai Muhammad) terhadap apa sahaja yang mereka katakan, dan ingatlah akan hamba Kami Nabi Daud, yang mempunyai kekuatan (dalam pegangan ugamanya); sesungguhnya ia adalah sentiasa rujuk kembali (kepada Kami dengan bersabar mematuhi perintah Kami).",
      "id": "Bersabarlah atas segala apa yang mereka katakan; dan ingatlah hamba Kami Daud yang mempunyai kekuatan; sesungguhnya dia amat taat (kepada Tuhan).",
      "ar": "ٱصۡبِرۡ عَلَىٰ مَا یَقُولُونَ وَٱذۡكُرۡ عَبۡدَنَا دَاوُۥدَ ذَا ٱلۡأَیۡدِۖ إِنَّهُۥۤ أَوَّابٌ\n"
    }
  },
  {
    "id": 3988,
    "surahId": 38,
    "ayahNumber": 18,
    "arabicText": "إِنَّا سَخَّرۡنَا ٱلۡجِبَالَ مَعَهُۥ یُسَبِّحۡنَ بِٱلۡعَشِیِّ وَٱلۡإِشۡرَاقِ\n",
    "translations": {
      "en": "[and for this,] behold, We caused the mountains to join him in extolling Our limitless glory at eventide and at sun­rise,",
      "ms": "Sesungguhnya Kami telah mudahkan gunung-ganang turut bertasbih memuji Kami bersama-sama dengannya; pada waktu petang dan ketika terbit matahari.",
      "id": "Sesungguhnya Kami menundukkan gunung-gunung untuk bertasbih bersama dia (Daud) di waktu petang dan pagi,",
      "ar": "إِنَّا سَخَّرۡنَا ٱلۡجِبَالَ مَعَهُۥ یُسَبِّحۡنَ بِٱلۡعَشِیِّ وَٱلۡإِشۡرَاقِ\n"
    }
  },
  {
    "id": 3989,
    "surahId": 38,
    "ayahNumber": 19,
    "arabicText": "وَٱلطَّیۡرَ مَحۡشُورَةࣰۖ كُلࣱّ لَّهُۥۤ أَوَّابࣱ\n",
    "translations": {
      "en": "and [likewise] the birds in their assemblies: [together] they all Would turn again and again unto Him [who had created them].",
      "ms": "Dan (Kami mudahkan juga) unggas turut berhimpun (untuk bertasbih memuji Kami bersama-sama dengannya); tiap-tiap satunya mengulangi tasbih masing-masing menurutnya.",
      "id": "dan (Kami tundukkan pula) burung-burung dalam keadaan terkumpul. Masing-masingnya amat taat kepada Allah.",
      "ar": "وَٱلطَّیۡرَ مَحۡشُورَةࣰۖ كُلࣱّ لَّهُۥۤ أَوَّابࣱ\n"
    }
  },
  {
    "id": 3990,
    "surahId": 38,
    "ayahNumber": 20,
    "arabicText": "وَشَدَدۡنَا مُلۡكَهُۥ وَءَاتَیۡنَـٰهُ ٱلۡحِكۡمَةَ وَفَصۡلَ ٱلۡخِطَابِ\n",
    "translations": {
      "en": "And We streng­thened his dominion, and bestowed upon him wisdom and sagacity in judgment.",
      "ms": "Dan Kami kuatkan kerajaannya, serta Kami kurniakan kepadanya hikmah kebijaksanaan dan kepitahan berkata-kata (dalam menjalankan hukum dan menjatuhkan hukuman).",
      "id": "Dan Kami kuatkan kerajaannya dan Kami berikan kepadanya hikmahdan kebijaksanaan dalam menyelesaikan perselisihan.",
      "ar": "وَشَدَدۡنَا مُلۡكَهُۥ وَءَاتَیۡنَـٰهُ ٱلۡحِكۡمَةَ وَفَصۡلَ ٱلۡخِطَابِ\n"
    }
  },
  {
    "id": 3991,
    "surahId": 38,
    "ayahNumber": 21,
    "arabicText": "۞ وَهَلۡ أَتَىٰكَ نَبَؤُا۟ ٱلۡخَصۡمِ إِذۡ تَسَوَّرُوا۟ ٱلۡمِحۡرَابَ\n",
    "translations": {
      "en": "AND YET, has the story of the litigants come within thy ken - [the story of the two] who surmounted the walls of the sanctuary [in which David prayed]?",
      "ms": "Dan sudahkah sampai kepadamu (wahai Muhammad) berita (perbicaraan dua) orang yang berselisihan? Ketika mereka memanjat tembok tempat ibadat;",
      "id": "Dan adakah sampai kepadamu berita orang-orang yang berperkara ketika mereka memanjat pagar?",
      "ar": "۞ وَهَلۡ أَتَىٰكَ نَبَؤُا۟ ٱلۡخَصۡمِ إِذۡ تَسَوَّرُوا۟ ٱلۡمِحۡرَابَ\n"
    }
  },
  {
    "id": 3992,
    "surahId": 38,
    "ayahNumber": 22,
    "arabicText": "إِذۡ دَخَلُوا۟ عَلَىٰ دَاوُۥدَ فَفَزِعَ مِنۡهُمۡۖ قَالُوا۟ لَا تَخَفۡۖ خَصۡمَانِ بَغَىٰ بَعۡضُنَا عَلَىٰ بَعۡضࣲ فَٱحۡكُم بَیۡنَنَا بِٱلۡحَقِّ وَلَا تُشۡطِطۡ وَٱهۡدِنَاۤ إِلَىٰ سَوَاۤءِ ٱلصِّرَ ٰ⁠طِ\n",
    "translations": {
      "en": "As they came upon David, and he shrank back in fear from them, they said: “Fear not! [We are but] two litigants. One of us has wronged the other: so judge thou between us with justice, and deviate not from what is right, and show [both of] us the way to rectitude.",
      "ms": "Iaitu ketika mereka masuk kepada Nabi Daud, lalu ia terkejut melihat mereka; mereka berkata kepadanya: \" Janganlah takut, (kami ini) adalah dua orang yang berselisihan, salah seorang dari kami telah berlaku zalim kepada yang lain; oleh itu hukumkanlah di antara kami dengan adil, dan janganlah melampaui (batas keadilan), serta pimpinlah kami ke jalan yang lurus.",
      "id": "Ketika mereka masuk (menemui) Daud lalu ia terkejut karena kedatangan) mereka. Mereka berkata: \"Janganlah kamu merasa takut; (kami) adalah dua orang yang berperkara yang salah seorang dari kami berbuat zalim kepada yang lain; maka berilah keputusan antara kami dengan adil dan janganlah kamu menyimpang dari kebenaran dan tunjukilah kami ke jalan yang lurus.",
      "ar": "إِذۡ دَخَلُوا۟ عَلَىٰ دَاوُۥدَ فَفَزِعَ مِنۡهُمۡۖ قَالُوا۟ لَا تَخَفۡۖ خَصۡمَانِ بَغَىٰ بَعۡضُنَا عَلَىٰ بَعۡضࣲ فَٱحۡكُم بَیۡنَنَا بِٱلۡحَقِّ وَلَا تُشۡطِطۡ وَٱهۡدِنَاۤ إِلَىٰ سَوَاۤءِ ٱلصِّرَ ٰ⁠طِ\n"
    }
  },
  {
    "id": 3993,
    "surahId": 38,
    "ayahNumber": 23,
    "arabicText": "إِنَّ هَـٰذَاۤ أَخِی لَهُۥ تِسۡعࣱ وَتِسۡعُونَ نَعۡجَةࣰ وَلِیَ نَعۡجَةࣱ وَ ٰ⁠حِدَةࣱ فَقَالَ أَكۡفِلۡنِیهَا وَعَزَّنِی فِی ٱلۡخِطَابِ\n",
    "translations": {
      "en": "“Behold, this is my brother: he has ninety-nine ewes, whereas I have [only] one ewe - and yet he said, ‘Make her over to me,’ and forcibly prevailed against me in this [our] dispute.”",
      "ms": "\" Sebenarnya orang ini ialah (seorang sahabat sebagai) saudaraku; ia mempunyai sembilan puluh sembilan ekor kambing betina dan aku mempunyai seekor sahaja; dalam pada itu ia (mendesakku dengan) berkata: ' Serahkanlah yang seekor itu kepadaku ', dan dia telah mengalahkan daku dalam merundingkan perkara itu\".",
      "id": "Sesungguhnya saudaraku ini mempunyai sembilan puluh sembilan ekor kambing betina dan aku mempunyai seekor saja. Maka dia berkata: \"Serahkanlah kambingmu itu kepadaku dan dia mengalahkan aku dalam perdebatan\".",
      "ar": "إِنَّ هَـٰذَاۤ أَخِی لَهُۥ تِسۡعࣱ وَتِسۡعُونَ نَعۡجَةࣰ وَلِیَ نَعۡجَةࣱ وَ ٰ⁠حِدَةࣱ فَقَالَ أَكۡفِلۡنِیهَا وَعَزَّنِی فِی ٱلۡخِطَابِ\n"
    }
  },
  {
    "id": 3994,
    "surahId": 38,
    "ayahNumber": 24,
    "arabicText": "قَالَ لَقَدۡ ظَلَمَكَ بِسُؤَالِ نَعۡجَتِكَ إِلَىٰ نِعَاجِهِۦۖ وَإِنَّ كَثِیرࣰا مِّنَ ٱلۡخُلَطَاۤءِ لَیَبۡغِی بَعۡضُهُمۡ عَلَىٰ بَعۡضٍ إِلَّا ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَقَلِیلࣱ مَّا هُمۡۗ وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنَّـٰهُ فَٱسۡتَغۡفَرَ رَبَّهُۥ وَخَرَّ رَاكِعࣰا وَأَنَابَ ۩\n",
    "translations": {
      "en": "Said [David]: “He has certainly wronged thee by demanding that thy ewe be added to his ewes! Thus, behold, do many kinsmen wrong one another [all] save those who believe [in God] and do righteous deeds: but how few are they!” And [suddenly] David understood that We had tried him: and so he asked his Sustainer to forgive him his sin, and fell down in prostration, and turned unto Him in repentance.",
      "ms": "Nabi Daud berkata: \" Sesungguhnya ia telah berlaku zalim kepadamu dengan meminta kambingmu itu (sebagai tambahan) kepada kambing-kambingnya; dan sesungguhnya kebanyakan dari orang-orang yang bergaul dan berhubungan (dalam berbagai-bagai lapangan hidup), setengahnya berlaku zalim kepada setengahnya yang lain, kecuali orang-orang yang beriman dan beramal soleh; sedang mereka amatlah sedikit!\" Dan Nabi Daud (setelah berfikir sejurus), mengetahui sebenarnya Kami telah mengujinya (dengan peristiwa itu), lalu ia memohon ampun kepada Tuhannya sambil merebahkan dirinya sujud, serta ia rujuk kembali (bertaubat).",
      "id": "Daud berkata: \"Sesungguhnya dia telah berbuat zalim kepadamu dengan meminta kambingmu itu untuk ditambahkan kepada kambingnya. Dan sesungguhnya kebanyakan dari orang-orang yang berserikat itu sebahagian mereka berbuat zalim kepada sebahagian yang lain, kecuali orang-orang yang beriman dan mengerjakan amal yang saleh; dan amat sedikitlah mereka ini\". Dan Daud mengetahui bahwa Kami mengujinya; maka ia meminta ampun kepada Tuhannya lalu menyungkur sujud dan bertaubat.",
      "ar": "قَالَ لَقَدۡ ظَلَمَكَ بِسُؤَالِ نَعۡجَتِكَ إِلَىٰ نِعَاجِهِۦۖ وَإِنَّ كَثِیرࣰا مِّنَ ٱلۡخُلَطَاۤءِ لَیَبۡغِی بَعۡضُهُمۡ عَلَىٰ بَعۡضٍ إِلَّا ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَقَلِیلࣱ مَّا هُمۡۗ وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنَّـٰهُ فَٱسۡتَغۡفَرَ رَبَّهُۥ وَخَرَّ رَاكِعࣰا وَأَنَابَ ۩\n"
    }
  },
  {
    "id": 3995,
    "surahId": 38,
    "ayahNumber": 25,
    "arabicText": "فَغَفَرۡنَا لَهُۥ ذَ ٰ⁠لِكَۖ وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابࣲ\n",
    "translations": {
      "en": "And thereupon We forgave him that [sin]: and, verily, nearness to Us awaits him [in the life to come], and the most beauteous of all goals!",
      "ms": "Maka Kami ampunkan kesalahannya itu; dan sesungguhnya ia mempunyai kedudukan yang dekat di sisi Kami serta tempat kembali yang sebaik-baiknya (pada hari akhirat kelak).",
      "id": "Maka Kami ampuni baginya kesalahannya itu. Dan sesungguhnya dia mempunyai kedudukan dekat pada sisi Kami dan tempat kembali yang baik.",
      "ar": "فَغَفَرۡنَا لَهُۥ ذَ ٰ⁠لِكَۖ وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابࣲ\n"
    }
  },
  {
    "id": 3996,
    "surahId": 38,
    "ayahNumber": 26,
    "arabicText": "یَـٰدَاوُۥدُ إِنَّا جَعَلۡنَـٰكَ خَلِیفَةࣰ فِی ٱلۡأَرۡضِ فَٱحۡكُم بَیۡنَ ٱلنَّاسِ بِٱلۡحَقِّ وَلَا تَتَّبِعِ ٱلۡهَوَىٰ فَیُضِلَّكَ عَن سَبِیلِ ٱللَّهِۚ إِنَّ ٱلَّذِینَ یَضِلُّونَ عَن سَبِیلِ ٱللَّهِ لَهُمۡ عَذَابࣱ شَدِیدُۢ بِمَا نَسُوا۟ یَوۡمَ ٱلۡحِسَابِ\n",
    "translations": {
      "en": "[And We said:] “O David! Behold, We have made thee a [prophet and, thus, Our] vicegerent on earth: judge, then, between men with justice, and do not follow vain desire, lest it lead thee astray from the path of God: verily, for those who go astray from the path of God there is suffering severe in store for having forgotten the Day of Reckoning!”",
      "ms": "Wahai Daud, sesungguhnya Kami telah menjadikanmu khalifah di bumi, maka jalankanlah hukum di antara manusia dengan (hukum syariat) yang benar (yang diwahyukan kepadamu); dan janganlah engkau menurut hawa nafsu, kerana yang demikian itu akan menyesatkanmu dari jalan Allah. Sesungguhnya orang-orang yang sesat dari jalan Allah, akan beroleh azab yang berat pada hari hitungan amal, disebabkan mereka melupakan (jalan Allah) itu.",
      "id": "Hai Daud, sesungguhnya Kami menjadikan kamu khalifah (penguasa) di muka bumi, maka berilah keputusan (perkara) di antara manusia dengan adil dan janganlah kamu mengikuti hawa nafsu, karena ia akan menyesatkan kamu dari jalan Allah. Sesungguhnya orang-orang yang sesat darin jalan Allah akan mendapat azab yang berat, karena mereka melupakan hari perhitungan.",
      "ar": "یَـٰدَاوُۥدُ إِنَّا جَعَلۡنَـٰكَ خَلِیفَةࣰ فِی ٱلۡأَرۡضِ فَٱحۡكُم بَیۡنَ ٱلنَّاسِ بِٱلۡحَقِّ وَلَا تَتَّبِعِ ٱلۡهَوَىٰ فَیُضِلَّكَ عَن سَبِیلِ ٱللَّهِۚ إِنَّ ٱلَّذِینَ یَضِلُّونَ عَن سَبِیلِ ٱللَّهِ لَهُمۡ عَذَابࣱ شَدِیدُۢ بِمَا نَسُوا۟ یَوۡمَ ٱلۡحِسَابِ\n"
    }
  },
  {
    "id": 3997,
    "surahId": 38,
    "ayahNumber": 27,
    "arabicText": "وَمَا خَلَقۡنَا ٱلسَّمَاۤءَ وَٱلۡأَرۡضَ وَمَا بَیۡنَهُمَا بَـٰطِلࣰاۚ ذَ ٰ⁠لِكَ ظَنُّ ٱلَّذِینَ كَفَرُوا۟ۚ فَوَیۡلࣱ لِّلَّذِینَ كَفَرُوا۟ مِنَ ٱلنَّارِ\n",
    "translations": {
      "en": "AND [thus it is:] We have not created heaven and earth and all that is between them without meaning and purpose, as is the surmise of those who are bent on denying the truth: but then, woe from the fire [of hell] unto all who are bent on denying the truth!",
      "ms": "Dan tiadalah Kami menciptakan langit dan bumi serta segala yang ada di antara keduanya sebagai ciptaan yang tidak mengandungi hikmah dan keadilan; yang demikian adalah sangkaan orang-orang yang kafir! Maka kecelakaanlah bagi orang-orang yang kafir itu dari azab neraka.",
      "id": "Dan Kami tidak menciptakan langit dan bumi dan apa yang ada antara keduanya tanpa hikmah. Yang demikian itu adalah anggapan orang-orang kafir, maka celakalah orang-orang kafir itu karena mereka akan masuk neraka.",
      "ar": "وَمَا خَلَقۡنَا ٱلسَّمَاۤءَ وَٱلۡأَرۡضَ وَمَا بَیۡنَهُمَا بَـٰطِلࣰاۚ ذَ ٰ⁠لِكَ ظَنُّ ٱلَّذِینَ كَفَرُوا۟ۚ فَوَیۡلࣱ لِّلَّذِینَ كَفَرُوا۟ مِنَ ٱلنَّارِ\n"
    }
  },
  {
    "id": 3998,
    "surahId": 38,
    "ayahNumber": 28,
    "arabicText": "أَمۡ نَجۡعَلُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ كَٱلۡمُفۡسِدِینَ فِی ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِینَ كَٱلۡفُجَّارِ\n",
    "translations": {
      "en": "[For,] would We treat those who have attained to faith and do righteous deeds in the same manner as [We shall treat] those who spread corruption on earth? Would We treat the God-conscious in the same manner as the wicked?",
      "ms": "Patutkah Kami jadikan orang-orang yang beriman dan beramal soleh itu sama seperti orang-orang yang melakukan kerosakan di muka bumi? Atau patutkah Kami jadikan orang-orang yang bertaqwa sama seperti orang-orang yang berdosa?",
      "id": "Patutkah Kami menganggap orang-orang yang beriman dan mengerjakan amal yang saleh sama dengan orang-orang yang berbuat kerusakan di muka bumi? Patutkah (pula) Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang berbuat maksiat?",
      "ar": "أَمۡ نَجۡعَلُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ كَٱلۡمُفۡسِدِینَ فِی ٱلۡأَرۡضِ أَمۡ نَجۡعَلُ ٱلۡمُتَّقِینَ كَٱلۡفُجَّارِ\n"
    }
  },
  {
    "id": 3999,
    "surahId": 38,
    "ayahNumber": 29,
    "arabicText": "كِتَـٰبٌ أَنزَلۡنَـٰهُ إِلَیۡكَ مُبَـٰرَكࣱ لِّیَدَّبَّرُوۤا۟ ءَایَـٰتِهِۦ وَلِیَتَذَكَّرَ أُو۟لُوا۟ ٱلۡأَلۡبَـٰبِ\n",
    "translations": {
      "en": "[All this have We expounded in this] blessed divine writ which We have revealed unto thee, [O Muhammad,] so that men may ponder over its mes­sages, and that those who are endowed with insight may take them to heart.",
      "ms": "(Al-Quran ini) sebuah Kitab yang Kami turunkan kepadamu (dan umatmu wahai Muhammad), -Kitab yang banyak faedah-faedah dan manfaatnya, untuk mereka memahami dengan teliti kandungan ayat-ayatnya, dan untuk orang-orang yang berakal sempurna beringat mengambil iktibar.",
      "id": "Ini adalah sebuah kitab yang Kami turunkan kepadamu penuh dengan berkah supaya mereka memperhatikan ayat-ayatnya dan supaya mendapat pelajaran orang-orang yang mempunyai fikiran.",
      "ar": "كِتَـٰبٌ أَنزَلۡنَـٰهُ إِلَیۡكَ مُبَـٰرَكࣱ لِّیَدَّبَّرُوۤا۟ ءَایَـٰتِهِۦ وَلِیَتَذَكَّرَ أُو۟لُوا۟ ٱلۡأَلۡبَـٰبِ\n"
    }
  },
  {
    "id": 4000,
    "surahId": 38,
    "ayahNumber": 30,
    "arabicText": "وَوَهَبۡنَا لِدَاوُۥدَ سُلَیۡمَـٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥۤ أَوَّابٌ\n",
    "translations": {
      "en": "AND UNTO DAVID We granted Solomon [as a son - and] how excellent a servant [of Ours he grew up to be]! Behold, he would always turn unto Us -",
      "ms": "Dan Kami telah kurniakan kepada Nabi Daud (seorang anak bernama) Sulaiman ia adalah sebaik-baik hamba (yang kuat beribadat), lagi sentiasa rujuk kembali (bertaubat).",
      "id": "Dan Kami karuniakan kepada Daud, Sulaiman, dia adalah sebaik-baik hamba. Sesungguhnya dia amat taat (kepada Tuhannya),",
      "ar": "وَوَهَبۡنَا لِدَاوُۥدَ سُلَیۡمَـٰنَۚ نِعۡمَ ٱلۡعَبۡدُ إِنَّهُۥۤ أَوَّابٌ\n"
    }
  },
  {
    "id": 4001,
    "surahId": 38,
    "ayahNumber": 31,
    "arabicText": "إِذۡ عُرِضَ عَلَیۡهِ بِٱلۡعَشِیِّ ٱلصَّـٰفِنَـٰتُ ٱلۡجِیَادُ\n",
    "translations": {
      "en": "[and even] when, towards the close of day, nobly-bred, swift-footed steeds were brought before him,",
      "ms": "(Ingatkanlah peristiwa) ketika Nabi Sulaiman ditunjukkan kepadanya pada suatu petang, satu kumpulan kuda yang terpuji keadaannya semasa berdiri, lagi yang tangkas semasa berlari.",
      "id": "(ingatlah) ketika dipertunjukkan kepadanya kuda-kuda yang tenang di waktu berhenti dan cepat waktu berlari pada waktu sore,",
      "ar": "إِذۡ عُرِضَ عَلَیۡهِ بِٱلۡعَشِیِّ ٱلصَّـٰفِنَـٰتُ ٱلۡجِیَادُ\n"
    }
  },
  {
    "id": 4002,
    "surahId": 38,
    "ayahNumber": 32,
    "arabicText": "فَقَالَ إِنِّیۤ أَحۡبَبۡتُ حُبَّ ٱلۡخَیۡرِ عَن ذِكۡرِ رَبِّی حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ\n",
    "translations": {
      "en": "he would say, “Verily, I have come to love the love of all that is good because I bear my Sustainer in mind!” [repeating these words as the steeds raced away,] until they were hidden by the veil [of distance - whereupon he would command],",
      "ms": "(Kerana lekanya dengan pertunjukan itu) maka Nabi Sulaiman berkata: \" Sesungguhnya aku telah mengutamakan kesukaanku kepada (kuda pembawa) kebaikan lebih daripada mengingati (ibadatku kepada) Tuhanku, sehingga (matahari) melindungi dirinya dengan tirai malam\".",
      "id": "maka ia berkata: \"Sesungguhnya aku menyukai kesenangan terhadap barang yang baik (kuda) sehingga aku lalai mengingat Tuhanku sampai kuda itu hilang dari pandangan\".",
      "ar": "فَقَالَ إِنِّیۤ أَحۡبَبۡتُ حُبَّ ٱلۡخَیۡرِ عَن ذِكۡرِ رَبِّی حَتَّىٰ تَوَارَتۡ بِٱلۡحِجَابِ\n"
    }
  },
  {
    "id": 4003,
    "surahId": 38,
    "ayahNumber": 33,
    "arabicText": "رُدُّوهَا عَلَیَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ\n",
    "translations": {
      "en": "“Bring them back unto me!”- and would [lovingly] stroke their legs and their necks.",
      "ms": "(Kemudian Nabi Sulaiman berkata kepada orang-orangnya): \" Bawa balik kuda itu kepadaku\"; maka ia pun tampil menyapu betis dan leher kuda itu (seekor demi seekor).",
      "id": "\"Bawalah kuda-kuda itu kembali kepadaku\". Lalu ia potong kaki dan leher kuda itu.",
      "ar": "رُدُّوهَا عَلَیَّۖ فَطَفِقَ مَسۡحَۢا بِٱلسُّوقِ وَٱلۡأَعۡنَاقِ\n"
    }
  },
  {
    "id": 4004,
    "surahId": 38,
    "ayahNumber": 34,
    "arabicText": "وَلَقَدۡ فَتَنَّا سُلَیۡمَـٰنَ وَأَلۡقَیۡنَا عَلَىٰ كُرۡسِیِّهِۦ جَسَدࣰا ثُمَّ أَنَابَ\n",
    "translations": {
      "en": "But [ere this], indeed, We had tried Solomon by placing upon his throne a [lifeless] body; and thereupon he turned [towards Us; and]",
      "ms": "Dan demi sesungguhnya! Kami telah menguji Nabi Sulaiman (dengan satu kejadian), dan Kami letakkan di atas takhta kebesarannya satu jasad (yang tidak cukup sifatnya) kemudian ia kembali (merayu kepada Kami): -",
      "id": "Dan sesungguhnya Kami telah menguji Sulaiman dan Kami jadikan (dia) tergeletak di atas kursinya sebagai tubuh (yang lemah karena sakit), kemudian ia bertaubat.",
      "ar": "وَلَقَدۡ فَتَنَّا سُلَیۡمَـٰنَ وَأَلۡقَیۡنَا عَلَىٰ كُرۡسِیِّهِۦ جَسَدࣰا ثُمَّ أَنَابَ\n"
    }
  },
  {
    "id": 4005,
    "surahId": 38,
    "ayahNumber": 35,
    "arabicText": "قَالَ رَبِّ ٱغۡفِرۡ لِی وَهَبۡ لِی مُلۡكࣰا لَّا یَنۢبَغِی لِأَحَدࣲ مِّنۢ بَعۡدِیۤۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ\n",
    "translations": {
      "en": "he prayed: “O my Sustainer! Forgive me my sins, and bestow upon me the gift of a kingdom which may not suit anyone after me: verily, Thou alone art a giver of gifts!”",
      "ms": "Katanya: \" Wahai Tuhanku! Ampunkanlah kesilapanku, dan kurniakanlah kepadaku sebuah kerajaan (yang tidak ada taranya dan) yang tidak akan ada pada sesiapapun kemudian daripadaku; sesungguhnya Engkaulah yang sentiasa Melimpah kurniaNya \".",
      "id": "Ia berkata: \"Ya Tuhanku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak dimiliki oleh seorang juapun sesudahku, sesungguhnya Engkaulah Yang Maha Pemberi\".",
      "ar": "قَالَ رَبِّ ٱغۡفِرۡ لِی وَهَبۡ لِی مُلۡكࣰا لَّا یَنۢبَغِی لِأَحَدࣲ مِّنۢ بَعۡدِیۤۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ\n"
    }
  },
  {
    "id": 4006,
    "surahId": 38,
    "ayahNumber": 36,
    "arabicText": "فَسَخَّرۡنَا لَهُ ٱلرِّیحَ تَجۡرِی بِأَمۡرِهِۦ رُخَاۤءً حَیۡثُ أَصَابَ\n",
    "translations": {
      "en": "And so We made subservient to him the wind, so that it gently sped at his behest whithersoever he willed,",
      "ms": "Maka (Kami kabulkan permohonannya lalu) Kami mudahkan baginya menggunakan angin yang bertiup perlahan-lahan menurut kemahuannya, ke arah mana sahaja yang hendaK ditujunya;",
      "id": "Kemudian Kami tundukkan kepadanya angin yang berhembus dengan baik menurut ke mana saja yang dikehendakinya,",
      "ar": "فَسَخَّرۡنَا لَهُ ٱلرِّیحَ تَجۡرِی بِأَمۡرِهِۦ رُخَاۤءً حَیۡثُ أَصَابَ\n"
    }
  },
  {
    "id": 4007,
    "surahId": 38,
    "ayahNumber": 37,
    "arabicText": "وَٱلشَّیَـٰطِینَ كُلَّ بَنَّاۤءࣲ وَغَوَّاصࣲ\n",
    "translations": {
      "en": "as well as all the rebellious forces [that We made to work for him] - every kind of builder and diver -",
      "ms": "Dan (Kami mudahkan baginya memerintah) Jin Syaitan; (ia memerintah) golongan-golongan yang pandai mendirikan bangunan, dan yang menjadi penyelam (bagi menjalankan kerja masing-masing).",
      "id": "dan (Kami tundukkan pula kepadanya) syaitan-syaitan semuanya ahli bangunan dan penyelam,",
      "ar": "وَٱلشَّیَـٰطِینَ كُلَّ بَنَّاۤءࣲ وَغَوَّاصࣲ\n"
    }
  },
  {
    "id": 4008,
    "surahId": 38,
    "ayahNumber": 38,
    "arabicText": "وَءَاخَرِینَ مُقَرَّنِینَ فِی ٱلۡأَصۡفَادِ\n",
    "translations": {
      "en": "and others linked together in fetters.",
      "ms": "Dan Jin-jin Syaitan yang lain dipasung dalam rantai-rantai belenggu.",
      "id": "dan syaitan yang lain yang terikat dalam belenggu.",
      "ar": "وَءَاخَرِینَ مُقَرَّنِینَ فِی ٱلۡأَصۡفَادِ\n"
    }
  },
  {
    "id": 4009,
    "surahId": 38,
    "ayahNumber": 39,
    "arabicText": "هَـٰذَا عَطَاۤؤُنَا فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَیۡرِ حِسَابࣲ\n",
    "translations": {
      "en": "[And We told him:] “This is Our gift, for thee to bestow freely on others, or to withhold, without [having to render] account!”",
      "ms": "(Serta Kami katakan kepadanya): \" Inilah pemberian Kami (kepadamu), maka berikanlah (kepada sesiapa yang engkau suka), atau tahankanlah pemberian itu; (terserahlah kepadamu) dengan tidak ada sebarang hitungan (untuk menyalahkanmu) \".",
      "id": "Inilah anugerah Kami; maka berikanlah (kepada orang lain) atau tahanlah (untuk dirimu sendiri) dengan tiada pertanggungan jawab.",
      "ar": "هَـٰذَا عَطَاۤؤُنَا فَٱمۡنُنۡ أَوۡ أَمۡسِكۡ بِغَیۡرِ حِسَابࣲ\n"
    }
  },
  {
    "id": 4010,
    "surahId": 38,
    "ayahNumber": 40,
    "arabicText": "وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابࣲ\n",
    "translations": {
      "en": "And, verily, nearness to Us awaits him [in the life to come], and the most beauteous of all goals!",
      "ms": "Dan sesungguhnya ia mempunyai kedudukan yang dekat lagi mulia di sisi Kami, serta tempat kembali yang sebaik-baiknya (pada hari akhirat kelak).",
      "id": "Dan sesungguhnya dia mempunyai kedudukan yang dekat pada sisi Kami dan tempat kembali yang baik.",
      "ar": "وَإِنَّ لَهُۥ عِندَنَا لَزُلۡفَىٰ وَحُسۡنَ مَـَٔابࣲ\n"
    }
  },
  {
    "id": 4011,
    "surahId": 38,
    "ayahNumber": 41,
    "arabicText": "وَٱذۡكُرۡ عَبۡدَنَاۤ أَیُّوبَ إِذۡ نَادَىٰ رَبَّهُۥۤ أَنِّی مَسَّنِیَ ٱلشَّیۡطَـٰنُ بِنُصۡبࣲ وَعَذَابٍ\n",
    "translations": {
      "en": "AND CALL to mind Our servant Job, [how it was] when he cried out to his Sustainer, “Behold, Satan has afflicted me with [utter] weariness and suffering!”",
      "ms": "Dan (ingatkanlah peristiwa) hamba Kami: Nabi Ayub ketika ia berdoa merayu kepada Tuhannya dengan berkata: \" Sesungguhnya aku diganggu oleh Syaitan dengan (hasutannya semasa aku ditimpa) kesusahan dan azab seksa (penyakit)\".",
      "id": "Dan ingatlah akan hamba Kami Ayyub ketika ia menyeru Tuhan-nya: \"Sesungguhnya aku diganggu syaitan dengan kepayahan dan siksaan\".",
      "ar": "وَٱذۡكُرۡ عَبۡدَنَاۤ أَیُّوبَ إِذۡ نَادَىٰ رَبَّهُۥۤ أَنِّی مَسَّنِیَ ٱلشَّیۡطَـٰنُ بِنُصۡبࣲ وَعَذَابٍ\n"
    }
  },
  {
    "id": 4012,
    "surahId": 38,
    "ayahNumber": 42,
    "arabicText": "ٱرۡكُضۡ بِرِجۡلِكَۖ هَـٰذَا مُغۡتَسَلُۢ بَارِدࣱ وَشَرَابࣱ\n",
    "translations": {
      "en": "[and thereupon was told:] “Strike [the ground] with thy foot: here is cool water to wash with and to drink!”",
      "ms": "(Maka Kami kabulkan permohonannya serta Kami perintahkan kepadanya): \" Hentakkanlah (bumi) dengan kakimu \" (setelah ia melakukannya maka terpancarlah air, lalu Kami berfirman kepadanya): \" Ini ialah air sejuk untuk mandi dan untuk minum (bagi menyembuhkan penyakitmu zahir dan batin) \".",
      "id": "(Allah berfirman): \"Hantamkanlah kakimu; inilah air yang sejuk untuk mandi dan untuk minum\".",
      "ar": "ٱرۡكُضۡ بِرِجۡلِكَۖ هَـٰذَا مُغۡتَسَلُۢ بَارِدࣱ وَشَرَابࣱ\n"
    }
  },
  {
    "id": 4013,
    "surahId": 38,
    "ayahNumber": 43,
    "arabicText": "وَوَهَبۡنَا لَهُۥۤ أَهۡلَهُۥ وَمِثۡلَهُم مَّعَهُمۡ رَحۡمَةࣰ مِّنَّا وَذِكۡرَىٰ لِأُو۟لِی ٱلۡأَلۡبَـٰبِ\n",
    "translations": {
      "en": "And We bestowed upon him new offspring, doubling their number as an act of grace from Us, and as a reminder unto all who are endowed with insight.",
      "ms": "Dan Kami kurniakan (lagi) kepadanya - keluarganya, dengan sekali ganda ramainya, sebagai satu rahmat dari Kami dan sebagai satu peringatan bagi orang-orang yang berakal sempurna (supaya mereka juga bersikap sabar semasa ditimpa malang).",
      "id": "Dan Kami anugerahi dia (dengan mengumpulkan kembali) keluarganya dan (Kami tambahkan) kepada mereka sebanyak mereka pula sebagai rahmat dari Kami dan pelajaran bagi orang-orang yang mempunyai fikiran.",
      "ar": "وَوَهَبۡنَا لَهُۥۤ أَهۡلَهُۥ وَمِثۡلَهُم مَّعَهُمۡ رَحۡمَةࣰ مِّنَّا وَذِكۡرَىٰ لِأُو۟لِی ٱلۡأَلۡبَـٰبِ\n"
    }
  },
  {
    "id": 4014,
    "surahId": 38,
    "ayahNumber": 44,
    "arabicText": "وَخُذۡ بِیَدِكَ ضِغۡثࣰا فَٱضۡرِب بِّهِۦ وَلَا تَحۡنَثۡۗ إِنَّا وَجَدۡنَـٰهُ صَابِرࣰاۚ نِّعۡمَ ٱلۡعَبۡدُ إِنَّهُۥۤ أَوَّابࣱ\n",
    "translations": {
      "en": "[And finally We told him:] “Now take in thy hand a small bunch of grass, and strike therewith, and thou wilt not break thine oath!” for, verily, We found him full of patience in adversity: how excellent a servant [of Ours], who, behold, would always turn unto Us!",
      "ms": "Dan (Kami perintahkan lagi kepadanya): \" Ambilah dengan tanganmu seikat jerami kemudian pukulah (isterimu) dengannya; dan janganlah engkau merosakkan sumpahmu itu \". Sesungguhnya Kami mendapati Nabi Ayub itu seorang yang sabar; ia adalah sebaik-baik hamba; sesungguhnya ia sentiasa rujuk kembali (kepada Kami dengan ibadatnya).",
      "id": "Dan ambillah dengan tanganmu seikat (rumput), maka pukullah dengan itu dan janganlah kamu melanggar sumpah. Sesungguhnya Kami dapati dia (Ayyub) seorang yang sabar. Dialah sebaik-baik hamba. Sesungguhnya dia amat taat (kepada Tuhan-nya).",
      "ar": "وَخُذۡ بِیَدِكَ ضِغۡثࣰا فَٱضۡرِب بِّهِۦ وَلَا تَحۡنَثۡۗ إِنَّا وَجَدۡنَـٰهُ صَابِرࣰاۚ نِّعۡمَ ٱلۡعَبۡدُ إِنَّهُۥۤ أَوَّابࣱ\n"
    }
  },
  {
    "id": 4015,
    "surahId": 38,
    "ayahNumber": 45,
    "arabicText": "وَٱذۡكُرۡ عِبَـٰدَنَاۤ إِبۡرَ ٰ⁠هِیمَ وَإِسۡحَـٰقَ وَیَعۡقُوبَ أُو۟لِی ٱلۡأَیۡدِی وَٱلۡأَبۡصَـٰرِ\n",
    "translations": {
      "en": "AND CALL to mind Our servants Abraham and Isaac and Jacob, [all of them] endowed with inner strength and vision:",
      "ms": "Dan (ingatkanlah peristiwa) hamba-hamba Kami: Nabi Ibrahim dan Nabi Ishak serta Nabi Yaakub, yang mempunyai kekuatan (melaksanakan taat setianya) dan pandangan yang mendalam (memahami ugamanya).",
      "id": "Dan ingatlah hamba-hamba Kami: Ibrahim, Ishaq dan Ya'qub yang mempunyai perbuatan-perbuatan yang besar dan ilmu-ilmu yang tinggi.",
      "ar": "وَٱذۡكُرۡ عِبَـٰدَنَاۤ إِبۡرَ ٰ⁠هِیمَ وَإِسۡحَـٰقَ وَیَعۡقُوبَ أُو۟لِی ٱلۡأَیۡدِی وَٱلۡأَبۡصَـٰرِ\n"
    }
  },
  {
    "id": 4016,
    "surahId": 38,
    "ayahNumber": 46,
    "arabicText": "إِنَّاۤ أَخۡلَصۡنَـٰهُم بِخَالِصَةࣲ ذِكۡرَى ٱلدَّارِ\n",
    "translations": {
      "en": "for, verily, We purified them by means of a thought most pure: the remembrance of the life to come.",
      "ms": "Sesungguhnya Kami telah jadikan mereka suci bersih dengan sebab satu sifat mereka yang murni, iaitu sifat sentiasa memperingati negeri akhirat.",
      "id": "Sesungguhnya Kami telah mensucikan mereka dengan (menganugerahkan kepada mereka) akhlak yang tinggi yaitu selalu mengingatkan (manusia) kepada negeri akhirat.",
      "ar": "إِنَّاۤ أَخۡلَصۡنَـٰهُم بِخَالِصَةࣲ ذِكۡرَى ٱلدَّارِ\n"
    }
  },
  {
    "id": 4017,
    "surahId": 38,
    "ayahNumber": 47,
    "arabicText": "وَإِنَّهُمۡ عِندَنَا لَمِنَ ٱلۡمُصۡطَفَیۡنَ ٱلۡأَخۡیَارِ\n",
    "translations": {
      "en": "And, behold, in Our sight they were indeed among the elect, the truly good!",
      "ms": "Dan sesungguhnya mereka di sisi Kami adalah dari orang-orang pilihan yang sebaik-baiknya.",
      "id": "Dan sesungguhnya mereka pada sisi Kami benar-benar termasuk orang-orang pilihan yang paling baik.",
      "ar": "وَإِنَّهُمۡ عِندَنَا لَمِنَ ٱلۡمُصۡطَفَیۡنَ ٱلۡأَخۡیَارِ\n"
    }
  },
  {
    "id": 4018,
    "surahId": 38,
    "ayahNumber": 48,
    "arabicText": "وَٱذۡكُرۡ إِسۡمَـٰعِیلَ وَٱلۡیَسَعَ وَذَا ٱلۡكِفۡلِۖ وَكُلࣱّ مِّنَ ٱلۡأَخۡیَارِ\n",
    "translations": {
      "en": "And call to mind Ishmael and Elisha, and every one who [like them] has pledged himself [unto Us]: for, each of them was of the truly good!",
      "ms": "Dan (ingatkanlah peristiwa) Nabi lsmail, dan Nabi Alyasak, serta Nabi Zulkifli; dan mereka masing-masing adalah dari orang-orang yang sebaik-baiknya.",
      "id": "Dan ingatlah akan Ismail, Ilyasa' dan Zulkifli. Semuanya termasuk orang-orang yang paling baik.",
      "ar": "وَٱذۡكُرۡ إِسۡمَـٰعِیلَ وَٱلۡیَسَعَ وَذَا ٱلۡكِفۡلِۖ وَكُلࣱّ مِّنَ ٱلۡأَخۡیَارِ\n"
    }
  },
  {
    "id": 4019,
    "surahId": 38,
    "ayahNumber": 49,
    "arabicText": "هَـٰذَا ذِكۡرࣱۚ وَإِنَّ لِلۡمُتَّقِینَ لَحُسۡنَ مَـَٔابࣲ\n",
    "translations": {
      "en": "LET [all] this be a reminder [to those who believe in God] - for, verily, the most beauteous of all goals awaits the God-conscious:",
      "ms": "(Segala sifat-sifat yang mulia) ini, adalah menjadi sebutan penghormatan (bagi mereka). Dan sesungguhnya bagi orang-orang yang bertaqwa, disediakan tempat kembali yang sebaik-baiknya (pada hari akhirat kelak), -",
      "id": "Ini adalah kehormatan (bagi mereka). Dan sesungguhnya bagi orang-orang yang bertakwa benar-benar (disediakan) tempat kembali yang baik,",
      "ar": "هَـٰذَا ذِكۡرࣱۚ وَإِنَّ لِلۡمُتَّقِینَ لَحُسۡنَ مَـَٔابࣲ\n"
    }
  },
  {
    "id": 4020,
    "surahId": 38,
    "ayahNumber": 50,
    "arabicText": "جَنَّـٰتِ عَدۡنࣲ مُّفَتَّحَةࣰ لَّهُمُ ٱلۡأَبۡوَ ٰ⁠بُ\n",
    "translations": {
      "en": "gardens of perpetual bliss, with gates wide-open to them,",
      "ms": "Iaitu beberapa buah Syurga tempat penginapan yang kekal, yang terbuka pintu-pintunya untuk mereka;",
      "id": "(yaitu) surga 'Adn yang pintu-pintunya terbuka bagi mereka,",
      "ar": "جَنَّـٰتِ عَدۡنࣲ مُّفَتَّحَةࣰ لَّهُمُ ٱلۡأَبۡوَ ٰ⁠بُ\n"
    }
  },
  {
    "id": 4021,
    "surahId": 38,
    "ayahNumber": 51,
    "arabicText": "مُتَّكِـِٔینَ فِیهَا یَدۡعُونَ فِیهَا بِفَـٰكِهَةࣲ كَثِیرَةࣲ وَشَرَابࣲ\n",
    "translations": {
      "en": "wherein they will recline, [and] wherein they may [freely] call for many a fruit and drink,",
      "ms": "(Mereka akan bersukaria) dalam Syurga itu sambil berbaring (di atas pelamin); mereka meminta di situ buah-buahan dan minuman yang berbagai jenisnya dan rasa kelazatannya.",
      "id": "di dalamnya mereka bertelekan (diatas dipan-dipan) sambil meminta buah-buahan yang banyak dan minuman di surga itu.",
      "ar": "مُتَّكِـِٔینَ فِیهَا یَدۡعُونَ فِیهَا بِفَـٰكِهَةࣲ كَثِیرَةࣲ وَشَرَابࣲ\n"
    }
  },
  {
    "id": 4022,
    "surahId": 38,
    "ayahNumber": 52,
    "arabicText": "۞ وَعِندَهُمۡ قَـٰصِرَ ٰ⁠تُ ٱلطَّرۡفِ أَتۡرَابٌ\n",
    "translations": {
      "en": "having beside them well-matched mates of modest gaze.”",
      "ms": "Dan di sisi mereka pula bidadari-bidadari yang pandangannya tertumpu (kepada mereka semata-mata), lagi yang sebaya umurnya.",
      "id": "Dan pada sisi mereka (ada bidadari-bidadari) yang tidak liar pandangannya dan sebaya umurnya.",
      "ar": "۞ وَعِندَهُمۡ قَـٰصِرَ ٰ⁠تُ ٱلطَّرۡفِ أَتۡرَابٌ\n"
    }
  },
  {
    "id": 4023,
    "surahId": 38,
    "ayahNumber": 53,
    "arabicText": "هَـٰذَا مَا تُوعَدُونَ لِیَوۡمِ ٱلۡحِسَابِ\n",
    "translations": {
      "en": "This is what you are promised for the Day of Reckoning:",
      "ms": "Inilah dia balasan yang dijanjikan kepada kamu setelah selesai hitungan amal!",
      "id": "Inilah apa yang dijanjikan kepadamu pada hari berhisab.",
      "ar": "هَـٰذَا مَا تُوعَدُونَ لِیَوۡمِ ٱلۡحِسَابِ\n"
    }
  },
  {
    "id": 4024,
    "surahId": 38,
    "ayahNumber": 54,
    "arabicText": "إِنَّ هَـٰذَا لَرِزۡقُنَا مَا لَهُۥ مِن نَّفَادٍ\n",
    "translations": {
      "en": "this, verily, shall be Our provision [for you], with no end to it!",
      "ms": "Sesungguhnya ini ialah pemberian Kami kepada kamu, pemberian yang tidak akan habis-habis; -",
      "id": "Sesungguhnya ini adalah benar-benar rezeki dari Kami yang tiada habis-habisnya.",
      "ar": "إِنَّ هَـٰذَا لَرِزۡقُنَا مَا لَهُۥ مِن نَّفَادٍ\n"
    }
  },
  {
    "id": 4025,
    "surahId": 38,
    "ayahNumber": 55,
    "arabicText": "هَـٰذَاۚ وَإِنَّ لِلطَّـٰغِینَ لَشَرَّ مَـَٔابࣲ\n",
    "translations": {
      "en": "All this [for the righteous]: but, verily, the most evil of all goals awaits those who are wont to transgress the bounds of what is right:",
      "ms": "Nikmat-nikmat ini (adalah untuk orang-orang yang bertaqwa). Dan Bahawa sesungguhnya bagi orang-orang yang zalim (dengan kekufuran atau kederhakaannya) seburuk-buruk tempat kembali, -",
      "id": "Beginilah (keadaan mereka). Dan sesungguhnya bagi orang-orang yang durhaka benar-benar (disediakan) tempat kembali yang buruk,",
      "ar": "هَـٰذَاۚ وَإِنَّ لِلطَّـٰغِینَ لَشَرَّ مَـَٔابࣲ\n"
    }
  },
  {
    "id": 4026,
    "surahId": 38,
    "ayahNumber": 56,
    "arabicText": "جَهَنَّمَ یَصۡلَوۡنَهَا فَبِئۡسَ ٱلۡمِهَادُ\n",
    "translations": {
      "en": "hell will they have to endure - and how vile a resting-place!",
      "ms": "Iaitu neraka Jahannam yang mereka akan menderita bakarannya; maka seburuk-buruk tempat menetap ialah neraka Jahannam;",
      "id": "(yaitu) neraka Jahannam, yang mereka masuk ke dalamnya; maka amat buruklah Jahannam itu sebagai tempat tinggal.",
      "ar": "جَهَنَّمَ یَصۡلَوۡنَهَا فَبِئۡسَ ٱلۡمِهَادُ\n"
    }
  },
  {
    "id": 4027,
    "surahId": 38,
    "ayahNumber": 57,
    "arabicText": "هَـٰذَا فَلۡیَذُوقُوهُ حَمِیمࣱ وَغَسَّاقࣱ\n",
    "translations": {
      "en": "This, [then, for them -] so let them taste it: burning despair and ice-cold darkness",
      "ms": "Ini sejenis azab seksa, maka hendaklah mereka merasainya, air panas yang menggelegak dan air danur yang mengalir (untuk minuman mereka);",
      "id": "Inilah (azab neraka), biarlah mereka merasakannya, (minuman mereka) air yang sangat panas dan air yang sangat dingin.",
      "ar": "هَـٰذَا فَلۡیَذُوقُوهُ حَمِیمࣱ وَغَسَّاقࣱ\n"
    }
  },
  {
    "id": 4028,
    "surahId": 38,
    "ayahNumber": 58,
    "arabicText": "وَءَاخَرُ مِن شَكۡلِهِۦۤ أَزۡوَ ٰ⁠جٌ\n",
    "translations": {
      "en": "and, coupled with it, further [suffering] of a similar nature.",
      "ms": "Dan azab seksa yang lain, yang serupa buruknya dan dahsyatnya adalah berbagai jenis lagi.",
      "id": "Dan azab yang lain yang serupa itu berbagai macam.",
      "ar": "وَءَاخَرُ مِن شَكۡلِهِۦۤ أَزۡوَ ٰ⁠جٌ\n"
    }
  },
  {
    "id": 4029,
    "surahId": 38,
    "ayahNumber": 59,
    "arabicText": "هَـٰذَا فَوۡجࣱ مُّقۡتَحِمࣱ مَّعَكُمۡ لَا مَرۡحَبَۢا بِهِمۡۚ إِنَّهُمۡ صَالُوا۟ ٱلنَّارِ\n",
    "translations": {
      "en": "[And they will say to one another: “Do you see] this crowd of people who rushed headlong [into sin] with you? No welcome to them! Verily, they [too] shall have to endure the fire!”",
      "ms": "(Penjaga neraka berkata kepada ketua-ketua golongan kafir dan penderhaka itu): \" Ini ialah serombongan (orang-orang kamu) yang masuk berasak-asak bersama-sama kamu \". (Ketua-ketua itu berkata): \" Mereka tidak perlu dialu-alukan, kerana sesungguhnya mereka pun akan menderita bakaran neraka \".",
      "id": "(Dikatakan kepada mereka): \"Ini adalah suatu rombongan (pengikut-pengikutmu) yang masuk berdesak-desak bersama kamu (ke neraka)\". (Berkata pemimpin-pemimpin mereka yang durhaka): \"Tiadalah ucapan selamat datang kepada mereka karena sesungguhnya mereka akan masuk neraka\".",
      "ar": "هَـٰذَا فَوۡجࣱ مُّقۡتَحِمࣱ مَّعَكُمۡ لَا مَرۡحَبَۢا بِهِمۡۚ إِنَّهُمۡ صَالُوا۟ ٱلنَّارِ\n"
    }
  },
  {
    "id": 4030,
    "surahId": 38,
    "ayahNumber": 60,
    "arabicText": "قَالُوا۟ بَلۡ أَنتُمۡ لَا مَرۡحَبَۢا بِكُمۡۖ أَنتُمۡ قَدَّمۡتُمُوهُ لَنَاۖ فَبِئۡسَ ٱلۡقَرَارُ\n",
    "translations": {
      "en": "[And] they [who had been seduced] will exclaim: “Nay, but it is you! No welcome to you! It is you who have prepared this for us: and how vile a state to abide in!”",
      "ms": "pengikut-pengikut mereka menjawab: \" Bahkan kamulah yang tidak perlu dialu-alukan, kerana kamulah yang membawa azab sengsara ini kepada kami, maka amatlah buruknya neraka ini sebagai tempat penetapan \".",
      "id": "Pengikut-pengikut mereka menjawab: \"Sebenarnya kamulah. Tiada ucapan selamat datang bagimu, karena kamulah yang menjerumuskan kami ke dalam azab, maka amat buruklah Jahannam itu sebagai tempat menetap\".",
      "ar": "قَالُوا۟ بَلۡ أَنتُمۡ لَا مَرۡحَبَۢا بِكُمۡۖ أَنتُمۡ قَدَّمۡتُمُوهُ لَنَاۖ فَبِئۡسَ ٱلۡقَرَارُ\n"
    }
  },
  {
    "id": 4031,
    "surahId": 38,
    "ayahNumber": 61,
    "arabicText": "قَالُوا۟ رَبَّنَا مَن قَدَّمَ لَنَا هَـٰذَا فَزِدۡهُ عَذَابࣰا ضِعۡفࣰا فِی ٱلنَّارِ\n",
    "translations": {
      "en": "[And] they will pray: “O our Sustainer! Who­ever has prepared this for us, double Thou his suffering in the fire!”",
      "ms": "Mereka berkata lagi: \" Wahai Tuhan kami! Sesiapa yang membawa azab ini kepada kami, maka tambahilah dia azab seksa berlipat ganda di dalam neraka \".",
      "id": "Mereka berkata (lagi): \"Ya Tuhan kami; barang siapa yang menjerumuskan kami ke dalam azab ini maka tambahkanlah azab kepadanya dengan berlipat ganda di dalam neraka\".",
      "ar": "قَالُوا۟ رَبَّنَا مَن قَدَّمَ لَنَا هَـٰذَا فَزِدۡهُ عَذَابࣰا ضِعۡفࣰا فِی ٱلنَّارِ\n"
    }
  },
  {
    "id": 4032,
    "surahId": 38,
    "ayahNumber": 62,
    "arabicText": "وَقَالُوا۟ مَا لَنَا لَا نَرَىٰ رِجَالࣰا كُنَّا نَعُدُّهُم مِّنَ ٱلۡأَشۡرَارِ\n",
    "translations": {
      "en": "And they will add: “How is it that we do not see [here any of the] men whom we were wont to count among the wicked,",
      "ms": "Dan penduduk neraka itu tetap akan bertanya sesama sendiri: \" Mengapa kita tidak melihat orang-orang yang dahulu kita kirakan mereka sebagai orang-orang jahat (lagi hina)?",
      "id": "Dan (orang-orang durhaka) berkata: \"Mengapa kami tidak melihat orang-orang yang dahulu (di dunia) kami anggap sebagai orang-orang yang jahat (hina).",
      "ar": "وَقَالُوا۟ مَا لَنَا لَا نَرَىٰ رِجَالࣰا كُنَّا نَعُدُّهُم مِّنَ ٱلۡأَشۡرَارِ\n"
    }
  },
  {
    "id": 4033,
    "surahId": 38,
    "ayahNumber": 63,
    "arabicText": "أَتَّخَذۡنَـٰهُمۡ سِخۡرِیًّا أَمۡ زَاغَتۡ عَنۡهُمُ ٱلۡأَبۡصَـٰرُ\n",
    "translations": {
      "en": "[and] whom we made the target of our derision? Or is it that [they are here, and] our eyes have missed them?”",
      "ms": "\" Adakah kita sahaja jadikan mereka ejek-ejekan (sedang mereka orang-orang yang benar)? Atau mata kita tidak dapat melihat mereka?",
      "id": "Apakah kami dahulu menjadikan mereka olok-olokan, ataukah karena mata kami tidak melihat mereka?\"",
      "ar": "أَتَّخَذۡنَـٰهُمۡ سِخۡرِیًّا أَمۡ زَاغَتۡ عَنۡهُمُ ٱلۡأَبۡصَـٰرُ\n"
    }
  },
  {
    "id": 4034,
    "surahId": 38,
    "ayahNumber": 64,
    "arabicText": "إِنَّ ذَ ٰ⁠لِكَ لَحَقࣱّ تَخَاصُمُ أَهۡلِ ٱلنَّارِ\n",
    "translations": {
      "en": "Such, behold, will in truth be the [confusion and] mutual wrangling of the people of the fire!",
      "ms": "Sesungguhnya (segala yang diterangkan) itu adalah benar iaitu perbalahan dan cercaan penduduk neraka sesama sendiri.",
      "id": "Sesungguhnya yang demikian itu pasti terjadi, (yaitu) pertengkaran penghuni neraka.",
      "ar": "إِنَّ ذَ ٰ⁠لِكَ لَحَقࣱّ تَخَاصُمُ أَهۡلِ ٱلنَّارِ\n"
    }
  },
  {
    "id": 4035,
    "surahId": 38,
    "ayahNumber": 65,
    "arabicText": "قُلۡ إِنَّمَاۤ أَنَا۠ مُنذِرࣱۖ وَمَا مِنۡ إِلَـٰهٍ إِلَّا ٱللَّهُ ٱلۡوَ ٰ⁠حِدُ ٱلۡقَهَّارُ\n",
    "translations": {
      "en": "SAY [O Muhammad]: “I am only a warner; and there is no deity whatever save God, the One, who holds absolute sway over all that exists,",
      "ms": "Katakanlah (wahai Muhammad): \" Sesungguhnya aku hanyalah seorang Rasul pemberi amaran, dan tidak ada sama sekali tuhan yang sebenar melainkan Allah Yang Maha Esa, lagi Yang kekuasaanNya mengatasi segala-galanya, -",
      "id": "Katakanlah (ya Muhammad): \"Sesungguhnya aku hanya seorang pemberi peringatan, dan sekali-kali tidak ada Tuhan selain Allah Yang Maha Esa dan Maha Mengalahkan.",
      "ar": "قُلۡ إِنَّمَاۤ أَنَا۠ مُنذِرࣱۖ وَمَا مِنۡ إِلَـٰهٍ إِلَّا ٱللَّهُ ٱلۡوَ ٰ⁠حِدُ ٱلۡقَهَّارُ\n"
    }
  },
  {
    "id": 4036,
    "surahId": 38,
    "ayahNumber": 66,
    "arabicText": "رَبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَمَا بَیۡنَهُمَا ٱلۡعَزِیزُ ٱلۡغَفَّـٰرُ\n",
    "translations": {
      "en": "the Sustainer of the heavens and the earth and all that is between them, the Almighty, the All-Forgiving!”",
      "ms": "\" Tuhan (yang mencipta serta mentadbirkan) langit dan bumi dan segala yang ada di antara keduanya; Yang Maha Kuasa, lagi Yang sentiasa Mengampuni (dosa hamba-hambaNya)\".",
      "id": "Tuhan langit dan bumi dan apa yang ada di antara keduanya Yang Maha Perkasa lagi Maha Pengampun.",
      "ar": "رَبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَمَا بَیۡنَهُمَا ٱلۡعَزِیزُ ٱلۡغَفَّـٰرُ\n"
    }
  },
  {
    "id": 4037,
    "surahId": 38,
    "ayahNumber": 67,
    "arabicText": "قُلۡ هُوَ نَبَؤٌا۟ عَظِیمٌ\n",
    "translations": {
      "en": "Say: “This is a message tremendous:",
      "ms": "Katakanlah lagi: \" Apa yang aku terangkan itu (tentang keesaan Allah dan kebenaran kerasulanku) adalah berita penting yang amat besar (faedahnya).",
      "id": "Katakanlah: \"Berita itu adalah berita yang besar,",
      "ar": "قُلۡ هُوَ نَبَؤٌا۟ عَظِیمٌ\n"
    }
  },
  {
    "id": 4038,
    "surahId": 38,
    "ayahNumber": 68,
    "arabicText": "أَنتُمۡ عَنۡهُ مُعۡرِضُونَ\n",
    "translations": {
      "en": "[how can] you turn away from it?”",
      "ms": "\" Yang kamu terus mengingkarinya.",
      "id": "yang kamu berpaling daripadanya.",
      "ar": "أَنتُمۡ عَنۡهُ مُعۡرِضُونَ\n"
    }
  },
  {
    "id": 4039,
    "surahId": 38,
    "ayahNumber": 69,
    "arabicText": "مَا كَانَ لِیَ مِنۡ عِلۡمِۭ بِٱلۡمَلَإِ ٱلۡأَعۡلَىٰۤ إِذۡ یَخۡتَصِمُونَ\n",
    "translations": {
      "en": "[Say, O Muhammad:] “No knowledge would I have had of [what passed among] the host on high when they argued [against the creation of man],",
      "ms": "\" Tiadalah bagiku sebarang pengetahuan tentang penduduk alam yang tinggi (malaikat), semasa mereka bersoal jawab (mengenai Nabi Adam-kalaulah tidak diwahyukan kepadaku).",
      "id": "Aku tiada mempunyai pengetahuan sedikitpun tentang al mala'ul a'la (malaikat) itu ketika mereka berbantah-bantahan.",
      "ar": "مَا كَانَ لِیَ مِنۡ عِلۡمِۭ بِٱلۡمَلَإِ ٱلۡأَعۡلَىٰۤ إِذۡ یَخۡتَصِمُونَ\n"
    }
  },
  {
    "id": 4040,
    "surahId": 38,
    "ayahNumber": 70,
    "arabicText": "إِن یُوحَىٰۤ إِلَیَّ إِلَّاۤ أَنَّمَاۤ أَنَا۠ نَذِیرࣱ مُّبِینٌ\n",
    "translations": {
      "en": "had it not been revealed unto me [by God] - to no other end than that I might convey [unto you] a plain warning.",
      "ms": "\" Tiadalah diwahyukan kepadaku melainkan kerana sesungguhnya aku seorang Rasul pemberi amaran yang jelas nyata (bukan seorang pembohong, atau ahli sihir, atau gila) \".",
      "id": "Tidak diwahyukan kepadaku, melainkan bahwa sesungguhnya aku hanyalah seorang pemberi peringatan yang nyata\".",
      "ar": "إِن یُوحَىٰۤ إِلَیَّ إِلَّاۤ أَنَّمَاۤ أَنَا۠ نَذِیرࣱ مُّبِینٌ\n"
    }
  },
  {
    "id": 4041,
    "surahId": 38,
    "ayahNumber": 71,
    "arabicText": "إِذۡ قَالَ رَبُّكَ لِلۡمَلَـٰۤىِٕكَةِ إِنِّی خَـٰلِقُۢ بَشَرࣰا مِّن طِینࣲ\n",
    "translations": {
      "en": "[For,] lo, thy Sustainer said unto the angels: “Behold, I am about to create a human being out of clay;",
      "ms": "(Ingatkanlah peristiwa) ketika Tuhanmu berfirman kepada malaikat: \" Sesungguhnya Aku hendak menciptakan manusia - Adam dari tanah;",
      "id": "(Ingatlah) ketika Tuhanmu berfirman kepada malaikat: \"Sesungguhnya Aku akan menciptakan manusia dari tanah\".",
      "ar": "إِذۡ قَالَ رَبُّكَ لِلۡمَلَـٰۤىِٕكَةِ إِنِّی خَـٰلِقُۢ بَشَرࣰا مِّن طِینࣲ\n"
    }
  },
  {
    "id": 4042,
    "surahId": 38,
    "ayahNumber": 72,
    "arabicText": "فَإِذَا سَوَّیۡتُهُۥ وَنَفَخۡتُ فِیهِ مِن رُّوحِی فَقَعُوا۟ لَهُۥ سَـٰجِدِینَ\n",
    "translations": {
      "en": "and when I have formed him fully and breathed into him of My spirit, fall you down before him in prostration!”",
      "ms": "\" Kemudian apabila Aku sempurnakan kejadiannya, serta Aku tiupkan padanya roh dari (ciptaan) Ku, maka hendaklah kamu sujud kepadanya \".",
      "id": "Maka apabila telah Kusempurnakan kejadiannya dan Kutiupkan kepadanya roh (ciptaan)Ku; maka hendaklah kamu tersungkur dengan bersujud kepadanya\".",
      "ar": "فَإِذَا سَوَّیۡتُهُۥ وَنَفَخۡتُ فِیهِ مِن رُّوحِی فَقَعُوا۟ لَهُۥ سَـٰجِدِینَ\n"
    }
  },
  {
    "id": 4043,
    "surahId": 38,
    "ayahNumber": 73,
    "arabicText": "فَسَجَدَ ٱلۡمَلَـٰۤىِٕكَةُ كُلُّهُمۡ أَجۡمَعُونَ\n",
    "translations": {
      "en": "Thereupon the angels prostrated themselves, all of them together,",
      "ms": "(Setelah selesai kejadian Adam) maka sujudlah sekalian malaikat, semuanya sekali, -",
      "id": "Lalu seluruh malaikat-malaikat itu bersujud semuanya,",
      "ar": "فَسَجَدَ ٱلۡمَلَـٰۤىِٕكَةُ كُلُّهُمۡ أَجۡمَعُونَ\n"
    }
  },
  {
    "id": 4044,
    "surahId": 38,
    "ayahNumber": 74,
    "arabicText": "إِلَّاۤ إِبۡلِیسَ ٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَـٰفِرِینَ\n",
    "translations": {
      "en": "save Iblis: he gloried in his arrogance, and [thus] became one of those who deny the truth.",
      "ms": "Melainkan Iblis; ia berlaku sombong takbur (mengingkarinya) serta menjadilah ia dari golongan yang kafir.",
      "id": "kecuali iblis; dia menyombongkan diri dan adalah dia termasuk orang-orang yang kafir.",
      "ar": "إِلَّاۤ إِبۡلِیسَ ٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَـٰفِرِینَ\n"
    }
  },
  {
    "id": 4045,
    "surahId": 38,
    "ayahNumber": 75,
    "arabicText": "قَالَ یَـٰۤإِبۡلِیسُ مَا مَنَعَكَ أَن تَسۡجُدَ لِمَا خَلَقۡتُ بِیَدَیَّۖ أَسۡتَكۡبَرۡتَ أَمۡ كُنتَ مِنَ ٱلۡعَالِینَ\n",
    "translations": {
      "en": "Said He: “O Iblis! What has kept thee from prostrating thyself before that [being] which I have created with My hands? Art thou too proud [to bow down before another created being], or art thou of those who think [only] of themselves as high?”",
      "ms": "Allah berfirman: \" Hai lblis! Apa yang menghalangmu daripada turut sujud kepada (Adam) yang Aku telah ciptakan dengan kekuasaanKu? Adakah engkau berlaku sombong takbur, ataupun engkau dari golongan yang tertinggi? \"",
      "id": "Allah berfirman: \"Hai iblis, apakah yang menghalangi kamu sujud kepada yang telah Ku-ciptakan dengan kedua tangan-Ku. Apakah kamu menyombongkan diri ataukah kamu (merasa) termasuk orang-orang yang (lebih) tinggi?\".",
      "ar": "قَالَ یَـٰۤإِبۡلِیسُ مَا مَنَعَكَ أَن تَسۡجُدَ لِمَا خَلَقۡتُ بِیَدَیَّۖ أَسۡتَكۡبَرۡتَ أَمۡ كُنتَ مِنَ ٱلۡعَالِینَ\n"
    }
  },
  {
    "id": 4046,
    "surahId": 38,
    "ayahNumber": 76,
    "arabicText": "قَالَ أَنَا۠ خَیۡرࣱ مِّنۡهُ خَلَقۡتَنِی مِن نَّارࣲ وَخَلَقۡتَهُۥ مِن طِینࣲ\n",
    "translations": {
      "en": "Answered [Iblis]: “I am better than he: Thou hast created me out of fire, whereas him Thou hast created out of clay.”",
      "ms": "Iblis menjawab: \" Aku lebih baik daripadanya; Engkau (wahai Tuhanku) ciptakan daku dari api, sedang dia Engkau ciptakan dari tanah \".",
      "id": "Iblis berkata: \"Aku lebih baik daripadanya, karena Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah\".",
      "ar": "قَالَ أَنَا۠ خَیۡرࣱ مِّنۡهُ خَلَقۡتَنِی مِن نَّارࣲ وَخَلَقۡتَهُۥ مِن طِینࣲ\n"
    }
  },
  {
    "id": 4047,
    "surahId": 38,
    "ayahNumber": 77,
    "arabicText": "قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِیمࣱ\n",
    "translations": {
      "en": "Said He: “Go forth, then, from this [angelic state] - for, behold, thou art henceforth accursed,",
      "ms": "Allah berfirman: \" Kalau demikian, keluarlah engkau daripadanya, kerana sesungguhnya engkau adalah makhluk yang diusir.",
      "id": "Allah berfirman: \"Maka keluarlah kamu dari surga; sesungguhnya kamu adalah orang yang terkutuk,",
      "ar": "قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِیمࣱ\n"
    }
  },
  {
    "id": 4048,
    "surahId": 38,
    "ayahNumber": 78,
    "arabicText": "وَإِنَّ عَلَیۡكَ لَعۡنَتِیۤ إِلَىٰ یَوۡمِ ٱلدِّینِ\n",
    "translations": {
      "en": "and My rejection shall be thy due until the Day of Judgment!”",
      "ms": "\" Dan sesungguhnya engkau ditimpa laknatku terus menerus hingga ke hari kiamat!\"",
      "id": "Sesungguhnya kutukan-Ku tetap atasmu sampai hari pembalasan\".",
      "ar": "وَإِنَّ عَلَیۡكَ لَعۡنَتِیۤ إِلَىٰ یَوۡمِ ٱلدِّینِ\n"
    }
  },
  {
    "id": 4049,
    "surahId": 38,
    "ayahNumber": 79,
    "arabicText": "قَالَ رَبِّ فَأَنظِرۡنِیۤ إِلَىٰ یَوۡمِ یُبۡعَثُونَ\n",
    "translations": {
      "en": "Said [Iblis]: “Then, O my Sustainer, grant me a respite till the Day when all shall be raised from the dead!”",
      "ms": "Iblis berkata: \" Wahai Tuhanku! Jika demikian, berilah tempoh kepadaku hingga ke hari mereka dibangkitkan (hari kiamat) \".",
      "id": "Iblis berkata: \"Ya Tuhanku, beri tangguhlah aku sampai hari mereka dibangkitkan\".",
      "ar": "قَالَ رَبِّ فَأَنظِرۡنِیۤ إِلَىٰ یَوۡمِ یُبۡعَثُونَ\n"
    }
  },
  {
    "id": 4050,
    "surahId": 38,
    "ayahNumber": 80,
    "arabicText": "قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِینَ\n",
    "translations": {
      "en": "Answered He: “Verily, so [be it:] thou shalt be among those who are granted respite",
      "ms": "Allah berfirman: \" Dengan permohonanmu itu, maka sesungguhnya engkau dari golongan yang diberi tempoh -",
      "id": "Allah berfirman: \"Sesungguhnya kamu termasuk orang-orang yang diberi tangguh,",
      "ar": "قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِینَ\n"
    }
  },
  {
    "id": 4051,
    "surahId": 38,
    "ayahNumber": 81,
    "arabicText": "إِلَىٰ یَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ\n",
    "translations": {
      "en": "till the Day the time whereof is known [only to Me].”",
      "ms": "\" Hingga ke hari masa yang termaklum \".",
      "id": "sampai kepada hari yang telah ditentukan waktunya (hari Kiamat)\".",
      "ar": "إِلَىٰ یَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ\n"
    }
  },
  {
    "id": 4052,
    "surahId": 38,
    "ayahNumber": 82,
    "arabicText": "قَالَ فَبِعِزَّتِكَ لَأُغۡوِیَنَّهُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "[Whereupon Iblis] said: “Then [I swear] by Thy very might: I shall most certainly beguile them all into grievous error –",
      "ms": "Iblis berkata: \" Demi kekuasaanmu (wahai Tuhanku), aku akan menyesatkan mereka semuanya, -",
      "id": "Iblis menjawab: \"Demi kekuasaan Engkau aku akan menyesatkan mereka semuanya,",
      "ar": "قَالَ فَبِعِزَّتِكَ لَأُغۡوِیَنَّهُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 4053,
    "surahId": 38,
    "ayahNumber": 83,
    "arabicText": "إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِینَ\n",
    "translations": {
      "en": "[all] save such of them as are truly Thy servants!”",
      "ms": "\" Kecuali hamba-hambaMu di antara zuriat-zuriat Adam itu yang dibersihkan dari sebarang kederhakaan dan penyelewengan \".",
      "id": "kecuali hamba-hamba-Mu yang mukhlis di antara mereka.",
      "ar": "إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِینَ\n"
    }
  },
  {
    "id": 4054,
    "surahId": 38,
    "ayahNumber": 84,
    "arabicText": "قَالَ فَٱلۡحَقُّ وَٱلۡحَقَّ أَقُولُ\n",
    "translations": {
      "en": "[And God] said: “This, then, is the truth! And this truth do I state:",
      "ms": "Allah berfirman: \" Maka Akulah Tuhan Yang Sebenar-benarnya, dan hanya perkara yang benar Aku firmankan -",
      "id": "Allah berfirman: \"Maka yang benar (adalah sumpah-Ku) dan hanya kebenaran itulah yang Ku-katakan\".",
      "ar": "قَالَ فَٱلۡحَقُّ وَٱلۡحَقَّ أَقُولُ\n"
    }
  },
  {
    "id": 4055,
    "surahId": 38,
    "ayahNumber": 85,
    "arabicText": "لَأَمۡلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنۡهُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "Most certainly will I fill hell with thee and such of them as shall follow thee, all together!”",
      "ms": "\" Demi sesungguhnya! Aku akan memenuhi neraka Jahannam dengan jenismu dan dengan orang-orang yang menurutmu di antara zuriat-zuriat Adam (yang derhaka) semuanya \".",
      "id": "Sesungguhnya Aku pasti akan memenuhi neraka Jahannam dengan jenis kamu dan dengan orang-orang yang mengikuti kamu di antara mereka kesemuanya.",
      "ar": "لَأَمۡلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنۡهُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 4056,
    "surahId": 38,
    "ayahNumber": 86,
    "arabicText": "قُلۡ مَاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ مِنۡ أَجۡرࣲ وَمَاۤ أَنَا۠ مِنَ ٱلۡمُتَكَلِّفِینَ\n",
    "translations": {
      "en": "SAY [O Prophet]: “No reward whatever do I ask of you for this [message]; and I am not one of those who claim to be what they are not.",
      "ms": "Katakanlah (wahai Muhammad): \" Aku tidak meminta kepada kamu sebarang bayaran kerana menyampaikan ajaran Al-Quran ini, dan bukanlah aku dari orang-orang yang mengada-ngada \".",
      "id": "Katakanlah (hai Muhammad): \"Aku tidak meminta upah sedikitpun padamu atas dakwahku dan bukanlah aku termasuk orang-orang yang mengada-adakan.",
      "ar": "قُلۡ مَاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ مِنۡ أَجۡرࣲ وَمَاۤ أَنَا۠ مِنَ ٱلۡمُتَكَلِّفِینَ\n"
    }
  },
  {
    "id": 4057,
    "surahId": 38,
    "ayahNumber": 87,
    "arabicText": "إِنۡ هُوَ إِلَّا ذِكۡرࣱ لِّلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "This [divine writ], behold, is no less than a reminder to all the worlds —",
      "ms": "Al-Quran tidak lain hanyalah peringatan bagi penduduk seluruh alam.",
      "id": "Al Quran ini tidak lain hanyalah peringatan bagi semesta alam.",
      "ar": "إِنۡ هُوَ إِلَّا ذِكۡرࣱ لِّلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 4058,
    "surahId": 38,
    "ayahNumber": 88,
    "arabicText": "وَلَتَعۡلَمُنَّ نَبَأَهُۥ بَعۡدَ حِینِۭ\n",
    "translations": {
      "en": "and you will most certainly grasp its purport after a lapse of time!”",
      "ms": "Dan demi sesungguhnya, kamu akan mengetahui kabenaran perkara-perkara yang diterangkannya, tidak lama lagi.",
      "id": "Dan sesungguhnya kamu akan mengetahui (kebenaran) berita Al Quran setelah beberapa waktu lagi.",
      "ar": "وَلَتَعۡلَمُنَّ نَبَأَهُۥ بَعۡدَ حِینِۭ\n"
    }
  }
]