[
  {
    "id": 1597,
    "surahId": 12,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِ ٱلۡمُبِینِ\n",
    "translations": {
      "en": "Alif. Lam. Ra. THESE ARE MESSAGES of a revelation clear in itself and clearly showing the truth:",
      "ms": "Alif, Laam, Raa'. Ini ialah ayat-ayat Kitab Al-Quran yang menyatakan kebenaran.",
      "id": "Alif, laam, raa. Ini adalah ayat-ayat Kitab (Al Quran) yang nyata (dari Allah).",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِ ٱلۡمُبِینِ\n"
    }
  },
  {
    "id": 1598,
    "surahId": 12,
    "ayahNumber": 2,
    "arabicText": "إِنَّاۤ أَنزَلۡنَـٰهُ قُرۡءَ ٰ⁠ نًا عَرَبِیࣰّا لَّعَلَّكُمۡ تَعۡقِلُونَ\n",
    "translations": {
      "en": "behold, We have bestowed it from on high as a discourse in the Arabic tongue, so that you might encompass it with your reason.",
      "ms": "Sesungguhnya Kami menurunkan kitab itu sebagai Quran yang dibaca dengan bahasa Arab, supaya kamu (menggunakan akal untuk) memahaminya.",
      "id": "Sesungguhnya Kami menurunkannya berupa Al Quran dengan berbahasa Arab, agar kamu memahaminya.",
      "ar": "إِنَّاۤ أَنزَلۡنَـٰهُ قُرۡءَ ٰ⁠ نًا عَرَبِیࣰّا لَّعَلَّكُمۡ تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1599,
    "surahId": 12,
    "ayahNumber": 3,
    "arabicText": "نَحۡنُ نَقُصُّ عَلَیۡكَ أَحۡسَنَ ٱلۡقَصَصِ بِمَاۤ أَوۡحَیۡنَاۤ إِلَیۡكَ هَـٰذَا ٱلۡقُرۡءَانَ وَإِن كُنتَ مِن قَبۡلِهِۦ لَمِنَ ٱلۡغَـٰفِلِینَ\n",
    "translations": {
      "en": "In the measure that We reveal this Qur'an unto thee, [O Prophet,] We explain it to thee in the best possible way, seeing that ere this thou wert indeed among those who are unaware [of what revelation is].",
      "ms": "Kami ceritakan kepadamu (wahai Muhammad) seindah-indah kisah dengan jalan Kami wahyukan kepadamu Al-Quran ini, padahal sebenarnya engkau sebelum datangnya wahyu itu, adalah dari orang-orang yang tidak pernah menyedari akan halnya.",
      "id": "Kami menceritakan kepadamu kisah yang paling baik dengan mewahyukan Al Quran ini kepadamu, dan sesungguhnya kamu sebelum (Kami mewahyukan)nya adalah termasuk orang-orang yang belum mengetahui.",
      "ar": "نَحۡنُ نَقُصُّ عَلَیۡكَ أَحۡسَنَ ٱلۡقَصَصِ بِمَاۤ أَوۡحَیۡنَاۤ إِلَیۡكَ هَـٰذَا ٱلۡقُرۡءَانَ وَإِن كُنتَ مِن قَبۡلِهِۦ لَمِنَ ٱلۡغَـٰفِلِینَ\n"
    }
  },
  {
    "id": 1600,
    "surahId": 12,
    "ayahNumber": 4,
    "arabicText": "إِذۡ قَالَ یُوسُفُ لِأَبِیهِ یَـٰۤأَبَتِ إِنِّی رَأَیۡتُ أَحَدَ عَشَرَ كَوۡكَبࣰا وَٱلشَّمۡسَ وَٱلۡقَمَرَ رَأَیۡتُهُمۡ لِی سَـٰجِدِینَ\n",
    "translations": {
      "en": "LO! Thus spoke Joseph unto his father: \"O my father! Behold, I saw [in a dream] eleven stars, as well as the sun and the moon: I saw them prostrate themselves before me!\"",
      "ms": "(Ingatlah peristiwa) ketika Nabi Yusuf berkata kepada bapanya: \"Wahai ayahku! Sesungguhnya aku mimpi melihat sebelas bintang dan matahari serta bulan; aku melihat mereka tunduk memberi hormat kepadaku\".",
      "id": "(Ingatlah), ketika Yusuf berkata kepada ayahnya: \"Wahai ayahku, sesungguhnya aku bermimpi melihat sebelas bintang, matahari dan bulan; kulihat semuanya sujud kepadaku\".",
      "ar": "إِذۡ قَالَ یُوسُفُ لِأَبِیهِ یَـٰۤأَبَتِ إِنِّی رَأَیۡتُ أَحَدَ عَشَرَ كَوۡكَبࣰا وَٱلشَّمۡسَ وَٱلۡقَمَرَ رَأَیۡتُهُمۡ لِی سَـٰجِدِینَ\n"
    }
  },
  {
    "id": 1601,
    "surahId": 12,
    "ayahNumber": 5,
    "arabicText": "قَالَ یَـٰبُنَیَّ لَا تَقۡصُصۡ رُءۡیَاكَ عَلَىٰۤ إِخۡوَتِكَ فَیَكِیدُوا۟ لَكَ كَیۡدًاۖ إِنَّ ٱلشَّیۡطَـٰنَ لِلۡإِنسَـٰنِ عَدُوࣱّ مُّبِینࣱ\n",
    "translations": {
      "en": "[Jacob] replied: \"O my dear son! Do not relate thy dream to thy brothers lest [out of envy] they devise an evil scheme against thee; verily, Satan is man's open foe!",
      "ms": "Bapanya berkata:\" Wahai anakku! Janganlah engkau ceritakan mimpimu kepada saudara-saudaramu, kerana aku khuatir mereka akan menjalankan sesuatu rancangan jahat terhadapmu. Sesungguhnya syaitan adalah musuh yang nyata bagi manusia.",
      "id": "Ayahnya berkata: \"Hai anakku, janganlah kamu ceritakan mimpimu itu kepada saudara-saudaramu, maka mereka membuat makar (untuk membinasakan)mu. Sesungguhnya syaitan itu adalah musuh yang nyata bagi manusia\".",
      "ar": "قَالَ یَـٰبُنَیَّ لَا تَقۡصُصۡ رُءۡیَاكَ عَلَىٰۤ إِخۡوَتِكَ فَیَكِیدُوا۟ لَكَ كَیۡدًاۖ إِنَّ ٱلشَّیۡطَـٰنَ لِلۡإِنسَـٰنِ عَدُوࣱّ مُّبِینࣱ\n"
    }
  },
  {
    "id": 1602,
    "surahId": 12,
    "ayahNumber": 6,
    "arabicText": "وَكَذَ ٰ⁠لِكَ یَجۡتَبِیكَ رَبُّكَ وَیُعَلِّمُكَ مِن تَأۡوِیلِ ٱلۡأَحَادِیثِ وَیُتِمُّ نِعۡمَتَهُۥ عَلَیۡكَ وَعَلَىٰۤ ءَالِ یَعۡقُوبَ كَمَاۤ أَتَمَّهَا عَلَىٰۤ أَبَوَیۡكَ مِن قَبۡلُ إِبۡرَ ٰ⁠هِیمَ وَإِسۡحَـٰقَۚ إِنَّ رَبَّكَ عَلِیمٌ حَكِیمࣱ\n",
    "translations": {
      "en": "For, [as thou hast been shown in thy dream,] even thus will thy Sustainer elect thee, and will impart unto thee some understanding of the inner meaning of happenings, and will bestow the full measure of His blessings upon thee and upon the House of Jacob -even as, aforetime, He bestowed it in full measure upon thy forefathers Abraham and Isaac. Verily, thy Sustainer is all-knowing, wise!\"",
      "ms": "Dan demikianlah caranya Tuhanmu memilihmu, dan akan mengajarmu takbir mimpi, serta akan menyempurnakan nikmatNya kepadamu dan kepada keluarga Yaakub: sebagaimana Ia telah menyempurnakannya kepada datuk nenekmu dahulu: Ibrahim dan Ishak. Sesungguhnya Tuhanmu Maha Mengetahui, lagi Maha Bijaksana\".",
      "id": "Dan demikianlah Tuhanmu, memilih kamu (untuk menjadi Nabi) dan diajarkan-Nya kepadamu sebahagian dari ta'bir mimpi-mimpi dan disempurnakan-Nya nikmat-Nya kepadamu dan kepada keluarga Ya'qub, sebagaimana Dia telah menyempurnakan nikmat-Nya kepada dua orang bapakmu sebelum itu, (yaitu) Ibrahim dan Ishak. Sesungguhnya Tuhanmu Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "وَكَذَ ٰ⁠لِكَ یَجۡتَبِیكَ رَبُّكَ وَیُعَلِّمُكَ مِن تَأۡوِیلِ ٱلۡأَحَادِیثِ وَیُتِمُّ نِعۡمَتَهُۥ عَلَیۡكَ وَعَلَىٰۤ ءَالِ یَعۡقُوبَ كَمَاۤ أَتَمَّهَا عَلَىٰۤ أَبَوَیۡكَ مِن قَبۡلُ إِبۡرَ ٰ⁠هِیمَ وَإِسۡحَـٰقَۚ إِنَّ رَبَّكَ عَلِیمٌ حَكِیمࣱ\n"
    }
  },
  {
    "id": 1603,
    "surahId": 12,
    "ayahNumber": 7,
    "arabicText": "۞ لَّقَدۡ كَانَ فِی یُوسُفَ وَإِخۡوَتِهِۦۤ ءَایَـٰتࣱ لِّلسَّاۤىِٕلِینَ\n",
    "translations": {
      "en": "Indeed, in [the story of] Joseph and his brothers there are messages for all who search [after truth].",
      "ms": "Demi sesungguhnya! (Kisah) Nabi Yusuf dengan saudara-saudaranya itu mengandungi beberapa pengajaran bagi orang-orang yang bertanya (tentang hal mereka untuk mengambil iktibar).",
      "id": "Sesungguhnya ada beberapa tanda-tanda kekuasaan Allah pada (kisah) Yusuf dan saudara-saudaranya bagi orang-orang yang bertanya.",
      "ar": "۞ لَّقَدۡ كَانَ فِی یُوسُفَ وَإِخۡوَتِهِۦۤ ءَایَـٰتࣱ لِّلسَّاۤىِٕلِینَ\n"
    }
  },
  {
    "id": 1604,
    "surahId": 12,
    "ayahNumber": 8,
    "arabicText": "إِذۡ قَالُوا۟ لَیُوسُفُ وَأَخُوهُ أَحَبُّ إِلَىٰۤ أَبِینَا مِنَّا وَنَحۡنُ عُصۡبَةٌ إِنَّ أَبَانَا لَفِی ضَلَـٰلࣲ مُّبِینٍ\n",
    "translations": {
      "en": "NOW [Joseph's brothers] spoke [thus to one another:] \"Truly, Joseph and his brother [Benjamin] are dearer to our father than we, even though we are so many. Behold, our father is surely suffering from an aberration!\"",
      "ms": "(Kisah itu bermula) ketika saudara-saudara Yusuf berkata (sesama sendiri): \"Sesungguhnya Yusuf dan adiknya, lebih disayangi oleh bapa kita daripada kita, padahal kita ini satu kumpulan (yang ramai dan berguna). Sesungguhnya bapa kita adalah dalam keadaan tidak adil yang nyata.\"",
      "id": "(Yaitu) ketika mereka berkata: \"Sesungguhnya Yusuf dan saudara kandungnya (Bunyamin) lebih dicintai oleh ayah kita dari pada kita sendiri, padahal kita (ini) adalah satu golongan (yang kuat). Sesungguhnya ayah kita adalah dalam kekeliruan yang nyata.",
      "ar": "إِذۡ قَالُوا۟ لَیُوسُفُ وَأَخُوهُ أَحَبُّ إِلَىٰۤ أَبِینَا مِنَّا وَنَحۡنُ عُصۡبَةٌ إِنَّ أَبَانَا لَفِی ضَلَـٰلࣲ مُّبِینٍ\n"
    }
  },
  {
    "id": 1605,
    "surahId": 12,
    "ayahNumber": 9,
    "arabicText": "ٱقۡتُلُوا۟ یُوسُفَ أَوِ ٱطۡرَحُوهُ أَرۡضࣰا یَخۡلُ لَكُمۡ وَجۡهُ أَبِیكُمۡ وَتَكُونُوا۟ مِنۢ بَعۡدِهِۦ قَوۡمࣰا صَـٰلِحِینَ\n",
    "translations": {
      "en": "[Said one of them:] \"Slay Joseph, or else drive him away to some [faraway] land, so that your father's regard may be for you alone: and after this is done, you will be [free to repent and to live once again as] righteous people!\"",
      "ms": "(Ramai di antara mereka berkata):\" Bunuhlah Yusuf atau buanglah dia ke suatu tempat yang jauh, supaya perhatian dan kasih sayang bapa kamu tertumpu kepada kamu semata-mata, dan supaya kamu sesudah itu menjadi orang-orang yang baik dan berguna\".",
      "id": "Bunuhlah Yusuf atau buanglah dia kesuatu daerah (yang tak dikenal) supaya perhatian ayahmu tertumpah kepadamu saja, dan sesudah itu hendaklah kamu menjadi orang-orang yang baik\".",
      "ar": "ٱقۡتُلُوا۟ یُوسُفَ أَوِ ٱطۡرَحُوهُ أَرۡضࣰا یَخۡلُ لَكُمۡ وَجۡهُ أَبِیكُمۡ وَتَكُونُوا۟ مِنۢ بَعۡدِهِۦ قَوۡمࣰا صَـٰلِحِینَ\n"
    }
  },
  {
    "id": 1606,
    "surahId": 12,
    "ayahNumber": 10,
    "arabicText": "قَالَ قَاۤىِٕلࣱ مِّنۡهُمۡ لَا تَقۡتُلُوا۟ یُوسُفَ وَأَلۡقُوهُ فِی غَیَـٰبَتِ ٱلۡجُبِّ یَلۡتَقِطۡهُ بَعۡضُ ٱلسَّیَّارَةِ إِن كُنتُمۡ فَـٰعِلِینَ\n",
    "translations": {
      "en": "Another of them said: \"Do not slay Joseph, but -rather - if you must do something - cast him into the dark depths of this well, [whence] some caravan may pick him up.\"",
      "ms": "Salah seorang di antara mereka berkata: \"Janganlah kamu membunuh Yusuf, tetapi buanglah dia ke dalam pergi, supaya ia dipungut oleh sebahagian dari orang-orang musafir (yang lalu di situ), kalaulah kamu tetap hendak menjalankan rancangan kamu itu\".",
      "id": "Seorang diantara mereka berkata: \"Janganlah kamu bunuh Yusuf, tetapi masukkanlah dia ke dasar sumur supaya dia dipungut oleh beberapa orang musafir, jika kamu hendak berbuat\".",
      "ar": "قَالَ قَاۤىِٕلࣱ مِّنۡهُمۡ لَا تَقۡتُلُوا۟ یُوسُفَ وَأَلۡقُوهُ فِی غَیَـٰبَتِ ٱلۡجُبِّ یَلۡتَقِطۡهُ بَعۡضُ ٱلسَّیَّارَةِ إِن كُنتُمۡ فَـٰعِلِینَ\n"
    }
  },
  {
    "id": 1607,
    "surahId": 12,
    "ayahNumber": 11,
    "arabicText": "قَالُوا۟ یَـٰۤأَبَانَا مَا لَكَ لَا تَأۡمَ۬نَّا عَلَىٰ یُوسُفَ وَإِنَّا لَهُۥ لَنَـٰصِحُونَ\n",
    "translations": {
      "en": "[On this they agreed; and thereupon] they spoke [thus to their father]: \"O our father! Wherefore wilt thou not trust us with Joseph, seeing that we are indeed his well-wishers?",
      "ms": "Mereka pun (pergi berjumpa dengan bapa mereka lalu) berkata: Wahai ayah kami! Mengapa ayah tidak percaya kepada kami tentang Yusuf, padahal sesungguhnya kami sentiasa tulus ikhlas mengambil berat kepadanya?",
      "id": "Mereka berkata: \"Wahai ayah kami, apa sebabnya kamu tidak mempercayai kami terhadap Yusuf, padahal sesungguhnya kami adalah orang-orang yang mengingini kebaikan baginya.",
      "ar": "قَالُوا۟ یَـٰۤأَبَانَا مَا لَكَ لَا تَأۡمَ۬نَّا عَلَىٰ یُوسُفَ وَإِنَّا لَهُۥ لَنَـٰصِحُونَ\n"
    }
  },
  {
    "id": 1608,
    "surahId": 12,
    "ayahNumber": 12,
    "arabicText": "أَرۡسِلۡهُ مَعَنَا غَدࣰا یَرۡتَعۡ وَیَلۡعَبۡ وَإِنَّا لَهُۥ لَحَـٰفِظُونَ\n",
    "translations": {
      "en": "Let him go out with us tomorrow, that he may enjoy himself and play: and, verily, we shall guard him well!\"",
      "ms": "Biarkan dia pergi bersama-sama kami esok, supaya ia bersuka ria makan minum dan bermain-main dengan bebasnya; dan sesungguhnya kami akan menjaganya dengan sebaik-baiknya\".",
      "id": "Biarkanlah dia pergi bersama kami besok pagi, agar dia (dapat) bersenang-senang dan (dapat) bermain-main, dan sesungguhnya kami pasti menjaganya\".",
      "ar": "أَرۡسِلۡهُ مَعَنَا غَدࣰا یَرۡتَعۡ وَیَلۡعَبۡ وَإِنَّا لَهُۥ لَحَـٰفِظُونَ\n"
    }
  },
  {
    "id": 1609,
    "surahId": 12,
    "ayahNumber": 13,
    "arabicText": "قَالَ إِنِّی لَیَحۡزُنُنِیۤ أَن تَذۡهَبُوا۟ بِهِۦ وَأَخَافُ أَن یَأۡكُلَهُ ٱلذِّئۡبُ وَأَنتُمۡ عَنۡهُ غَـٰفِلُونَ\n",
    "translations": {
      "en": "[Jacob] answered: \"Behold, it grieves me indeed [to think] that you might take him with you, for I dread lest the wolf devour him at a moment when you are heedless of him!\"",
      "ms": "Bapa mereka menjawab: \"Permergian kamu membawanya bersama sangatlah mendukacitakan daku, dan aku pula bimbang ia akan dimakan oleh serigala, ketika kamu lalai dari mengawalnya \".",
      "id": "Berkata Ya'qub: \"Sesungguhnya kepergian kamu bersama Yusuf amat menyedihkanku dan aku khawatir kalau-kalau dia dimakan serigala, sedang kamu lengah dari padanya\".",
      "ar": "قَالَ إِنِّی لَیَحۡزُنُنِیۤ أَن تَذۡهَبُوا۟ بِهِۦ وَأَخَافُ أَن یَأۡكُلَهُ ٱلذِّئۡبُ وَأَنتُمۡ عَنۡهُ غَـٰفِلُونَ\n"
    }
  },
  {
    "id": 1610,
    "surahId": 12,
    "ayahNumber": 14,
    "arabicText": "قَالُوا۟ لَىِٕنۡ أَكَلَهُ ٱلذِّئۡبُ وَنَحۡنُ عُصۡبَةٌ إِنَّاۤ إِذࣰا لَّخَـٰسِرُونَ\n",
    "translations": {
      "en": "Said they: \"Surely, if the wolf were to devour him notwithstanding that we are so many-then, behold, we ought ourselves to perish!\"",
      "ms": "Mereka berkata: \"Kalau dia dimakan oleh serigala, sedang kami ramai bilangannya, sesungguhnya kami sudah tentu menjadilah orang-orang yang rugi\".",
      "id": "Mereka berkata: \"Jika ia benar-benar dimakan serigala, sedang kami golongan (yang kuat), sesungguhnya kami kalau demikian adalah orang-orang yang merugi\".",
      "ar": "قَالُوا۟ لَىِٕنۡ أَكَلَهُ ٱلذِّئۡبُ وَنَحۡنُ عُصۡبَةٌ إِنَّاۤ إِذࣰا لَّخَـٰسِرُونَ\n"
    }
  },
  {
    "id": 1611,
    "surahId": 12,
    "ayahNumber": 15,
    "arabicText": "فَلَمَّا ذَهَبُوا۟ بِهِۦ وَأَجۡمَعُوۤا۟ أَن یَجۡعَلُوهُ فِی غَیَـٰبَتِ ٱلۡجُبِّۚ وَأَوۡحَیۡنَاۤ إِلَیۡهِ لَتُنَبِّئَنَّهُم بِأَمۡرِهِمۡ هَـٰذَا وَهُمۡ لَا یَشۡعُرُونَ\n",
    "translations": {
      "en": "And so, when they went away with him, they decided to cast him into the dark depths of the well. And We revealed [this] unto him: \"Thou wilt yet remind them of this their deed at a time when they shall not perceive [who thou art]!\"",
      "ms": "Setelah mereka pergi dengan membawanya bersama dan setelah mereka sekata hendak melepaskan dia ke dalam perigi, (mereka pun melakukan yang demikian), dan kami pula ilhamkan kepadanya:\" Sesungguhnya engkau (wahai Yusuf, akan terselamat, dan) akan memberi tahu mereka tentang hal perbuatan mereka ini, sedang mereka tidak sedar (dan tidak mengingatinya lagi) \".",
      "id": "Maka tatkala mereka membawanya dan sepakat memasukkannya ke dasar sumur (lalu mereka masukkan dia), dan (di waktu dia sudah dalam sumur) Kami wahyukan kepada Yusuf: \"Sesungguhnya kamu akan menceritakan kepada mereka perbuatan mereka ini, sedang mereka tiada ingat lagi\".",
      "ar": "فَلَمَّا ذَهَبُوا۟ بِهِۦ وَأَجۡمَعُوۤا۟ أَن یَجۡعَلُوهُ فِی غَیَـٰبَتِ ٱلۡجُبِّۚ وَأَوۡحَیۡنَاۤ إِلَیۡهِ لَتُنَبِّئَنَّهُم بِأَمۡرِهِمۡ هَـٰذَا وَهُمۡ لَا یَشۡعُرُونَ\n"
    }
  },
  {
    "id": 1612,
    "surahId": 12,
    "ayahNumber": 16,
    "arabicText": "وَجَاۤءُوۤ أَبَاهُمۡ عِشَاۤءࣰ یَبۡكُونَ\n",
    "translations": {
      "en": "And at nightfall they came to their father, weeping,",
      "ms": "Dan sesudah itu datanglah mereka mendapatkan bapa mereka pada waktu senja sambil (buat-buat) menangis.",
      "id": "Kemudian mereka datang kepada ayah mereka di sore hari sambil menangis.",
      "ar": "وَجَاۤءُوۤ أَبَاهُمۡ عِشَاۤءࣰ یَبۡكُونَ\n"
    }
  },
  {
    "id": 1613,
    "surahId": 12,
    "ayahNumber": 17,
    "arabicText": "قَالُوا۟ یَـٰۤأَبَانَاۤ إِنَّا ذَهَبۡنَا نَسۡتَبِقُ وَتَرَكۡنَا یُوسُفَ عِندَ مَتَـٰعِنَا فَأَكَلَهُ ٱلذِّئۡبُۖ وَمَاۤ أَنتَ بِمُؤۡمِنࣲ لَّنَا وَلَوۡ كُنَّا صَـٰدِقِینَ\n",
    "translations": {
      "en": "[and] said: \"O our father! Behold, we went off racing with one another, and left Joseph behind with our things; and thereupon the wolf devoured him! But [we know that] thou wouldst not believe us even though we speak the truth\" -",
      "ms": "Mereka berkata: \"Wahai ayah kami! Sesungguhnya kami telah pergi berlumba-lumba berburu dan kami telah tinggalkan Yusuf menjaga barang-barang kami, lalu ia dimakan oleh serigala; dan sudah tentu ayah tidak akan percaya kepada kata-kata kami ini, sekalipun kami adalah orang-orang yang benar\".",
      "id": "Mereka berkata: \"Wahai ayah kami, sesungguhnya kami pergi berlomba-lomba dan kami tinggalkan Yusuf di dekat barang-barang kami, lalu dia dimakan serigala; dan kamu sekali-kali tidak akan percaya kepada kami, sekalipun kami adalah orang-orang yang benar\".",
      "ar": "قَالُوا۟ یَـٰۤأَبَانَاۤ إِنَّا ذَهَبۡنَا نَسۡتَبِقُ وَتَرَكۡنَا یُوسُفَ عِندَ مَتَـٰعِنَا فَأَكَلَهُ ٱلذِّئۡبُۖ وَمَاۤ أَنتَ بِمُؤۡمِنࣲ لَّنَا وَلَوۡ كُنَّا صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 1614,
    "surahId": 12,
    "ayahNumber": 18,
    "arabicText": "وَجَاۤءُو عَلَىٰ قَمِیصِهِۦ بِدَمࣲ كَذِبࣲۚ قَالَ بَلۡ سَوَّلَتۡ لَكُمۡ أَنفُسُكُمۡ أَمۡرࣰاۖ فَصَبۡرࣱ جَمِیلࣱۖ وَٱللَّهُ ٱلۡمُسۡتَعَانُ عَلَىٰ مَا تَصِفُونَ\n",
    "translations": {
      "en": "and they produced his tunic with false blood upon it. [But Jacob] exclaimed: \"Nay, but it is your [own] minds that have made [so terrible] a happening seem a matter of little account to you! But [as for myself,] patience in adversity is most goodly [in the sight of God]; and it is to God [alone] that I pray to give me strength to bear the misfortune which you have described to me.\"",
      "ms": "Dan (bagi mengesahkan dakwaan itu) mereka pula melumurkan baju Yusuf dengan darah palsu. Bapa mereka berkata: \"Tidak! Bahkan nafsu kamu memperelokkan kepada kamu suatu perkara (yang tidak diterima akal). Kalau demikian, bersabarlah aku dengan sebaik-baiknya, dan Allah jualah yang dipohonkan pertolonganNya, mengenai apa yang kamu katakan itu.\"",
      "id": "Mereka datang membawa baju gamisnya (yang berlumuran) dengan darah palsu. Ya'qub berkata: \"Sebenarnya dirimu sendirilah yang memandang baik perbuatan (yang buruk) itu; maka kesabaran yang baik itulah (kesabaranku). Dan Allah sajalah yang dimohon pertolongan-Nya terhadap apa yang kamu ceritakan\".",
      "ar": "وَجَاۤءُو عَلَىٰ قَمِیصِهِۦ بِدَمࣲ كَذِبࣲۚ قَالَ بَلۡ سَوَّلَتۡ لَكُمۡ أَنفُسُكُمۡ أَمۡرࣰاۖ فَصَبۡرࣱ جَمِیلࣱۖ وَٱللَّهُ ٱلۡمُسۡتَعَانُ عَلَىٰ مَا تَصِفُونَ\n"
    }
  },
  {
    "id": 1615,
    "surahId": 12,
    "ayahNumber": 19,
    "arabicText": "وَجَاۤءَتۡ سَیَّارَةࣱ فَأَرۡسَلُوا۟ وَارِدَهُمۡ فَأَدۡلَىٰ دَلۡوَهُۥۖ قَالَ یَـٰبُشۡرَىٰ هَـٰذَا غُلَـٰمࣱۚ وَأَسَرُّوهُ بِضَـٰعَةࣰۚ وَٱللَّهُ عَلِیمُۢ بِمَا یَعۡمَلُونَ\n",
    "translations": {
      "en": "AND THERE CAME a caravan; and they sent forth their drawer of water, and he let down his bucket into the well - [and when he saw Joseph] he exclaimed: \"Oh, what a lucky find, this boy!\" And they hid him with a view to selling him: but God had full knowledge of all that they were doing.",
      "ms": "Dan (semasa Yusuf dalam perigi) datanglah ke tempat itu satu rombongan (ahli perniagaan) yang sedang dalam perjalanan; lalu mereka menghantarkan seorang pencari air bagi mereka; (setelah sampainya ke perigi itu) dia pun menghulurkan timbanya (dan manakala ia melihat Yusuf bergantung pada timbanya) ia berseru dengan katanya: \"Hai, (ini) sungguh mengembirakan! Ini adalah seorang budak lelaki (yang cantik parasnya)\". (Setelah mengetahui hal itu, saudara-saudara Yusuf pun datang) serta mereka sembunyikan keadaan Yusuf yang sebenarnya (untuk dijual) sebagai barang dagangan. Dan Allah Maha Mengetahui akan apa yang mereka lakukan.",
      "id": "Kemudian datanglah kelompok orang-orang musafir, lalu mereka menyuruh seorang pengambil air, maka dia menurunkan timbanya, dia berkata: \"Oh; kabar gembira, ini seorang anak muda!\" Kemudian mereka menyembunyikan dia sebagai barang dagangan. Dan Allah Maha Mengetahui apa yang mereka kerjakan.",
      "ar": "وَجَاۤءَتۡ سَیَّارَةࣱ فَأَرۡسَلُوا۟ وَارِدَهُمۡ فَأَدۡلَىٰ دَلۡوَهُۥۖ قَالَ یَـٰبُشۡرَىٰ هَـٰذَا غُلَـٰمࣱۚ وَأَسَرُّوهُ بِضَـٰعَةࣰۚ وَٱللَّهُ عَلِیمُۢ بِمَا یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1616,
    "surahId": 12,
    "ayahNumber": 20,
    "arabicText": "وَشَرَوۡهُ بِثَمَنِۭ بَخۡسࣲ دَرَ ٰ⁠هِمَ مَعۡدُودَةࣲ وَكَانُوا۟ فِیهِ مِنَ ٱلزَّ ٰ⁠هِدِینَ\n",
    "translations": {
      "en": "And they sold him for a paltry price - a mere few silver coins: thus low did they value him.",
      "ms": "Dan (setelah berlaku perundingan) mereka menjualnya dengan harga yang murah, iaitu beberapa dirham sahaja bilangannya; dan mereka adalah orang-orang yang tidak menghargainya.",
      "id": "Dan mereka menjual Yusuf dengan harga yang murah, yaitu beberapa dirham saja, dan mereka merasa tidak tertarik hatinya kepada Yusuf.",
      "ar": "وَشَرَوۡهُ بِثَمَنِۭ بَخۡسࣲ دَرَ ٰ⁠هِمَ مَعۡدُودَةࣲ وَكَانُوا۟ فِیهِ مِنَ ٱلزَّ ٰ⁠هِدِینَ\n"
    }
  },
  {
    "id": 1617,
    "surahId": 12,
    "ayahNumber": 21,
    "arabicText": "وَقَالَ ٱلَّذِی ٱشۡتَرَىٰهُ مِن مِّصۡرَ لِٱمۡرَأَتِهِۦۤ أَكۡرِمِی مَثۡوَىٰهُ عَسَىٰۤ أَن یَنفَعَنَاۤ أَوۡ نَتَّخِذَهُۥ وَلَدࣰاۚ وَكَذَ ٰ⁠لِكَ مَكَّنَّا لِیُوسُفَ فِی ٱلۡأَرۡضِ وَلِنُعَلِّمَهُۥ مِن تَأۡوِیلِ ٱلۡأَحَادِیثِۚ وَٱللَّهُ غَالِبٌ عَلَىٰۤ أَمۡرِهِۦ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "And the man from Egypt who bought him said to his wife: \"Make his stay [with us] honourable; he may well be of use to us, or we may adopt him as a son. And thus We gave unto Joseph a firm place on earth; and [We did this] so that We might impart unto him some understanding of the inner meaning of happenings. For, God always prevails in whatever be His purpose: but most people know it not.",
      "ms": "Dan (setelah Yusuf dijualkan di negeri Mesir), berkatalah orang yang membeli Yusuf kepada isterinya: \"Berilah dia layanan yang sebaik-baiknya; semoga ia berguna kepada kita, atau kita jadikan dia anak\". Dan demikianlah caranya kami menetapkan kedudukan Yusuf di bumi (Mesir untuk dihormati dan disayangi), dan untuk kami mengajarnya sebahagian dari ilmu takbir mimpi. Dan Allah Maha Kuasa melakukan segala perkara yang telah ditetapkanNya, akan tetapi kebanyakan manusia tidak mengetahui.",
      "id": "Dan orang Mesir yang membelinya berkata kepada isterinya: \"Berikanlah kepadanya tempat (dan layanan) yang baik, boleh jadi dia bermanfaat kepada kita atau kita pungut dia sebagai anak\". Dan demikian pulalah Kami memberikan kedudukan yang baik kepada Yusuf di muka bumi (Mesir), dan agar Kami ajarkan kepadanya ta'bir mimpi. Dan Allah berkuasa terhadap urusan-Nya, tetapi kebanyakan manusia tiada mengetahuinya.",
      "ar": "وَقَالَ ٱلَّذِی ٱشۡتَرَىٰهُ مِن مِّصۡرَ لِٱمۡرَأَتِهِۦۤ أَكۡرِمِی مَثۡوَىٰهُ عَسَىٰۤ أَن یَنفَعَنَاۤ أَوۡ نَتَّخِذَهُۥ وَلَدࣰاۚ وَكَذَ ٰ⁠لِكَ مَكَّنَّا لِیُوسُفَ فِی ٱلۡأَرۡضِ وَلِنُعَلِّمَهُۥ مِن تَأۡوِیلِ ٱلۡأَحَادِیثِۚ وَٱللَّهُ غَالِبٌ عَلَىٰۤ أَمۡرِهِۦ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1618,
    "surahId": 12,
    "ayahNumber": 22,
    "arabicText": "وَلَمَّا بَلَغَ أَشُدَّهُۥۤ ءَاتَیۡنَـٰهُ حُكۡمࣰا وَعِلۡمࣰاۚ وَكَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "And when he reached full manhood, We bestowed upon him the ability to judge [between right and wrong], as well as [innate] knowledge: for thus do We reward the doers of good.",
      "ms": "Dan ketika Yusuf sampai ke peringkat umurnya yang sempurna kekuatannya, Kami beri kepadanya kebijaksanaan serta ilmu pengetahuan; dan demikianlah kami membalas orang-orang yang berusaha memperbaiki amalannya.",
      "id": "Dan tatkala dia cukup dewasa Kami berikan kepadanya hikmah dan ilmu. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.",
      "ar": "وَلَمَّا بَلَغَ أَشُدَّهُۥۤ ءَاتَیۡنَـٰهُ حُكۡمࣰا وَعِلۡمࣰاۚ وَكَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 1619,
    "surahId": 12,
    "ayahNumber": 23,
    "arabicText": "وَرَ ٰ⁠وَدَتۡهُ ٱلَّتِی هُوَ فِی بَیۡتِهَا عَن نَّفۡسِهِۦ وَغَلَّقَتِ ٱلۡأَبۡوَ ٰ⁠بَ وَقَالَتۡ هَیۡتَ لَكَۚ قَالَ مَعَاذَ ٱللَّهِۖ إِنَّهُۥ رَبِّیۤ أَحۡسَنَ مَثۡوَایَۖ إِنَّهُۥ لَا یُفۡلِحُ ٱلظَّـٰلِمُونَ\n",
    "translations": {
      "en": "And [it so happened that] she in whose house he was living [conceived a passion for him and] sought to make him yield himself unto her; and she bolted the doors and said, \"Come thou unto me!\" [But Joseph] answered: \"May God preserve me! Behold, goodly has my master made my stay [in this house]! Verily, to no good end come they that do [such] wrong!\"",
      "ms": "Dan perempuan yang Yusuf tinggal di rumahnya, bersungguh-sungguh memujuk Yusuf berkehendakkan dirinya; dan perempuan itupun menutup pintu-pintu serta berkata: \"Marilah ke mari, aku bersedia untukmu\". Yusuf menjawab: \"Aku berlindung kepada Allah (dari perbuatan yang keji itu); sesungguhnya Tuhanku telah memuliharaku dengan sebaik-baiknya; sesungguhnya orang-orang yang zalim tidak akan berjaya\".",
      "id": "Dan wanita (Zulaikha) yang Yusuf tinggal di rumahnya menggoda Yusuf untuk menundukkan dirinya (kepadanya) dan dia menutup pintu-pintu, seraya berkata: \"Marilah ke sini\". Yusuf berkata: \"Aku berlindung kepada Allah, sungguh tuanku telah memperlakukan aku dengan baik\". Sesungguhnya orang-orang yang zalim tiada akan beruntung.",
      "ar": "وَرَ ٰ⁠وَدَتۡهُ ٱلَّتِی هُوَ فِی بَیۡتِهَا عَن نَّفۡسِهِۦ وَغَلَّقَتِ ٱلۡأَبۡوَ ٰ⁠بَ وَقَالَتۡ هَیۡتَ لَكَۚ قَالَ مَعَاذَ ٱللَّهِۖ إِنَّهُۥ رَبِّیۤ أَحۡسَنَ مَثۡوَایَۖ إِنَّهُۥ لَا یُفۡلِحُ ٱلظَّـٰلِمُونَ\n"
    }
  },
  {
    "id": 1620,
    "surahId": 12,
    "ayahNumber": 24,
    "arabicText": "وَلَقَدۡ هَمَّتۡ بِهِۦۖ وَهَمَّ بِهَا لَوۡلَاۤ أَن رَّءَا بُرۡهَـٰنَ رَبِّهِۦۚ كَذَ ٰ⁠لِكَ لِنَصۡرِفَ عَنۡهُ ٱلسُّوۤءَ وَٱلۡفَحۡشَاۤءَۚ إِنَّهُۥ مِنۡ عِبَادِنَا ٱلۡمُخۡلَصِینَ\n",
    "translations": {
      "en": "And, indeed, she desired him, and he desired her; [and he would have succumbed] had he not seen [in this temptation] an evidence of his Sustainer's truth: thus [We willed it to be] in order that We might avert from him all evil and all deeds of abomination -for, behold, he was truly one of Our servants.",
      "ms": "Dan sebenarnya perempuan itu telah berkeinginan sangat kepadanya, dan Yusuf pula (mungkin timbul) keinginannya kepada perempuan itu kalaulah ia tidak menyedari kenyataan Tuhannya (tentang kejinya perbuatan zina itu). Demikianlah (takdir Kami) untuk menjauhkan dari Yusuf perkara-perkara yang tidak baik dan perbuatan-perbuatan yang keji, kerana sesungguhnya ia dari hamba-hamba Kami yang dibersihkan dari segala dosa.",
      "id": "Sesungguhnya wanita itu telah bermaksud (melakukan perbuatan itu) dengan Yusuf, dan Yusufpun bermaksud (melakukan pula) dengan wanita itu andaikata dia tidak melihat tanda (dari) Tuhannya. Demikianlah, agar Kami memalingkan dari padanya kemungkaran dan kekejian. Sesungguhnya Yusuf itu termasuk hamba-hamba Kami yang terpilih.",
      "ar": "وَلَقَدۡ هَمَّتۡ بِهِۦۖ وَهَمَّ بِهَا لَوۡلَاۤ أَن رَّءَا بُرۡهَـٰنَ رَبِّهِۦۚ كَذَ ٰ⁠لِكَ لِنَصۡرِفَ عَنۡهُ ٱلسُّوۤءَ وَٱلۡفَحۡشَاۤءَۚ إِنَّهُۥ مِنۡ عِبَادِنَا ٱلۡمُخۡلَصِینَ\n"
    }
  },
  {
    "id": 1621,
    "surahId": 12,
    "ayahNumber": 25,
    "arabicText": "وَٱسۡتَبَقَا ٱلۡبَابَ وَقَدَّتۡ قَمِیصَهُۥ مِن دُبُرࣲ وَأَلۡفَیَا سَیِّدَهَا لَدَا ٱلۡبَابِۚ قَالَتۡ مَا جَزَاۤءُ مَنۡ أَرَادَ بِأَهۡلِكَ سُوۤءًا إِلَّاۤ أَن یُسۡجَنَ أَوۡ عَذَابٌ أَلِیمࣱ\n",
    "translations": {
      "en": "And they both rushed to the door; and she [grasped and] rent his tunic from behind-and [lo!] they met her lord at the door! Said she: \"What ought to be the punishment of one who had evil designs on [the virtue of] thy wife - [what] but imprisonment or a [yet more] grievous chastisement?\"",
      "ms": "Dan mereka berdua pun berkejaran ke pintu, serta perempuan itu mengoyakkan baju Yusuf dari belakang; lalu terserempaklah keduanya dengan suami perempuan itu di muka pintu. Tiba-tiba perempuan itu berkata (kepada suaminya): Tidak ada balasan bagi orang yang mahu membuat jahat terhadap isterimu melainkan dipenjarakan dia atau dikenakan azab yang menyiksanya\".",
      "id": "Dan keduanya berlomba-lomba menuju pintu dan wanita itu menarik baju gamis Yusuf dari belakang hingga koyak dan kedua-duanya mendapati suami wanita itu di muka pintu. Wanita itu berkata: \"Apakah pembalasan terhadap orang yang bermaksud berbuat serong dengan isterimu, selain dipenjarakan atau (dihukum) dengan azab yang pedih?\"",
      "ar": "وَٱسۡتَبَقَا ٱلۡبَابَ وَقَدَّتۡ قَمِیصَهُۥ مِن دُبُرࣲ وَأَلۡفَیَا سَیِّدَهَا لَدَا ٱلۡبَابِۚ قَالَتۡ مَا جَزَاۤءُ مَنۡ أَرَادَ بِأَهۡلِكَ سُوۤءًا إِلَّاۤ أَن یُسۡجَنَ أَوۡ عَذَابٌ أَلِیمࣱ\n"
    }
  },
  {
    "id": 1622,
    "surahId": 12,
    "ayahNumber": 26,
    "arabicText": "قَالَ هِیَ رَ ٰ⁠وَدَتۡنِی عَن نَّفۡسِیۚ وَشَهِدَ شَاهِدࣱ مِّنۡ أَهۡلِهَاۤ إِن كَانَ قَمِیصُهُۥ قُدَّ مِن قُبُلࣲ فَصَدَقَتۡ وَهُوَ مِنَ ٱلۡكَـٰذِبِینَ\n",
    "translations": {
      "en": "[Joseph] exclaimed: \"It was she who sought to make me yield myself unto her!\" Now one of those present, a member of her own household, suggested this: If his tunic has been torn from the front, then she is telling the truth, and he is a liar;",
      "ms": "Yusuf pula berkata: \"Dia lah yang memujukku berkehendakkan diriku\". (Suaminya tercengang mendengarnya) dan seorang dari keluarga perempuan itu (yang ada bersama-sama) tampil memberi pendapatnya dengan berkata:\" \"Jika baju Yusuf koyak dari depan maka benarlah tuduhan perempuan itu, dan menjadilah Yusuf dari orang-orang yang dusta.",
      "id": "Yusuf berkata: \"Dia menggodaku untuk menundukkan diriku (kepadanya)\", dan seorang saksi dari keluarga wanita itu memberikan kesaksiannya: \"Jika baju gamisnya koyak di muka, maka wanita itu benar dan Yusuf termasuk orang-orang yang dusta.",
      "ar": "قَالَ هِیَ رَ ٰ⁠وَدَتۡنِی عَن نَّفۡسِیۚ وَشَهِدَ شَاهِدࣱ مِّنۡ أَهۡلِهَاۤ إِن كَانَ قَمِیصُهُۥ قُدَّ مِن قُبُلࣲ فَصَدَقَتۡ وَهُوَ مِنَ ٱلۡكَـٰذِبِینَ\n"
    }
  },
  {
    "id": 1623,
    "surahId": 12,
    "ayahNumber": 27,
    "arabicText": "وَإِن كَانَ قَمِیصُهُۥ قُدَّ مِن دُبُرࣲ فَكَذَبَتۡ وَهُوَ مِنَ ٱلصَّـٰدِقِینَ\n",
    "translations": {
      "en": "but if his tunic has been torn from behind, then she is lying, and he is speaking the truth.\"",
      "ms": "Dan jika bajunya koyak dari belakang, maka dustalah perempuan itu, dan Yusuf adalah dari orang-orang yang benar\".",
      "id": "Dan jika baju gamisnya koyak di belakang, maka wanita itulah yang dusta, dan Yusuf termasuk orang-orang yang benar\".",
      "ar": "وَإِن كَانَ قَمِیصُهُۥ قُدَّ مِن دُبُرࣲ فَكَذَبَتۡ وَهُوَ مِنَ ٱلصَّـٰدِقِینَ\n"
    }
  },
  {
    "id": 1624,
    "surahId": 12,
    "ayahNumber": 28,
    "arabicText": "فَلَمَّا رَءَا قَمِیصَهُۥ قُدَّ مِن دُبُرࣲ قَالَ إِنَّهُۥ مِن كَیۡدِكُنَّۖ إِنَّ كَیۡدَكُنَّ عَظِیمࣱ\n",
    "translations": {
      "en": "And when (her husband] saw that his tunic was torn from behind, he said: \"Behold, this is [an instance] of your guile, O womankind! Verily, awesome is your guile!",
      "ms": "Setelah suaminya melihat baju Yusuf koyak dari belakang, berkatalah ia: \"Sesungguhnya ini adalah dari tipu daya kamu orang-orang perempuan; sesungguhnya tipu daya kamu amatlah besar pengaruhnya.",
      "id": "Maka tatkala suami wanita itu melihat baju gamis Yusuf koyak di belakang berkatalah dia: \"Sesungguhnya (kejadian) itu adalah diantara tipu daya kamu, sesungguhnya tipu daya kamu adalah besar\".",
      "ar": "فَلَمَّا رَءَا قَمِیصَهُۥ قُدَّ مِن دُبُرࣲ قَالَ إِنَّهُۥ مِن كَیۡدِكُنَّۖ إِنَّ كَیۡدَكُنَّ عَظِیمࣱ\n"
    }
  },
  {
    "id": 1625,
    "surahId": 12,
    "ayahNumber": 29,
    "arabicText": "یُوسُفُ أَعۡرِضۡ عَنۡ هَـٰذَاۚ وَٱسۡتَغۡفِرِی لِذَنۢبِكِۖ إِنَّكِ كُنتِ مِنَ ٱلۡخَاطِـِٔینَ\n",
    "translations": {
      "en": "[But,] Joseph, let this pass! And thou, [O wife,] ask forgiveness for thy sin-for, verily, thou hast been greatly at fault!\"",
      "ms": "Wahai Yusuf, lupakanlah hal ini. Dan engkau (Wahai Zulaikha), mintalah ampun bagi dosamu, sesungguhnya engkau adalah dari orang-orang yang bersalah!\"",
      "id": "(Hai) Yusuf: \"Berpalinglah dari ini, dan (kamu hai isteriku) mohon ampunlah atas dosamu itu, karena kamu sesungguhnya termasuk orang-orang yang berbuat salah\".",
      "ar": "یُوسُفُ أَعۡرِضۡ عَنۡ هَـٰذَاۚ وَٱسۡتَغۡفِرِی لِذَنۢبِكِۖ إِنَّكِ كُنتِ مِنَ ٱلۡخَاطِـِٔینَ\n"
    }
  },
  {
    "id": 1626,
    "surahId": 12,
    "ayahNumber": 30,
    "arabicText": "۞ وَقَالَ نِسۡوَةࣱ فِی ٱلۡمَدِینَةِ ٱمۡرَأَتُ ٱلۡعَزِیزِ تُرَ ٰ⁠وِدُ فَتَىٰهَا عَن نَّفۡسِهِۦۖ قَدۡ شَغَفَهَا حُبًّاۖ إِنَّا لَنَرَىٰهَا فِی ضَلَـٰلࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "NOW the women of the city spoke [thus to one another]: \"The wife of this nobleman is trying to induce her slave-boy to yield himself unto her! Her love for him has pierced her heart; verily, we see that she is undoubtedly suffering from an aberration!",
      "ms": "Dan (sesudah itu) perempuan-perempuan di bandar Mesir (mencaci hal Zulaikha dengan) berkata: Isteri Al-Aziz itu memujuk hambanya (Yusuf) berkehendakkan dirinya, sesungguhnya cintanya (kepada Yusuf) itu sudahlah meresap ke dalam lipatan hatinya; sesungguhnya kami memandangnya berada dalam kesesatan yang nyata.\"",
      "id": "Dan wanita-wanita di kota berkata: \"Isteri Al Aziz menggoda bujangnya untuk menundukkan dirinya (kepadanya), sesungguhnya cintanya kepada bujangnya itu adalah sangat mendalam. Sesungguhnya kami memandangnya dalam kesesatan yang nyata\".",
      "ar": "۞ وَقَالَ نِسۡوَةࣱ فِی ٱلۡمَدِینَةِ ٱمۡرَأَتُ ٱلۡعَزِیزِ تُرَ ٰ⁠وِدُ فَتَىٰهَا عَن نَّفۡسِهِۦۖ قَدۡ شَغَفَهَا حُبًّاۖ إِنَّا لَنَرَىٰهَا فِی ضَلَـٰلࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 1627,
    "surahId": 12,
    "ayahNumber": 31,
    "arabicText": "فَلَمَّا سَمِعَتۡ بِمَكۡرِهِنَّ أَرۡسَلَتۡ إِلَیۡهِنَّ وَأَعۡتَدَتۡ لَهُنَّ مُتَّكَـࣰٔا وَءَاتَتۡ كُلَّ وَ ٰ⁠حِدَةࣲ مِّنۡهُنَّ سِكِّینࣰا وَقَالَتِ ٱخۡرُجۡ عَلَیۡهِنَّۖ فَلَمَّا رَأَیۡنَهُۥۤ أَكۡبَرۡنَهُۥ وَقَطَّعۡنَ أَیۡدِیَهُنَّ وَقُلۡنَ حَـٰشَ لِلَّهِ مَا هَـٰذَا بَشَرًا إِنۡ هَـٰذَاۤ إِلَّا مَلَكࣱ كَرِیمࣱ\n",
    "translations": {
      "en": "Thereupon, when she heard of their malicious talk, she sent for them, and prepared for them a sumptuous repast, and handed each of them a knife and said [to Joseph]: \"Come out and show thyself to them!\" And when the women saw him, they were greatly amazed at his beauty, and [so flustered were they that] they cut their hands [with their knives], exclaiming, \"God save us! This is no mortal man! This is nought but a noble angel!\"",
      "ms": "Maka apabila ia (Zulaikha) mendengar cacian mereka, dia pun menjemput mereka dan menyediakan satu jamuan untuk mereka, serta memberi kepada - tiap seorang di antara mereka sebilah pisau. Dan pada ketika itu berkatalah ia (kepada Yusuf): \"Keluarlah di hadapan mereka\". Maka ketika mereka melihatnya, mereka tercengang melihat kecantikan parasnya, dan mereka dengan tidak sedar melukakan tangan mereka sambil berkata: \"Jauhnya Allah dari kekurangan! Ini bukanlah seorang manusia, ini tidak lain melainkan malaikat yang mulia!\"",
      "id": "Maka tatkala wanita itu (Zulaikha) mendengar cercaan mereka, diundangnyalah wanita-wanita itu dan disediakannya bagi mereka tempat duduk, dan diberikannya kepada masing-masing mereka sebuah pisau (untuk memotong jamuan), kemudian dia berkata (kepada Yusuf): \"Keluarlah (nampakkanlah dirimu) kepada mereka\". Maka tatkala wanita-wanita itu melihatnya, mereka kagum kepada (keelokan rupa)nya, dan mereka melukai (jari) tangannya dan berkata: \"Maha sempurna Allah, ini bukanlah manusia. Sesungguhnya ini tidak lain hanyalah malaikat yang mulia\".",
      "ar": "فَلَمَّا سَمِعَتۡ بِمَكۡرِهِنَّ أَرۡسَلَتۡ إِلَیۡهِنَّ وَأَعۡتَدَتۡ لَهُنَّ مُتَّكَـࣰٔا وَءَاتَتۡ كُلَّ وَ ٰ⁠حِدَةࣲ مِّنۡهُنَّ سِكِّینࣰا وَقَالَتِ ٱخۡرُجۡ عَلَیۡهِنَّۖ فَلَمَّا رَأَیۡنَهُۥۤ أَكۡبَرۡنَهُۥ وَقَطَّعۡنَ أَیۡدِیَهُنَّ وَقُلۡنَ حَـٰشَ لِلَّهِ مَا هَـٰذَا بَشَرًا إِنۡ هَـٰذَاۤ إِلَّا مَلَكࣱ كَرِیمࣱ\n"
    }
  },
  {
    "id": 1628,
    "surahId": 12,
    "ayahNumber": 32,
    "arabicText": "قَالَتۡ فَذَ ٰ⁠لِكُنَّ ٱلَّذِی لُمۡتُنَّنِی فِیهِۖ وَلَقَدۡ رَ ٰ⁠وَدتُّهُۥ عَن نَّفۡسِهِۦ فَٱسۡتَعۡصَمَۖ وَلَىِٕن لَّمۡ یَفۡعَلۡ مَاۤ ءَامُرُهُۥ لَیُسۡجَنَنَّ وَلَیَكُونࣰا مِّنَ ٱلصَّـٰغِرِینَ\n",
    "translations": {
      "en": "Said she: \"This, then, is he about whom you have been blaming me! And, indeed, I did try to make him yield himself unto me, but he remained chaste. Now, however, if he does not do what I bid him, he shall most certainly be imprisoned, and shall most certainly find himself among the despised!",
      "ms": "(Zulaikha) berkata: \"Inilah orangnya yang kamu tempelak aku mengenainya! Sebenarnya aku telah memujuknya berkehendakkan dirinya tetapi ia menolak dan berpegang teguh kepada kesuciannya; dan demi sesungguhnya kalau ia tidak mahu melakukan apa yang aku suruh tentulah ia akan dipenjarakan, dan akan menjadi dari orang-orang yang hina.\"",
      "id": "Wanita itu berkata: \"Itulah dia orang yang kamu cela aku karena (tertarik) kepadanya, dan sesungguhnya aku telah menggoda dia untuk menundukkan dirinya (kepadaku) akan tetapi dia menolak. Dan sesungguhnya jika dia tidak mentaati apa yang aku perintahkan kepadanya, niscaya dia akan dipenjarakan dan dia akan termasuk golongan orang-orang yang hina\".",
      "ar": "قَالَتۡ فَذَ ٰ⁠لِكُنَّ ٱلَّذِی لُمۡتُنَّنِی فِیهِۖ وَلَقَدۡ رَ ٰ⁠وَدتُّهُۥ عَن نَّفۡسِهِۦ فَٱسۡتَعۡصَمَۖ وَلَىِٕن لَّمۡ یَفۡعَلۡ مَاۤ ءَامُرُهُۥ لَیُسۡجَنَنَّ وَلَیَكُونࣰا مِّنَ ٱلصَّـٰغِرِینَ\n"
    }
  },
  {
    "id": 1629,
    "surahId": 12,
    "ayahNumber": 33,
    "arabicText": "قَالَ رَبِّ ٱلسِّجۡنُ أَحَبُّ إِلَیَّ مِمَّا یَدۡعُونَنِیۤ إِلَیۡهِۖ وَإِلَّا تَصۡرِفۡ عَنِّی كَیۡدَهُنَّ أَصۡبُ إِلَیۡهِنَّ وَأَكُن مِّنَ ٱلۡجَـٰهِلِینَ\n",
    "translations": {
      "en": "Said he: \"O my Sustainer! Prison is more desirable to me than [compliance with] what these women invite me to: for, unless Thou turn away their guile from me, I might yet yield to their allure and become one of those who are unaware [of right and wrong].\"",
      "ms": "Yusuf (merayu kehadrat Allah Taala dengan) berkata: \"Wahai Tuhanku! Aku lebih suka kepada penjara dari apa yang perempuan-perempuan itu ajak aku kepadanya. Dan jika Engkau tidak menjauhkan daripadaku tipu daya mereka, mungkin aku akan cenderung kepada mereka, dan aku menjadi dari orang-orang yang tidak mengamalkan ilmunya\".",
      "id": "Yusuf berkata: \"Wahai Tuhanku, penjara lebih aku sukai daripada memenuhi ajakan mereka kepadaku. Dan jika tidak Engkau hindarkan dari padaku tipu daya mereka, tentu aku akan cenderung untuk (memenuhi keinginan mereka) dan tentulah aku termasuk orang-orang yang bodoh\".",
      "ar": "قَالَ رَبِّ ٱلسِّجۡنُ أَحَبُّ إِلَیَّ مِمَّا یَدۡعُونَنِیۤ إِلَیۡهِۖ وَإِلَّا تَصۡرِفۡ عَنِّی كَیۡدَهُنَّ أَصۡبُ إِلَیۡهِنَّ وَأَكُن مِّنَ ٱلۡجَـٰهِلِینَ\n"
    }
  },
  {
    "id": 1630,
    "surahId": 12,
    "ayahNumber": 34,
    "arabicText": "فَٱسۡتَجَابَ لَهُۥ رَبُّهُۥ فَصَرَفَ عَنۡهُ كَیۡدَهُنَّۚ إِنَّهُۥ هُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n",
    "translations": {
      "en": "And his Sustainer responded to his prayer, and freed him from the threat of their guile: verily, He alone is all-hearing, all-knowing.",
      "ms": "Maka Tuhannya memperkenankan doanya, lalu dijauhkan daripadanya tipu daya mereka; sesungguhnya Allah jualah yang Maha Mendengar, lagi Maha Mengetahui.",
      "id": "Maka Tuhannya memperkenankan doa Yusuf dan Dia menghindarkan Yusuf dari tipu daya mereka. Sesungguhnya Dialah Yang Maha Mendengar lagi Maha Mengetahui.",
      "ar": "فَٱسۡتَجَابَ لَهُۥ رَبُّهُۥ فَصَرَفَ عَنۡهُ كَیۡدَهُنَّۚ إِنَّهُۥ هُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n"
    }
  },
  {
    "id": 1631,
    "surahId": 12,
    "ayahNumber": 35,
    "arabicText": "ثُمَّ بَدَا لَهُم مِّنۢ بَعۡدِ مَا رَأَوُا۟ ٱلۡـَٔایَـٰتِ لَیَسۡجُنُنَّهُۥ حَتَّىٰ حِینࣲ\n",
    "translations": {
      "en": "For, presently it occurred to the nobleman and his household _ [even] after they had seen all the signs [of Joseph's innocence] - that they might as well imprison him for a time.",
      "ms": "Kemudian timbul fikiran bagi suami perempuan itu, serta orang-orangnya hendak memenjarakan Yusuf sesudah mereka nampak tanda-tanda (yang menghendaki supaya Yusuf dijauhkan) hingga ke suatu masa.",
      "id": "Kemudian timbul pikiran pada mereka setelah melihat tanda-tanda (kebenaran Yusuf) bahwa mereka harus memenjarakannya sampai sesuatu waktu.",
      "ar": "ثُمَّ بَدَا لَهُم مِّنۢ بَعۡدِ مَا رَأَوُا۟ ٱلۡـَٔایَـٰتِ لَیَسۡجُنُنَّهُۥ حَتَّىٰ حِینࣲ\n"
    }
  },
  {
    "id": 1632,
    "surahId": 12,
    "ayahNumber": 36,
    "arabicText": "وَدَخَلَ مَعَهُ ٱلسِّجۡنَ فَتَیَانِۖ قَالَ أَحَدُهُمَاۤ إِنِّیۤ أَرَىٰنِیۤ أَعۡصِرُ خَمۡرࣰاۖ وَقَالَ ٱلۡـَٔاخَرُ إِنِّیۤ أَرَىٰنِیۤ أَحۡمِلُ فَوۡقَ رَأۡسِی خُبۡزࣰا تَأۡكُلُ ٱلطَّیۡرُ مِنۡهُۖ نَبِّئۡنَا بِتَأۡوِیلِهِۦۤۖ إِنَّا نَرَىٰكَ مِنَ ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "NOW two young men happened to go to prison at the same time as Joseph. One of them said: \"Behold, I saw myself [in a dream] pressing wine.\" And the other said: \"Behold, I saw myself [in a dream] carrying bread on my head, and birds were eating thereof.\" [And both entreated Joseph:] \"Let us know the real meaning of this! Verily, we see that thou art one of those who know well [how to interpret dreams].",
      "ms": "Dan masuklah bersama-samanya ke penjara dua orang khadam raja. Salah seorang di antaranya (bertanya kepada Yusuf dengan) berkata: \"Sesungguhnya aku bermimpi melihat diriku memerah anggur \". Dan berkata pula yang seorang lagi: \"Sesungguhnya aku bermimpi melihat diriku menjunjung roti atas kepalaku, yang sebahagiannya dimakan oleh burung.\" (kemudian keduanya berkata): \"Terangkanlah kepada kami akan takbirnya. Sesungguhnya kami memandangmu: dari orang-orang yang berbuat kebaikan (untuk umum)\".",
      "id": "Dan bersama dengan dia masuk pula ke dalam penjara dua orang pemuda. Berkatalah salah seorang diantara keduanya: \"Sesungguhnya aku bermimpi, bahwa aku memeras anggur\". Dan yang lainnya berkata: \"Sesungguhnya aku bermimpi, bahwa aku membawa roti di atas kepalaku, sebahagiannya dimakan burung\". Berikanlah kepada kami ta'birnya; sesungguhnya kami memandang kamu termasuk orang-orang yang pandai (mena'birkan mimpi).",
      "ar": "وَدَخَلَ مَعَهُ ٱلسِّجۡنَ فَتَیَانِۖ قَالَ أَحَدُهُمَاۤ إِنِّیۤ أَرَىٰنِیۤ أَعۡصِرُ خَمۡرࣰاۖ وَقَالَ ٱلۡـَٔاخَرُ إِنِّیۤ أَرَىٰنِیۤ أَحۡمِلُ فَوۡقَ رَأۡسِی خُبۡزࣰا تَأۡكُلُ ٱلطَّیۡرُ مِنۡهُۖ نَبِّئۡنَا بِتَأۡوِیلِهِۦۤۖ إِنَّا نَرَىٰكَ مِنَ ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 1633,
    "surahId": 12,
    "ayahNumber": 37,
    "arabicText": "قَالَ لَا یَأۡتِیكُمَا طَعَامࣱ تُرۡزَقَانِهِۦۤ إِلَّا نَبَّأۡتُكُمَا بِتَأۡوِیلِهِۦ قَبۡلَ أَن یَأۡتِیَكُمَاۚ ذَ ٰ⁠لِكُمَا مِمَّا عَلَّمَنِی رَبِّیۤۚ إِنِّی تَرَكۡتُ مِلَّةَ قَوۡمࣲ لَّا یُؤۡمِنُونَ بِٱللَّهِ وَهُم بِٱلۡـَٔاخِرَةِ هُمۡ كَـٰفِرُونَ\n",
    "translations": {
      "en": "[Joseph] answered: \"Ere there comes unto you the meal which you are [daily] fed, I shall have informed you of the real meaning of your dreams, [so that you might know what is to come] before it comes unto you: for this is [part] of the knowledge which my Sustainer has imparted to me. \"Behold, I have left behind me the ways of people who do not believe in God, and who persistently refuse to acknowledge the truth of the life to come;",
      "ms": "Yusuf menjawab: \"(Aku bukan sahaja dapat menerangkan takbir mimpi kamu itu, bahkan) tidak datang kepada kamu sesuatu makanan yang diberikan kepada kamu (tiap-tiap hari dalam penjara), melainkan aku juga dapat memberitahu kepada kamu akan nama dan jenisnya, sebelum ia dibawa kepada kamu. Yang demikian itu ialah sebahagian dari apa yang diajarkan kepadaku oleh Tuhanku. Dengan sebab itu aku meninggalkan ugama kaum yang tidak beriman kepada Allah serta tidak pula percayakan hari akhirat.",
      "id": "Yusuf berkata: \"Tidak disampaikan kepada kamu berdua makanan yang akan diberikan kepadamu melainkan aku telah dapat menerangkan jenis makanan itu, sebelum makanan itu sampai kepadamu. Yang demikian itu adalah sebagian dari apa yang diajarkan kepadaku oleh Tuhanku. Sesungguhnya aku telah meninggalkan agama orang-orang yang tidak beriman kepada Allah, sedang mereka ingkar kepada hari kemudian.",
      "ar": "قَالَ لَا یَأۡتِیكُمَا طَعَامࣱ تُرۡزَقَانِهِۦۤ إِلَّا نَبَّأۡتُكُمَا بِتَأۡوِیلِهِۦ قَبۡلَ أَن یَأۡتِیَكُمَاۚ ذَ ٰ⁠لِكُمَا مِمَّا عَلَّمَنِی رَبِّیۤۚ إِنِّی تَرَكۡتُ مِلَّةَ قَوۡمࣲ لَّا یُؤۡمِنُونَ بِٱللَّهِ وَهُم بِٱلۡـَٔاخِرَةِ هُمۡ كَـٰفِرُونَ\n"
    }
  },
  {
    "id": 1634,
    "surahId": 12,
    "ayahNumber": 38,
    "arabicText": "وَٱتَّبَعۡتُ مِلَّةَ ءَابَاۤءِیۤ إِبۡرَ ٰ⁠هِیمَ وَإِسۡحَـٰقَ وَیَعۡقُوبَۚ مَا كَانَ لَنَاۤ أَن نُّشۡرِكَ بِٱللَّهِ مِن شَیۡءࣲۚ ذَ ٰ⁠لِكَ مِن فَضۡلِ ٱللَّهِ عَلَیۡنَا وَعَلَى ٱلنَّاسِ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَشۡكُرُونَ\n",
    "translations": {
      "en": "and I follow the creed of my forefathers Abraham, Isaac and Jacob. It is not conceivable that we should [be allowed to] ascribe divinity to aught beside God: this is [an outcome] of God's bounty unto us and unto all mankind -but most people are ungrateful.",
      "ms": "\"Dan aku menurut ugama bapa dan datuk nenekku: Ibrahim dan Ishak serta Yaakub. Tidaklah sepatutnya kita mempersekutukan sesuatupun dengan Allah. Mentauhid - mengesakan Allah ialah hasil dari limpah kurnia Allah kepada kita dan kepada umat manusia. Tetapi kebanyakan manusia tidak bersyukur.",
      "id": "Dan aku pengikut agama bapak-bapakku yaitu Ibrahim, Ishak dan Ya'qub. Tiadalah patut bagi kami (para Nabi) mempersekutukan sesuatu apapun dengan Allah. Yang demikian itu adalah dari karunia Allah kepada kami dan kepada manusia (seluruhnya); tetapi kebanyakan manusia tidak mensyukuri (Nya).",
      "ar": "وَٱتَّبَعۡتُ مِلَّةَ ءَابَاۤءِیۤ إِبۡرَ ٰ⁠هِیمَ وَإِسۡحَـٰقَ وَیَعۡقُوبَۚ مَا كَانَ لَنَاۤ أَن نُّشۡرِكَ بِٱللَّهِ مِن شَیۡءࣲۚ ذَ ٰ⁠لِكَ مِن فَضۡلِ ٱللَّهِ عَلَیۡنَا وَعَلَى ٱلنَّاسِ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَشۡكُرُونَ\n"
    }
  },
  {
    "id": 1635,
    "surahId": 12,
    "ayahNumber": 39,
    "arabicText": "یَـٰصَـٰحِبَیِ ٱلسِّجۡنِ ءَأَرۡبَابࣱ مُّتَفَرِّقُونَ خَیۡرٌ أَمِ ٱللَّهُ ٱلۡوَ ٰ⁠حِدُ ٱلۡقَهَّارُ\n",
    "translations": {
      "en": "\"O my companions in imprisonment! Which is more reasonable: [belief in the existence of numerous divine] lords, each of them different from the other\" -or [in] the One God, who holds absolute sway over all that exists?",
      "ms": "\"Wahai sahabatku berdua yang sepenjara, memuja dan menyembah berbilang-bilang tuhan yang bercerai-berai itukah yang lebih baik atau menyembah Allah Tuhan Yang Maha Esa, lagi Maha Kuasa?",
      "id": "Hai kedua penghuni penjara, manakah yang baik, tuhan-tuhan yang bermacam-macam itu ataukah Allah Yang Maha Esa lagi Maha Perkasa?",
      "ar": "یَـٰصَـٰحِبَیِ ٱلسِّجۡنِ ءَأَرۡبَابࣱ مُّتَفَرِّقُونَ خَیۡرٌ أَمِ ٱللَّهُ ٱلۡوَ ٰ⁠حِدُ ٱلۡقَهَّارُ\n"
    }
  },
  {
    "id": 1636,
    "surahId": 12,
    "ayahNumber": 40,
    "arabicText": "مَا تَعۡبُدُونَ مِن دُونِهِۦۤ إِلَّاۤ أَسۡمَاۤءࣰ سَمَّیۡتُمُوهَاۤ أَنتُمۡ وَءَابَاۤؤُكُم مَّاۤ أَنزَلَ ٱللَّهُ بِهَا مِن سُلۡطَـٰنٍۚ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِ أَمَرَ أَلَّا تَعۡبُدُوۤا۟ إِلَّاۤ إِیَّاهُۚ ذَ ٰ⁠لِكَ ٱلدِّینُ ٱلۡقَیِّمُ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "\"All that you worship instead of God is nothing but [empty] names which you have invented - you and your forefathers- [and] for which God has bestowed no warrant from on high. Judgment [as to what is right and what is wrong] rests with God alone-[and] He has ordained that you should worship nought but Him: this is the [one] ever-true faith; but most people know it not",
      "ms": "Apa yang kamu sembah, yang lain dari Allah, hanyalah nama-nama yang kamu menamakannya, kamu dan datuk nenek kamu, Allah tidak pernah menurunkan sebarang bukti yang membenarkannya. Sebenarnya hukum (yang menentukan amal ibadat) hanyalah bagi Allah. Ia memerintahkan supaya kamu jangan menyembah melainkan Dia. Yang demikian itulah Ugama yang betul, tetapi kebanyakan manusia tidak mengetahui.",
      "id": "Kamu tidak menyembah yang selain Allah kecuali hanya (menyembah) nama-nama yang kamu dan nenek moyangmu membuat-buatnya. Allah tidak menurunkan suatu keteranganpun tentang nama-nama itu. Keputusan itu hanyalah kepunyaan Allah. Dia telah memerintahkan agar kamu tidak menyembah selain Dia. Itulah agama yang lurus, tetapi kebanyakan manusia tidak mengetahui\".",
      "ar": "مَا تَعۡبُدُونَ مِن دُونِهِۦۤ إِلَّاۤ أَسۡمَاۤءࣰ سَمَّیۡتُمُوهَاۤ أَنتُمۡ وَءَابَاۤؤُكُم مَّاۤ أَنزَلَ ٱللَّهُ بِهَا مِن سُلۡطَـٰنٍۚ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِ أَمَرَ أَلَّا تَعۡبُدُوۤا۟ إِلَّاۤ إِیَّاهُۚ ذَ ٰ⁠لِكَ ٱلدِّینُ ٱلۡقَیِّمُ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1637,
    "surahId": 12,
    "ayahNumber": 41,
    "arabicText": "یَـٰصَـٰحِبَیِ ٱلسِّجۡنِ أَمَّاۤ أَحَدُكُمَا فَیَسۡقِی رَبَّهُۥ خَمۡرࣰاۖ وَأَمَّا ٱلۡـَٔاخَرُ فَیُصۡلَبُ فَتَأۡكُلُ ٱلطَّیۡرُ مِن رَّأۡسِهِۦۚ قُضِیَ ٱلۡأَمۡرُ ٱلَّذِی فِیهِ تَسۡتَفۡتِیَانِ\n",
    "translations": {
      "en": "\"[And now,] O my companions in imprisonment, [I shall tell you the meaning of your dreams:] as for one of you two, he will [again] give his lord [the King] wine to drink; but as for the other, he will be crucified, and birds will eat off his head. [But whatever be your future,] the matter on which you have asked me to enlighten you has been decided [by God].\"",
      "ms": "\"Wahai sahabatku berdua yang sepenjara! (Takbir mimpi kamu itu ialah): adapun salah seorang dari kamu, maka ia akan memberi minum arak kepada tuannya. Ada pun yang seorang lagi, maka ia akan dipalang, serta burung pula akan makan dari kepalanya. Telah selesailah (dan tetaplah berlakunya) perkara yang kamu tanyakan itu\".",
      "id": "Hai kedua penghuni penjara: \"Adapun salah seorang diantara kamu berdua, akan memberi minuman tuannya dengan khamar; adapun yang seorang lagi maka ia akan disalib, lalu burung memakan sebagian dari kepalanya. Telah diputuskan perkara yang kamu berdua menanyakannya (kepadaku)\".",
      "ar": "یَـٰصَـٰحِبَیِ ٱلسِّجۡنِ أَمَّاۤ أَحَدُكُمَا فَیَسۡقِی رَبَّهُۥ خَمۡرࣰاۖ وَأَمَّا ٱلۡـَٔاخَرُ فَیُصۡلَبُ فَتَأۡكُلُ ٱلطَّیۡرُ مِن رَّأۡسِهِۦۚ قُضِیَ ٱلۡأَمۡرُ ٱلَّذِی فِیهِ تَسۡتَفۡتِیَانِ\n"
    }
  },
  {
    "id": 1638,
    "surahId": 12,
    "ayahNumber": 42,
    "arabicText": "وَقَالَ لِلَّذِی ظَنَّ أَنَّهُۥ نَاجࣲ مِّنۡهُمَا ٱذۡكُرۡنِی عِندَ رَبِّكَ فَأَنسَىٰهُ ٱلشَّیۡطَـٰنُ ذِكۡرَ رَبِّهِۦ فَلَبِثَ فِی ٱلسِّجۡنِ بِضۡعَ سِنِینَ\n",
    "translations": {
      "en": "And [thereupon Joseph] said unto the one of the two whom he considered saved: \"Mention me unto thy lord [when thou art free]!\" But Satan caused him to forget to mention [Joseph] to his lord, and so he remained in prison a few [more] years.",
      "ms": "Dan berkatalah Yusuf kepada orang yang ia percaya akan terselamat di antara mereka berdua: \"Sebutkanlah perihalku kepada tuanmu\". (Setelah orang itu dibebaskan dari penjara) maka ia dilupakan oleh syaitan untuk menyebutkan (hal Yusuf) kepada tuannya. Dengan sebab itu tinggalah Yusuf dalam penjara beberapa tahun.",
      "id": "Dan Yusuf berkata kepada orang yang diketahuinya akan selamat diantara mereka berdua: \"Terangkanlah keadaanku kepada tuanmu\". Maka syaitan menjadikan dia lupa menerangkan (keadaan Yusuf) kepada tuannya. Karena itu tetaplah dia (Yusuf) dalam penjara beberapa tahun lamanya.",
      "ar": "وَقَالَ لِلَّذِی ظَنَّ أَنَّهُۥ نَاجࣲ مِّنۡهُمَا ٱذۡكُرۡنِی عِندَ رَبِّكَ فَأَنسَىٰهُ ٱلشَّیۡطَـٰنُ ذِكۡرَ رَبِّهِۦ فَلَبِثَ فِی ٱلسِّجۡنِ بِضۡعَ سِنِینَ\n"
    }
  },
  {
    "id": 1639,
    "surahId": 12,
    "ayahNumber": 43,
    "arabicText": "وَقَالَ ٱلۡمَلِكُ إِنِّیۤ أَرَىٰ سَبۡعَ بَقَرَ ٰ⁠تࣲ سِمَانࣲ یَأۡكُلُهُنَّ سَبۡعٌ عِجَافࣱ وَسَبۡعَ سُنۢبُلَـٰتٍ خُضۡرࣲ وَأُخَرَ یَابِسَـٰتࣲۖ یَـٰۤأَیُّهَا ٱلۡمَلَأُ أَفۡتُونِی فِی رُءۡیَـٰیَ إِن كُنتُمۡ لِلرُّءۡیَا تَعۡبُرُونَ\n",
    "translations": {
      "en": "AND [one day] the King said: Behold, I saw [in a dream] seven fat cows being devoured by seven emaciated ones, and seven green ears [of wheat] next to [seven] others that were withered. O you nobles! Enlighten me about [the meaning of] my dream, if you are able to interpret dreams!\"",
      "ms": "Dan (pada suatu hari) raja Mesir berkata: \"Sesungguhnya aku mimpi melihat: tujuh ekor lembu yang gemuk dimakan oleh tujuh ekor lembu yang kurus, dan aku melihat tujuh tangkai (biji-bijian) yang hijau dan tujuh tangkai lagi yang kering. Wahai ketua-ketua kaum (yang hadir, terangkanlah kepadaku tentang mimpiku ini, kalau kamu orang yang pandai menafsirkan mimpi\".",
      "id": "Raja berkata (kepada orang-orang terkemuka dari kaumnya): \"Sesungguhnya aku bermimpi melihat tujuh ekor sapi betina yang gemuk-gemuk dimakan oleh tujuh ekor sapi betina yang kurus-kurus dan tujuh bulir (gandum) yang hijau dan tujuh bulir lainnya yang kering\". Hai orang-orang yang terkemuka: \"Terangkanlah kepadaku tentang ta'bir mimpiku itu jika kamu dapat mena'birkan mimpi\".",
      "ar": "وَقَالَ ٱلۡمَلِكُ إِنِّیۤ أَرَىٰ سَبۡعَ بَقَرَ ٰ⁠تࣲ سِمَانࣲ یَأۡكُلُهُنَّ سَبۡعٌ عِجَافࣱ وَسَبۡعَ سُنۢبُلَـٰتٍ خُضۡرࣲ وَأُخَرَ یَابِسَـٰتࣲۖ یَـٰۤأَیُّهَا ٱلۡمَلَأُ أَفۡتُونِی فِی رُءۡیَـٰیَ إِن كُنتُمۡ لِلرُّءۡیَا تَعۡبُرُونَ\n"
    }
  },
  {
    "id": 1640,
    "surahId": 12,
    "ayahNumber": 44,
    "arabicText": "قَالُوۤا۟ أَضۡغَـٰثُ أَحۡلَـٰمࣲۖ وَمَا نَحۡنُ بِتَأۡوِیلِ ٱلۡأَحۡلَـٰمِ بِعَـٰلِمِینَ\n",
    "translations": {
      "en": "They answered: \" [This is one of] the most involved and confusing of dreams, and we have no deep knowledge of the real meaning of dreams.\"",
      "ms": "Mereka menjawab: \"Yang demikian itu ialah mimpi-mimpi yang bercampur aduk, dan kami bukanlah orang-orang yang mengetahui mimpi-mimpi (yang sedemikian) itu\".",
      "id": "Mereka menjawab: \"(Itu) adalah mimpi-mimpi yang kosong dan kami sekali-kali tidak tahu menta'birkan mimpi itu\".",
      "ar": "قَالُوۤا۟ أَضۡغَـٰثُ أَحۡلَـٰمࣲۖ وَمَا نَحۡنُ بِتَأۡوِیلِ ٱلۡأَحۡلَـٰمِ بِعَـٰلِمِینَ\n"
    }
  },
  {
    "id": 1641,
    "surahId": 12,
    "ayahNumber": 45,
    "arabicText": "وَقَالَ ٱلَّذِی نَجَا مِنۡهُمَا وَٱدَّكَرَ بَعۡدَ أُمَّةٍ أَنَا۠ أُنَبِّئُكُم بِتَأۡوِیلِهِۦ فَأَرۡسِلُونِ\n",
    "translations": {
      "en": "At that, the one of the two [erstwhile prisoners] who had been saved, and [who suddenly] remembered [Joseph] after all that time, spoke [thus]: \"It is I who can inform you of the real meaning of this [dream]; so let me go [in search of it].\"",
      "ms": "Dan (pada saat itu) berkatalah orang yang terselamat di antara mereka yang berdua itu, dan yang baharu mengingati (akan pesanan Yusuf) sesudah berlalu suatu masa yang lanjut: \"Aku akan memberi tahu kepada kamu tafsirannya. Oleh itu hantarkanlah daku pergi (kepada orang yang mengetahui tafsirannya) \".",
      "id": "Dan berkatalah orang yang selamat diantara mereka berdua dan teringat (kepada Yusuf) sesudah beberapa waktu lamanya: \"Aku akan memberitakan kepadamu tentang (orang yang pandai) mena'birkan mimpi itu, maka utuslah aku (kepadanya)\".",
      "ar": "وَقَالَ ٱلَّذِی نَجَا مِنۡهُمَا وَٱدَّكَرَ بَعۡدَ أُمَّةٍ أَنَا۠ أُنَبِّئُكُم بِتَأۡوِیلِهِۦ فَأَرۡسِلُونِ\n"
    }
  },
  {
    "id": 1642,
    "surahId": 12,
    "ayahNumber": 46,
    "arabicText": "یُوسُفُ أَیُّهَا ٱلصِّدِّیقُ أَفۡتِنَا فِی سَبۡعِ بَقَرَ ٰ⁠تࣲ سِمَانࣲ یَأۡكُلُهُنَّ سَبۡعٌ عِجَافࣱ وَسَبۡعِ سُنۢبُلَـٰتٍ خُضۡرࣲ وَأُخَرَ یَابِسَـٰتࣲ لَّعَلِّیۤ أَرۡجِعُ إِلَى ٱلنَّاسِ لَعَلَّهُمۡ یَعۡلَمُونَ\n",
    "translations": {
      "en": "[And he went to see Joseph in the prison and said to him:] \"Joseph, O thou truthful one! Enlighten us about [the meaning of a dream in which] seven fat cows were being devoured by seven emaciated ones, and seven green ears [of wheat appeared] next to [seven] others that were withered - so that I may return [with thy explanation] unto the people [of the court, and] that they may come to know [what manner of man thou art]!\"",
      "ms": "(Setelah ia berjumpa dengan Yusuf, berkatalah ia): \"Yusuf, Wahai orang yang benar (pada segala-galanya)! tafsirkanlah kepada kami (seorang bermimpi melihat): tujuh ekor lembu yang gemuk dimakan oleh tujuh ekor lembu yang kurus; dan tujuh tangkai (biji-bijian) yang hijau serta tujuh tangkai lagi yang kering; (tafsirkanlah) supaya aku kembali kepada orang-orang yang mengutusku itu, semoga mereka dapat mengetahui tafsirannya\".",
      "id": "(Setelah pelayan itu berjumpa dengan Yusuf dia berseru): \"Yusuf, hai orang yang amat dipercaya, terangkanlah kepada kami tentang tujuh ekor sapi betina yang gemuk-gemuk yang dimakan oleh tujuh ekor sapi betina yang kurus-kurus dan tujuh bulir (gandum) yang hijau dan (tujuh) lainnya yang kering agar aku kembali kepada orang-orang itu, agar mereka mengetahuinya\".",
      "ar": "یُوسُفُ أَیُّهَا ٱلصِّدِّیقُ أَفۡتِنَا فِی سَبۡعِ بَقَرَ ٰ⁠تࣲ سِمَانࣲ یَأۡكُلُهُنَّ سَبۡعٌ عِجَافࣱ وَسَبۡعِ سُنۢبُلَـٰتٍ خُضۡرࣲ وَأُخَرَ یَابِسَـٰتࣲ لَّعَلِّیۤ أَرۡجِعُ إِلَى ٱلنَّاسِ لَعَلَّهُمۡ یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1643,
    "surahId": 12,
    "ayahNumber": 47,
    "arabicText": "قَالَ تَزۡرَعُونَ سَبۡعَ سِنِینَ دَأَبࣰا فَمَا حَصَدتُّمۡ فَذَرُوهُ فِی سُنۢبُلِهِۦۤ إِلَّا قَلِیلࣰا مِّمَّا تَأۡكُلُونَ\n",
    "translations": {
      "en": "[Joseph] replied: \"You shall sow for seven years as usual; but let all [the grain] that you harvest remain [untouched] in its ear, excepting only a little, whereof you may eat:",
      "ms": "Yusuf menjawab: \"Hendaklah kamu menanam bersungguh-sungguh tujuh tahun berturut-turut, kemudian apa yang kamu ketam biarkanlah dia pada tangkai-tangkainya; kecuali sedikit dari bahagian yang kamu jadikan untuk makan.",
      "id": "Yusuf berkata: \"Supaya kamu bertanam tujuh tahun (lamanya) sebagaimana biasa; maka apa yang kamu tuai hendaklah kamu biarkan dibulirnya kecuali sedikit untuk kamu makan.",
      "ar": "قَالَ تَزۡرَعُونَ سَبۡعَ سِنِینَ دَأَبࣰا فَمَا حَصَدتُّمۡ فَذَرُوهُ فِی سُنۢبُلِهِۦۤ إِلَّا قَلِیلࣰا مِّمَّا تَأۡكُلُونَ\n"
    }
  },
  {
    "id": 1644,
    "surahId": 12,
    "ayahNumber": 48,
    "arabicText": "ثُمَّ یَأۡتِی مِنۢ بَعۡدِ ذَ ٰ⁠لِكَ سَبۡعࣱ شِدَادࣱ یَأۡكُلۡنَ مَا قَدَّمۡتُمۡ لَهُنَّ إِلَّا قَلِیلࣰا مِّمَّا تُحۡصِنُونَ\n",
    "translations": {
      "en": "for, after that [period of seven good years] there will come seven hard [years] which will devour all that you shall have laid up for them, excepting only a little of that which you shall have kept in store.",
      "ms": "Kemudian akan datang selepas tempoh itu, tujuh tahun kemaraun yang besar, yang akan menghabiskan makanan yang kamu sediakan baginya; kecuali sedikit dari apa yang kamu simpan (untuk dijadikan benih).",
      "id": "Kemudian sesudah itu akan datang tujuh tahun yang amat sulit, yang menghabiskan apa yang kamu simpan untuk menghadapinya (tahun sulit), kecuali sedikit dari (bibit gandum) yang kamu simpan.",
      "ar": "ثُمَّ یَأۡتِی مِنۢ بَعۡدِ ذَ ٰ⁠لِكَ سَبۡعࣱ شِدَادࣱ یَأۡكُلۡنَ مَا قَدَّمۡتُمۡ لَهُنَّ إِلَّا قَلِیلࣰا مِّمَّا تُحۡصِنُونَ\n"
    }
  },
  {
    "id": 1645,
    "surahId": 12,
    "ayahNumber": 49,
    "arabicText": "ثُمَّ یَأۡتِی مِنۢ بَعۡدِ ذَ ٰ⁠لِكَ عَامࣱ فِیهِ یُغَاثُ ٱلنَّاسُ وَفِیهِ یَعۡصِرُونَ\n",
    "translations": {
      "en": "And after that there will come a year in which the people will be delivered from all distress, and in which they will press [oil and wine as before].\"",
      "ms": "\"Kemudian akan datang pula sesudah itu tahun yang padanya orang ramai beroleh rahmat hujan, dan padanya mereka dapat memerah (hasil anggur, zaitun dan sebagainya)\".",
      "id": "Kemudian setelah itu akan datang tahun yang padanya manusia diberi hujan (dengan cukup) dan dimasa itu mereka memeras anggur\".",
      "ar": "ثُمَّ یَأۡتِی مِنۢ بَعۡدِ ذَ ٰ⁠لِكَ عَامࣱ فِیهِ یُغَاثُ ٱلنَّاسُ وَفِیهِ یَعۡصِرُونَ\n"
    }
  },
  {
    "id": 1646,
    "surahId": 12,
    "ayahNumber": 50,
    "arabicText": "وَقَالَ ٱلۡمَلِكُ ٱئۡتُونِی بِهِۦۖ فَلَمَّا جَاۤءَهُ ٱلرَّسُولُ قَالَ ٱرۡجِعۡ إِلَىٰ رَبِّكَ فَسۡـَٔلۡهُ مَا بَالُ ٱلنِّسۡوَةِ ٱلَّـٰتِی قَطَّعۡنَ أَیۡدِیَهُنَّۚ إِنَّ رَبِّی بِكَیۡدِهِنَّ عَلِیمࣱ\n",
    "translations": {
      "en": "And [as soon as Joseph's interpretation. was conveyed to him,] the King said: \"Bring him before me!\" But when the [King's] messenger came unto him, [Joseph] said: \"Go back to thy lord and ask him [first to find out the truth] about those women who cut their hands-for, behold, [until now it is] my Sustainer [alone who] has full knowledge of their guile!\"",
      "ms": "Dan (apabila mendengar tafsiran itu) berkatalah raja Mesir:\" Bawalah dia kepadaku! \"Maka tatkata utusan raja datang kepada Yusuf (menjemputnya mengadap raja), Yusuf berkata kepadanya: Kembalilah kepada tuanmu kemudian bertanyalah kepadanya: \"Apa halnya perempuan-perempuan yang melukakan tangan mereka ? Sesungguhnya Tuhanku Maha Mengetahui tipu daya mereka\".",
      "id": "Raja berkata: \"Bawalah dia kepadaku\". Maka tatkala utusan itu datang kepada Yusuf, berkatalah Yusuf: \"Kembalilah kepada tuanmu dan tanyakanlah kepadanya bagaimana halnya wanita-wanita yang telah melukai tangannya. Sesungguhnya Tuhanku, Maha Mengetahui tipu daya mereka\".",
      "ar": "وَقَالَ ٱلۡمَلِكُ ٱئۡتُونِی بِهِۦۖ فَلَمَّا جَاۤءَهُ ٱلرَّسُولُ قَالَ ٱرۡجِعۡ إِلَىٰ رَبِّكَ فَسۡـَٔلۡهُ مَا بَالُ ٱلنِّسۡوَةِ ٱلَّـٰتِی قَطَّعۡنَ أَیۡدِیَهُنَّۚ إِنَّ رَبِّی بِكَیۡدِهِنَّ عَلِیمࣱ\n"
    }
  },
  {
    "id": 1647,
    "surahId": 12,
    "ayahNumber": 51,
    "arabicText": "قَالَ مَا خَطۡبُكُنَّ إِذۡ رَ ٰ⁠وَدتُّنَّ یُوسُفَ عَن نَّفۡسِهِۦۚ قُلۡنَ حَـٰشَ لِلَّهِ مَا عَلِمۡنَا عَلَیۡهِ مِن سُوۤءࣲۚ قَالَتِ ٱمۡرَأَتُ ٱلۡعَزِیزِ ٱلۡـَٔـٰنَ حَصۡحَصَ ٱلۡحَقُّ أَنَا۠ رَ ٰ⁠وَدتُّهُۥ عَن نَّفۡسِهِۦ وَإِنَّهُۥ لَمِنَ ٱلصَّـٰدِقِینَ\n",
    "translations": {
      "en": "[Thereupon the King sent for those women; and when they came,] he asked: \"What was it that you hoped to achieve when you sought to make Joseph yield himself unto you?\" The women answered: \"God save us! We did not perceive the least evil [intention] on his part!\" [And] the wife of Joseph's former master exclaimed: \"Now has the truth come to light! It was I who sought to make him yield himself unto me - whereas he, behold, was indeed speaking the truth!\"",
      "ms": "Setelah perempuan-perempuan itu dipanggil), raja bertanya kepada mereka: \"Apahal kamu, semasa kamu memujuk Yusuf mengenai dirinya?\" Mereka menjawab: JauhNya Allah dari segala cacat cela, kami tidak mengetahui sesuatu kejahatan terhadap Yusuf\". Isteri Al-Aziz pun berkata: \"Sekarang ternyatalah kebenaran (yang selama ini tersembunyi), akulah yang memujuk Yusuf berkehendakkan dirinya (tetapi ia telah menolak); dan sesungguhnya adalah ia dari orang-orang yang benar.",
      "id": "Raja berkata (kepada wanita-wanita itu): \"Bagaimana keadaanmu ketika kamu menggoda Yusuf untuk menundukkan dirinya (kepadamu)?\" Mereka berkata: \"Maha Sempurna Allah, kami tiada mengetahui sesuatu keburukan dari padanya\". Berkata isteri Al Aziz: \"Sekarang jelaslah kebenaran itu, akulah yang menggodanya untuk menundukkan dirinya (kepadaku), dan sesungguhnya dia termasuk orang-orang yang benar\".",
      "ar": "قَالَ مَا خَطۡبُكُنَّ إِذۡ رَ ٰ⁠وَدتُّنَّ یُوسُفَ عَن نَّفۡسِهِۦۚ قُلۡنَ حَـٰشَ لِلَّهِ مَا عَلِمۡنَا عَلَیۡهِ مِن سُوۤءࣲۚ قَالَتِ ٱمۡرَأَتُ ٱلۡعَزِیزِ ٱلۡـَٔـٰنَ حَصۡحَصَ ٱلۡحَقُّ أَنَا۠ رَ ٰ⁠وَدتُّهُۥ عَن نَّفۡسِهِۦ وَإِنَّهُۥ لَمِنَ ٱلصَّـٰدِقِینَ\n"
    }
  },
  {
    "id": 1648,
    "surahId": 12,
    "ayahNumber": 52,
    "arabicText": "ذَ ٰ⁠لِكَ لِیَعۡلَمَ أَنِّی لَمۡ أَخُنۡهُ بِٱلۡغَیۡبِ وَأَنَّ ٱللَّهَ لَا یَهۡدِی كَیۡدَ ٱلۡخَاۤىِٕنِینَ\n",
    "translations": {
      "en": "[When Joseph learned what had happened, he said: \"I asked for] this, so that [my former master] might know that I did not betray him behind his back, and that God does not bless with His guidance the artful schemes of those who betray their trust.",
      "ms": "\"(Pengakuanku) yang demikian supaya ia mengetahui, bahawa aku tidak mengkhianatinya semasa ia tidak hadir (bersama di sini); dan bahawa Allah tidak menjayakan tipu daya orang-orang yang khianat.",
      "id": "(Yusuf berkata): \"Yang demikian itu agar dia (Al Aziz) mengetahui bahwa sesungguhnya aku tidak berkhianat kepadanya di belakangnya, dan bahwasanya Allah tidak meridhai tipu daya orang-orang yang berkhianat.",
      "ar": "ذَ ٰ⁠لِكَ لِیَعۡلَمَ أَنِّی لَمۡ أَخُنۡهُ بِٱلۡغَیۡبِ وَأَنَّ ٱللَّهَ لَا یَهۡدِی كَیۡدَ ٱلۡخَاۤىِٕنِینَ\n"
    }
  },
  {
    "id": 1649,
    "surahId": 12,
    "ayahNumber": 53,
    "arabicText": "۞ وَمَاۤ أُبَرِّئُ نَفۡسِیۤۚ إِنَّ ٱلنَّفۡسَ لَأَمَّارَةُۢ بِٱلسُّوۤءِ إِلَّا مَا رَحِمَ رَبِّیۤۚ إِنَّ رَبِّی غَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "And yet, I am not trying to absolve myself: for, verily, man's inner self does incite [him] to evil, and saved are only they upon whom my Sustainer bestows His grace. Behold, my Sustainer is much forgiving, a dispenser of grace!\"",
      "ms": "\"Dan tiadalah aku berani membersihkan diriku; sesungguhnya nafsu manusia itu sangat menyuruh melakukan kejahatan, kecuali orang-orang yang telah diberi rahmat oleh Tuhanku (maka terselamatlah ia dari hasutan nafsu itu). Sesungguhnya Tuhanku Maha Pengampun, lagi Maha Mengasihani.\"",
      "id": "Dan aku tidak membebaskan diriku (dari kesalahan), karena sesungguhnya nafsu itu selalu menyuruh kepada kejahatan, kecuali nafsu yang diberi rahmat oleh Tuhanku. Sesungguhnya Tuhanku Maha Pengampun lagi Maha Penyanyang.",
      "ar": "۞ وَمَاۤ أُبَرِّئُ نَفۡسِیۤۚ إِنَّ ٱلنَّفۡسَ لَأَمَّارَةُۢ بِٱلسُّوۤءِ إِلَّا مَا رَحِمَ رَبِّیۤۚ إِنَّ رَبِّی غَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 1650,
    "surahId": 12,
    "ayahNumber": 54,
    "arabicText": "وَقَالَ ٱلۡمَلِكُ ٱئۡتُونِی بِهِۦۤ أَسۡتَخۡلِصۡهُ لِنَفۡسِیۖ فَلَمَّا كَلَّمَهُۥ قَالَ إِنَّكَ ٱلۡیَوۡمَ لَدَیۡنَا مَكِینٌ أَمِینࣱ\n",
    "translations": {
      "en": "And the King said: \"Bring him unto me, so that I may attach him to my own person.\" And when he had spoken with him, [the King] said: \"Behold, [from] this day thou shalt be of high standing with us, invested with all trust!\"",
      "ms": "Dan (setelah mendengar pengakuan perempuan-perempuan itu), raja berkata: \"Bawalah Yusuf kepadaku, aku hendak menjadikan dia orang yang khas untuk aku bermesyuarat dengannya. Setelah (Yusuf dibawa mengadap, dan raja) berkata-kata dengannya (serta mengetahui kebijaksanaannya) berkatalah raja kepadanya: \"Sesungguhnya engkau pada hari ini (wahai Yusuf), seorang yang berpangkat tinggi, lagi dipercayai di kalangan kami \".",
      "id": "Dan raja berkata: \"Bawalah Yusuf kepadaku, agar aku memilih dia sebagai orang yang rapat kepadaku\". Maka tatkala raja telah bercakap-cakap dengan dia, dia berkata: \"Sesungguhnya kamu (mulai) hari ini menjadi seorang yang berkedudukan tinggi lagi dipercayai pada sisi kami\".",
      "ar": "وَقَالَ ٱلۡمَلِكُ ٱئۡتُونِی بِهِۦۤ أَسۡتَخۡلِصۡهُ لِنَفۡسِیۖ فَلَمَّا كَلَّمَهُۥ قَالَ إِنَّكَ ٱلۡیَوۡمَ لَدَیۡنَا مَكِینٌ أَمِینࣱ\n"
    }
  },
  {
    "id": 1651,
    "surahId": 12,
    "ayahNumber": 55,
    "arabicText": "قَالَ ٱجۡعَلۡنِی عَلَىٰ خَزَاۤىِٕنِ ٱلۡأَرۡضِۖ إِنِّی حَفِیظٌ عَلِیمࣱ\n",
    "translations": {
      "en": "[Joseph] replied: \"Place in my charge the store-houses of the land; behold, I shall be a good and knowing keeper.",
      "ms": "Yusuf berkata: \"Jadikanlah daku pengurus perbendaharaan hasil bumi (Mesir); sesungguhnya aku sedia menjaganya dengan sebaik-baiknya, lagi mengetahui cara mentadbirkannya\".",
      "id": "Berkata Yusuf: \"Jadikanlah aku bendaharawan negara (Mesir); sesungguhnya aku adalah orang yang pandai menjaga, lagi berpengetahuan\".",
      "ar": "قَالَ ٱجۡعَلۡنِی عَلَىٰ خَزَاۤىِٕنِ ٱلۡأَرۡضِۖ إِنِّی حَفِیظٌ عَلِیمࣱ\n"
    }
  },
  {
    "id": 1652,
    "surahId": 12,
    "ayahNumber": 56,
    "arabicText": "وَكَذَ ٰ⁠لِكَ مَكَّنَّا لِیُوسُفَ فِی ٱلۡأَرۡضِ یَتَبَوَّأُ مِنۡهَا حَیۡثُ یَشَاۤءُۚ نُصِیبُ بِرَحۡمَتِنَا مَن نَّشَاۤءُۖ وَلَا نُضِیعُ أَجۡرَ ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "And thus We established Joseph securely in the land [of Egypt]: he had full mastery over it, [doing] whatever he willed. [Thus do] We cause Our grace to alight upon whomever We will; and We do not fail to requite the doers of good.",
      "ms": "Dan demikianlah caranya, Kami tetapkan kedudukan Yusuf memegang kuasa di bumi Mesir; ia bebas tinggal di negeri itu di mana sahaja yang disukainya. Kami limpahkan rahmat Kami kepada sesiapa sahaja yang Kami kehendaki, dan Kami tidak menghilangkan balasan baik orang-orang yang berbuat kebaikan.",
      "id": "Dan demikianlah Kami memberi kedudukan kepada Yusuf di negeri Mesir; (dia berkuasa penuh) pergi menuju kemana saja ia kehendaki di bumi Mesir itu. Kami melimpahkan rahmat Kami kepada siapa yang Kami kehendaki dan Kami tidak menyia-nyiakan pahala orang-orang yang berbuat baik.",
      "ar": "وَكَذَ ٰ⁠لِكَ مَكَّنَّا لِیُوسُفَ فِی ٱلۡأَرۡضِ یَتَبَوَّأُ مِنۡهَا حَیۡثُ یَشَاۤءُۚ نُصِیبُ بِرَحۡمَتِنَا مَن نَّشَاۤءُۖ وَلَا نُضِیعُ أَجۡرَ ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 1653,
    "surahId": 12,
    "ayahNumber": 57,
    "arabicText": "وَلَأَجۡرُ ٱلۡـَٔاخِرَةِ خَیۡرࣱ لِّلَّذِینَ ءَامَنُوا۟ وَكَانُوا۟ یَتَّقُونَ\n",
    "translations": {
      "en": "But in the eyes of those who have attained to faith and have always been conscious of Us, a reward in the life to come is a far greater good [than any reward in this world].",
      "ms": "Dan sesungguhnya pahala hari akhirat lebih baik bagi orang-orang yang beriman serta mereka pula sentiasa bertaqwa.",
      "id": "Dan sesungguhnya pahala di akhirat itu lebih baik, bagi orang-orang yang beriman dan selalu bertakwa.",
      "ar": "وَلَأَجۡرُ ٱلۡـَٔاخِرَةِ خَیۡرࣱ لِّلَّذِینَ ءَامَنُوا۟ وَكَانُوا۟ یَتَّقُونَ\n"
    }
  },
  {
    "id": 1654,
    "surahId": 12,
    "ayahNumber": 58,
    "arabicText": "وَجَاۤءَ إِخۡوَةُ یُوسُفَ فَدَخَلُوا۟ عَلَیۡهِ فَعَرَفَهُمۡ وَهُمۡ لَهُۥ مُنكِرُونَ\n",
    "translations": {
      "en": "AND [after some years,] Joseph's brothers came [to Egypt] and presented themselves before him: and he knew them [at once], whereas they did not recognize him.",
      "ms": "Dan (setelah tiba musim kemarau) datanglah saudara-saudara Yusuf (ke Mesir), lalu masuklah mereka mendapatkannya; Yusuf dengan serta merta kenal mereka, sedang mereka tidak mengenalnya.",
      "id": "Dan saudara-saudara Yusuf datang (ke Mesir} lalu mereka masuk ke (tempat)nya. Maka Yusuf mengenal mereka, sedang mereka tidak kenal (lagi) kepadanya.",
      "ar": "وَجَاۤءَ إِخۡوَةُ یُوسُفَ فَدَخَلُوا۟ عَلَیۡهِ فَعَرَفَهُمۡ وَهُمۡ لَهُۥ مُنكِرُونَ\n"
    }
  },
  {
    "id": 1655,
    "surahId": 12,
    "ayahNumber": 59,
    "arabicText": "وَلَمَّا جَهَّزَهُم بِجَهَازِهِمۡ قَالَ ٱئۡتُونِی بِأَخࣲ لَّكُم مِّنۡ أَبِیكُمۡۚ أَلَا تَرَوۡنَ أَنِّیۤ أُوفِی ٱلۡكَیۡلَ وَأَنَا۠ خَیۡرُ ٱلۡمُنزِلِینَ\n",
    "translations": {
      "en": "And when he had provided them with their provisions, he said: \"[When you come here next,] bring unto me that brother of yours from your father's side. Do you not see that I have given [you] full measure and have been the best of hosts?",
      "ms": "Dan ketika Yusuf menyediakan untuk mereka bekalan mereka, berkatalah ia:\" (Pada kali yang lain) bawalah kepadaku saudara kamu yang sebapa. Tidakkah kamu melihat, bahawa aku menyempurnakan bekalan makanan kamu, dan bahawa aku sebaik-baik penerima tetamu?",
      "id": "Dan tatkala Yusuf menyiapkan untuk mereka bahan makanannya, ia berkata: \"Bawalah kepadaku saudaramu yang seayah dengan kamu (Bunyamin), tidakkah kamu melihat bahwa aku menyempurnakan sukatan dan aku adalah sebaik-baik penerima tamu?",
      "ar": "وَلَمَّا جَهَّزَهُم بِجَهَازِهِمۡ قَالَ ٱئۡتُونِی بِأَخࣲ لَّكُم مِّنۡ أَبِیكُمۡۚ أَلَا تَرَوۡنَ أَنِّیۤ أُوفِی ٱلۡكَیۡلَ وَأَنَا۠ خَیۡرُ ٱلۡمُنزِلِینَ\n"
    }
  },
  {
    "id": 1656,
    "surahId": 12,
    "ayahNumber": 60,
    "arabicText": "فَإِن لَّمۡ تَأۡتُونِی بِهِۦ فَلَا كَیۡلَ لَكُمۡ عِندِی وَلَا تَقۡرَبُونِ\n",
    "translations": {
      "en": "But if you do not bring him unto me, you shall never again receive a single measure [of grain] from me, nor shall you [be allowed to] come near me!\"",
      "ms": "Oleh itu, kalau kamu tidak membawanya kepadaku, maka tidak ada hak bagi kamu mendapat bekalan makanan di sisiku, dan janganlah kamu menghampiriku lagi\".",
      "id": "Jika kamu tidak membawanya kepadaku, maka kamu tidak akan mendapat sukatan lagi dari padaku dan jangan kamu mendekatiku\".",
      "ar": "فَإِن لَّمۡ تَأۡتُونِی بِهِۦ فَلَا كَیۡلَ لَكُمۡ عِندِی وَلَا تَقۡرَبُونِ\n"
    }
  },
  {
    "id": 1657,
    "surahId": 12,
    "ayahNumber": 61,
    "arabicText": "قَالُوا۟ سَنُرَ ٰ⁠وِدُ عَنۡهُ أَبَاهُ وَإِنَّا لَفَـٰعِلُونَ\n",
    "translations": {
      "en": "They answered: \"We shall try to persuade his father to part with him, and, verily, we shall do [our utmost]!\"",
      "ms": "Mereka menjawab: \"Kami akan memujuk bapanya melepaskan dia bersama-sama kami, dan sesungguhnya kami akan melakukannya\".",
      "id": "Mereka berkata: \"Kami akan membujuk ayahnya untuk membawanya (ke mari) dan sesungguhnya kami benar-benar akan melaksanakannya\".",
      "ar": "قَالُوا۟ سَنُرَ ٰ⁠وِدُ عَنۡهُ أَبَاهُ وَإِنَّا لَفَـٰعِلُونَ\n"
    }
  },
  {
    "id": 1658,
    "surahId": 12,
    "ayahNumber": 62,
    "arabicText": "وَقَالَ لِفِتۡیَـٰنِهِ ٱجۡعَلُوا۟ بِضَـٰعَتَهُمۡ فِی رِحَالِهِمۡ لَعَلَّهُمۡ یَعۡرِفُونَهَاۤ إِذَا ٱنقَلَبُوۤا۟ إِلَىٰۤ أَهۡلِهِمۡ لَعَلَّهُمۡ یَرۡجِعُونَ\n",
    "translations": {
      "en": "And [Joseph] said to his servants: \"Place their merchandise in their camel-packs, so that they may find it there when they come home, and hence be the more eager to return.",
      "ms": "Dan (selepas itu) berkatalah Yusuf kepada orang-orang suruhannya. \"Masukkanlah barang-barang dagangan mereka pada tempat simpanan barang di kenderaan mereka, supaya mereka mengetahuinya kelak ketika mereka kembali kepada keluarga mereka, dan supaya mereka datang lagi (ke negeri ini)\".",
      "id": "Yusuf berkata kepada bujang-bujangnya: \"Masukkanlah barang-barang (penukar kepunyaan mereka) ke dalam karung-karung mereka, supaya mereka mengetahuinya apabila mereka telah kembali kepada keluarganya, mudah-mudahan mereka kembali lagi\".",
      "ar": "وَقَالَ لِفِتۡیَـٰنِهِ ٱجۡعَلُوا۟ بِضَـٰعَتَهُمۡ فِی رِحَالِهِمۡ لَعَلَّهُمۡ یَعۡرِفُونَهَاۤ إِذَا ٱنقَلَبُوۤا۟ إِلَىٰۤ أَهۡلِهِمۡ لَعَلَّهُمۡ یَرۡجِعُونَ\n"
    }
  },
  {
    "id": 1659,
    "surahId": 12,
    "ayahNumber": 63,
    "arabicText": "فَلَمَّا رَجَعُوۤا۟ إِلَىٰۤ أَبِیهِمۡ قَالُوا۟ یَـٰۤأَبَانَا مُنِعَ مِنَّا ٱلۡكَیۡلُ فَأَرۡسِلۡ مَعَنَاۤ أَخَانَا نَكۡتَلۡ وَإِنَّا لَهُۥ لَحَـٰفِظُونَ\n",
    "translations": {
      "en": "And so, when they returned to their father, [Joseph's brothers] said: \"O our father! All grain is [to be] withheld from us [in the future unless we bring Benjamin with us]: send, therefore, our brother with us, so that we may obtain our measure (of grain]; and, verily, we shall guard him well!\"",
      "ms": "Maka ketika mereka kembali kepada bapa mereka, berkatalah mereka: \"Wahai ayah kami! Kami (tetap diberi amaran bahawa kami) tidak akan mendapat lagi bekalan makanan (kiranya Bunyamin tidak pergi bersama). Oleh itu, hantarkanlah dia bersama-sama kami, supaya kami dapat lagi bekalan makanan; dan sesungguhnya kami akan menjaganya dengan sebaik-baiknya\".",
      "id": "Maka tatkala mereka telah kembali kepada ayah mereka (Ya'qub) mereka berkata: \"Wahai ayah kami, kami tidak akan mendapat sukatan (gandum) lagi, (jika tidak membawa saudara kami), sebab itu biarkanlah saudara kami pergi bersama-sama kami supaya kami mendapat sukatan, dan sesungguhnya kami benar benar akan menjaganya\".",
      "ar": "فَلَمَّا رَجَعُوۤا۟ إِلَىٰۤ أَبِیهِمۡ قَالُوا۟ یَـٰۤأَبَانَا مُنِعَ مِنَّا ٱلۡكَیۡلُ فَأَرۡسِلۡ مَعَنَاۤ أَخَانَا نَكۡتَلۡ وَإِنَّا لَهُۥ لَحَـٰفِظُونَ\n"
    }
  },
  {
    "id": 1660,
    "surahId": 12,
    "ayahNumber": 64,
    "arabicText": "قَالَ هَلۡ ءَامَنُكُمۡ عَلَیۡهِ إِلَّا كَمَاۤ أَمِنتُكُمۡ عَلَىٰۤ أَخِیهِ مِن قَبۡلُ فَٱللَّهُ خَیۡرٌ حَـٰفِظࣰاۖ وَهُوَ أَرۡحَمُ ٱلرَّ ٰ⁠حِمِینَ\n",
    "translations": {
      "en": "[Jacob] replied: \"Shall I trust you with him in the same way as I trusted you with his brother (Joseph] aforetime? [Nay,] but God's guardianship is better [than yours], for He is the most merciful of the merciful!\"",
      "ms": "Bapa mereka berkata: \"(Jika aku lepaskan dia pergi bersama-sama kamu), aku tidak menaruh kepercayaan kepada kamu menjaganya melainkan seperti kepercayaanku kepada kamu menjaga saudaranya dahulu (yang telah kamu hampakan. Oleh itu aku hanya menaruh kepercayaan kepada Allah), kerana Allah jualah Penjaga yang sebaik-baiknya, dan Dia lah jua Yang Maha Mengasihani dari sesiapa sahaja yang menaruh belas kasihan\".",
      "id": "Berkata Ya'qub: \"Bagaimana aku akan mempercayakannya (Bunyamin) kepadamu, kecuali seperti aku telah mempercayakan saudaranya (Yusuf) kepada kamu dahulu?\". Maka Allah adalah sebaik-baik Penjaga dan Dia adalah Maha Penyanyang diantara para penyanyang.",
      "ar": "قَالَ هَلۡ ءَامَنُكُمۡ عَلَیۡهِ إِلَّا كَمَاۤ أَمِنتُكُمۡ عَلَىٰۤ أَخِیهِ مِن قَبۡلُ فَٱللَّهُ خَیۡرٌ حَـٰفِظࣰاۖ وَهُوَ أَرۡحَمُ ٱلرَّ ٰ⁠حِمِینَ\n"
    }
  },
  {
    "id": 1661,
    "surahId": 12,
    "ayahNumber": 65,
    "arabicText": "وَلَمَّا فَتَحُوا۟ مَتَـٰعَهُمۡ وَجَدُوا۟ بِضَـٰعَتَهُمۡ رُدَّتۡ إِلَیۡهِمۡۖ قَالُوا۟ یَـٰۤأَبَانَا مَا نَبۡغِیۖ هَـٰذِهِۦ بِضَـٰعَتُنَا رُدَّتۡ إِلَیۡنَاۖ وَنَمِیرُ أَهۡلَنَا وَنَحۡفَظُ أَخَانَا وَنَزۡدَادُ كَیۡلَ بَعِیرࣲۖ ذَ ٰ⁠لِكَ كَیۡلࣱ یَسِیرࣱ\n",
    "translations": {
      "en": "Thereupon, when they opened their packs, they discovered that their merchandise had been returned to them; [and] they said: \"O our father! What more could we desire? Here is our merchandise: it has been returned to us! [If thou send Benjamin with us,] we shall (again] be able to bring food for our family, and shall guard our brother [well], and receive in addition another camel-load of grain That [which we have brought the first time] was but a scanty measure.\"",
      "ms": "Dan semasa mereka membuka barang-barang mereka, mereka dapati barang-barang dagangan mereka telah dikembalikan kepada mereka. Mereka berkata dengan gembiranya: \"Wahai ayah kami! Apa yang kita kehendaki lagi? Ini dia barang-barang dagangan yang kita jadikan tukaran (bagi mendapat gandum) itu telah dikembalikan kepada kita. Dan (dengan kemurahan hati menteri yang berbudi itu) akan dapatlah kami membawa lagi bekalan makanan kepada keluarga kami, dan kami pula akan dapat menjaga saudara kami, serta akan dapat tambahan benda-benda makanan sebanyak muatan seekor unta lagi. Pemberian tambahan yang sebanyak itu mudah sekali ditunaikannya\".",
      "id": "Tatkala mereka membuka barang-barangnya, mereka menemukan kembali barang-barang (penukaran) mereka, dikembalikan kepada mereka. Mereka berkata: \"Wahai ayah kami apa lagi yang kita inginkan. Ini barang-barang kita dikembalikan kepada kita, dan kami akan dapat memberi makan keluarga kami, dan kami akan dapat memelihara saudara kami, dan kami akan mendapat tambahan sukatan (gandum) seberat beban seekor unta. Itu adalah sukatan yang mudah (bagi raja Mesir)\".",
      "ar": "وَلَمَّا فَتَحُوا۟ مَتَـٰعَهُمۡ وَجَدُوا۟ بِضَـٰعَتَهُمۡ رُدَّتۡ إِلَیۡهِمۡۖ قَالُوا۟ یَـٰۤأَبَانَا مَا نَبۡغِیۖ هَـٰذِهِۦ بِضَـٰعَتُنَا رُدَّتۡ إِلَیۡنَاۖ وَنَمِیرُ أَهۡلَنَا وَنَحۡفَظُ أَخَانَا وَنَزۡدَادُ كَیۡلَ بَعِیرࣲۖ ذَ ٰ⁠لِكَ كَیۡلࣱ یَسِیرࣱ\n"
    }
  },
  {
    "id": 1662,
    "surahId": 12,
    "ayahNumber": 66,
    "arabicText": "قَالَ لَنۡ أُرۡسِلَهُۥ مَعَكُمۡ حَتَّىٰ تُؤۡتُونِ مَوۡثِقࣰا مِّنَ ٱللَّهِ لَتَأۡتُنَّنِی بِهِۦۤ إِلَّاۤ أَن یُحَاطَ بِكُمۡۖ فَلَمَّاۤ ءَاتَوۡهُ مَوۡثِقَهُمۡ قَالَ ٱللَّهُ عَلَىٰ مَا نَقُولُ وَكِیلࣱ\n",
    "translations": {
      "en": "Said [Jacob]: \"I will not send him with you until you give me a solemn pledge, before God, that you will indeed bring him back unto me, unless you yourselves be encompassed [by death]!\" And when they had given him their solemn pledge, [Jacob] said: \"God is witness to all that we say!\"",
      "ms": "Bapa mereka berkata:\" Aku tidak sekali-kali akan melepaskan dia (Bunyamin) pergi bersama-sama kamu, sehingga kamu memberi kepadaku satu perjanjian yang teguh (bersumpah) dengan nama Allah, bahawa kamu akan membawanya kembali kepadaku dengan selamat, kecuali jika kamu semua dikepong dan dikalahkan oleh musuh\". Maka ketika mereka memberikan perjanjian yang teguh (bersumpah) kepadanya, berkatalah ia: \"Allah jualah yang menjadi Saksi dan Pengawas atas apa yang kita semua katakan itu.\"",
      "id": "Ya'qub berkata: \"Aku sekali-kali tidak akan melepaskannya (pergi) bersama-sama kamu, sebelum kamu memberikan kepadaku janji yang teguh atas nama Allah, bahwa kamu pasti akan membawanya kepadaku kembali, kecuali jika kamu dikepung musuh\". Tatkala mereka memberikan janji mereka, maka Ya'qub berkata: \"Allah adalah saksi terhadap apa yang kita ucapkan (ini)\".",
      "ar": "قَالَ لَنۡ أُرۡسِلَهُۥ مَعَكُمۡ حَتَّىٰ تُؤۡتُونِ مَوۡثِقࣰا مِّنَ ٱللَّهِ لَتَأۡتُنَّنِی بِهِۦۤ إِلَّاۤ أَن یُحَاطَ بِكُمۡۖ فَلَمَّاۤ ءَاتَوۡهُ مَوۡثِقَهُمۡ قَالَ ٱللَّهُ عَلَىٰ مَا نَقُولُ وَكِیلࣱ\n"
    }
  },
  {
    "id": 1663,
    "surahId": 12,
    "ayahNumber": 67,
    "arabicText": "وَقَالَ یَـٰبَنِیَّ لَا تَدۡخُلُوا۟ مِنۢ بَابࣲ وَ ٰ⁠حِدࣲ وَٱدۡخُلُوا۟ مِنۡ أَبۡوَ ٰ⁠بࣲ مُّتَفَرِّقَةࣲۖ وَمَاۤ أُغۡنِی عَنكُم مِّنَ ٱللَّهِ مِن شَیۡءٍۖ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِۖ عَلَیۡهِ تَوَكَّلۡتُۖ وَعَلَیۡهِ فَلۡیَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ\n",
    "translations": {
      "en": "And he added: \"O my sons! Do not enter [the city all] by one gate, but enter by different gates. Yet [even so,] I can be of no avail whatever to you against [anything that may be willed by] God: judgment [as to what is to happen] rests with none but God. In Him have I placed my trust: for, all who have trust [in His existence] must place their trust in Him alone.\"",
      "ms": "Dan ia berkata lagi: \"Wahai anak-anakku! Janganlah kamu masuk (ke bandar Mesir) dari sebuah pintu sahaja, tetapi masuklah dari beberapa buah pintu yang berlainan. Dan aku (dengan nasihatku ini), tidak dapat menyelamatkan kamu dari sesuatu takdir yang telah ditetapkan oleh Allah. Kuasa menetapkan sesuatu (sebab dan musabab) itu hanya tertentu bagi Allah. KepadaNyalah aku berserah diri, dan kepadaNyalah hendaknya berserah orang-orang yang mahu berserah diri\".",
      "id": "Dan Ya'qub berkata: \"Hai anak-anakku janganlah kamu (bersama-sama) masuk dari satu pintu gerbang, dan masuklah dari pintu-pintu gerbang yang berlain-lain; namun demikian aku tiada dapat melepaskan kamu barang sedikitpun dari pada (takdir) Allah. Keputusan menetapkan (sesuatu) hanyalah hak Allah; kepada-Nya-lah aku bertawakkal dan hendaklah kepada-Nya saja orang-orang yang bertawakkal berserah diri\".",
      "ar": "وَقَالَ یَـٰبَنِیَّ لَا تَدۡخُلُوا۟ مِنۢ بَابࣲ وَ ٰ⁠حِدࣲ وَٱدۡخُلُوا۟ مِنۡ أَبۡوَ ٰ⁠بࣲ مُّتَفَرِّقَةࣲۖ وَمَاۤ أُغۡنِی عَنكُم مِّنَ ٱللَّهِ مِن شَیۡءٍۖ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِۖ عَلَیۡهِ تَوَكَّلۡتُۖ وَعَلَیۡهِ فَلۡیَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ\n"
    }
  },
  {
    "id": 1664,
    "surahId": 12,
    "ayahNumber": 68,
    "arabicText": "وَلَمَّا دَخَلُوا۟ مِنۡ حَیۡثُ أَمَرَهُمۡ أَبُوهُم مَّا كَانَ یُغۡنِی عَنۡهُم مِّنَ ٱللَّهِ مِن شَیۡءٍ إِلَّا حَاجَةࣰ فِی نَفۡسِ یَعۡقُوبَ قَضَىٰهَاۚ وَإِنَّهُۥ لَذُو عِلۡمࣲ لِّمَا عَلَّمۡنَـٰهُ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "But although they entered [Joseph's city] in the way their father had bidden them, this proved of no avail whatever to them against [the plan of] God [His request] had served only to satisfy Jacob's heartfelt desire [to protect them]: for, behold, thanks to what We had imparted unto him, he was indeed endowed with the knowledge [that God's will must always prevail]; but most people know it not.",
      "ms": "Dan ketika mereka masuk menurut arah yang diperintahkan oleh bapa mereka, tidaklah perintahnya itu dapat menyelamatkan mereka dari apa yang telah ditakdirkan oleh Allah sedikitpun, tetapi yang demikian itu hanyalah melahirkan hajat yang terpendam dalam hati Nabi Yaakub. Dan sesungguhnya ia orang yang berilmu, kerana kami telah mengajarnya (dengan perantaraan wahyu); tetapi kebanyakan manusia tidak mengetahui (akan rahsia takdir Tuhan).",
      "id": "Dan tatkala mereka masuk menurut yang diperintahkan ayah mereka, maka (cara yang mereka lakukan itu) tiadalah melepaskan mereka sedikitpun dari takdir Allah, akan tetapi itu hanya suatu keinginan pada diri Ya'qub yang telah ditetapkannya. Dan sesungguhnya dia mempunyai pengetahuan, karena Kami telah mengajarkan kepadanya. Akan tetapi kebanyakan manusia tiada mengetahui.",
      "ar": "وَلَمَّا دَخَلُوا۟ مِنۡ حَیۡثُ أَمَرَهُمۡ أَبُوهُم مَّا كَانَ یُغۡنِی عَنۡهُم مِّنَ ٱللَّهِ مِن شَیۡءٍ إِلَّا حَاجَةࣰ فِی نَفۡسِ یَعۡقُوبَ قَضَىٰهَاۚ وَإِنَّهُۥ لَذُو عِلۡمࣲ لِّمَا عَلَّمۡنَـٰهُ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1665,
    "surahId": 12,
    "ayahNumber": 69,
    "arabicText": "وَلَمَّا دَخَلُوا۟ عَلَىٰ یُوسُفَ ءَاوَىٰۤ إِلَیۡهِ أَخَاهُۖ قَالَ إِنِّیۤ أَنَا۠ أَخُوكَ فَلَا تَبۡتَىِٕسۡ بِمَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "AND WHEN [the sons of Jacob] presented themselves before Joseph, he drew his brother [Benjamin] unto himself, saying [to him in secret]: \"Behold, I am thy brother! So grieve thou not over their past doings!\"",
      "ms": "Dan semasa mereka masuk mendapatkan Yusuf, ia menempatkan saudara kandungnya (Bunyamin) bersama-samanya, sambil berkata kepadanya:\" Akulah saudara engkau Yusuf), oleh itu janganlah engkau berdukacita lagi disebabkan apa yang mereka lakukan\".",
      "id": "Dan tatkala mereka masuk ke (tempat) Yusuf. Yusuf membawa saudaranya (Bunyamin) ke tempatnya, Yusuf berkata: \"Sesungguhnya aku (ini) adalah saudaramu, maka janganlah kamu berdukacita terhadap apa yang telah mereka kerjakan\".",
      "ar": "وَلَمَّا دَخَلُوا۟ عَلَىٰ یُوسُفَ ءَاوَىٰۤ إِلَیۡهِ أَخَاهُۖ قَالَ إِنِّیۤ أَنَا۠ أَخُوكَ فَلَا تَبۡتَىِٕسۡ بِمَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1666,
    "surahId": 12,
    "ayahNumber": 70,
    "arabicText": "فَلَمَّا جَهَّزَهُم بِجَهَازِهِمۡ جَعَلَ ٱلسِّقَایَةَ فِی رَحۡلِ أَخِیهِ ثُمَّ أَذَّنَ مُؤَذِّنٌ أَیَّتُهَا ٱلۡعِیرُ إِنَّكُمۡ لَسَـٰرِقُونَ\n",
    "translations": {
      "en": "And [later,] when he had provided them with their provisions, he placed the [King's] drinking-cup in his brother's camel-pack. And [as they were leaving the city,] a herald called out: \"O you people of the caravan! Verily, you are thieves!",
      "ms": "Maka ketika ia membekalkan mereka dengan bekalan makan (yang mencukupi keperluan) mereka, lalu ia meletakkan bijana minuman raja di kenderaan saudaranya (Bunyamin), kemudian menyeru seorang penyeru:\" Wahai orang-orang kafilah ini, sesungguhnya kamu adalah pencuri \".",
      "id": "Maka tatkala telah disiapkan untuk mereka bahan makanan mereka, Yusuf memasukkan piala (tempat minum) ke dalam karung saudaranya. Kemudian berteriaklah seseorang yang menyerukan: \"Hai kafilah, sesungguhnya kamu adalah orang-orang yang mencuri\".",
      "ar": "فَلَمَّا جَهَّزَهُم بِجَهَازِهِمۡ جَعَلَ ٱلسِّقَایَةَ فِی رَحۡلِ أَخِیهِ ثُمَّ أَذَّنَ مُؤَذِّنٌ أَیَّتُهَا ٱلۡعِیرُ إِنَّكُمۡ لَسَـٰرِقُونَ\n"
    }
  },
  {
    "id": 1667,
    "surahId": 12,
    "ayahNumber": 71,
    "arabicText": "قَالُوا۟ وَأَقۡبَلُوا۟ عَلَیۡهِم مَّاذَا تَفۡقِدُونَ\n",
    "translations": {
      "en": "Turning towards the herald and his companions, the brothers asked: \"What is it that you miss?\"",
      "ms": "Mereka bertanya sambil mengadap ke arah orang-orang menteri yang menuduh itu: \"Apa benda kamu yang kehilangan?\"",
      "id": "Mereka menjawab, sambil menghadap kepada penyeru-penyeru itu: \"Barang apakah yang hilang dari pada kamu?\"",
      "ar": "قَالُوا۟ وَأَقۡبَلُوا۟ عَلَیۡهِم مَّاذَا تَفۡقِدُونَ\n"
    }
  },
  {
    "id": 1668,
    "surahId": 12,
    "ayahNumber": 72,
    "arabicText": "قَالُوا۟ نَفۡقِدُ صُوَاعَ ٱلۡمَلِكِ وَلِمَن جَاۤءَ بِهِۦ حِمۡلُ بَعِیرࣲ وَأَنَا۠ بِهِۦ زَعِیمࣱ\n",
    "translations": {
      "en": "They answered: \"We miss the King's goblet; and he who produces it shall receive a camel-load [of grain as reward]!\" And [the herald added:] \"I pledge myself to this _ [promise]!\"",
      "ms": "Orang-orang menteri menjawab: \"Kami kehilangan cupak raja. Dan sesiapa yang memulangkannya akan diberi (benda-benda makanan) sebanyak muatan seekor unta, dan akulah yang menjamin pemberian itu\".",
      "id": "Penyeru-penyeru itu berkata: \"Kami kehilangan piala raja, dan siapa yang dapat mengembalikannya akan memperoleh bahan makanan (seberat) beban unta, dan aku menjamin terhadapnya\".",
      "ar": "قَالُوا۟ نَفۡقِدُ صُوَاعَ ٱلۡمَلِكِ وَلِمَن جَاۤءَ بِهِۦ حِمۡلُ بَعِیرࣲ وَأَنَا۠ بِهِۦ زَعِیمࣱ\n"
    }
  },
  {
    "id": 1669,
    "surahId": 12,
    "ayahNumber": 73,
    "arabicText": "قَالُوا۟ تَٱللَّهِ لَقَدۡ عَلِمۡتُم مَّا جِئۡنَا لِنُفۡسِدَ فِی ٱلۡأَرۡضِ وَمَا كُنَّا سَـٰرِقِینَ\n",
    "translations": {
      "en": "Said [the brothers]: \"By God! Well do you know that we have not come to commit deeds of corruption in this land, and that we have not been thieving!\"",
      "ms": "Mereka berkata: \"Demi Allah! Sesungguhnya kamu sedia mengetahui bahawa kedatangan kami bukanlah untuk berbuat kerosakan di bumi (Mesir ini), dan kami pula bukanlah pencuri\".",
      "id": "Saudara-saudara Yusuf menjawab \"Demi Allah sesungguhnya kamu mengetahui bahwa kami datang bukan untuk membuat kerusakan di negeri (ini) dan kami bukanlah para pencuri\".",
      "ar": "قَالُوا۟ تَٱللَّهِ لَقَدۡ عَلِمۡتُم مَّا جِئۡنَا لِنُفۡسِدَ فِی ٱلۡأَرۡضِ وَمَا كُنَّا سَـٰرِقِینَ\n"
    }
  },
  {
    "id": 1670,
    "surahId": 12,
    "ayahNumber": 74,
    "arabicText": "قَالُوا۟ فَمَا جَزَ ٰ⁠ۤؤُهُۥۤ إِن كُنتُمۡ كَـٰذِبِینَ\n",
    "translations": {
      "en": "[The Egyptians] said: \"But what shall be the requital of this [deed] if you are [proved to be] liars?\"",
      "ms": "(Orang-orang menteri) bertanya: \"Maka apa balasan pencuri itu, jika kamu berdusta?\"",
      "id": "Mereka berkata: \"Tetapi apa balasannya jikalau kamu betul-betul pendusta? \"",
      "ar": "قَالُوا۟ فَمَا جَزَ ٰ⁠ۤؤُهُۥۤ إِن كُنتُمۡ كَـٰذِبِینَ\n"
    }
  },
  {
    "id": 1671,
    "surahId": 12,
    "ayahNumber": 75,
    "arabicText": "قَالُوا۟ جَزَ ٰ⁠ۤؤُهُۥ مَن وُجِدَ فِی رَحۡلِهِۦ فَهُوَ جَزَ ٰ⁠ۤؤُهُۥۚ كَذَ ٰ⁠لِكَ نَجۡزِی ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "[The brothers] replied: \"Its requital? He in whose camel-pack [the cup] is found-he shall be [enslaved as] a requital thereof! Thus do we [ourselves] requite the doers of [such] wrong.",
      "ms": "Mereka menjawab: \"Balasannya: sesiapa yang didapati benda itu di kenderaannya, maka dia lah sendiri yang menjadi balasannya. Demikianlah kami membalas orang-orang yang zalim\".",
      "id": "Mereka menjawab: \"Balasannya, ialah pada siapa diketemukan (barang yang hilang) dalam karungnya, maka dia sendirilah balasannya (tebusannya)\". Demikianlah kami memberi pembalasan kepada orang-orang yang zalim.",
      "ar": "قَالُوا۟ جَزَ ٰ⁠ۤؤُهُۥ مَن وُجِدَ فِی رَحۡلِهِۦ فَهُوَ جَزَ ٰ⁠ۤؤُهُۥۚ كَذَ ٰ⁠لِكَ نَجۡزِی ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1672,
    "surahId": 12,
    "ayahNumber": 76,
    "arabicText": "فَبَدَأَ بِأَوۡعِیَتِهِمۡ قَبۡلَ وِعَاۤءِ أَخِیهِ ثُمَّ ٱسۡتَخۡرَجَهَا مِن وِعَاۤءِ أَخِیهِۚ كَذَ ٰ⁠لِكَ كِدۡنَا لِیُوسُفَۖ مَا كَانَ لِیَأۡخُذَ أَخَاهُ فِی دِینِ ٱلۡمَلِكِ إِلَّاۤ أَن یَشَاۤءَ ٱللَّهُۚ نَرۡفَعُ دَرَجَـٰتࣲ مَّن نَّشَاۤءُۗ وَفَوۡقَ كُلِّ ذِی عِلۡمٍ عَلِیمࣱ\n",
    "translations": {
      "en": "Thereupon [they were brought before Joseph to be searched; and] he began with the bags of his half-brothers before the bag of his brother [Benjamin]: and in the end he brought forth the drinking Cups out of his brother's bag. In this way did We contrive for Joseph [the attainment of his heart's desire]: under the King's law, he would [otherwise] not have been able to detain his brother, had not God so willed. We do raise to [high] degrees [of knowledge] whomever We will - but above everyone who is endowed with knowledge there is One who knows all.",
      "ms": "Maka Yusuf pun mulailah memeriksa tempat-tempat barang mereka sebelum memeriksa tempat barang saudara kandungnya (Bunyamin) kemudian ia mengeluarkan benda yang hilang itu dari tempat simpanan barang saudara kandungnya. Demikianlah Kami jayakan rancangan untuk (menyampaikan hajat) Yusuf. Tidaklah ia akan dapat mengambil saudara kandungnya menurut undang-undang raja, kecuali jika dikehendaki oleh Allah. (Dengan ilmu pengetahuan), Kami tinggikan pangkat kedudukan sesiapa yang Kami kehendaki, dan tiap-tiap orang yang berilmu pengetahuan, ada lagi di atasnya yang lebih mengetahui,",
      "id": "Maka mulailah Yusuf (memeriksa) karung-karung mereka sebelum (memeriksa) karung saudaranya sendiri, kemudian dia mengeluarkan piala raja itu dari karung saudaranya. Demikianlah Kami atur untuk (mencapai maksud) Yusuf. Tiadalah patut Yusuf menghukum saudaranya menurut undang-undang raja, kecuali Allah menghendaki-Nya. Kami tinggikan derajat orang yang Kami kehendaki; dan di atas tiap-tiap orang yang berpengetahuan itu ada lagi Yang Maha Mengetahui.",
      "ar": "فَبَدَأَ بِأَوۡعِیَتِهِمۡ قَبۡلَ وِعَاۤءِ أَخِیهِ ثُمَّ ٱسۡتَخۡرَجَهَا مِن وِعَاۤءِ أَخِیهِۚ كَذَ ٰ⁠لِكَ كِدۡنَا لِیُوسُفَۖ مَا كَانَ لِیَأۡخُذَ أَخَاهُ فِی دِینِ ٱلۡمَلِكِ إِلَّاۤ أَن یَشَاۤءَ ٱللَّهُۚ نَرۡفَعُ دَرَجَـٰتࣲ مَّن نَّشَاۤءُۗ وَفَوۡقَ كُلِّ ذِی عِلۡمٍ عَلِیمࣱ\n"
    }
  },
  {
    "id": 1673,
    "surahId": 12,
    "ayahNumber": 77,
    "arabicText": "۞ قَالُوۤا۟ إِن یَسۡرِقۡ فَقَدۡ سَرَقَ أَخࣱ لَّهُۥ مِن قَبۡلُۚ فَأَسَرَّهَا یُوسُفُ فِی نَفۡسِهِۦ وَلَمۡ یُبۡدِهَا لَهُمۡۚ قَالَ أَنتُمۡ شَرࣱّ مَّكَانࣰاۖ وَٱللَّهُ أَعۡلَمُ بِمَا تَصِفُونَ\n",
    "translations": {
      "en": "[As soon as the cup came to light out of Benjamin's bag, the brothers] exclaimed: \"If he has stolen-well, a brother of his used to steal afore-time!\" Thereupon Joseph said to himself, without revealing his thought to them: \"You are far worse in this respect, and God is fully aware of what you are saying.",
      "ms": "Mereka berkata:\" Kalau dia mencuri, maka (tidaklah pelik), kerana sesungguhnya saudara kandungnya pernah juga mencuri dahulu. (Mendengar kata-kata yang menyinggung itu) maka Yusuf pun menyembunyikan perasaannya, dan tidak menyatakannya kepada mereka, sambil berkata (dalam hati): \"Kamulah yang lebih buruk keadaannya; dan Allah Maha Mengetahui akan apa yang kamu katakan itu\".",
      "id": "Mereka berkata: \"Jika ia mencuri, maka sesungguhnya, telah pernah mencuri pula saudaranya sebelum itu\". Maka Yusuf menyembunyikan kejengkelan itu pada dirinya dan tidak menampakkannya kepada mereka. Dia berkata (dalam hatinya): \"Kamu lebih buruk kedudukanmu (sifat-sifatmu) dan Allah Maha Mengetahui apa yang kamu terangkan itu\".",
      "ar": "۞ قَالُوۤا۟ إِن یَسۡرِقۡ فَقَدۡ سَرَقَ أَخࣱ لَّهُۥ مِن قَبۡلُۚ فَأَسَرَّهَا یُوسُفُ فِی نَفۡسِهِۦ وَلَمۡ یُبۡدِهَا لَهُمۡۚ قَالَ أَنتُمۡ شَرࣱّ مَّكَانࣰاۖ وَٱللَّهُ أَعۡلَمُ بِمَا تَصِفُونَ\n"
    }
  },
  {
    "id": 1674,
    "surahId": 12,
    "ayahNumber": 78,
    "arabicText": "قَالُوا۟ یَـٰۤأَیُّهَا ٱلۡعَزِیزُ إِنَّ لَهُۥۤ أَبࣰا شَیۡخࣰا كَبِیرࣰا فَخُذۡ أَحَدَنَا مَكَانَهُۥۤۖ إِنَّا نَرَىٰكَ مِنَ ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "They said: \"O thou great one! Behold, he has a father, a very old man: detain, therefore, one of us in his stead. Verily, we see that thou art a doer of good!\"",
      "ms": "Merekapun merayu dengan berkata: \"Wahai datuk menteri! Sesungguhnya ia (Bunyamin), mempunyai bapa yang sudah tua, lagi berpangkat. Oleh itu, ambilah salah seorang di antara kami sebagai gantinya; sesungguhnya kami memandangmu dari orang-orang yang sentiasa berbudi \".",
      "id": "Mereka berkata: \"Wahai Al Aziz, sesungguhnya ia mempunyai ayah yang sudah lanjut usianya, lantaran itu ambillah salah seorang diantara kami sebagai gantinya, sesungguhnya kami melihat kamu termasuk oranng-orang yang berbuat baik\".",
      "ar": "قَالُوا۟ یَـٰۤأَیُّهَا ٱلۡعَزِیزُ إِنَّ لَهُۥۤ أَبࣰا شَیۡخࣰا كَبِیرࣰا فَخُذۡ أَحَدَنَا مَكَانَهُۥۤۖ إِنَّا نَرَىٰكَ مِنَ ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 1675,
    "surahId": 12,
    "ayahNumber": 79,
    "arabicText": "قَالَ مَعَاذَ ٱللَّهِ أَن نَّأۡخُذَ إِلَّا مَن وَجَدۡنَا مَتَـٰعَنَا عِندَهُۥۤ إِنَّاۤ إِذࣰا لَّظَـٰلِمُونَ\n",
    "translations": {
      "en": "He answered: \"May God preserve us from [the sin of] detaining any other than him with whom we have found our property-for then, behold, we would indeed be evildoers!\"",
      "ms": "Yusuf berkata: \"Kami berlindung kepada Allah daripada mengambil sesiapapun kecuali orang yang kami dapati barang kami dalam simpanannya. Sesungguhnya jika kami mengambil orang lain, nescaya menjadilah kami orang-orang yang zalim\".",
      "id": "Berkata Yusuf: \"Aku mohon perlindungan kepada Allah daripada menahan seorang, kecuali orang yang kami ketemukan harta benda kami padanya, jika kami berbuat demikian, maka benar-benarlah kami orang-orang yang zalim\".",
      "ar": "قَالَ مَعَاذَ ٱللَّهِ أَن نَّأۡخُذَ إِلَّا مَن وَجَدۡنَا مَتَـٰعَنَا عِندَهُۥۤ إِنَّاۤ إِذࣰا لَّظَـٰلِمُونَ\n"
    }
  },
  {
    "id": 1676,
    "surahId": 12,
    "ayahNumber": 80,
    "arabicText": "فَلَمَّا ٱسۡتَیۡـَٔسُوا۟ مِنۡهُ خَلَصُوا۟ نَجِیࣰّاۖ قَالَ كَبِیرُهُمۡ أَلَمۡ تَعۡلَمُوۤا۟ أَنَّ أَبَاكُمۡ قَدۡ أَخَذَ عَلَیۡكُم مَّوۡثِقࣰا مِّنَ ٱللَّهِ وَمِن قَبۡلُ مَا فَرَّطتُمۡ فِی یُوسُفَۖ فَلَنۡ أَبۡرَحَ ٱلۡأَرۡضَ حَتَّىٰ یَأۡذَنَ لِیۤ أَبِیۤ أَوۡ یَحۡكُمَ ٱللَّهُ لِیۖ وَهُوَ خَیۡرُ ٱلۡحَـٰكِمِینَ\n",
    "translations": {
      "en": "And so, when they lost all hope of [moving] him, they withdrew to take counsel [among themselves]. The eldest of them said: \"Do you not remember that your father has bound you by a solemn pledge before God - and how, before that, you had failed with regard to Joseph? Hence, I shall not depart from this land till my father gives me leave or God passes judgment in my favour: for He is the best of all judges.",
      "ms": "Maka apabila mereka berputus asa daripada mendapat pertolongannya, merekapun mengasingkan diri lalu bermesyuarat tentang hal itu. Berkatalah ketua mereka (saudaranya yang sulung): \"Tidakkah kamu ketahui bahawa bapa kita telah mengambil janji dari kamu yang dikuatkan dengan nama Allah, dan dahulu pun kamu telah mencuaikan janji dan sumpah kamu dalam perkara menjaga keselamatan Yusuf? Oleh itu, aku tidak sekali-kali akan meninggalkan negeri (Mesir) ini sehingga bapaku izinkan aku (kembali atau sehingga Allah menghukum bagiku (untuk meninggalkan negeri ini), dan Dia lah Hakim yang seadil-adilnya.",
      "id": "Maka tatkala mereka berputus asa dari pada (putusan) Yusuf mereka menyendiri sambil berunding dengan berbisik-bisik. Berkatalah yang tertua diantara mereka: \"Tidakkah kamu ketahui bahwa sesungguhnya ayahmu telah mengambil janji dari kamu dengan nama Allah dan sebelum itu kamu telah menyia-nyiakan Yusuf. Sebab itu aku tidak akan meninggalkan negeri Mesir, sampai ayahku mengizinkan kepadaku (untuk kembali), atau Allah memberi keputusan terhadapku. Dan Dia adalah Hakim yang sebaik-baiknya\".",
      "ar": "فَلَمَّا ٱسۡتَیۡـَٔسُوا۟ مِنۡهُ خَلَصُوا۟ نَجِیࣰّاۖ قَالَ كَبِیرُهُمۡ أَلَمۡ تَعۡلَمُوۤا۟ أَنَّ أَبَاكُمۡ قَدۡ أَخَذَ عَلَیۡكُم مَّوۡثِقࣰا مِّنَ ٱللَّهِ وَمِن قَبۡلُ مَا فَرَّطتُمۡ فِی یُوسُفَۖ فَلَنۡ أَبۡرَحَ ٱلۡأَرۡضَ حَتَّىٰ یَأۡذَنَ لِیۤ أَبِیۤ أَوۡ یَحۡكُمَ ٱللَّهُ لِیۖ وَهُوَ خَیۡرُ ٱلۡحَـٰكِمِینَ\n"
    }
  },
  {
    "id": 1677,
    "surahId": 12,
    "ayahNumber": 81,
    "arabicText": "ٱرۡجِعُوۤا۟ إِلَىٰۤ أَبِیكُمۡ فَقُولُوا۟ یَـٰۤأَبَانَاۤ إِنَّ ٱبۡنَكَ سَرَقَ وَمَا شَهِدۡنَاۤ إِلَّا بِمَا عَلِمۡنَا وَمَا كُنَّا لِلۡغَیۡبِ حَـٰفِظِینَ\n",
    "translations": {
      "en": "[And as for you others,] return to your father and say: `O our father! Behold, thy son has stolen-but we [can] bear witness to no more than what has become known to us; and [although we gave you our pledge,] we could not guard against something that [lay hidden in the future and, hence,] was beyond the reach of our perception.",
      "ms": "Kembalilah kamu kepada bapa kamu, dan katakanlah, wahai ayah kami! Sesungguhnya anakmu (Bunyamin) telah mencuri, dan kami tidak menjadi saksi (terhadapnya) melainkan dengan apa yang kami ketahui dan kami tidaklah dapat menjaga perkara yang ghaib.",
      "id": "Kembalilah kepada ayahmu dan katakanlah: \"Wahai ayah kami! Sesungguhnya anakmu telah mencuri, dan kami hanya menyaksikan apa yang kami ketahui, dan sekali-kali kami tidak dapat menjaga (mengetahui) barang yang ghaib.",
      "ar": "ٱرۡجِعُوۤا۟ إِلَىٰۤ أَبِیكُمۡ فَقُولُوا۟ یَـٰۤأَبَانَاۤ إِنَّ ٱبۡنَكَ سَرَقَ وَمَا شَهِدۡنَاۤ إِلَّا بِمَا عَلِمۡنَا وَمَا كُنَّا لِلۡغَیۡبِ حَـٰفِظِینَ\n"
    }
  },
  {
    "id": 1678,
    "surahId": 12,
    "ayahNumber": 82,
    "arabicText": "وَسۡـَٔلِ ٱلۡقَرۡیَةَ ٱلَّتِی كُنَّا فِیهَا وَٱلۡعِیرَ ٱلَّتِیۤ أَقۡبَلۡنَا فِیهَاۖ وَإِنَّا لَصَـٰدِقُونَ\n",
    "translations": {
      "en": "And ask thou in the town in which we were [at the time], and of the people of the caravan with whom we travelled hither, and [thou wilt find that] we, are indeed telling the truth!\"'",
      "ms": "Dan bertanyalah kepada penduduk negeri (Mesir) tempat kami tinggal (berdagang) dan kepada orang-orang kafilah yang kami balik bersamanya. Sesungguhnya kami adalah orang-orang yang benar\".",
      "id": "Dan tanyalah (penduduk) negeri yang kami berada disitu, dan kafilah yang kami datang bersamanya, dan sesungguhnya kami adalah orang-orang yang benar\".",
      "ar": "وَسۡـَٔلِ ٱلۡقَرۡیَةَ ٱلَّتِی كُنَّا فِیهَا وَٱلۡعِیرَ ٱلَّتِیۤ أَقۡبَلۡنَا فِیهَاۖ وَإِنَّا لَصَـٰدِقُونَ\n"
    }
  },
  {
    "id": 1679,
    "surahId": 12,
    "ayahNumber": 83,
    "arabicText": "قَالَ بَلۡ سَوَّلَتۡ لَكُمۡ أَنفُسُكُمۡ أَمۡرࣰاۖ فَصَبۡرࣱ جَمِیلٌۖ عَسَى ٱللَّهُ أَن یَأۡتِیَنِی بِهِمۡ جَمِیعًاۚ إِنَّهُۥ هُوَ ٱلۡعَلِیمُ ٱلۡحَكِیمُ\n",
    "translations": {
      "en": "[AND WHEN they returned to their father and told him what had happened,] he exclaimed: \"Nay, but it is your [own] minds that have made [so terrible] a happening seem a matter of little account to you! But [as for myself,] patience in adversity is most goodly; God may well bring them all [back] unto me: verily, He alone is all-knowing, truly wise!\"",
      "ms": "(Setelah mereka kembali dan menyampaikan hal itu kepada bapa mereka) berkatalah ia: \"(Tidaklah benar apa yang kamu katakan itu) bahkan nafsu kamu telah memperelokkan pada pandangan kamu suatu perkara (yang kamu rancangkan). Jika demikian, bersabarlah aku dengan sebaik-baiknya, mudah-mudahan Allah mengembalikan mereka semua kepadaku. Sesungguhnya Dia lah jua Yang Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "Ya'qub berkata: \"Hanya dirimu sendirilah yang memandang baik perbuatan (yang buruk) itu. Maka kesabaran yang baik itulah (kesabaranku). Mudah-mudahan Allah mendatangkan mereka semuanya kepadaku; sesungguhnya Dialah Yang Maha Mengetahui lagi Maha Bijaksana\".",
      "ar": "قَالَ بَلۡ سَوَّلَتۡ لَكُمۡ أَنفُسُكُمۡ أَمۡرࣰاۖ فَصَبۡرࣱ جَمِیلٌۖ عَسَى ٱللَّهُ أَن یَأۡتِیَنِی بِهِمۡ جَمِیعًاۚ إِنَّهُۥ هُوَ ٱلۡعَلِیمُ ٱلۡحَكِیمُ\n"
    }
  },
  {
    "id": 1680,
    "surahId": 12,
    "ayahNumber": 84,
    "arabicText": "وَتَوَلَّىٰ عَنۡهُمۡ وَقَالَ یَـٰۤأَسَفَىٰ عَلَىٰ یُوسُفَ وَٱبۡیَضَّتۡ عَیۡنَاهُ مِنَ ٱلۡحُزۡنِ فَهُوَ كَظِیمࣱ\n",
    "translations": {
      "en": "But he turned away from them and said: \"O woe is me for Joseph!\"-and his eyes became dim from the grief with which he was filled.",
      "ms": "Dan (bapa mereka - Nabi Yaakub) pun berpaling dari mereka (kerana berita yang mengharukan itu) sambil berkata: Aduhai sedihnya aku kerana Yusuf, dan putihlah dua belah matanya disebabkan ratap tangis dukacitanya kerana ia orang yang memendamkan marahnya di dalam hati.",
      "id": "Dan Ya'qub berpaling dari mereka (anak-anaknya) seraya berkata: \"Aduhai duka citaku terhadap Yusuf\", dan kedua matanya menjadi putih karena kesedihan dan dia adalah seorang yang menahan amarahnya (terhadap anak-anaknya).",
      "ar": "وَتَوَلَّىٰ عَنۡهُمۡ وَقَالَ یَـٰۤأَسَفَىٰ عَلَىٰ یُوسُفَ وَٱبۡیَضَّتۡ عَیۡنَاهُ مِنَ ٱلۡحُزۡنِ فَهُوَ كَظِیمࣱ\n"
    }
  },
  {
    "id": 1681,
    "surahId": 12,
    "ayahNumber": 85,
    "arabicText": "قَالُوا۟ تَٱللَّهِ تَفۡتَؤُا۟ تَذۡكُرُ یُوسُفَ حَتَّىٰ تَكُونَ حَرَضًا أَوۡ تَكُونَ مِنَ ٱلۡهَـٰلِكِینَ\n",
    "translations": {
      "en": "Said [his sons]: \"By God! Thou wilt never cease to remember, Joseph till thou art broken in body and spirit or art dead!\"",
      "ms": "Mereka berkata: \"Demi Allah, ayah tak habis-habis ingat kepada Yusuf, sehingga ayah menjadi sakit merana, atau menjadi dari orang-orang yang binasa\".",
      "id": "Mereka berkata: \"Demi Allah, senantiasa kamu mengingati Yusuf, sehingga kamu mengidapkan penyakit yang berat atau termasuk orang-orang yang binasa\".",
      "ar": "قَالُوا۟ تَٱللَّهِ تَفۡتَؤُا۟ تَذۡكُرُ یُوسُفَ حَتَّىٰ تَكُونَ حَرَضًا أَوۡ تَكُونَ مِنَ ٱلۡهَـٰلِكِینَ\n"
    }
  },
  {
    "id": 1682,
    "surahId": 12,
    "ayahNumber": 86,
    "arabicText": "قَالَ إِنَّمَاۤ أَشۡكُوا۟ بَثِّی وَحُزۡنِیۤ إِلَى ٱللَّهِ وَأَعۡلَمُ مِنَ ٱللَّهِ مَا لَا تَعۡلَمُونَ\n",
    "translations": {
      "en": "He answered: \"It is only to God that I complain of my deep grief and my sorrow: for I know, from God, something that you do not know.",
      "ms": "(Nabi Yaakub) menjawab: \"Sesungguhnya aku hanyalah mengadukan kesusahan dan dukacitaku kepada Allah dan aku mengetahui (dengan perantaraan wahyu) dari Allah, apa yang kamu tidak mengetahuinya.",
      "id": "Ya'qub menjawab: \"Sesungguhnya hanyalah kepada Allah aku mengadukan kesusahan dan kesedihanku, dan aku mengetahui dari Allah apa yang kamu tiada mengetahuinya\".",
      "ar": "قَالَ إِنَّمَاۤ أَشۡكُوا۟ بَثِّی وَحُزۡنِیۤ إِلَى ٱللَّهِ وَأَعۡلَمُ مِنَ ٱللَّهِ مَا لَا تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1683,
    "surahId": 12,
    "ayahNumber": 87,
    "arabicText": "یَـٰبَنِیَّ ٱذۡهَبُوا۟ فَتَحَسَّسُوا۟ مِن یُوسُفَ وَأَخِیهِ وَلَا تَا۟یۡـَٔسُوا۟ مِن رَّوۡحِ ٱللَّهِۖ إِنَّهُۥ لَا یَا۟یۡـَٔسُ مِن رَّوۡحِ ٱللَّهِ إِلَّا ٱلۡقَوۡمُ ٱلۡكَـٰفِرُونَ\n",
    "translations": {
      "en": "[Hence,] O my sons, go forth and try to obtain some tidings of Joseph and his brother; and do not lose hope of God's life-giving mercy: verily, none but people who deny the truth can ever lose hope of God's life-giving mercy.",
      "ms": "Wahai anak-anakku! Pergilah dan intiplah khabar berita mengenai Yusuf dan saudaranya (Bunyamin), dan janganlah kamu berputus asa dari rahmat serta pertolongan Allah. Sesungguhnya tidak berputus asa dari rahmat dan pertolongan Allah itu melainkan kaum yang kafir\".",
      "id": "Hai anak-anakku, pergilah kamu, maka carilah berita tentang Yusuf dan saudaranya dan jangan kamu berputus asa dari rahmat Allah. Sesungguhnya tiada berputus asa dari rahmat Allah, melainkan kaum yang kafir\".",
      "ar": "یَـٰبَنِیَّ ٱذۡهَبُوا۟ فَتَحَسَّسُوا۟ مِن یُوسُفَ وَأَخِیهِ وَلَا تَا۟یۡـَٔسُوا۟ مِن رَّوۡحِ ٱللَّهِۖ إِنَّهُۥ لَا یَا۟یۡـَٔسُ مِن رَّوۡحِ ٱللَّهِ إِلَّا ٱلۡقَوۡمُ ٱلۡكَـٰفِرُونَ\n"
    }
  },
  {
    "id": 1684,
    "surahId": 12,
    "ayahNumber": 88,
    "arabicText": "فَلَمَّا دَخَلُوا۟ عَلَیۡهِ قَالُوا۟ یَـٰۤأَیُّهَا ٱلۡعَزِیزُ مَسَّنَا وَأَهۡلَنَا ٱلضُّرُّ وَجِئۡنَا بِبِضَـٰعَةࣲ مُّزۡجَىٰةࣲ فَأَوۡفِ لَنَا ٱلۡكَیۡلَ وَتَصَدَّقۡ عَلَیۡنَاۤۖ إِنَّ ٱللَّهَ یَجۡزِی ٱلۡمُتَصَدِّقِینَ\n",
    "translations": {
      "en": "[AND THE SONS of Jacob went back to Egypt and to Joseph;] and when they presented themselves before him, they said: \"O thou great one! Hardship has visited us and our folk, and so we have brought but scanty merchandise; but give us a full measure [of grain], and be charitable to us: behold, God rewards those who give in charity!\"",
      "ms": "Maka (bertolaklah mereka ke Mesir, dan) setelah mereka masuk mengadap Yusuf, berkatalah mereka: \"Wahai Datuk Menteri, kami dan keluarga kami telah menderita kesusahan (kemarau), dan kami datang dengan membawa barang-barang yang kurang baik dan tidak berharga (untuk menjadi tukaran bagi benda-benda makanan negeri ini). Oleh itu, sempurnakanlah sukatan bekalan makanan bagi kami dan mendermalah kepada kami, sesungguhnya Allah membalas dengan sebaik-baik balasan kepada orang-orang yang bermurah hati menderma\".",
      "id": "Maka ketika mereka masuk ke (tempat) Yusuf, mereka berkata: \"Hai Al Aziz, kami dan keluarga kami telah ditimpa kesengsaraan dan kami datang membawa barang-barang yang tak berharga, maka sempurnakanlah sukatan untuk kami, dan bersedekahlah kepada kami, sesungguhnya Allah memberi balasan kepada orang-orang yang bersedekah\".",
      "ar": "فَلَمَّا دَخَلُوا۟ عَلَیۡهِ قَالُوا۟ یَـٰۤأَیُّهَا ٱلۡعَزِیزُ مَسَّنَا وَأَهۡلَنَا ٱلضُّرُّ وَجِئۡنَا بِبِضَـٰعَةࣲ مُّزۡجَىٰةࣲ فَأَوۡفِ لَنَا ٱلۡكَیۡلَ وَتَصَدَّقۡ عَلَیۡنَاۤۖ إِنَّ ٱللَّهَ یَجۡزِی ٱلۡمُتَصَدِّقِینَ\n"
    }
  },
  {
    "id": 1685,
    "surahId": 12,
    "ayahNumber": 89,
    "arabicText": "قَالَ هَلۡ عَلِمۡتُم مَّا فَعَلۡتُم بِیُوسُفَ وَأَخِیهِ إِذۡ أَنتُمۡ جَـٰهِلُونَ\n",
    "translations": {
      "en": "Replied he: \"Do you remember what you did to Joseph and his brother when you were still unaware [of right and wrong]?\"",
      "ms": "Yusuf berkata: \"Tahukah kamu (betapa buruknya) apa yang kamu telah lakukan kepada Yusuf dan adiknya, semasa kamu masih jahil (tentang buruknya perbuatan yang demikian)?\"",
      "id": "Yusuf berkata: \"Apakah kamu mengetahui (kejelekan) apa yang telah kamu lakukan terhadap Yusuf dan saudaranya ketika kamu tidak mengetahui (akibat) perbuatanmu itu?\".",
      "ar": "قَالَ هَلۡ عَلِمۡتُم مَّا فَعَلۡتُم بِیُوسُفَ وَأَخِیهِ إِذۡ أَنتُمۡ جَـٰهِلُونَ\n"
    }
  },
  {
    "id": 1686,
    "surahId": 12,
    "ayahNumber": 90,
    "arabicText": "قَالُوۤا۟ أَءِنَّكَ لَأَنتَ یُوسُفُۖ قَالَ أَنَا۠ یُوسُفُ وَهَـٰذَاۤ أَخِیۖ قَدۡ مَنَّ ٱللَّهُ عَلَیۡنَاۤۖ إِنَّهُۥ مَن یَتَّقِ وَیَصۡبِرۡ فَإِنَّ ٱللَّهَ لَا یُضِیعُ أَجۡرَ ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "They exclaimed: \"Why - is it indeed thou who art Joseph?\" He answered: \"I am Joseph, and this is my brother. God has indeed been gracious unto us. Verily, if one is conscious of Him and patient in adversity behold, God does not fail to requite the doers of good!\"",
      "ms": "Mereka bertanya (dengan hairan): \"Engkau ini Yusufkah? \" Ia menjawab: \"Akulah Yusuf dan ini adikku (Bunyamin). Sesungguhnya Allah telah mengurniakan nikmatNya kepada kami. Sebenarnya sesiapa yang bertaqwa dan bersabar, maka sesungguhnya Allah tidak menghilangkan pahala orang-orang yang berbuat kebaikan.",
      "id": "Mereka berkata: \"Apakah kamu ini benar-benar Yusuf?\". Yusuf menjawab: \"Akulah Yusuf dan ini saudaraku. Sesungguhnya Allah telah melimpahkan karunia-Nya kepada kami\". Sesungguhnya barang siapa yang bertakwa dan bersabar, maka sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang berbuat baik\"",
      "ar": "قَالُوۤا۟ أَءِنَّكَ لَأَنتَ یُوسُفُۖ قَالَ أَنَا۠ یُوسُفُ وَهَـٰذَاۤ أَخِیۖ قَدۡ مَنَّ ٱللَّهُ عَلَیۡنَاۤۖ إِنَّهُۥ مَن یَتَّقِ وَیَصۡبِرۡ فَإِنَّ ٱللَّهَ لَا یُضِیعُ أَجۡرَ ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 1687,
    "surahId": 12,
    "ayahNumber": 91,
    "arabicText": "قَالُوا۟ تَٱللَّهِ لَقَدۡ ءَاثَرَكَ ٱللَّهُ عَلَیۡنَا وَإِن كُنَّا لَخَـٰطِـِٔینَ\n",
    "translations": {
      "en": "[The brothers] said: \"By God! Most certainly has God raised thee high above us, and we were indeed but sinners!\"",
      "ms": "Mereka berkata: \"Demi Allah! Sesungguhnya Allah telah melebihkan dan memuliakan engkau daripada kami (disebabkan taqwa dan kesabaranmu); dan sesungguhnya kami adalah orang-orang yang bersalah\".",
      "id": "Mereka berkata: \"Demi Allah, sesungguhnya Allah telah melebihkan kamu atas kami, dan sesungguhnya kami adalah orang-orang yang bersalah (berdosa)\".",
      "ar": "قَالُوا۟ تَٱللَّهِ لَقَدۡ ءَاثَرَكَ ٱللَّهُ عَلَیۡنَا وَإِن كُنَّا لَخَـٰطِـِٔینَ\n"
    }
  },
  {
    "id": 1688,
    "surahId": 12,
    "ayahNumber": 92,
    "arabicText": "قَالَ لَا تَثۡرِیبَ عَلَیۡكُمُ ٱلۡیَوۡمَۖ یَغۡفِرُ ٱللَّهُ لَكُمۡۖ وَهُوَ أَرۡحَمُ ٱلرَّ ٰ⁠حِمِینَ\n",
    "translations": {
      "en": "Said he: \"No reproach shall be uttered today against you. May God forgive you your sins: for He is the most merciful of the merciful!",
      "ms": "Yusuf berkata: \"Kamu pada hari ini tidak akan ditempelak atau disalahkan (tentang perbuatan kamu yang telah terlanjur itu), semoga Allah mengampunkan dosa kamu, dan Dia lah jua Yang Maha Mengasihani daripada segala yang lain yang mengasihani.",
      "id": "Dia (Yusuf) berkata: \"Pada hari ini tak ada cercaan terhadap kamu, mudah-mudahan Allah mengampuni (kamu), dan Dia adalah Maha Penyayang diantara para penyayang\".",
      "ar": "قَالَ لَا تَثۡرِیبَ عَلَیۡكُمُ ٱلۡیَوۡمَۖ یَغۡفِرُ ٱللَّهُ لَكُمۡۖ وَهُوَ أَرۡحَمُ ٱلرَّ ٰ⁠حِمِینَ\n"
    }
  },
  {
    "id": 1689,
    "surahId": 12,
    "ayahNumber": 93,
    "arabicText": "ٱذۡهَبُوا۟ بِقَمِیصِی هَـٰذَا فَأَلۡقُوهُ عَلَىٰ وَجۡهِ أَبِی یَأۡتِ بَصِیرࣰا وَأۡتُونِی بِأَهۡلِكُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "[And now] go and take this tunic of mine and lay it over my father's face, and he will recover his sight. And thereupon come [back] to me with all your family.\"",
      "ms": "Pergilah dengan membawa bajuku ini, kemudian letakkan pada muka ayahku supaya ia dapat melihat, dan selepas itu bawalah kepadaku keluarga kamu semuanya\".",
      "id": "Pergilah kamu dengan membawa baju gamisku ini, lalu letakkanlah dia kewajah ayahku, nanti ia akan melihat kembali; dan bawalah keluargamu semuanya kepadaku\".",
      "ar": "ٱذۡهَبُوا۟ بِقَمِیصِی هَـٰذَا فَأَلۡقُوهُ عَلَىٰ وَجۡهِ أَبِی یَأۡتِ بَصِیرࣰا وَأۡتُونِی بِأَهۡلِكُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 1690,
    "surahId": 12,
    "ayahNumber": 94,
    "arabicText": "وَلَمَّا فَصَلَتِ ٱلۡعِیرُ قَالَ أَبُوهُمۡ إِنِّی لَأَجِدُ رِیحَ یُوسُفَۖ لَوۡلَاۤ أَن تُفَنِّدُونِ\n",
    "translations": {
      "en": "AND AS SOON as the caravan [with which Jacob's sons were travelling] was on its way, their father said [to the people around him]: \"Behold, were it not that you might consider me a dotard, [I would say that] I truly feel the breath of Joseph [in the air]!\"",
      "ms": "Dan semasa kafilah (mereka meninggalkan Mesir menunju ke tempat bapa mereka di Palestin), berkatalah bapa mereka (kepada kaum kerabatnya yang ada di sisinya): \"Sesungguhnya aku ada terbau akan bau Yusuf. Jika kamu tidak menyangka aku sudah nyanyuk (tentulah kamu akan percaya)\".",
      "id": "Tatkala kafilah itu telah ke luar (dari negeri Mesir) berkata ayah mereka: \"Sesungguhnya aku mencium bau Yusuf, sekiranya kamu tidak menuduhku lemah akal (tentu kamu membenarkan aku)\".",
      "ar": "وَلَمَّا فَصَلَتِ ٱلۡعِیرُ قَالَ أَبُوهُمۡ إِنِّی لَأَجِدُ رِیحَ یُوسُفَۖ لَوۡلَاۤ أَن تُفَنِّدُونِ\n"
    }
  },
  {
    "id": 1691,
    "surahId": 12,
    "ayahNumber": 95,
    "arabicText": "قَالُوا۟ تَٱللَّهِ إِنَّكَ لَفِی ضَلَـٰلِكَ ٱلۡقَدِیمِ\n",
    "translations": {
      "en": "They answered: \"By God! Thou art indeed still lost in thy old aberration!\"",
      "ms": "Mereka berkata: \"Demi Allah! Sesungguhnya ayah masih berada dalam keadaan tidak siumanmu yang lama\".",
      "id": "Keluarganya berkata: \"Demi Allah, sesungguhnya kamu masih dalam kekeliruanmu yang dahulu\".",
      "ar": "قَالُوا۟ تَٱللَّهِ إِنَّكَ لَفِی ضَلَـٰلِكَ ٱلۡقَدِیمِ\n"
    }
  },
  {
    "id": 1692,
    "surahId": 12,
    "ayahNumber": 96,
    "arabicText": "فَلَمَّاۤ أَن جَاۤءَ ٱلۡبَشِیرُ أَلۡقَىٰهُ عَلَىٰ وَجۡهِهِۦ فَٱرۡتَدَّ بَصِیرࣰاۖ قَالَ أَلَمۡ أَقُل لَّكُمۡ إِنِّیۤ أَعۡلَمُ مِنَ ٱللَّهِ مَا لَا تَعۡلَمُونَ\n",
    "translations": {
      "en": "But when the bearer of good tidings came [with Joseph's tunic], he laid it over his face; and he regained his sight, [and] exclaimed: \"Did I not tell you, `Verily, I know, from God, something that you do not know'?\"",
      "ms": "Maka sebaik-baik sahaja datang pembawa khabar berita yang mengembirakan itu, dia pun meletakkan baju Yusuf pada muka Nabi Yaakub, lalu menjadilah ia celik kembali seperti sediakala. Nabi Yaakub berkata: \"Bukankah aku telah katakan kepada kamu, sesungguhnya aku mengetahui (dengan perantaraan wahyu) dari Allah akan apa yang kamu tidak mengetahuinya?\"",
      "id": "Tatkala telah tiba pembawa kabar gembira itu, maka diletakkannya baju gamis itu ke wajah Ya'qub, lalu kembalilah dia dapat melihat. Berkata Ya'qub: \"Tidakkah aku katakan kepadamu, bahwa aku mengetahui dari Allah apa yang kamu tidak mengetahuinya\".",
      "ar": "فَلَمَّاۤ أَن جَاۤءَ ٱلۡبَشِیرُ أَلۡقَىٰهُ عَلَىٰ وَجۡهِهِۦ فَٱرۡتَدَّ بَصِیرࣰاۖ قَالَ أَلَمۡ أَقُل لَّكُمۡ إِنِّیۤ أَعۡلَمُ مِنَ ٱللَّهِ مَا لَا تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1693,
    "surahId": 12,
    "ayahNumber": 97,
    "arabicText": "قَالُوا۟ یَـٰۤأَبَانَا ٱسۡتَغۡفِرۡ لَنَا ذُنُوبَنَاۤ إِنَّا كُنَّا خَـٰطِـِٔینَ\n",
    "translations": {
      "en": "[His sons] answered: \"O our father! Ask God to forgive us our sins, for, verily, we were sinners.\"",
      "ms": "Mereka berkata: \"Wahai ayah kami! Mintalah ampun bagi kami akan dosa-dosa kami; sesungguhnya kami adalah orang-orang yang bersalah\".",
      "id": "Mereka berkata: \"Wahai ayah kami, mohonkanlah ampun bagi kami terhadap dosa-dosa kami, sesungguhnya kami adalah orang-orang yang bersalah (berdosa)\".",
      "ar": "قَالُوا۟ یَـٰۤأَبَانَا ٱسۡتَغۡفِرۡ لَنَا ذُنُوبَنَاۤ إِنَّا كُنَّا خَـٰطِـِٔینَ\n"
    }
  },
  {
    "id": 1694,
    "surahId": 12,
    "ayahNumber": 98,
    "arabicText": "قَالَ سَوۡفَ أَسۡتَغۡفِرُ لَكُمۡ رَبِّیۤۖ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِیمُ\n",
    "translations": {
      "en": "He said: \"I shall ask my Sustainer to forgive you: He alone is truly forgiving, a true dispenser of grace!\"",
      "ms": "Nabi Yaakub berkata: \"Aku akan meminta ampun bagi kamu dari Tuhanku; sesungguhnya Dia lah jua Yang Maha Pengampun, lagi Maha Mengasihani\".",
      "id": "Ya'qub berkata: \"Aku akan memohonkan ampun bagimu kepada Tuhanku. Sesungguhnya Dialah Yang Maha Pengampun lagi Maha Penyayang\".",
      "ar": "قَالَ سَوۡفَ أَسۡتَغۡفِرُ لَكُمۡ رَبِّیۤۖ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِیمُ\n"
    }
  },
  {
    "id": 1695,
    "surahId": 12,
    "ayahNumber": 99,
    "arabicText": "فَلَمَّا دَخَلُوا۟ عَلَىٰ یُوسُفَ ءَاوَىٰۤ إِلَیۡهِ أَبَوَیۡهِ وَقَالَ ٱدۡخُلُوا۟ مِصۡرَ إِن شَاۤءَ ٱللَّهُ ءَامِنِینَ\n",
    "translations": {
      "en": "AND WHEN they [all arrived in Egypt and] presented themselves before Joseph, he drew his parents unto himself, saying, \"Enter Egypt! If God so wills, you shall be secure [from all evil]!\"",
      "ms": "Maka ketika mereka (Nabi Yaakub dan keluarganya) masuk (ke Mesir) menemui Yusuf, Yusuf segera menyambut serta memeluk kedua ibu bapanya, sambil berkata: \"Masuklah kamu ke negeri Mesir, insya Allah kamu berada di dalam aman.",
      "id": "Maka tatkala mereka masuk ke (tempat) Yusuf: Yusuf merangkul ibu bapanya dan dia berkata: \"Masuklah kamu ke negeri Mesir, insya Allah dalam keadaan aman\".",
      "ar": "فَلَمَّا دَخَلُوا۟ عَلَىٰ یُوسُفَ ءَاوَىٰۤ إِلَیۡهِ أَبَوَیۡهِ وَقَالَ ٱدۡخُلُوا۟ مِصۡرَ إِن شَاۤءَ ٱللَّهُ ءَامِنِینَ\n"
    }
  },
  {
    "id": 1696,
    "surahId": 12,
    "ayahNumber": 100,
    "arabicText": "وَرَفَعَ أَبَوَیۡهِ عَلَى ٱلۡعَرۡشِ وَخَرُّوا۟ لَهُۥ سُجَّدࣰاۖ وَقَالَ یَـٰۤأَبَتِ هَـٰذَا تَأۡوِیلُ رُءۡیَـٰیَ مِن قَبۡلُ قَدۡ جَعَلَهَا رَبِّی حَقࣰّاۖ وَقَدۡ أَحۡسَنَ بِیۤ إِذۡ أَخۡرَجَنِی مِنَ ٱلسِّجۡنِ وَجَاۤءَ بِكُم مِّنَ ٱلۡبَدۡوِ مِنۢ بَعۡدِ أَن نَّزَغَ ٱلشَّیۡطَـٰنُ بَیۡنِی وَبَیۡنَ إِخۡوَتِیۤۚ إِنَّ رَبِّی لَطِیفࣱ لِّمَا یَشَاۤءُۚ إِنَّهُۥ هُوَ ٱلۡعَلِیمُ ٱلۡحَكِیمُ\n",
    "translations": {
      "en": "And he raised his parents to the highest place of honour; and they [all] fell down before Him, prostrating themselves in adoration. Thereupon [Joseph] said: \"O my father! This is the real meaning of my dream of long ago, which my Sustainer has made come true. And He was indeed good to me when He freed me from the prison, and [when] He brought you [all unto me] from the desert after Satan had sown discord between me and my brothers. Verily, my Sustainer is unfathomable in [the way He brings about] whatever He wills: verily, He alone is all-knowing, truly wise!",
      "ms": "Dan ia dudukkan kedua ibu bapanya (bersama-samanya) di atas kerusi kebesaran. Dan setelah itu mereka semuanya tunduk memberi hormat kepada Yusuf. Dan (pada saat itu) berkatalah Yusuf: \"Wahai ayahku! Inilah dia tafsiran mimpiku dahulu. Sesungguhnya Allah telah menjadikan mimpiku itu benar. Dan sesungguhnya Ia telah melimpahkan kebaikan kepadaku ketika Ia mengeluarkan daku dari penjara; dan Ia membawa kamu ke mari dari dosa sesudah Syaitan (dengan hasutannya) merosakkan perhubungan antaraku dengan saudara-saudaraku. Sesungguhnya Tuhanku lemah-lembut tadbirNya bagi apa yang dikehendakiNya; sesungguhnya Dia lah yang Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "Dan ia menaikkan kedua ibu-bapanya ke atas singgasana. Dan mereka (semuanya) merebahkan diri seraya sujud kepada Yusuf. Dan berkata Yusuf: \"Wahai ayahku inilah ta'bir mimpiku yang dahulu itu; sesungguhnya Tuhanku telah menjadikannya suatu kenyataan. Dan sesungguhnya Tuhanku telah berbuat baik kepadaku, ketika Dia membebaskan aku dari rumah penjara dan ketika membawa kamu dari dusun padang pasir, setelah syaitan merusakkan (hubungan) antaraku dan saudara-saudaraku. Sesungguhnya Tuhanku Maha Lembut terhadap apa yang Dia kehendaki. Sesungguhnya Dialah Yang Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "وَرَفَعَ أَبَوَیۡهِ عَلَى ٱلۡعَرۡشِ وَخَرُّوا۟ لَهُۥ سُجَّدࣰاۖ وَقَالَ یَـٰۤأَبَتِ هَـٰذَا تَأۡوِیلُ رُءۡیَـٰیَ مِن قَبۡلُ قَدۡ جَعَلَهَا رَبِّی حَقࣰّاۖ وَقَدۡ أَحۡسَنَ بِیۤ إِذۡ أَخۡرَجَنِی مِنَ ٱلسِّجۡنِ وَجَاۤءَ بِكُم مِّنَ ٱلۡبَدۡوِ مِنۢ بَعۡدِ أَن نَّزَغَ ٱلشَّیۡطَـٰنُ بَیۡنِی وَبَیۡنَ إِخۡوَتِیۤۚ إِنَّ رَبِّی لَطِیفࣱ لِّمَا یَشَاۤءُۚ إِنَّهُۥ هُوَ ٱلۡعَلِیمُ ٱلۡحَكِیمُ\n"
    }
  },
  {
    "id": 1697,
    "surahId": 12,
    "ayahNumber": 101,
    "arabicText": "۞ رَبِّ قَدۡ ءَاتَیۡتَنِی مِنَ ٱلۡمُلۡكِ وَعَلَّمۡتَنِی مِن تَأۡوِیلِ ٱلۡأَحَادِیثِۚ فَاطِرَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ أَنتَ وَلِیِّۦ فِی ٱلدُّنۡیَا وَٱلۡـَٔاخِرَةِۖ تَوَفَّنِی مُسۡلِمࣰا وَأَلۡحِقۡنِی بِٱلصَّـٰلِحِینَ\n",
    "translations": {
      "en": "\"O my Sustainer! Thou hast indeed bestowed upon me something of power, and hast imparted unto me some knowledge of the inner meaning of happenings. Originator of the heavens and the earth! Thou art near unto me in this world and in the life to come: let me die as one who has surrendered himself unto Thee, and make me one with the righteous!\"",
      "ms": "\"Wahai Tuhanku! Sesungguhnya Engkau telah mengurniakan daku sebahagian dari kekuasaan (pemerintahan) dan mengajarku sebahagian dari ilmu tafsiran mimpi. Wahai Tuhan yang menciptakan langit dan bumi Engkau Penguasa dan Pelindungku di dunia dan di akhirat; sempurnakanlah ajalku (ketika mati) dalam keadaan Islam, dan hubungkanlah daku dengan orang-orang yang soleh\".",
      "id": "Ya Tuhanku, sesungguhnya Engkau telah menganugerahkan kepadaku sebahagian kerajaan dan telah mengajarkan kepadaku sebahagian ta'bir mimpi. (Ya Tuhan) Pencipta langit dan bumi. Engkaulah Pelindungku di dunia dan di akhirat, wafatkanlah aku dalam keadaan Islam dan gabungkanlah aku dengan orang-orang yang saleh.",
      "ar": "۞ رَبِّ قَدۡ ءَاتَیۡتَنِی مِنَ ٱلۡمُلۡكِ وَعَلَّمۡتَنِی مِن تَأۡوِیلِ ٱلۡأَحَادِیثِۚ فَاطِرَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ أَنتَ وَلِیِّۦ فِی ٱلدُّنۡیَا وَٱلۡـَٔاخِرَةِۖ تَوَفَّنِی مُسۡلِمࣰا وَأَلۡحِقۡنِی بِٱلصَّـٰلِحِینَ\n"
    }
  },
  {
    "id": 1698,
    "surahId": 12,
    "ayahNumber": 102,
    "arabicText": "ذَ ٰ⁠لِكَ مِنۡ أَنۢبَاۤءِ ٱلۡغَیۡبِ نُوحِیهِ إِلَیۡكَۖ وَمَا كُنتَ لَدَیۡهِمۡ إِذۡ أَجۡمَعُوۤا۟ أَمۡرَهُمۡ وَهُمۡ یَمۡكُرُونَ\n",
    "translations": {
      "en": "THIS ACCOUNT of something that was beyond the reach of thy perception We [now] reveal unto thee, [O Prophet:] for thou wert not with Joseph's brothers when they resolved upon what they were going to do and wove their schemes [against him].",
      "ms": "(Kisah nabi Yusuf) yang demikian ialah dari berita-berita yang ghaib yang kami wahyukan kepadamu (wahai Muhammad), sedang engkau tidak ada bersama-sama mereka semasa mereka sekata mengambil keputusan (hendak membuang Yusuf ke dalam perigi) dan semasa mereka menjalankan rancangan jahat (terhadapnya untuk membinasakannya).",
      "id": "Demikian itu (adalah) diantara berita-berita yang ghaib yang Kami wahyukan kepadamu (Muhammad); padahal kamu tidak berada pada sisi mereka, ketika mereka memutuskan rencananya (untuk memasukkan Yusuf ke dalam sumur) dan mereka sedang mengatur tipu daya.",
      "ar": "ذَ ٰ⁠لِكَ مِنۡ أَنۢبَاۤءِ ٱلۡغَیۡبِ نُوحِیهِ إِلَیۡكَۖ وَمَا كُنتَ لَدَیۡهِمۡ إِذۡ أَجۡمَعُوۤا۟ أَمۡرَهُمۡ وَهُمۡ یَمۡكُرُونَ\n"
    }
  },
  {
    "id": 1699,
    "surahId": 12,
    "ayahNumber": 103,
    "arabicText": "وَمَاۤ أَكۡثَرُ ٱلنَّاسِ وَلَوۡ حَرَصۡتَ بِمُؤۡمِنِینَ\n",
    "translations": {
      "en": "Yet - however strongly thou mayest desire it -most people will not believe [in this revelation],",
      "ms": "Dan kebanyakan manusia tidak akan beriman walaupun engkau terlalu ingin (supaya mereka beriman).",
      "id": "Dan sebahagian besar manusia tidak akan beriman -- walaupun kamu sangat menginginkannya.",
      "ar": "وَمَاۤ أَكۡثَرُ ٱلنَّاسِ وَلَوۡ حَرَصۡتَ بِمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1700,
    "surahId": 12,
    "ayahNumber": 104,
    "arabicText": "وَمَا تَسۡـَٔلُهُمۡ عَلَیۡهِ مِنۡ أَجۡرٍۚ إِنۡ هُوَ إِلَّا ذِكۡرࣱ لِّلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "although thou dost not ask of them any reward for it: it is but [God's] reminder unto all mankind.",
      "ms": "Padahal engkau tidak meminta kepada mereka sebarang upah tentang ajaran Al-Quran, sedang Al-Quran itu tidak lain hanyalah peringatan dan pengajaran dari Allah bagi umat manusia seluruhnya.",
      "id": "Dan kamu sekali-kali tidak meminta upah kepada mereka (terhadap seruanmu ini), itu tidak lain hanyalah pengajaran bagi semesta alam.",
      "ar": "وَمَا تَسۡـَٔلُهُمۡ عَلَیۡهِ مِنۡ أَجۡرٍۚ إِنۡ هُوَ إِلَّا ذِكۡرࣱ لِّلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 1701,
    "surahId": 12,
    "ayahNumber": 105,
    "arabicText": "وَكَأَیِّن مِّنۡ ءَایَةࣲ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ یَمُرُّونَ عَلَیۡهَا وَهُمۡ عَنۡهَا مُعۡرِضُونَ\n",
    "translations": {
      "en": "But [then] -how many a sign is there in the heavens and on earth which they pass by [unthinkingly], and on which they turn their backs!",
      "ms": "Dan berapa banyak tanda-tanda kekuasaan Allah di langit dan di bumi yang mereka menyaksikannya berulang-ulang semasa mereka pagi dan datang, sedang mereka tidak juga menghiraukan dan memikirkannya.",
      "id": "Dan banyak sekali tanda-tanda (kekuasaan Allah) di langit dan di bumi yang mereka melaluinya, sedang mereka berpaling dari padanya.",
      "ar": "وَكَأَیِّن مِّنۡ ءَایَةࣲ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ یَمُرُّونَ عَلَیۡهَا وَهُمۡ عَنۡهَا مُعۡرِضُونَ\n"
    }
  },
  {
    "id": 1702,
    "surahId": 12,
    "ayahNumber": 106,
    "arabicText": "وَمَا یُؤۡمِنُ أَكۡثَرُهُم بِٱللَّهِ إِلَّا وَهُم مُّشۡرِكُونَ\n",
    "translations": {
      "en": "And most of them do not even believe in God without [also] ascribing divine powers to other beings beside Him.",
      "ms": "Dan (orang-orang yang beriman kepada Allah), kebanyakan mereka tidak beriman kepada Allah melainkan mereka mempersekutukannya juga dengan yang lain.",
      "id": "Dan sebahagian besar dari mereka tidak beriman kepada Allah, melainkan dalam keadaan mempersekutukan Allah (dengan sembahan-sembahan lain).",
      "ar": "وَمَا یُؤۡمِنُ أَكۡثَرُهُم بِٱللَّهِ إِلَّا وَهُم مُّشۡرِكُونَ\n"
    }
  },
  {
    "id": 1703,
    "surahId": 12,
    "ayahNumber": 107,
    "arabicText": "أَفَأَمِنُوۤا۟ أَن تَأۡتِیَهُمۡ غَـٰشِیَةࣱ مِّنۡ عَذَابِ ٱللَّهِ أَوۡ تَأۡتِیَهُمُ ٱلسَّاعَةُ بَغۡتَةࣰ وَهُمۡ لَا یَشۡعُرُونَ\n",
    "translations": {
      "en": "Do they, then, feel free from the fear that there might fall upon them the overwhelming terror of God's chastisement, or that the Last Hour might come upon them of a sudden, without their being aware [of its approach]?",
      "ms": "(Mengapa mereka bersikap demikian?) Adakah mereka merasa aman dari didatangi azab Allah yang meliputi mereka, atau didatangi hari kiamat secara mengejut, sedang mereka tidak menyedarinya?",
      "id": "Apakah mereka merasa aman dari kedatangan siksa Allah yang meliputi mereka, atau kedatangan kiamat kepada mereka secara mendadak, sedang mereka tidak menyadarinya?",
      "ar": "أَفَأَمِنُوۤا۟ أَن تَأۡتِیَهُمۡ غَـٰشِیَةࣱ مِّنۡ عَذَابِ ٱللَّهِ أَوۡ تَأۡتِیَهُمُ ٱلسَّاعَةُ بَغۡتَةࣰ وَهُمۡ لَا یَشۡعُرُونَ\n"
    }
  },
  {
    "id": 1704,
    "surahId": 12,
    "ayahNumber": 108,
    "arabicText": "قُلۡ هَـٰذِهِۦ سَبِیلِیۤ أَدۡعُوۤا۟ إِلَى ٱللَّهِۚ عَلَىٰ بَصِیرَةٍ أَنَا۠ وَمَنِ ٱتَّبَعَنِیۖ وَسُبۡحَـٰنَ ٱللَّهِ وَمَاۤ أَنَا۠ مِنَ ٱلۡمُشۡرِكِینَ\n",
    "translations": {
      "en": "Say [O Prophet]: \"This is my way: Resting upon conscious insight accessible to reason, I am calling [you all] unto God - I and they who follow me.\" And [say:] \"Limitless is God in His glory; and I am not one of those who ascribe divinity to aught beside Him!\"",
      "ms": "Katakanlah (wahai Muhammad): \"Inilah jalanku, aku dan orang-orang yang menurutku, menyeru manusia umumnya kepada ugama Allah dengan berdasarkan keterangan dan bukti yang jelas nyata. Dan aku menegaskan: Maha suci Allah (dari segala iktiqad dan perbuatan syirik); dan bukanlah aku dari golongan yang mempersekutukan Allah dengan sesuatu yang lain.\"",
      "id": "Katakanlah: \"Inilah jalan (agama)ku, aku dan orang-orang yang mengikutiku mengajak (kamu) kepada Allah dengan hujjah yang nyata, Maha Suci Allah, dan aku tiada termasuk orang-orang yang musyrik\".",
      "ar": "قُلۡ هَـٰذِهِۦ سَبِیلِیۤ أَدۡعُوۤا۟ إِلَى ٱللَّهِۚ عَلَىٰ بَصِیرَةٍ أَنَا۠ وَمَنِ ٱتَّبَعَنِیۖ وَسُبۡحَـٰنَ ٱللَّهِ وَمَاۤ أَنَا۠ مِنَ ٱلۡمُشۡرِكِینَ\n"
    }
  },
  {
    "id": 1705,
    "surahId": 12,
    "ayahNumber": 109,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَا مِن قَبۡلِكَ إِلَّا رِجَالࣰا نُّوحِیۤ إِلَیۡهِم مِّنۡ أَهۡلِ ٱلۡقُرَىٰۤۗ أَفَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَیَنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلَّذِینَ مِن قَبۡلِهِمۡۗ وَلَدَارُ ٱلۡـَٔاخِرَةِ خَیۡرࣱ لِّلَّذِینَ ٱتَّقَوۡا۟ۚ أَفَلَا تَعۡقِلُونَ\n",
    "translations": {
      "en": "And [even] before thy time, We never sent [as Our apostles] any but [mortal] men, whom We inspired, [and whom We always chose] from among the people of the [very] communities [to whom the message was to be brought]. Have, then, they [who reject this divine writ] never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before them?-and [do they not know that] to those who are conscious of God the life in the hereafter is indeed better [than this world]? Will they not, then, use their reason?",
      "ms": "Dan tiadalah Kami mengutus Rasul - sebelummu (wahai Muhammad) melainkan orang-orang lelaki dari penduduk bandar, yang kami wahyukan kepada mereka. Maka mengapa orang-orang (yang tidak mahu beriman) itu tidak mengembara di muka bumi, supaya memerhatikan bagaimana akibat orang-orang kafir yang terdahulu dari mereka? Dan (ingatlah) sesungguhnya negeri akhirat lebih baik bagi orang-orang yang bertaqwa. Oleh itu, mengapa kamu (wahai manusia) tidak mahu memikirkannya?",
      "id": "Kami tidak mengutus sebelum kamu, melainkan orang laki-laki yang Kami berikan wahyu kepadanya diantara penduduk negeri. Maka tidakkah mereka bepergian di muka bumi lalu melihat bagaimana kesudahan orang-orang sebelum mereka (yang mendustakan rasul) dan sesungguhnya kampung akhirat adalah lebih baik bagi orang-orang yang bertakwa. Maka tidakkah kamu memikirkannya?",
      "ar": "وَمَاۤ أَرۡسَلۡنَا مِن قَبۡلِكَ إِلَّا رِجَالࣰا نُّوحِیۤ إِلَیۡهِم مِّنۡ أَهۡلِ ٱلۡقُرَىٰۤۗ أَفَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَیَنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلَّذِینَ مِن قَبۡلِهِمۡۗ وَلَدَارُ ٱلۡـَٔاخِرَةِ خَیۡرࣱ لِّلَّذِینَ ٱتَّقَوۡا۟ۚ أَفَلَا تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1706,
    "surahId": 12,
    "ayahNumber": 110,
    "arabicText": "حَتَّىٰۤ إِذَا ٱسۡتَیۡـَٔسَ ٱلرُّسُلُ وَظَنُّوۤا۟ أَنَّهُمۡ قَدۡ كُذِبُوا۟ جَاۤءَهُمۡ نَصۡرُنَا فَنُجِّیَ مَن نَّشَاۤءُۖ وَلَا یُرَدُّ بَأۡسُنَا عَنِ ٱلۡقَوۡمِ ٱلۡمُجۡرِمِینَ\n",
    "translations": {
      "en": "[All the earlier apostles had to suffer persecution for a long time;] but at last -when those apostles had lost all hope and saw themselves branded as liars - Our succour attained to them: whereupon everyone whom We Milled [to be saved] was saved [and the deniers of the truth were destroyed]: for, never can Our punishment be averted from people who are lost in sin.",
      "ms": "(Orang-orang yang mendustakan ugama Allah itu telah diberi tempoh yang lanjut sebelum ditimpakan dengan azab) hingga apabila Rasul-rasul berputus asa terhadap kaumnya yang ingkar dan menyangka bahawa mereka telah disifatkan oleh kaumnya sebagai orang-orang yang berdusta, datanglah pertolongan Kami kepada mereka, lalu diselamatkanlah sesiapa yang Kami kehendaki. Dan (ingatlah bahawa) azab Kami tidak akan dapat ditolak oleh sesiapapun daripada menimpa kaum yang berdosa.",
      "id": "Sehingga apabila para rasul tidak mempunyai harapan lagi (tentang keimanan mereka) dan telah meyakini bahwa mereka telah didustakan, datanglah kepada para rasul itu pertolongan Kami, lalu diselamatkan orang-orang yang Kami kehendaki. Dan tidak dapat ditolak siksa Kami dari pada orang-orang yang berdosa.",
      "ar": "حَتَّىٰۤ إِذَا ٱسۡتَیۡـَٔسَ ٱلرُّسُلُ وَظَنُّوۤا۟ أَنَّهُمۡ قَدۡ كُذِبُوا۟ جَاۤءَهُمۡ نَصۡرُنَا فَنُجِّیَ مَن نَّشَاۤءُۖ وَلَا یُرَدُّ بَأۡسُنَا عَنِ ٱلۡقَوۡمِ ٱلۡمُجۡرِمِینَ\n"
    }
  },
  {
    "id": 1707,
    "surahId": 12,
    "ayahNumber": 111,
    "arabicText": "لَقَدۡ كَانَ فِی قَصَصِهِمۡ عِبۡرَةࣱ لِّأُو۟لِی ٱلۡأَلۡبَـٰبِۗ مَا كَانَ حَدِیثࣰا یُفۡتَرَىٰ وَلَـٰكِن تَصۡدِیقَ ٱلَّذِی بَیۡنَ یَدَیۡهِ وَتَفۡصِیلَ كُلِّ شَیۡءࣲ وَهُدࣰى وَرَحۡمَةࣰ لِّقَوۡمࣲ یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Indeed, in the stories of these men there is a lesson for those who are endowed with insight. [As for this revelation,] it could not possibly be a discourse invented [by man]: nay indeed, it is [a divine writ] confirming the truth of whatever there still remains [of earlier revelations], clearly spelling out everything, and [offering] guidance and grace unto people who will believe.",
      "ms": "Demi sesungguhnya, kisah Nabi-nabi itu mengandungi pelajaran yang mendatangkan iktibar bagi orang-orang yang mempunyai akal fikiran. (Kisah Nabi-nabi yang terkandung dalam Al-Quran) bukanlah ia cerita-cerita yang diada-adakan, tetapi ia mengesahkan apa yang tersebut di dalam Kitab-kitab ugama yang terdahulu daripadanya, dan ia sebagai keterangan yang menjelaskan tiap-tiap sesuatu, serta menjadi hidayah petunjuk dan rahmat bagi kaum yang (mahu) beriman.",
      "id": "Sesungguhnya pada kisah-kisah mereka itu terdapat pengajaran bagi orang-orang yang mempunyai akal. Al Quran itu bukanlah cerita yang dibuat-buat, akan tetapi membenarkan (kitab-kitab) yang sebelumnya dan menjelaskan segala sesuatu, dan sebagai petunjuk dan rahmat bagi kaum yang beriman.",
      "ar": "لَقَدۡ كَانَ فِی قَصَصِهِمۡ عِبۡرَةࣱ لِّأُو۟لِی ٱلۡأَلۡبَـٰبِۗ مَا كَانَ حَدِیثࣰا یُفۡتَرَىٰ وَلَـٰكِن تَصۡدِیقَ ٱلَّذِی بَیۡنَ یَدَیۡهِ وَتَفۡصِیلَ كُلِّ شَیۡءࣲ وَهُدࣰى وَرَحۡمَةࣰ لِّقَوۡمࣲ یُؤۡمِنُونَ\n"
    }
  }
]