[
  {
    "id": 2596,
    "surahId": 22,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ یَـٰۤأَیُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمۡۚ إِنَّ زَلۡزَلَةَ ٱلسَّاعَةِ شَیۡءٌ عَظِیمࣱ\n",
    "translations": {
      "en": "O men! Be conscious of your Sustainer: for, verily the violent convulsion of the Last Hour will be an awesome thing!",
      "ms": "Wahai umat manusia, bertaqwalah kepada Tuhan kamu! Sesungguhnya gempa hari kiamat itu suatu perkara yang amat besar.",
      "id": "Hai manusia, bertakwalah kepada Tuhanmu; sesungguhnya kegoncangan hari kiamat itu adalah suatu kejadian yang sangat besar (dahsyat).",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ یَـٰۤأَیُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمۡۚ إِنَّ زَلۡزَلَةَ ٱلسَّاعَةِ شَیۡءٌ عَظِیمࣱ\n"
    }
  },
  {
    "id": 2597,
    "surahId": 22,
    "ayahNumber": 2,
    "arabicText": "یَوۡمَ تَرَوۡنَهَا تَذۡهَلُ كُلُّ مُرۡضِعَةٍ عَمَّاۤ أَرۡضَعَتۡ وَتَضَعُ كُلُّ ذَاتِ حَمۡلٍ حَمۡلَهَا وَتَرَى ٱلنَّاسَ سُكَـٰرَىٰ وَمَا هُم بِسُكَـٰرَىٰ وَلَـٰكِنَّ عَذَابَ ٱللَّهِ شَدِیدࣱ\n",
    "translations": {
      "en": "On the Day when you behold it, every woman that feeds a child at her breast will utterly forget her nursling, and every woman heavy with child will bring forth her burden [before her time]; and it will seem to thee that all mankind is drunk, although they will not be drunk - but vehement will be [their dread of] God’s chastisement.",
      "ms": "Pada hari kamu melihat (peristiwa-peristiwa yang mengerikan) itu, tiap-tiap ibu penyusu akan melupakan anak yang disusukannya, dan tiap-tiap perempuan yang mengandung akan gugurkan anak yang dikandungnya; dan engkau akan melihat manusia mabuk, padahal mereka sebenarnya tidak mabuk, tetapi azab Allah amatlah berat, mengerikan.",
      "id": "(Ingatlah) pada hari (ketika) kamu melihat kegoncangan itu, lalailah semua wanita yang menyusui anaknya dari anak yang disusuinya dan gugurlah kandungan segala wanita yang hamil, dan kamu lihat manusia dalam keadaan mabuk, padahal sebenarnya mereka tidak mabuk, akan tetapi azab Allah itu sangat kerasnya.",
      "ar": "یَوۡمَ تَرَوۡنَهَا تَذۡهَلُ كُلُّ مُرۡضِعَةٍ عَمَّاۤ أَرۡضَعَتۡ وَتَضَعُ كُلُّ ذَاتِ حَمۡلٍ حَمۡلَهَا وَتَرَى ٱلنَّاسَ سُكَـٰرَىٰ وَمَا هُم بِسُكَـٰرَىٰ وَلَـٰكِنَّ عَذَابَ ٱللَّهِ شَدِیدࣱ\n"
    }
  },
  {
    "id": 2598,
    "surahId": 22,
    "ayahNumber": 3,
    "arabicText": "وَمِنَ ٱلنَّاسِ مَن یُجَـٰدِلُ فِی ٱللَّهِ بِغَیۡرِ عِلۡمࣲ وَیَتَّبِعُ كُلَّ شَیۡطَـٰنࣲ مَّرِیدࣲ\n",
    "translations": {
      "en": "And yet, among men there is many a one who argues about God without having any knowledge [of Him], and follows every rebellious satanic force",
      "ms": "Dan ada di antara manusia yang membantah perkara-perkara yang berhubung dengan Allah dengan tidak berdasarkan sebarang pengetahuan, dan ia menurut tiap-tiap syaitan yang telah sebati dengan kejahatan.",
      "id": "Di antara manusia ada orang yang membantah tentang Allah tanpa ilmu pengetahuan dan mengikuti setiap syaitan yang jahat,",
      "ar": "وَمِنَ ٱلنَّاسِ مَن یُجَـٰدِلُ فِی ٱللَّهِ بِغَیۡرِ عِلۡمࣲ وَیَتَّبِعُ كُلَّ شَیۡطَـٰنࣲ مَّرِیدࣲ\n"
    }
  },
  {
    "id": 2599,
    "surahId": 22,
    "ayahNumber": 4,
    "arabicText": "كُتِبَ عَلَیۡهِ أَنَّهُۥ مَن تَوَلَّاهُ فَأَنَّهُۥ یُضِلُّهُۥ وَیَهۡدِیهِ إِلَىٰ عَذَابِ ٱلسَّعِیرِ\n",
    "translations": {
      "en": "about which it has been decreed that whoever entrusts himself to it, him will it lead astray and guide towards the suffering of the blazing flame!",
      "ms": "Yang telah ditetapkan kepada (tiap-tiap) syaitan itu, bahawa sesiapa yang berketuakan dia, maka sesungguhnya ia akan menyesatkannya dan memimpinnya kepada azab neraka.",
      "id": "yang telah ditetapkan terhadap syaitan itu, bahwa barangsiapa yang berkawan dengan dia, tentu dia akan menyesatkannya, dan membawanya ke azab neraka.",
      "ar": "كُتِبَ عَلَیۡهِ أَنَّهُۥ مَن تَوَلَّاهُ فَأَنَّهُۥ یُضِلُّهُۥ وَیَهۡدِیهِ إِلَىٰ عَذَابِ ٱلسَّعِیرِ\n"
    }
  },
  {
    "id": 2600,
    "surahId": 22,
    "ayahNumber": 5,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ إِن كُنتُمۡ فِی رَیۡبࣲ مِّنَ ٱلۡبَعۡثِ فَإِنَّا خَلَقۡنَـٰكُم مِّن تُرَابࣲ ثُمَّ مِن نُّطۡفَةࣲ ثُمَّ مِنۡ عَلَقَةࣲ ثُمَّ مِن مُّضۡغَةࣲ مُّخَلَّقَةࣲ وَغَیۡرِ مُخَلَّقَةࣲ لِّنُبَیِّنَ لَكُمۡۚ وَنُقِرُّ فِی ٱلۡأَرۡحَامِ مَا نَشَاۤءُ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى ثُمَّ نُخۡرِجُكُمۡ طِفۡلࣰا ثُمَّ لِتَبۡلُغُوۤا۟ أَشُدَّكُمۡۖ وَمِنكُم مَّن یُتَوَفَّىٰ وَمِنكُم مَّن یُرَدُّ إِلَىٰۤ أَرۡذَلِ ٱلۡعُمُرِ لِكَیۡلَا یَعۡلَمَ مِنۢ بَعۡدِ عِلۡمࣲ شَیۡـࣰٔاۚ وَتَرَى ٱلۡأَرۡضَ هَامِدَةࣰ فَإِذَاۤ أَنزَلۡنَا عَلَیۡهَا ٱلۡمَاۤءَ ٱهۡتَزَّتۡ وَرَبَتۡ وَأَنۢبَتَتۡ مِن كُلِّ زَوۡجِۭ بَهِیجࣲ\n",
    "translations": {
      "en": "O MEN! If you are in doubt as to the [truth of] resurrection, [remember that,] verily, We have created [every one of] you out of dust, then out of a drop of sperm, then out of a germ-cell, then out of an embryonic lump complete [in itself] and yet incom­plete so that We might make [your origin] clear unto you. And whatever We will [to be born] We cause to rest in the [mothers’] wombs for a term set [by Us], and then We bring you forth as infants and [allow you to live] so that [some of] you might attain to maturity: for among you are such as are caused to die [in childhood], just as many a one of you is reduced in old age to a most abject state, ceasing to know anything of what he once knew so well. And [if, O man, thou art still in doubt as to resur­rection, consider this:] thou canst see the earth dry and lifeless - and [suddenly,] when We send down waters upon it, it stirs and swells and puts forth every kind of lovely plant!",
      "ms": "Wahai umat manusia, sekiranya kamu menaruh syak (ragu-ragu) tentang kebangkitan makhluk (hidup semula pada hari kiamat), maka (perhatilah kepada tingkatan kejadian manusia) kerana sebenarnya Kami telah menciptakan kamu dari tanah, kemudian dari setitik air benih, kemudian dari sebuku darah beku, kemudian dari seketul daging yang disempurnakan kejadiannya dan yang tidak disempurnakan; (Kami jadikan secara yang demikian) kerana Kami hendak menerangkan kepada kamu (kekuasaan Kami); dan Kami pula menetapkan dalam kandungan rahim (ibu yang mengandung itu) apa yang Kami rancangkan hingga ke suatu masa yang ditentukan lahirnya; kemudian Kami mengeluarkan kamu berupa kanak-kanak; kemudian (kamu dipelihara) hingga sampai ke peringkat umur dewasa; dan (dalam pada itu) ada di antara kamu yang dimatikan (semasa kecil atau semasa dewasa) dan ada pula yang dilanjutkan umurnya ke peringkat tua nyanyuk sehingga ia tidak mengetahui lagi akan sesuatu yang telah diketahuinya dahulu. Dan (ingatlah satu bukti lagi); Engkau melihat bumi itu kering, kemudian apabila Kami menurunkan hujan menimpanya, bergeraklah tanahnya (dengan tumbuh-tumbuhan yang merecup tumbuh), dan gembur membusutlah ia, serta ia pula menumbuhkan berjenis-jenis tanaman yang indah permai.",
      "id": "Hai manusia, jika kamu dalam keraguan tentang kebangkitan (dari kubur), maka (ketahuilah) sesungguhnya Kami telah menjadikan kamu dari tanah, kemudian dari setetes mani, kemudian dari segumpal darah, kemudian dari segumpal daging yang sempurna kejadiannya dan yang tidak sempurna, agar Kami jelaskan kepada kamu dan Kami tetapkan dalam rahim, apa yang Kami kehendaki sampai waktu yang sudah ditentukan, kemudian Kami keluarkan kamu sebagai bayi, kemudian (dengan berangsur-angsur) kamu sampailah kepada kedewasaan, dan di antara kamu ada yang diwafatkan dan (adapula) di antara kamu yang dipanjangkan umurnya sampai pikun, supaya dia tidak mengetahui lagi sesuatupun yang dahulunya telah diketahuinya. Dan kamu lihat bumi ini kering, kemudian apabila telah Kami turunkan air di atasnya, hiduplah bumi itu dan suburlah dan menumbuhkan berbagai macam tumbuh-tumbuhan yang indah.",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ إِن كُنتُمۡ فِی رَیۡبࣲ مِّنَ ٱلۡبَعۡثِ فَإِنَّا خَلَقۡنَـٰكُم مِّن تُرَابࣲ ثُمَّ مِن نُّطۡفَةࣲ ثُمَّ مِنۡ عَلَقَةࣲ ثُمَّ مِن مُّضۡغَةࣲ مُّخَلَّقَةࣲ وَغَیۡرِ مُخَلَّقَةࣲ لِّنُبَیِّنَ لَكُمۡۚ وَنُقِرُّ فِی ٱلۡأَرۡحَامِ مَا نَشَاۤءُ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى ثُمَّ نُخۡرِجُكُمۡ طِفۡلࣰا ثُمَّ لِتَبۡلُغُوۤا۟ أَشُدَّكُمۡۖ وَمِنكُم مَّن یُتَوَفَّىٰ وَمِنكُم مَّن یُرَدُّ إِلَىٰۤ أَرۡذَلِ ٱلۡعُمُرِ لِكَیۡلَا یَعۡلَمَ مِنۢ بَعۡدِ عِلۡمࣲ شَیۡـࣰٔاۚ وَتَرَى ٱلۡأَرۡضَ هَامِدَةࣰ فَإِذَاۤ أَنزَلۡنَا عَلَیۡهَا ٱلۡمَاۤءَ ٱهۡتَزَّتۡ وَرَبَتۡ وَأَنۢبَتَتۡ مِن كُلِّ زَوۡجِۭ بَهِیجࣲ\n"
    }
  },
  {
    "id": 2601,
    "surahId": 22,
    "ayahNumber": 6,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّهُۥ یُحۡیِ ٱلۡمَوۡتَىٰ وَأَنَّهُۥ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n",
    "translations": {
      "en": "All this [happens] because God alone is the Ultimate Truth, and because He alone brings the dead to life, and because He has the power to will anything.",
      "ms": "(Kedua-dua kenyataan) yang tersebut membuktikan bahawa sesungguhnya Allah jualah Tuhan Yang Sebenar-benarnya (yang berhak disembah), dan sesungguhnya Dia lah yang menghidupkan makhluk-makhluk yang mati, dan Dia lah jua Yang Maha Kuasa atas tiap-tiap sesuatu.",
      "id": "Yang demikian itu, karena sesungguhnya Allah, Dialah yang haq dan sesungguhnya Dialah yang menghidupkan segala yang mati dan sesungguhnya Allah Maha Kuasa atas segala sesuatu,",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّهُۥ یُحۡیِ ٱلۡمَوۡتَىٰ وَأَنَّهُۥ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n"
    }
  },
  {
    "id": 2602,
    "surahId": 22,
    "ayahNumber": 7,
    "arabicText": "وَأَنَّ ٱلسَّاعَةَ ءَاتِیَةࣱ لَّا رَیۡبَ فِیهَا وَأَنَّ ٱللَّهَ یَبۡعَثُ مَن فِی ٱلۡقُبُورِ\n",
    "translations": {
      "en": "And [know, O man] that the Last Hour is bound to come, beyond any doubt, and that God will [in­deed] resurrect all who are in their graves.",
      "ms": "Dan bahawa sesungguhnya hari kiamat itu tetap akan datang, tidak ada sebarang syak padanya, dan bahawa sesungguhnya Allah akan membangkitkan (menghidupkan semula) orang-orang yang di dalam kubur.",
      "id": "dan sesungguhnya hari kiamat itu pastilah datang, tak ada keraguan padanya; dan bahwasanya Allah membangkitkan semua orang di dalam kubur.",
      "ar": "وَأَنَّ ٱلسَّاعَةَ ءَاتِیَةࣱ لَّا رَیۡبَ فِیهَا وَأَنَّ ٱللَّهَ یَبۡعَثُ مَن فِی ٱلۡقُبُورِ\n"
    }
  },
  {
    "id": 2603,
    "surahId": 22,
    "ayahNumber": 8,
    "arabicText": "وَمِنَ ٱلنَّاسِ مَن یُجَـٰدِلُ فِی ٱللَّهِ بِغَیۡرِ عِلۡمࣲ وَلَا هُدࣰى وَلَا كِتَـٰبࣲ مُّنِیرࣲ\n",
    "translations": {
      "en": "And yet, among men there is many a one that argues about God without having any knowledge [of Him], without any guidance, and without any light-giving revelation –",
      "ms": "Dan ada di antara manusia yang membantah dalam perkara-perkara yang berhubung dengan Allah dengan tidak berdasarkan sebarang pengetahuan, dan tidak berdasarkan sebarang keterangan, dan tidak juga berdasarkan mana-mana Kitab Allah yang menerangi kebenaran;",
      "id": "Dan di antara manusia ada orang-orang yang membantah tentang Allah tanpa ilmu pengetahuan, tanpa petunjuk dan tanpa kitab (wahyu) yang bercahaya,",
      "ar": "وَمِنَ ٱلنَّاسِ مَن یُجَـٰدِلُ فِی ٱللَّهِ بِغَیۡرِ عِلۡمࣲ وَلَا هُدࣰى وَلَا كِتَـٰبࣲ مُّنِیرࣲ\n"
    }
  },
  {
    "id": 2604,
    "surahId": 22,
    "ayahNumber": 9,
    "arabicText": "ثَانِیَ عِطۡفِهِۦ لِیُضِلَّ عَن سَبِیلِ ٱللَّهِۖ لَهُۥ فِی ٱلدُّنۡیَا خِزۡیࣱۖ وَنُذِیقُهُۥ یَوۡمَ ٱلۡقِیَـٰمَةِ عَذَابَ ٱلۡحَرِیقِ\n",
    "translations": {
      "en": "scornfully turning aside [from the truth] so as to lead [others] astray from the path of God. Disgrace [of the spirit] is in store for him in this world; and on the Day of Resurrection We shall make him taste suffering through fire;",
      "ms": "Ia membantah sambil memalingkan sebelah badannya dengan sombong angkuh sehingga menghalang dirinya dan orang lain dari jalan ugama Allah; ia akan beroleh kehinaan di dunia, dan Kami akan merasakannya azab yang membakar pada hari kiamat kelak;",
      "id": "dengan memalingkan lambungnya untuk menyesatkan manusia dari jalan Allah. Ia mendapat kehinaan di dunia dan dihari kiamat Kami merasakan kepadanya azab neraka yang membakar.",
      "ar": "ثَانِیَ عِطۡفِهِۦ لِیُضِلَّ عَن سَبِیلِ ٱللَّهِۖ لَهُۥ فِی ٱلدُّنۡیَا خِزۡیࣱۖ وَنُذِیقُهُۥ یَوۡمَ ٱلۡقِیَـٰمَةِ عَذَابَ ٱلۡحَرِیقِ\n"
    }
  },
  {
    "id": 2605,
    "surahId": 22,
    "ayahNumber": 10,
    "arabicText": "ذَ ٰ⁠لِكَ بِمَا قَدَّمَتۡ یَدَاكَ وَأَنَّ ٱللَّهَ لَیۡسَ بِظَلَّـٰمࣲ لِّلۡعَبِیدِ\n",
    "translations": {
      "en": "[and he shall be told:] “This is an outcome of what thine own hands have wrought - for, never does God do the least wrong to His creatures!”",
      "ms": "(Dengan dikatakan kepadanya): \"Azab yang demikian ini ialah disebabkan perbuatan tanganmu sendiri, kerana sesungguhnya Allah tidak sekali-kali berlaku zalim kepada hamba-hambaNya\".",
      "id": "(Akan dikatakan kepadanya): \"Yang demikian itu, adalah disebabkan perbuatan yang dikerjakan oleh kedua tangan kamu dahulu dan sesungguhnya Allah sekali-kali bukanlah penganiaya hamba-hamba-Nya\".",
      "ar": "ذَ ٰ⁠لِكَ بِمَا قَدَّمَتۡ یَدَاكَ وَأَنَّ ٱللَّهَ لَیۡسَ بِظَلَّـٰمࣲ لِّلۡعَبِیدِ\n"
    }
  },
  {
    "id": 2606,
    "surahId": 22,
    "ayahNumber": 11,
    "arabicText": "وَمِنَ ٱلنَّاسِ مَن یَعۡبُدُ ٱللَّهَ عَلَىٰ حَرۡفࣲۖ فَإِنۡ أَصَابَهُۥ خَیۡرٌ ٱطۡمَأَنَّ بِهِۦۖ وَإِنۡ أَصَابَتۡهُ فِتۡنَةٌ ٱنقَلَبَ عَلَىٰ وَجۡهِهِۦ خَسِرَ ٱلدُّنۡیَا وَٱلۡـَٔاخِرَةَۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡخُسۡرَانُ ٱلۡمُبِینُ\n",
    "translations": {
      "en": "And there is, too, among men many a one who worships God on the border-line [of faith]: thus, if good befalls him, he is satisfied with Him; but if a trial assails him, he turns away utterly, losing [thereby both] this world and the life to come: [and] this, indeed, is a loss beyond compare!",
      "ms": "Dan ada di antara manusia yang menyembah Allah dengan sikap dan pendirian yang tidak tetap, iaitu kalau ia beroleh kebaikan, senanglah hatinya dengan keadaan itu; dan kalau pula ia ditimpa fitnah kesusahan, berbaliklah ia semula (kepada kekufurannya). (Dengan sikapnya itu) rugilah ia akan dunia dan akhirat, itulah kerugian yang terang nyata.",
      "id": "Dan di antara manusia ada orang yang menyembah Allah dengan berada di tepi; maka jika ia memperoleh kebajikan, tetaplah ia dalam keadaan itu, dan jika ia ditimpa oleh suatu bencana, berbaliklah ia ke belakang. Rugilah ia di dunia dan di akhirat. Yang demikian itu adalah kerugian yang nyata.",
      "ar": "وَمِنَ ٱلنَّاسِ مَن یَعۡبُدُ ٱللَّهَ عَلَىٰ حَرۡفࣲۖ فَإِنۡ أَصَابَهُۥ خَیۡرٌ ٱطۡمَأَنَّ بِهِۦۖ وَإِنۡ أَصَابَتۡهُ فِتۡنَةٌ ٱنقَلَبَ عَلَىٰ وَجۡهِهِۦ خَسِرَ ٱلدُّنۡیَا وَٱلۡـَٔاخِرَةَۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡخُسۡرَانُ ٱلۡمُبِینُ\n"
    }
  },
  {
    "id": 2607,
    "surahId": 22,
    "ayahNumber": 12,
    "arabicText": "یَدۡعُوا۟ مِن دُونِ ٱللَّهِ مَا لَا یَضُرُّهُۥ وَمَا لَا یَنفَعُهُۥۚ ذَ ٰ⁠لِكَ هُوَ ٱلضَّلَـٰلُ ٱلۡبَعِیدُ\n",
    "translations": {
      "en": "[By behaving thus,] he invokes, instead of God, something that can neither harm nor benefit him: [and] this is indeed the utmost one can go astray.",
      "ms": "Ia menyeru dan menyembah makhluk-makhluk yang lain dari Allah, yang tidak dapat membahayakannya dan tidak dapat mendatangkan kebaikan kepadanya; itulah kesesatan yang jauh terpesong.",
      "id": "Ia menyeru selain Allah, sesuatu yang tidak dapat memberi mudharat dan tidak (pula) memberi manfaat kepadanya. Yang demikian itu adalah kesesatan yang jauh.",
      "ar": "یَدۡعُوا۟ مِن دُونِ ٱللَّهِ مَا لَا یَضُرُّهُۥ وَمَا لَا یَنفَعُهُۥۚ ذَ ٰ⁠لِكَ هُوَ ٱلضَّلَـٰلُ ٱلۡبَعِیدُ\n"
    }
  },
  {
    "id": 2608,
    "surahId": 22,
    "ayahNumber": 13,
    "arabicText": "یَدۡعُوا۟ لَمَن ضَرُّهُۥۤ أَقۡرَبُ مِن نَّفۡعِهِۦۚ لَبِئۡسَ ٱلۡمَوۡلَىٰ وَلَبِئۡسَ ٱلۡعَشِیرُ\n",
    "translations": {
      "en": "[And sometimes] he invokes [another human being] one that is far more likely to cause harm than benefit: vile, indeed, is such a patron and vile the follower!",
      "ms": "Ia menyeru dan menyembah makhluk yang - dengan perbuatan demikian - mudaratnya lebih dekat dari manfaat yang diharapkannya; demi sesungguhnya seburuk-buruk penolong dan seburuk-buruk sahabat karib ialah makhluk yang diseru dan disembahnya itu.",
      "id": "Ia menyeru sesuatu yang sebenarnya mudharatnya lebih dekat dari manfaatnya. Sesungguhnya yang diserunya itu adalah sejahat-jahat kawan.",
      "ar": "یَدۡعُوا۟ لَمَن ضَرُّهُۥۤ أَقۡرَبُ مِن نَّفۡعِهِۦۚ لَبِئۡسَ ٱلۡمَوۡلَىٰ وَلَبِئۡسَ ٱلۡعَشِیرُ\n"
    }
  },
  {
    "id": 2609,
    "surahId": 22,
    "ayahNumber": 14,
    "arabicText": "إِنَّ ٱللَّهَ یُدۡخِلُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۚ إِنَّ ٱللَّهَ یَفۡعَلُ مَا یُرِیدُ\n",
    "translations": {
      "en": "VERILY, God will admit those who have attained to faith and have done righteous deeds into gardens through which running waters flow: for, behold, God does whatever He wills.",
      "ms": "Sesungguhnya Allah akan memasukkan orang-orang yang beriman dan beramal soleh ke dalam Syurga yang mengalir di bawahnya beberapa sungai; sesungguhnya Allah melakukan apa yang ditentukanNya.",
      "id": "Sesungguhnya Allah memasukkan orang-orang yang beriman dan mengerjakan amal yang saleh ke dalam surga-surga yang di bawahnya mengalir sungai-sungai. Sesungguhnya Allah berbuat apa yang Dia kehendaki.",
      "ar": "إِنَّ ٱللَّهَ یُدۡخِلُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۚ إِنَّ ٱللَّهَ یَفۡعَلُ مَا یُرِیدُ\n"
    }
  },
  {
    "id": 2610,
    "surahId": 22,
    "ayahNumber": 15,
    "arabicText": "مَن كَانَ یَظُنُّ أَن لَّن یَنصُرَهُ ٱللَّهُ فِی ٱلدُّنۡیَا وَٱلۡـَٔاخِرَةِ فَلۡیَمۡدُدۡ بِسَبَبٍ إِلَى ٱلسَّمَاۤءِ ثُمَّ لۡیَقۡطَعۡ فَلۡیَنظُرۡ هَلۡ یُذۡهِبَنَّ كَیۡدُهُۥ مَا یَغِیظُ\n",
    "translations": {
      "en": "If anyone thinks that God will not succour him in this world and in the life to come, let him reach out unto heaven by any [other] means and [thus try to] make headway: and then let him see whether this scheme of his will indeed do away with the cause of his anguish.",
      "ms": "Sesiapa yang menyangka bahawa Allah tidak sekali-kali akan menolong Nabi Muhammad dalam dunia ini dan di akhirat kelak, maka hendaklah ia menghulurkan tali (serta mengikatnya) di bumbong rumahnya, kemudian hendaklah ia menjerut lehernya (supaya ia mati tercekek); dalam pada itu hendaklah ia memikirkan lebih dahulu, adakah tipu dayanya itu dapat menghapuskan sebab-sebab yang menimbulkan kemarahannya?",
      "id": "Barangsiapa yang menyangka bahwa Allah sekali-kali tiada menolongnya (Muhammad) di dunia dan akhirat, maka hendaklah ia merentangkan tali ke langit, kemudian hendaklah ia melaluinya, kemudian hendaklah ia pikirkan apakah tipu dayanya itu dapat melenyapkan apa yang menyakitkan hatinya.",
      "ar": "مَن كَانَ یَظُنُّ أَن لَّن یَنصُرَهُ ٱللَّهُ فِی ٱلدُّنۡیَا وَٱلۡـَٔاخِرَةِ فَلۡیَمۡدُدۡ بِسَبَبٍ إِلَى ٱلسَّمَاۤءِ ثُمَّ لۡیَقۡطَعۡ فَلۡیَنظُرۡ هَلۡ یُذۡهِبَنَّ كَیۡدُهُۥ مَا یَغِیظُ\n"
    }
  },
  {
    "id": 2611,
    "surahId": 22,
    "ayahNumber": 16,
    "arabicText": "وَكَذَ ٰ⁠لِكَ أَنزَلۡنَـٰهُ ءَایَـٰتِۭ بَیِّنَـٰتࣲ وَأَنَّ ٱللَّهَ یَهۡدِی مَن یُرِیدُ\n",
    "translations": {
      "en": "And thus have We bestowed from on high this [divine writ] in the shape of clear messages: for [thus it is] that God guides him who wills [to be guided].",
      "ms": "Dan demikianlah pula Kami menurunkan Al-Quran itu sebagai ayat-ayat keterangan yang jelas nyata; dan sesungguhnya Allah memberi hidayah petunjuk kepada sesiapa yang dikehendakiNya (menurut peraturan dan undang-undangNya).",
      "id": "Dan demikianlah Kami telah menurunkan Al Quran yang merupakan ayat-ayat yang nyata, dan bahwasanya Allah memberikan petunjuk kepada siapa yang Dia kehendaki.",
      "ar": "وَكَذَ ٰ⁠لِكَ أَنزَلۡنَـٰهُ ءَایَـٰتِۭ بَیِّنَـٰتࣲ وَأَنَّ ٱللَّهَ یَهۡدِی مَن یُرِیدُ\n"
    }
  },
  {
    "id": 2612,
    "surahId": 22,
    "ayahNumber": 17,
    "arabicText": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَٱلَّذِینَ هَادُوا۟ وَٱلصَّـٰبِـِٔینَ وَٱلنَّصَـٰرَىٰ وَٱلۡمَجُوسَ وَٱلَّذِینَ أَشۡرَكُوۤا۟ إِنَّ ٱللَّهَ یَفۡصِلُ بَیۡنَهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَیۡءࣲ شَهِیدٌ\n",
    "translations": {
      "en": "Verily, as for those who have attained to faith [in this divine writ], and those who follow the Jewish faith, and the Sabians, and the Christians, and the Magians, [on the one hand,] and those who are bent on ascribing divinity to aught but God, [on the other,] verily, God will decide between them on Resurrection Day: for, behold, God is witness unto everything.",
      "ms": "Bahawasanya orang-orang yang beriman, dan orang-orang Yahudi, dan orang-orang Saabiein, dan orang-orang Nasrani, dan orang-orang Majusi, serta orang-orang Musyrik, sesungguhnya Allah akan memutuskan hukumNya di antara mereka pada hari kiamat, kerana sesungguhnya Allah sentiasa Memerhati dan Menyaksikan tiap-tiap sesuatu.",
      "id": "Sesungguhnya orang-orang yang beriman, orang-orang Yahudi, orang-orang Shaabi-iin orang-orang Nasrani, orang-orang Majusi dan orang-orang musyrik, Allah akan memberi keputusan di antara mereka pada hari kiamat. Sesungguhnya Allah menyaksikan segala sesuatu.",
      "ar": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَٱلَّذِینَ هَادُوا۟ وَٱلصَّـٰبِـِٔینَ وَٱلنَّصَـٰرَىٰ وَٱلۡمَجُوسَ وَٱلَّذِینَ أَشۡرَكُوۤا۟ إِنَّ ٱللَّهَ یَفۡصِلُ بَیۡنَهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَیۡءࣲ شَهِیدٌ\n"
    }
  },
  {
    "id": 2613,
    "surahId": 22,
    "ayahNumber": 18,
    "arabicText": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ یَسۡجُدُ لَهُۥ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَن فِی ٱلۡأَرۡضِ وَٱلشَّمۡسُ وَٱلۡقَمَرُ وَٱلنُّجُومُ وَٱلۡجِبَالُ وَٱلشَّجَرُ وَٱلدَّوَاۤبُّ وَكَثِیرࣱ مِّنَ ٱلنَّاسِۖ وَكَثِیرٌ حَقَّ عَلَیۡهِ ٱلۡعَذَابُۗ وَمَن یُهِنِ ٱللَّهُ فَمَا لَهُۥ مِن مُّكۡرِمٍۚ إِنَّ ٱللَّهَ یَفۡعَلُ مَا یَشَاۤءُ ۩\n",
    "translations": {
      "en": "ART THOU NOT aware that before God prostrate themselves all [things and beings] that are in the heavens and all that are on earth the sun, and the moon, and the stars, and the mountains, and the trees, and the beasts? And many human beings [submit to God con­sciously], whereas many [others, having defied Him,] will inevitably have to suffer [in the life to come]; and he whom God shall scorn [on Resur­rection Day] will have none who could bestow honour on him: for, verily, God does what He wills.",
      "ms": "Tidakkah engkau mengetahui bahawa segala yang ada di langit dan di bumi tunduk sujud kepada Allah dan (di antaranya termasuklah) matahari dan bulan, dan bintang-bintang, dan gunung-ganang, dan pokok-pokok kayu, dan binatang-binatang, serta sebahagian besar dari manusia? Dan banyak pula (di antara manusia) yang berhak ditimpa azab (disebabkan kekufurannya dan maksiatnya); dan (ingatlah) sesiapa yang dihinakan oleh Allah maka ia tidak akan beroleh sesiapapun yang dapat memuliakannya. Sesungguhnya Allah tetap melakukan apa yang dirancangkanNya.",
      "id": "Apakah kamu tiada mengetahui, bahwa kepada Allah bersujud apa yang ada di langit, di bumi, matahari, bulan, bintang, gunung, pohon-pohonan, binatang-binatang yang melata dan sebagian besar daripada manusia? Dan banyak di antara manusia yang telah ditetapkan azab atasnya. Dan barangsiapa yang dihinakan Allah maka tidak seorangpun yang memuliakannya. Sesungguhnya Allah berbuat apa yang Dia kehendaki.",
      "ar": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ یَسۡجُدُ لَهُۥ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَن فِی ٱلۡأَرۡضِ وَٱلشَّمۡسُ وَٱلۡقَمَرُ وَٱلنُّجُومُ وَٱلۡجِبَالُ وَٱلشَّجَرُ وَٱلدَّوَاۤبُّ وَكَثِیرࣱ مِّنَ ٱلنَّاسِۖ وَكَثِیرٌ حَقَّ عَلَیۡهِ ٱلۡعَذَابُۗ وَمَن یُهِنِ ٱللَّهُ فَمَا لَهُۥ مِن مُّكۡرِمٍۚ إِنَّ ٱللَّهَ یَفۡعَلُ مَا یَشَاۤءُ ۩\n"
    }
  },
  {
    "id": 2614,
    "surahId": 22,
    "ayahNumber": 19,
    "arabicText": "۞ هَـٰذَانِ خَصۡمَانِ ٱخۡتَصَمُوا۟ فِی رَبِّهِمۡۖ فَٱلَّذِینَ كَفَرُوا۟ قُطِّعَتۡ لَهُمۡ ثِیَابࣱ مِّن نَّارࣲ یُصَبُّ مِن فَوۡقِ رُءُوسِهِمُ ٱلۡحَمِیمُ\n",
    "translations": {
      "en": "These two contrary kinds of man have become engrossed in contention about their Sus­tainer! But [thus it is:] as for those who are bent on denying the truth garments of fire shall be cut out for them [in the life to come]; burning despair will be poured over their heads,",
      "ms": "Inilah dua golongan (mukmin dan kafir) yang berbantah-bantahan tentang Tuhan mereka. Maka orang-orang yang kafir akan disediakan untuk mereka pakaian dari api neraka, serta dicurahkan atas kepala mereka air panas yang menggelegak,",
      "id": "Inilah dua golongan (golongan mukmin dan golongan kafir) yang bertengkar, mereka saling bertengkar mengenai Tuhan mereka. Maka orang kafir akan dibuatkan untuk mereka pakaian-pakaian dari api neraka. Disiramkan air yang sedang mendidih ke atas kepala mereka.",
      "ar": "۞ هَـٰذَانِ خَصۡمَانِ ٱخۡتَصَمُوا۟ فِی رَبِّهِمۡۖ فَٱلَّذِینَ كَفَرُوا۟ قُطِّعَتۡ لَهُمۡ ثِیَابࣱ مِّن نَّارࣲ یُصَبُّ مِن فَوۡقِ رُءُوسِهِمُ ٱلۡحَمِیمُ\n"
    }
  },
  {
    "id": 2615,
    "surahId": 22,
    "ayahNumber": 20,
    "arabicText": "یُصۡهَرُ بِهِۦ مَا فِی بُطُونِهِمۡ وَٱلۡجُلُودُ\n",
    "translations": {
      "en": "causing all that is within their bodies, as well as the skins, to melt away.",
      "ms": "Yang dengannya dihancurkan apa yang ada dalam perut mereka, dan juga kulit badan mereka.",
      "id": "Dengan air itu dihancur luluhkan segala apa yang ada dalam perut mereka dan juga kulit (mereka).",
      "ar": "یُصۡهَرُ بِهِۦ مَا فِی بُطُونِهِمۡ وَٱلۡجُلُودُ\n"
    }
  },
  {
    "id": 2616,
    "surahId": 22,
    "ayahNumber": 21,
    "arabicText": "وَلَهُم مَّقَـٰمِعُ مِنۡ حَدِیدࣲ\n",
    "translations": {
      "en": "And they shall be held [in this state as if] by iron grips;",
      "ms": "Dan mereka pula disediakan batang-batang besi untuk menyeksa mereka.",
      "id": "Dan untuk mereka cambuk-cambuk dari besi.",
      "ar": "وَلَهُم مَّقَـٰمِعُ مِنۡ حَدِیدࣲ\n"
    }
  },
  {
    "id": 2617,
    "surahId": 22,
    "ayahNumber": 22,
    "arabicText": "كُلَّمَاۤ أَرَادُوۤا۟ أَن یَخۡرُجُوا۟ مِنۡهَا مِنۡ غَمٍّ أُعِیدُوا۟ فِیهَا وَذُوقُوا۟ عَذَابَ ٱلۡحَرِیقِ\n",
    "translations": {
      "en": "and every time they try in their anguish to come out of it, they shall be returned thereto and [be told]: “Taste suffering through fire [to the full]!”",
      "ms": "Tiap-tiap kali mereka hendak keluar dari neraka itu, disebabkan mereka menderita azabnya, mereka dikembalikan padanya, serta dikatakan: \"Rasalah kamu azab seksa yang membakar!\"",
      "id": "Setiap kali mereka hendak ke luar dari neraka lantaran kesengsaraan mereka, niscaya mereka dikembalikan ke dalamnya. (Kepada mereka dikatakan), \"Rasailah azab yang membakar ini\".",
      "ar": "كُلَّمَاۤ أَرَادُوۤا۟ أَن یَخۡرُجُوا۟ مِنۡهَا مِنۡ غَمٍّ أُعِیدُوا۟ فِیهَا وَذُوقُوا۟ عَذَابَ ٱلۡحَرِیقِ\n"
    }
  },
  {
    "id": 2618,
    "surahId": 22,
    "ayahNumber": 23,
    "arabicText": "إِنَّ ٱللَّهَ یُدۡخِلُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ یُحَلَّوۡنَ فِیهَا مِنۡ أَسَاوِرَ مِن ذَهَبࣲ وَلُؤۡلُؤࣰاۖ وَلِبَاسُهُمۡ فِیهَا حَرِیرࣱ\n",
    "translations": {
      "en": "[As against this,] behold, God will admit those who attain to faith and do righteous deeds into gar­dens through which running waters flow, wherein they will be adorned with bracelets of gold and pearls, and where silk will be their raiment:",
      "ms": "Sesungguhnya Allah akan memasukkan orang-orang yang beriman dan beramal soleh ke dalam Syurga yang mengalir padanya beberapa sungai; mereka dihiaskan di situ dengan gelang-gelang emas dan mutiara, dan pakaian mereka di situ dari sutera.",
      "id": "Sesungguhnya Allah memasukkan orang-orang beriman dan mengerjakan amal yang saleh ke dalam surga-surga yang di bawahnya mengalir sungai-sungai. Di surga itu mereka diberi perhiasan dengan gelang-gelang dari emas dan mutiara, dan pakaian mereka adalah sutera.",
      "ar": "إِنَّ ٱللَّهَ یُدۡخِلُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ یُحَلَّوۡنَ فِیهَا مِنۡ أَسَاوِرَ مِن ذَهَبࣲ وَلُؤۡلُؤࣰاۖ وَلِبَاسُهُمۡ فِیهَا حَرِیرࣱ\n"
    }
  },
  {
    "id": 2619,
    "surahId": 22,
    "ayahNumber": 24,
    "arabicText": "وَهُدُوۤا۟ إِلَى ٱلطَّیِّبِ مِنَ ٱلۡقَوۡلِ وَهُدُوۤا۟ إِلَىٰ صِرَ ٰ⁠طِ ٱلۡحَمِیدِ\n",
    "translations": {
      "en": "for they were [willing to be] guided towards the best of all tenets, and so they were guided onto the way that leads to the One unto whom all praise is due.",
      "ms": "Dan mereka diberi petunjuk kepada mengucapkan kata-kata yang baik, serta diberi petunjuk ke jalan Allah Yang Amat Terpuji.",
      "id": "Dan mereka diberi petunjuk kepada ucapan-ucapan yang baik dan ditunjuki (pula) kepada jalan (Allah) yang terpuji.",
      "ar": "وَهُدُوۤا۟ إِلَى ٱلطَّیِّبِ مِنَ ٱلۡقَوۡلِ وَهُدُوۤا۟ إِلَىٰ صِرَ ٰ⁠طِ ٱلۡحَمِیدِ\n"
    }
  },
  {
    "id": 2620,
    "surahId": 22,
    "ayahNumber": 25,
    "arabicText": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَیَصُدُّونَ عَن سَبِیلِ ٱللَّهِ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ ٱلَّذِی جَعَلۡنَـٰهُ لِلنَّاسِ سَوَاۤءً ٱلۡعَـٰكِفُ فِیهِ وَٱلۡبَادِۚ وَمَن یُرِدۡ فِیهِ بِإِلۡحَادِۭ بِظُلۡمࣲ نُّذِقۡهُ مِنۡ عَذَابٍ أَلِیمࣲ\n",
    "translations": {
      "en": "BEHOLD, as for those who are bent on denying the truth and bar [others] from the path of God and from the Inviolable House of Worship which We have set up for all people alike - [both] those who dwell there and those who come from abroad - and all who seek to profane it by [deliberate] evildoing: [all] such shall We cause to taste grievous suffering in the life to come.]",
      "ms": "Sesungguhnya (amatlah zalim) orang-orang yang kafir serta menghalangi manusia dari jalan Allah (ugama Islam), dan dari memasuki Masjid Al-Haraam (Makkah) yang Kami jadikan dia tempat beribadat untuk seluruh umat manusia (yang beriman) - sama ada yang tinggal menetap di situ atau yang datang berziarah; dan sesiapa yang berazam melakukan di situ sebarang perbuatan yang di larang dengan cara yang zalim, Kami akan merasakannya azab yang tidak terperi sakitnya.",
      "id": "Sesungguhnya orang-orang yang kafir dan menghalangi manusia dari jalan Allah dan Masjidilharam yang telah Kami jadikan untuk semua manusia, baik yang bermukim di situ maupun di padang pasir dan siapa yang bermaksud di dalamnya melakukan kejahatan secara zalim, niscaya akan Kami rasakan kepadanya sebahagian siksa yang pedih.",
      "ar": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَیَصُدُّونَ عَن سَبِیلِ ٱللَّهِ وَٱلۡمَسۡجِدِ ٱلۡحَرَامِ ٱلَّذِی جَعَلۡنَـٰهُ لِلنَّاسِ سَوَاۤءً ٱلۡعَـٰكِفُ فِیهِ وَٱلۡبَادِۚ وَمَن یُرِدۡ فِیهِ بِإِلۡحَادِۭ بِظُلۡمࣲ نُّذِقۡهُ مِنۡ عَذَابٍ أَلِیمࣲ\n"
    }
  },
  {
    "id": 2621,
    "surahId": 22,
    "ayahNumber": 26,
    "arabicText": "وَإِذۡ بَوَّأۡنَا لِإِبۡرَ ٰ⁠هِیمَ مَكَانَ ٱلۡبَیۡتِ أَن لَّا تُشۡرِكۡ بِی شَیۡـࣰٔا وَطَهِّرۡ بَیۡتِیَ لِلطَّاۤىِٕفِینَ وَٱلۡقَاۤىِٕمِینَ وَٱلرُّكَّعِ ٱلسُّجُودِ\n",
    "translations": {
      "en": "For, when We assigned unto Abraham the site of this Temple, [We said unto him:] “Do not ascribe divinity to aught beside Me!” and: “Purify My Temple for those who will walk around it, and those who will stand before it [in meditation], and those who will bow down and prostrate themselves [in prayer].”",
      "ms": "Dan (ingatkanlah peristiwa) ketika Kami tentukan bagi Nabi Ibrahim tempat Kaabah (untuk membinanya, lalu Kami berfirman kepadanya): \"Janganlah engkau sekutukan sesuatu pun denganKu, dan bersihkanlah rumahKu (Kaabah ini) bagi orang-orang yang tawaf, dan orang-orang yang berdiri dan yang rukuk serta yang sujud (mengerjakan sembahyang).",
      "id": "Dan (ingatlah), ketika Kami memberikan tempat kepada Ibrahim di tempat Baitullah (dengan mengatakan): \"Janganlah kamu memperserikatkan sesuatupun dengan Aku dan sucikanlah rumah-Ku ini bagi orang-orang yang thawaf, dan orang-orang yang beribadat dan orang-orang yang ruku' dan sujud.",
      "ar": "وَإِذۡ بَوَّأۡنَا لِإِبۡرَ ٰ⁠هِیمَ مَكَانَ ٱلۡبَیۡتِ أَن لَّا تُشۡرِكۡ بِی شَیۡـࣰٔا وَطَهِّرۡ بَیۡتِیَ لِلطَّاۤىِٕفِینَ وَٱلۡقَاۤىِٕمِینَ وَٱلرُّكَّعِ ٱلسُّجُودِ\n"
    }
  },
  {
    "id": 2622,
    "surahId": 22,
    "ayahNumber": 27,
    "arabicText": "وَأَذِّن فِی ٱلنَّاسِ بِٱلۡحَجِّ یَأۡتُوكَ رِجَالࣰا وَعَلَىٰ كُلِّ ضَامِرࣲ یَأۡتِینَ مِن كُلِّ فَجٍّ عَمِیقࣲ\n",
    "translations": {
      "en": "Hence, [O Muhammad,] proclaim thou unto all people the [duty of] pilgrimage: they will come unto thee on foot and on every [kind of] fast mount, coming from every far-away point [on earth],",
      "ms": "\"Dan serukanlah umat manusia untuk mengerjakan ibadat Haji, nescaya mereka akan datang ke (rumah Tuhan) mu dengan berjalan kaki, dan dengan menunggang berjenis-jenis unta yang kurus yang datangnya dari berbagai jalan (dan ceruk rantau) yang jauh.",
      "id": "Dan berserulah kepada manusia untuk mengerjakan haji, niscaya mereka akan datang kepadamu dengan berjalan kaki, dan mengendarai unta yang kurus yang datang dari segenap penjuru yang jauh,",
      "ar": "وَأَذِّن فِی ٱلنَّاسِ بِٱلۡحَجِّ یَأۡتُوكَ رِجَالࣰا وَعَلَىٰ كُلِّ ضَامِرࣲ یَأۡتِینَ مِن كُلِّ فَجٍّ عَمِیقࣲ\n"
    }
  },
  {
    "id": 2623,
    "surahId": 22,
    "ayahNumber": 28,
    "arabicText": "لِّیَشۡهَدُوا۟ مَنَـٰفِعَ لَهُمۡ وَیَذۡكُرُوا۟ ٱسۡمَ ٱللَّهِ فِیۤ أَیَّامࣲ مَّعۡلُومَـٰتٍ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِیمَةِ ٱلۡأَنۡعَـٰمِۖ فَكُلُوا۟ مِنۡهَا وَأَطۡعِمُوا۟ ٱلۡبَاۤىِٕسَ ٱلۡفَقِیرَ\n",
    "translations": {
      "en": "so that they might experience much that shall be of benefit to them, and that they might extol the name of God on the days appointed [for sacrifice], over whatever heads of cattle He may have provided for them [to this end]: eat, then, thereof, and feed the unfortunate poor.",
      "ms": "\"Supaya mereka menyaksikan berbagai perkara yang mendatangkan faedah kepada mereka serta memperingati dan menyebut nama Allah, pada hari-hari yang tertentu, kerana pengurniaanNya kepada mereka dengan binatang-binatang ternak (untuk dijadikan korban); dengan yang demikian makanlah kamu dari (daging) binatang-binatang korban itu dan berilah makan kepada orang yang susah, yang fakir miskin.",
      "id": "supaya mereka menyaksikan berbagai manfaat bagi mereka dan supaya mereka menyebut nama Allah pada hari yang telah ditentukan atas rezeki yang Allah telah berikan kepada mereka berupa binatang ternak. Maka makanlah sebahagian daripadanya dan (sebahagian lagi) berikanlah untuk dimakan orang-orang yang sengsara dan fakir.",
      "ar": "لِّیَشۡهَدُوا۟ مَنَـٰفِعَ لَهُمۡ وَیَذۡكُرُوا۟ ٱسۡمَ ٱللَّهِ فِیۤ أَیَّامࣲ مَّعۡلُومَـٰتٍ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِیمَةِ ٱلۡأَنۡعَـٰمِۖ فَكُلُوا۟ مِنۡهَا وَأَطۡعِمُوا۟ ٱلۡبَاۤىِٕسَ ٱلۡفَقِیرَ\n"
    }
  },
  {
    "id": 2624,
    "surahId": 22,
    "ayahNumber": 29,
    "arabicText": "ثُمَّ لۡیَقۡضُوا۟ تَفَثَهُمۡ وَلۡیُوفُوا۟ نُذُورَهُمۡ وَلۡیَطَّوَّفُوا۟ بِٱلۡبَیۡتِ ٱلۡعَتِیقِ\n",
    "translations": {
      "en": "Thereafter let them bring to an end their state of self-denial, and let them fulfill the vows which they [may] have made, and let them walk [once again] around the Most Ancient Temple.",
      "ms": "\"Kemudian hendaklah mereka membersihkan dirinya dan hendaklah mereka menyempurnakan nazar-nazarnya, dan hendaklah mereka tawaf akan Baitullah (Kaabah) yang tua sejarahnya itu\".",
      "id": "Kemudian, hendaklah mereka menghilangkan kotoran yang ada pada badan mereka dan hendaklah mereka menyempurnakan nazar-nazar mereka dan hendaklah mereka melakukan melakukan thawaf sekeliling rumah yang tua itu (Baitullah).",
      "ar": "ثُمَّ لۡیَقۡضُوا۟ تَفَثَهُمۡ وَلۡیُوفُوا۟ نُذُورَهُمۡ وَلۡیَطَّوَّفُوا۟ بِٱلۡبَیۡتِ ٱلۡعَتِیقِ\n"
    }
  },
  {
    "id": 2625,
    "surahId": 22,
    "ayahNumber": 30,
    "arabicText": "ذَ ٰ⁠لِكَۖ وَمَن یُعَظِّمۡ حُرُمَـٰتِ ٱللَّهِ فَهُوَ خَیۡرࣱ لَّهُۥ عِندَ رَبِّهِۦۗ وَأُحِلَّتۡ لَكُمُ ٱلۡأَنۡعَـٰمُ إِلَّا مَا یُتۡلَىٰ عَلَیۡكُمۡۖ فَٱجۡتَنِبُوا۟ ٱلرِّجۡسَ مِنَ ٱلۡأَوۡثَـٰنِ وَٱجۡتَنِبُوا۟ قَوۡلَ ٱلزُّورِ\n",
    "translations": {
      "en": "All this [is ordained by God]; and if one houours God’s sacred commandments, it will redound to his own good in his Sustainer’s sight. And all [kinds of] cattle have been made lawful to you [for sacrifice and food], save what is mentioned to you [as forbidden]. Shun, then, [all that God has forbidden and, most of all,] the loathsome evil of idolatrous beliefs and practices; and shun every word that is untrue,",
      "ms": "Itulah yang wajib dipatuhi; dan sesiapa yang menghormati hukum-hukum Allah maka yang demikian menjadi kebaikan baginya di sisi Tuhannya. Dan dihalalkan bagi kamu binatang-binatang ternak, kecuali yang dibacakan kepada kamu (tentang haramnya), maka jauhilah kekotoran syirik yang disebabkan oleh penyembahan berhala, serta jauhilah perkataan yang dusta, -",
      "id": "Demikianlah (perintah Allah). Dan barangsiapa mengagungkan apa-apa yang terhormat di sisi Allah maka itu adalah lebih baik baginya di sisi Tuhannya. Dan telah dihalalkan bagi kamu semua binatang ternak, terkecuali yang diterangkan kepadamu keharamannya, maka jauhilah olehmu berhala-berhala yang najis itu dan jauhilah perkataan-perkataan dusta.",
      "ar": "ذَ ٰ⁠لِكَۖ وَمَن یُعَظِّمۡ حُرُمَـٰتِ ٱللَّهِ فَهُوَ خَیۡرࣱ لَّهُۥ عِندَ رَبِّهِۦۗ وَأُحِلَّتۡ لَكُمُ ٱلۡأَنۡعَـٰمُ إِلَّا مَا یُتۡلَىٰ عَلَیۡكُمۡۖ فَٱجۡتَنِبُوا۟ ٱلرِّجۡسَ مِنَ ٱلۡأَوۡثَـٰنِ وَٱجۡتَنِبُوا۟ قَوۡلَ ٱلزُّورِ\n"
    }
  },
  {
    "id": 2626,
    "surahId": 22,
    "ayahNumber": 31,
    "arabicText": "حُنَفَاۤءَ لِلَّهِ غَیۡرَ مُشۡرِكِینَ بِهِۦۚ وَمَن یُشۡرِكۡ بِٱللَّهِ فَكَأَنَّمَا خَرَّ مِنَ ٱلسَّمَاۤءِ فَتَخۡطَفُهُ ٱلطَّیۡرُ أَوۡ تَهۡوِی بِهِ ٱلرِّیحُ فِی مَكَانࣲ سَحِیقࣲ\n",
    "translations": {
      "en": "[inclining] towards God, [and] turning away from all that is false, without ascribing divine qualities to aught beside Him: for he who ascribes divinity to aught but God is like one who is hurtling down from the skies - whereupon the birds carry him off, or the wind blows him away onto a far-off place.",
      "ms": "(Amalkanlah perkara-perkara itu) dengan tulus ikhlas kepada Allah, serta tidak mempersekutukan sesuatu pun denganNya; dan sesiapa yang mempersekutukan sesuatu yang lain dengan Allah maka seolah-olah dia jatuh dari langit lalu disambar oleh burung, atau dihumbankan oleh angin ke tempat yang jauh (yang membinasakan).",
      "id": "dengan ikhlas kepada Allah, tidak mempersekutukan sesuatu dengan Dia. Barangsiapa mempersekutukan sesuatu dengan Allah, maka adalah ia seolah-olah jatuh dari langit lalu disambar oleh burung, atau diterbangkan angin ke tempat yang jauh.",
      "ar": "حُنَفَاۤءَ لِلَّهِ غَیۡرَ مُشۡرِكِینَ بِهِۦۚ وَمَن یُشۡرِكۡ بِٱللَّهِ فَكَأَنَّمَا خَرَّ مِنَ ٱلسَّمَاۤءِ فَتَخۡطَفُهُ ٱلطَّیۡرُ أَوۡ تَهۡوِی بِهِ ٱلرِّیحُ فِی مَكَانࣲ سَحِیقࣲ\n"
    }
  },
  {
    "id": 2627,
    "surahId": 22,
    "ayahNumber": 32,
    "arabicText": "ذَ ٰ⁠لِكَۖ وَمَن یُعَظِّمۡ شَعَـٰۤىِٕرَ ٱللَّهِ فَإِنَّهَا مِن تَقۡوَى ٱلۡقُلُوبِ\n",
    "translations": {
      "en": "This is [to be borne in mind]. And anyone who honours the symbols set up by God [shall know that] verily, these [symbols derive their value] from the God-consciousness in the [believers’] hearts.",
      "ms": "Demikianlah (ajaran Allah); dan sesiapa yang menghormati Syiar-syiar ugama Allah maka (dia lah orang yang bertaqwa) kerana sesungguhnya perbuatan itu satu kesan dari sifat-sifat taqwa hati orang mukmin.",
      "id": "Demikianlah (perintah Allah). Dan barangsiapa mengagungkan syi'ar-syi'ar Allah, maka sesungguhnya itu timbul dari ketakwaan hati.",
      "ar": "ذَ ٰ⁠لِكَۖ وَمَن یُعَظِّمۡ شَعَـٰۤىِٕرَ ٱللَّهِ فَإِنَّهَا مِن تَقۡوَى ٱلۡقُلُوبِ\n"
    }
  },
  {
    "id": 2628,
    "surahId": 22,
    "ayahNumber": 33,
    "arabicText": "لَكُمۡ فِیهَا مَنَـٰفِعُ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى ثُمَّ مَحِلُّهَاۤ إِلَى ٱلۡبَیۡتِ ٱلۡعَتِیقِ\n",
    "translations": {
      "en": "In that [God-consciousness] you shall find benefits until a term set [by Him is fulfilled], and [you shall know that] its goal and end is the Most Ancient Temple.",
      "ms": "Kamu beroleh berbagai-bagai faedah dan kegunaan pada binatang ternak itu hingga ke suatu masa yang tertentu (bagi menyembelihnya); kemudian waktu menyembelihnya ketika sampai di tanah haram Baitullah yang tua sejarahnya itu.",
      "id": "Bagi kamu pada binatang-binatang hadyu itu ada beberapa manfaat, sampai kepada waktu yang ditentukan, kemudian tempat wajib (serta akhir masa) menyembelihnya ialah setelah sampai ke Baitul Atiq (Baitullah).",
      "ar": "لَكُمۡ فِیهَا مَنَـٰفِعُ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى ثُمَّ مَحِلُّهَاۤ إِلَى ٱلۡبَیۡتِ ٱلۡعَتِیقِ\n"
    }
  },
  {
    "id": 2629,
    "surahId": 22,
    "ayahNumber": 34,
    "arabicText": "وَلِكُلِّ أُمَّةࣲ جَعَلۡنَا مَنسَكࣰا لِّیَذۡكُرُوا۟ ٱسۡمَ ٱللَّهِ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِیمَةِ ٱلۡأَنۡعَـٰمِۗ فَإِلَـٰهُكُمۡ إِلَـٰهࣱ وَ ٰ⁠حِدࣱ فَلَهُۥۤ أَسۡلِمُوا۟ۗ وَبَشِّرِ ٱلۡمُخۡبِتِینَ\n",
    "translations": {
      "en": "And [thus it is:] unto every community [that has ever believed in Us] have We appointed [sacrifice as] an act of worship, so that they might extol the name of God over whatever heads of cattle He may have provided for them [to this end]. And (always bear in mind:) your God is the One and Only God: hence, surrender yourselves unto Him. And give thou the glad tiding [of God’s acceptance] unto all who are humble –",
      "ms": "Dan bagi tiap-tiap umat, Kami syariatkan ibadat menyembelih korban (atau lain-lainnya) supaya mereka menyebut nama Allah sebagai bersyukur akan pengurniaanNya kepada mereka; binatang-binatang ternak yang disembelih itu. Kerana Tuhan kamu semua ialah Tuhan Yang Maha Esa, maka hendaklah kamu tunduk taat kepadaNya; dan sampaikanlah berita gembira (wahai Muhammad) kepada orang-orang yang tunduk taat -",
      "id": "Dan bagi tiap-tiap umat telah Kami syariatkan penyembelihan (kurban), supaya mereka menyebut nama Allah terhadap binatang ternak yang telah direzekikan Allah kepada mereka, maka Tuhanmu ialah Tuhan Yang Maha Esa, karena itu berserah dirilah kamu kepada-Nya. Dan berilah kabar gembira kepada orang-orang yang tunduk patuh (kepada Allah),",
      "ar": "وَلِكُلِّ أُمَّةࣲ جَعَلۡنَا مَنسَكࣰا لِّیَذۡكُرُوا۟ ٱسۡمَ ٱللَّهِ عَلَىٰ مَا رَزَقَهُم مِّنۢ بَهِیمَةِ ٱلۡأَنۡعَـٰمِۗ فَإِلَـٰهُكُمۡ إِلَـٰهࣱ وَ ٰ⁠حِدࣱ فَلَهُۥۤ أَسۡلِمُوا۟ۗ وَبَشِّرِ ٱلۡمُخۡبِتِینَ\n"
    }
  },
  {
    "id": 2630,
    "surahId": 22,
    "ayahNumber": 35,
    "arabicText": "ٱلَّذِینَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَٱلصَّـٰبِرِینَ عَلَىٰ مَاۤ أَصَابَهُمۡ وَٱلۡمُقِیمِی ٱلصَّلَوٰةِ وَمِمَّا رَزَقۡنَـٰهُمۡ یُنفِقُونَ\n",
    "translations": {
      "en": "all whose hearts tremble with awe whenever God is mentioned, and all who patiently bear whatever ill befalls them, and all who are constant in prayer and spend on others out of what We provide for them as sustenance.",
      "ms": "Iaitu orang-orang yang apabila disebut nama Allah, gerun gementarlah hati mereka, dan orang-orang yang sabar (cekal hati) terhadap kesusahan yang menimpa mereka, dan orang-orang yang mendirikan sembahyang, serta orang-orang yang mendermakan sebahagian dari rezeki yang Kami berikan kepadanya.",
      "id": "(yaitu) orang-orang yang apabila disebut nama Allah gemetarlah hati mereka, orang-orang yang sabar terhadap apa yang menimpa mereka, orang-orang yang mendirikan sembahyang dan orang-orang yang menafkahkan sebagian dari apa yang telah Kami rezekikan kepada mereka.",
      "ar": "ٱلَّذِینَ إِذَا ذُكِرَ ٱللَّهُ وَجِلَتۡ قُلُوبُهُمۡ وَٱلصَّـٰبِرِینَ عَلَىٰ مَاۤ أَصَابَهُمۡ وَٱلۡمُقِیمِی ٱلصَّلَوٰةِ وَمِمَّا رَزَقۡنَـٰهُمۡ یُنفِقُونَ\n"
    }
  },
  {
    "id": 2631,
    "surahId": 22,
    "ayahNumber": 36,
    "arabicText": "وَٱلۡبُدۡنَ جَعَلۡنَـٰهَا لَكُم مِّن شَعَـٰۤىِٕرِ ٱللَّهِ لَكُمۡ فِیهَا خَیۡرࣱۖ فَٱذۡكُرُوا۟ ٱسۡمَ ٱللَّهِ عَلَیۡهَا صَوَاۤفَّۖ فَإِذَا وَجَبَتۡ جُنُوبُهَا فَكُلُوا۟ مِنۡهَا وَأَطۡعِمُوا۟ ٱلۡقَانِعَ وَٱلۡمُعۡتَرَّۚ كَذَ ٰ⁠لِكَ سَخَّرۡنَـٰهَا لَكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ\n",
    "translations": {
      "en": "And as for the sacrifice of cattle, We have ordained it for you as one of the symbols set up by God, in which there is [much] good for you. Hence, extol the name of God over them when they are lined up [for sacrifice]; and after they have fallen lifeless to the ground, eat of their flesh, and feed the poor who is contented with his lot (and does not beg), as well as him who is forced to beg. It is to this end that We have made them subservient to your needs, so that you might have cause to be grateful.",
      "ms": "Dan Kami jadikan unta (yang dihadiahkan kepada fakir miskin Makkah itu) sebahagian dari syiar ugama Allah untuk kamu; pada menyembelih unta yang tersebut ada kebaikan bagi kamu; oleh itu sebutlah nama Allah (semasa menyembelihnya) ketika ia berdiri di atas tiga kakinya maka apabila ia tumbang (serta putus nyawanya), makanlah sebahagian daripadanya, dan berilah (bahagian yang lain) kepada orang-orang yang tidak meminta dan yang meminta. Demikianlah Kami mudahkan dia untuk kamu (menguasainya dan menyembelihnya) supaya kamu bersyukur.",
      "id": "Dan telah Kami jadikan untuk kamu unta-unta itu sebahagian dari syi'ar Allah, kamu memperoleh kebaikan yang banyak padanya, maka sebutlah olehmu nama Allah ketika kamu menyembelihnya dalam keadaan berdiri (dan telah terikat). Kemudian apabila telah roboh (mati), maka makanlah sebahagiannya dan beri makanlah orang yang rela dengan apa yang ada padanya (yang tidak meminta-minta) dan orang yang meminta. Demikianlah Kami telah menundukkan untua-unta itu kepada kamu, mudah-mudahan kamu bersyukur.",
      "ar": "وَٱلۡبُدۡنَ جَعَلۡنَـٰهَا لَكُم مِّن شَعَـٰۤىِٕرِ ٱللَّهِ لَكُمۡ فِیهَا خَیۡرࣱۖ فَٱذۡكُرُوا۟ ٱسۡمَ ٱللَّهِ عَلَیۡهَا صَوَاۤفَّۖ فَإِذَا وَجَبَتۡ جُنُوبُهَا فَكُلُوا۟ مِنۡهَا وَأَطۡعِمُوا۟ ٱلۡقَانِعَ وَٱلۡمُعۡتَرَّۚ كَذَ ٰ⁠لِكَ سَخَّرۡنَـٰهَا لَكُمۡ لَعَلَّكُمۡ تَشۡكُرُونَ\n"
    }
  },
  {
    "id": 2632,
    "surahId": 22,
    "ayahNumber": 37,
    "arabicText": "لَن یَنَالَ ٱللَّهَ لُحُومُهَا وَلَا دِمَاۤؤُهَا وَلَـٰكِن یَنَالُهُ ٱلتَّقۡوَىٰ مِنكُمۡۚ كَذَ ٰ⁠لِكَ سَخَّرَهَا لَكُمۡ لِتُكَبِّرُوا۟ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمۡۗ وَبَشِّرِ ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "[But bear in mind:] never does their flesh reach God, and neither their blood: it is only your God-consciousness that reaches Him. It is to this end that We have made them subservient to your needs, so that you might glorify God for all the guidance with which He has graced you. And give thou this glad tiding unto the doers of good:",
      "ms": "Daging dan darah binatang korban atau hadiah itu tidak sekali-kali akan sampai kepada Allah, tetapi yang sampai kepadaNya ialah amal yang ikhlas yang berdasarkan taqwa dari kamu. Demikianlah Ia memudahkan binatang-binatang itu bagi kamu supaya kamu membesarkan Allah kerana mendapat nikmat petunjukNya. Dan sampaikanlah berita gembira (dengan balasan yang sebaik-baiknya) kepada orang-orang yang berusaha supaya baik amalnya.",
      "id": "Daging-daging unta dan darahnya itu sekali-kali tidak dapat mencapai (keridhaan) Allah, tetapi ketakwaan dari kamulah yang dapat mencapainya. Demikianlah Allah telah menundukkannya untuk kamu supaya kamu mengagungkan Allah terhadap hidayah-Nya kepada kamu. Dan berilah kabar gembira kepada orang-orang yang berbuat baik.",
      "ar": "لَن یَنَالَ ٱللَّهَ لُحُومُهَا وَلَا دِمَاۤؤُهَا وَلَـٰكِن یَنَالُهُ ٱلتَّقۡوَىٰ مِنكُمۡۚ كَذَ ٰ⁠لِكَ سَخَّرَهَا لَكُمۡ لِتُكَبِّرُوا۟ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمۡۗ وَبَشِّرِ ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 2633,
    "surahId": 22,
    "ayahNumber": 38,
    "arabicText": "۞ إِنَّ ٱللَّهَ یُدَ ٰ⁠فِعُ عَنِ ٱلَّذِینَ ءَامَنُوۤا۟ۗ إِنَّ ٱللَّهَ لَا یُحِبُّ كُلَّ خَوَّانࣲ كَفُورٍ\n",
    "translations": {
      "en": "Verily, God will ward off [all evil] from those who attain to faith; [and,] verily, God does not love anyone who betrays his trust and is bereft of gratitude.",
      "ms": "Sesungguhnya Allah membela orang-orang yang beriman; sesungguhnya Allah tidak suka kepada tiap-tiap seorang yang khianat, lagi tidak bersyukur.",
      "id": "Sesungguhnya Allah membela orang-orang yang telah beriman. Sesungguhnya Allah tidak menyukai tiap-tiap orang yang berkhianat lagi mengingkari nikmat.",
      "ar": "۞ إِنَّ ٱللَّهَ یُدَ ٰ⁠فِعُ عَنِ ٱلَّذِینَ ءَامَنُوۤا۟ۗ إِنَّ ٱللَّهَ لَا یُحِبُّ كُلَّ خَوَّانࣲ كَفُورٍ\n"
    }
  },
  {
    "id": 2634,
    "surahId": 22,
    "ayahNumber": 39,
    "arabicText": "أُذِنَ لِلَّذِینَ یُقَـٰتَلُونَ بِأَنَّهُمۡ ظُلِمُوا۟ۚ وَإِنَّ ٱللَّهَ عَلَىٰ نَصۡرِهِمۡ لَقَدِیرٌ\n",
    "translations": {
      "en": "PERMISSION [to fight] is given to those against whom war is being wrongfully waged and, verily, God has indeed the power to succour them -:",
      "ms": "Diizinkan berperang bagi orang-orang (Islam) yang diperangi (oleh golongan penceroboh), kerana sesungguhnya mereka telah dianiaya; dan sesungguhnya Allah Amat Berkuasa untuk menolong mereka (mencapai kemenangan).",
      "id": "Telah diizinkan (berperang) bagi orang-orang yang diperangi, karena sesungguhnya mereka telah dianiaya. Dan sesungguhnya Allah, benar-benar Maha Kuasa menolong mereka itu,",
      "ar": "أُذِنَ لِلَّذِینَ یُقَـٰتَلُونَ بِأَنَّهُمۡ ظُلِمُوا۟ۚ وَإِنَّ ٱللَّهَ عَلَىٰ نَصۡرِهِمۡ لَقَدِیرٌ\n"
    }
  },
  {
    "id": 2635,
    "surahId": 22,
    "ayahNumber": 40,
    "arabicText": "ٱلَّذِینَ أُخۡرِجُوا۟ مِن دِیَـٰرِهِم بِغَیۡرِ حَقٍّ إِلَّاۤ أَن یَقُولُوا۟ رَبُّنَا ٱللَّهُۗ وَلَوۡلَا دَفۡعُ ٱللَّهِ ٱلنَّاسَ بَعۡضَهُم بِبَعۡضࣲ لَّهُدِّمَتۡ صَوَ ٰ⁠مِعُ وَبِیَعࣱ وَصَلَوَ ٰ⁠تࣱ وَمَسَـٰجِدُ یُذۡكَرُ فِیهَا ٱسۡمُ ٱللَّهِ كَثِیرࣰاۗ وَلَیَنصُرَنَّ ٱللَّهُ مَن یَنصُرُهُۥۤۚ إِنَّ ٱللَّهَ لَقَوِیٌّ عَزِیزٌ\n",
    "translations": {
      "en": "those who have been driven from their homelands against all right for no other reason than their saying. “Our Sustainer is God!” For, if God had not enabled people to defend themselves against one another, all] monasteries and churches and synagogues and mosques - in [all of] which Gods name is abundantly extolled - would surely have been destroyed [ere now]. And God will most certainly succour him who suc­cours His cause: for, verily, God is most powerful, almighty,",
      "ms": "Iaitu mereka yang diusir dari kampung halamannya dengan tidak berdasarkan sebarang alasan yang benar, (mereka diusir) semata-mata kerana mereka berkata: \"Tuhan kami ialah Allah\". Dan kalaulah Allah tidak mendorong setengah manusia menentang pencerobohan setengahnya yang lain, nescaya runtuhlah tempat-tempat pertapaan serta gereja-gereja (kaum Nasrani), dan tempat-tempat sembahyang (kaum Yahudi), dan juga masjid-masjid (orang Islam) yang sentiasa disebut nama Allah banyak-banyak padanya dan sesungguhnya Allah akan menolong sesiapa yang menolong ugamaNya (ugama Islam); sesungguhnya Allah Maha Kuat, lagi Maha Kuasa; -",
      "id": "(yaitu) orang-orang yang telah diusir dari kampung halaman mereka tanpa alasan yang benar, kecuali karena mereka berkata: \"Tuhan kami hanyalah Allah\". Dan sekiranya Allah tiada menolak (keganasan) sebagian manusia dengan sebagian yang lain, tentulah telah dirobohkan biara-biara Nasrani, gereja-gereja, rumah-rumah ibadat orang Yahudi dan masjid-masjid, yang di dalamnya banyak disebut nama Allah. Sesungguhnya Allah pasti menolong orang yang menolong (agama)-Nya. Sesungguhnya Allah benar-benar Maha Kuat lagi Maha Perkasa,",
      "ar": "ٱلَّذِینَ أُخۡرِجُوا۟ مِن دِیَـٰرِهِم بِغَیۡرِ حَقٍّ إِلَّاۤ أَن یَقُولُوا۟ رَبُّنَا ٱللَّهُۗ وَلَوۡلَا دَفۡعُ ٱللَّهِ ٱلنَّاسَ بَعۡضَهُم بِبَعۡضࣲ لَّهُدِّمَتۡ صَوَ ٰ⁠مِعُ وَبِیَعࣱ وَصَلَوَ ٰ⁠تࣱ وَمَسَـٰجِدُ یُذۡكَرُ فِیهَا ٱسۡمُ ٱللَّهِ كَثِیرࣰاۗ وَلَیَنصُرَنَّ ٱللَّهُ مَن یَنصُرُهُۥۤۚ إِنَّ ٱللَّهَ لَقَوِیٌّ عَزِیزٌ\n"
    }
  },
  {
    "id": 2636,
    "surahId": 22,
    "ayahNumber": 41,
    "arabicText": "ٱلَّذِینَ إِن مَّكَّنَّـٰهُمۡ فِی ٱلۡأَرۡضِ أَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ وَأَمَرُوا۟ بِٱلۡمَعۡرُوفِ وَنَهَوۡا۟ عَنِ ٱلۡمُنكَرِۗ وَلِلَّهِ عَـٰقِبَةُ ٱلۡأُمُورِ\n",
    "translations": {
      "en": "[well aware of] those who, [even] if We firmly establish them on earth, remain constant in prayer, and give in charity, and enjoin the doing of what is right and forbid the doing of what is wrong; but with God rests the final outcome of all events.",
      "ms": "Iaitu mereka (umat Islam) yang jika Kami berikan mereka kekuasaan memerintah di bumi nescaya mereka mendirikan sembahyang serta memberi zakat, dan mereka menyuruh berbuat kebaikan serta melarang dari melakukan kejahatan dan perkara yang mungkar. Dan (ingatlah) bagi Allah jualah kesudahan segala urusan.",
      "id": "(yaitu) orang-orang yang jika Kami teguhkan kedudukan mereka di muka bumi niscaya mereka mendirikan sembahyang, menunaikan zakat, menyuruh berbuat ma'ruf dan mencegah dari perbuatan yang mungkar; dan kepada Allah-lah kembali segala urusan.",
      "ar": "ٱلَّذِینَ إِن مَّكَّنَّـٰهُمۡ فِی ٱلۡأَرۡضِ أَقَامُوا۟ ٱلصَّلَوٰةَ وَءَاتَوُا۟ ٱلزَّكَوٰةَ وَأَمَرُوا۟ بِٱلۡمَعۡرُوفِ وَنَهَوۡا۟ عَنِ ٱلۡمُنكَرِۗ وَلِلَّهِ عَـٰقِبَةُ ٱلۡأُمُورِ\n"
    }
  },
  {
    "id": 2637,
    "surahId": 22,
    "ayahNumber": 42,
    "arabicText": "وَإِن یُكَذِّبُوكَ فَقَدۡ كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحࣲ وَعَادࣱ وَثَمُودُ\n",
    "translations": {
      "en": "AND IF THEY [who are bent on denying the truth] give thee the lie, [O Muhammad, remember that, long] before their time, the people of Noah and [the tribes of] Ad and Thamud gave the lie [to their prophets],",
      "ms": "Dan jika mereka (yang kafir itu) mendustakanmu (wahai Muhammad), maka (yang demikian tidaklah pelik) kerana sesungguhnya sebelum mereka: Kaum Nabi Nuh, dan Aad (kaum Nabi Hud), serta Thamud (kaum Nabi Soleh) telah juga mendustakan Rasul masing-masing;",
      "id": "Dan jika mereka (orang-orang musyrik) mendustakan kamu, maka sesungguhnya telah mendustakan juga sebelum mereka kaum Nuh, 'Aad dan Tsamud,",
      "ar": "وَإِن یُكَذِّبُوكَ فَقَدۡ كَذَّبَتۡ قَبۡلَهُمۡ قَوۡمُ نُوحࣲ وَعَادࣱ وَثَمُودُ\n"
    }
  },
  {
    "id": 2638,
    "surahId": 22,
    "ayahNumber": 43,
    "arabicText": "وَقَوۡمُ إِبۡرَ ٰ⁠هِیمَ وَقَوۡمُ لُوطࣲ\n",
    "translations": {
      "en": "as did the people of Abraham, and the people of Lot,",
      "ms": "Dan (demikian juga) kaum Nabi Ibrahim dan kaum Nabi Lut;",
      "id": "dan kaum Ibrahim dan kaum Luth,",
      "ar": "وَقَوۡمُ إِبۡرَ ٰ⁠هِیمَ وَقَوۡمُ لُوطࣲ\n"
    }
  },
  {
    "id": 2639,
    "surahId": 22,
    "ayahNumber": 44,
    "arabicText": "وَأَصۡحَـٰبُ مَدۡیَنَۖ وَكُذِّبَ مُوسَىٰۖ فَأَمۡلَیۡتُ لِلۡكَـٰفِرِینَ ثُمَّ أَخَذۡتُهُمۡۖ فَكَیۡفَ كَانَ نَكِیرِ\n",
    "translations": {
      "en": "and the dwellers of Madyan; and [so, too,] Moses was given the lie [by Pharaoh]. And [in every ease] I gave rein, for a while, to the deniers of the truth: but then I took them to task - and how awesome was My denial [of them,]!",
      "ms": "Dan juga penduduk Madyan; dan Nabi Musa juga telah didustakan; maka Aku memberi tempoh kepada orang-orang kafir itu, kemudian Aku menimpakan mereka dengan azab seksa. Dengan yang demikian perhatikanlah bagaimana buruknya kesan kemurkaanKu.",
      "id": "dan penduduk Madyan, dan telah didustakan Musa, lalu Aku tangguhkan (azab-Ku) untuk orang-orang kafir, kemudian Aku azab mereka, maka (lihatlah) bagaimana besarnya kebencian-Ku (kepada mereka itu).",
      "ar": "وَأَصۡحَـٰبُ مَدۡیَنَۖ وَكُذِّبَ مُوسَىٰۖ فَأَمۡلَیۡتُ لِلۡكَـٰفِرِینَ ثُمَّ أَخَذۡتُهُمۡۖ فَكَیۡفَ كَانَ نَكِیرِ\n"
    }
  },
  {
    "id": 2640,
    "surahId": 22,
    "ayahNumber": 45,
    "arabicText": "فَكَأَیِّن مِّن قَرۡیَةٍ أَهۡلَكۡنَـٰهَا وَهِیَ ظَالِمَةࣱ فَهِیَ خَاوِیَةٌ عَلَىٰ عُرُوشِهَا وَبِئۡرࣲ مُّعَطَّلَةࣲ وَقَصۡرࣲ مَّشِیدٍ\n",
    "translations": {
      "en": "And how many a township have We destroyed because it had been immersed in evildoing - and now they [all] lie deserted, with their roofs caved in! And how many a well lies abandoned, and how many a castle that [once] stood high!",
      "ms": "Maka bukan sedikit negeri-negeri yang Kami binasakan dengan sebab kezaliman penduduknya, lalu runtuh ranaplah bangunan-bangunannya; dan bukan sedikit pula telaga yang telah terbiar, dan istana yang tersergam (telah kosong, ditinggalkan).",
      "id": "Berapalah banyaknya kota yang Kami telah membinasakannya, yang penduduknya dalam keadaan zalim, maka (tembok-tembok) kota itu roboh menutupi atap-atapnya dan (berapa banyak pula) sumur yang telah ditinggalkan dan istana yang tinggi,",
      "ar": "فَكَأَیِّن مِّن قَرۡیَةٍ أَهۡلَكۡنَـٰهَا وَهِیَ ظَالِمَةࣱ فَهِیَ خَاوِیَةٌ عَلَىٰ عُرُوشِهَا وَبِئۡرࣲ مُّعَطَّلَةࣲ وَقَصۡرࣲ مَّشِیدٍ\n"
    }
  },
  {
    "id": 2641,
    "surahId": 22,
    "ayahNumber": 46,
    "arabicText": "أَفَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَتَكُونَ لَهُمۡ قُلُوبࣱ یَعۡقِلُونَ بِهَاۤ أَوۡ ءَاذَانࣱ یَسۡمَعُونَ بِهَاۖ فَإِنَّهَا لَا تَعۡمَى ٱلۡأَبۡصَـٰرُ وَلَـٰكِن تَعۡمَى ٱلۡقُلُوبُ ٱلَّتِی فِی ٱلصُّدُورِ\n",
    "translations": {
      "en": "Have they, then, never journeyed about the earth, letting their hearts gain wisdom, and causing their ears to hear? Yet, verily, it is not their eyes that have become blind - but blind have become the hearts that are in their breasts!",
      "ms": "Oleh itu, bukankah ada baiknya mereka mengembara di muka bumi supaya - dengan melihat kesan-kesan yang tersebut - mereka menjadi orang-orang yang ada hati yang dengannya mereka dapat memahami, atau ada telinga yang dengannya mereka dapat mendengar? (Tetapi kalaulah mereka mengembara pun tidak juga berguna) kerana keadaan yang sebenarnya bukanlah mata kepala yang buta, tetapi yang buta itu ialah mata hati yang ada di dalam dada.",
      "id": "maka apakah mereka tidak berjalan di muka bumi, lalu mereka mempunyai hati yang dengan itu mereka dapat memahami atau mempunyai telinga yang dengan itu mereka dapat mendengar? Karena sesungguhnya bukanlah mata itu yang buta, tetapi yang buta, ialah hati yang di dalam dada.",
      "ar": "أَفَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَتَكُونَ لَهُمۡ قُلُوبࣱ یَعۡقِلُونَ بِهَاۤ أَوۡ ءَاذَانࣱ یَسۡمَعُونَ بِهَاۖ فَإِنَّهَا لَا تَعۡمَى ٱلۡأَبۡصَـٰرُ وَلَـٰكِن تَعۡمَى ٱلۡقُلُوبُ ٱلَّتِی فِی ٱلصُّدُورِ\n"
    }
  },
  {
    "id": 2642,
    "surahId": 22,
    "ayahNumber": 47,
    "arabicText": "وَیَسۡتَعۡجِلُونَكَ بِٱلۡعَذَابِ وَلَن یُخۡلِفَ ٱللَّهُ وَعۡدَهُۥۚ وَإِنَّ یَوۡمًا عِندَ رَبِّكَ كَأَلۡفِ سَنَةࣲ مِّمَّا تَعُدُّونَ\n",
    "translations": {
      "en": "And [so, O Muhammad,] they challenge thee to hasten the coming upon them of [God’s] chastisement: but God never fails to fulfill His promise - and, behold, in thy Sustainer’s sight a day is like a thousand years of your reckoning.",
      "ms": "Dan mereka meminta kepadamu (wahai Muhammad) menyegerakan kedatangan azab, padahal Allah tidak sekali-kali akan memungkiri janjiNya; dan (katakanlah kepada mereka): sesungguhnya satu hari dari hari-hari azab di sisi Tuhanmu adalah menyamai seribu tahun dari yang kamu hitung.",
      "id": "Dan mereka meminta kepadamu agar azab itu disegerakan, padahal Allah sekali-kali tidak akan menyalahi janji-Nya. Sesungguhnya sehari disisi Tuhanmu adalah seperti seribu tahun menurut perhitunganmu.",
      "ar": "وَیَسۡتَعۡجِلُونَكَ بِٱلۡعَذَابِ وَلَن یُخۡلِفَ ٱللَّهُ وَعۡدَهُۥۚ وَإِنَّ یَوۡمًا عِندَ رَبِّكَ كَأَلۡفِ سَنَةࣲ مِّمَّا تَعُدُّونَ\n"
    }
  },
  {
    "id": 2643,
    "surahId": 22,
    "ayahNumber": 48,
    "arabicText": "وَكَأَیِّن مِّن قَرۡیَةٍ أَمۡلَیۡتُ لَهَا وَهِیَ ظَالِمَةࣱ ثُمَّ أَخَذۡتُهَا وَإِلَیَّ ٱلۡمَصِیرُ\n",
    "translations": {
      "en": "And to how many a community that was im­mersed in evildoing have I given rein for a while! But then I took it to task: for with Me is all journeys’ end!",
      "ms": "Dan bukan sedikit negeri-negeri yang Aku beri tempoh, sedang penduduknya berlaku zalim; kemudian Aku menimpakannya dengan azab seksa; dan (ingatlah) kepada Akulah tempat kembali.",
      "id": "Dan berapalah banyaknya kota yang Aku tangguhkan (azab-Ku) kepadanya, yang penduduknya berbuat zalim, kemudian Aku azab mereka, dan hanya kepada-Kulah kembalinya (segala sesuatu).",
      "ar": "وَكَأَیِّن مِّن قَرۡیَةٍ أَمۡلَیۡتُ لَهَا وَهِیَ ظَالِمَةࣱ ثُمَّ أَخَذۡتُهَا وَإِلَیَّ ٱلۡمَصِیرُ\n"
    }
  },
  {
    "id": 2644,
    "surahId": 22,
    "ayahNumber": 49,
    "arabicText": "قُلۡ یَـٰۤأَیُّهَا ٱلنَّاسُ إِنَّمَاۤ أَنَا۠ لَكُمۡ نَذِیرࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "SAY [O Muhammad]: “O men! I am but a plain warner [sent by God] unto you!”",
      "ms": "Katakanlah (wahai Muhammad): \"Wahai sekalian manusia, aku tidak lain hanyalah seorang Rasul pemberi amaran yang menjelaskan keterangan-keterangan kepada kamu\".",
      "id": "Katakanlah: \"Hai manusia, sesungguhnya aku adalah seorang pemberi peringatan yang nyata kepada kamu\".",
      "ar": "قُلۡ یَـٰۤأَیُّهَا ٱلنَّاسُ إِنَّمَاۤ أَنَا۠ لَكُمۡ نَذِیرࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 2645,
    "surahId": 22,
    "ayahNumber": 50,
    "arabicText": "فَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ لَهُم مَّغۡفِرَةࣱ وَرِزۡقࣱ كَرِیمࣱ\n",
    "translations": {
      "en": "And [know that] those who attain to faith and do righteous deeds shall be granted forgiveness of sins and a most excellent sustenance;",
      "ms": "Maka orang-orang yang beriman dan beramal soleh akan beroleh keampunan dan limpah kurnia yang mulia.",
      "id": "Maka orang-orang yang beriman dan beramal saleh, bagi mereka ampunan dan rezeki yang mulia.",
      "ar": "فَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ لَهُم مَّغۡفِرَةࣱ وَرِزۡقࣱ كَرِیمࣱ\n"
    }
  },
  {
    "id": 2646,
    "surahId": 22,
    "ayahNumber": 51,
    "arabicText": "وَٱلَّذِینَ سَعَوۡا۟ فِیۤ ءَایَـٰتِنَا مُعَـٰجِزِینَ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلۡجَحِیمِ\n",
    "translations": {
      "en": "whereas those who strive against Our messages, seeking to defeat their purpose - they are destined for the blazing fire.",
      "ms": "Dan (sebaliknya) orang-orang yang berusaha menentang dan membatalkan ayat-ayat keterangan Kami, mereka itulah ahli neraka.",
      "id": "Dan orang-orang yang berusaha dengan maksud menentang ayat-ayat Kami dengan melemahkan (kemauan untuk beriman); mereka itu adalah penghuni-penghuni neraka.",
      "ar": "وَٱلَّذِینَ سَعَوۡا۟ فِیۤ ءَایَـٰتِنَا مُعَـٰجِزِینَ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلۡجَحِیمِ\n"
    }
  },
  {
    "id": 2647,
    "surahId": 22,
    "ayahNumber": 52,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَا مِن قَبۡلِكَ مِن رَّسُولࣲ وَلَا نَبِیٍّ إِلَّاۤ إِذَا تَمَنَّىٰۤ أَلۡقَى ٱلشَّیۡطَـٰنُ فِیۤ أُمۡنِیَّتِهِۦ فَیَنسَخُ ٱللَّهُ مَا یُلۡقِی ٱلشَّیۡطَـٰنُ ثُمَّ یُحۡكِمُ ٱللَّهُ ءَایَـٰتِهِۦۗ وَٱللَّهُ عَلِیمٌ حَكِیمࣱ\n",
    "translations": {
      "en": "Yet whenever We sent forth any apostle or prophet before thee, and he was hoping [that his warnings would be heeded], Satan would cast an asper­sion on his innermost aims: but God renders null and void whatever aspersion Satan may cast; and God makes His messages clear in and by themselves for God is all-knowing, wise.",
      "ms": "Dan tidaklah Kami mengutuskan sebelummu seorang Rasul atau seorang Nabi melainkan apabila ia bercita-cita (supaya kaumnya beriman kepada ugama Allah yang dibawanya), maka Syaitan pun melemparkan hasutannya mengenai usaha Rasul atau Nabi itu mencapai cita-citanya; oleh itu, Allah segera menghapuskan apa yang telah diganggu oleh Syaitan, kemudian Allah menetapkan ayat-ayatNya dengan kukuhnya; dan Allah Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "Dan Kami tidak mengutus sebelum kamu seorang rasulpun dan tidak (pula) seorang nabi, melainkan apabila ia mempunyai sesuatu keinginan, syaitanpun memasukkan godaan-godaan terhadap keinginan itu, Allah menghilangkan apa yang dimasukkan oleh syaitan itu, dan Allah menguatkan ayat-ayat-Nya. Dan Allah Maha Mengetahui lagi Maha Bijaksana,",
      "ar": "وَمَاۤ أَرۡسَلۡنَا مِن قَبۡلِكَ مِن رَّسُولࣲ وَلَا نَبِیٍّ إِلَّاۤ إِذَا تَمَنَّىٰۤ أَلۡقَى ٱلشَّیۡطَـٰنُ فِیۤ أُمۡنِیَّتِهِۦ فَیَنسَخُ ٱللَّهُ مَا یُلۡقِی ٱلشَّیۡطَـٰنُ ثُمَّ یُحۡكِمُ ٱللَّهُ ءَایَـٰتِهِۦۗ وَٱللَّهُ عَلِیمٌ حَكِیمࣱ\n"
    }
  },
  {
    "id": 2648,
    "surahId": 22,
    "ayahNumber": 53,
    "arabicText": "لِّیَجۡعَلَ مَا یُلۡقِی ٱلشَّیۡطَـٰنُ فِتۡنَةࣰ لِّلَّذِینَ فِی قُلُوبِهِم مَّرَضࣱ وَٱلۡقَاسِیَةِ قُلُوبُهُمۡۗ وَإِنَّ ٱلظَّـٰلِمِینَ لَفِی شِقَاقِۭ بَعِیدࣲ\n",
    "translations": {
      "en": "[And He allows doubts to arise] so that He might cause whatever aspersion Satan may cast [against His prophets] to become a trial for all in whose hearts is disease and all whose hearts are hardened: for, verily, all who are [thus] sinning [against themselves] are most deeply in the wrong.",
      "ms": "(Yang demikian) kerana Allah hendak menjadikan hasutan Syaitan itu sebagai satu fitnah cubaan bagi orang-orang yang ada penyakit kufur ingkar dalam hati mereka, dan yang hatinya keras membatu; dan sesungguhnya mereka yang zalim itu sentiasa berada dalam pertentangan yang jauh dari kebenaran.",
      "id": "agar Dia menjadikan apa yang dimasukkan oleh syaitan itu, sebagai cobaan bagi orang-orang yang di dalam hatinya ada penyakit dan yang kasar hatinya. Dan sesungguhnya orang-orang yang zalim itu, benar-benar dalam permusuhan yang sangat,",
      "ar": "لِّیَجۡعَلَ مَا یُلۡقِی ٱلشَّیۡطَـٰنُ فِتۡنَةࣰ لِّلَّذِینَ فِی قُلُوبِهِم مَّرَضࣱ وَٱلۡقَاسِیَةِ قُلُوبُهُمۡۗ وَإِنَّ ٱلظَّـٰلِمِینَ لَفِی شِقَاقِۭ بَعِیدࣲ\n"
    }
  },
  {
    "id": 2649,
    "surahId": 22,
    "ayahNumber": 54,
    "arabicText": "وَلِیَعۡلَمَ ٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ فَیُؤۡمِنُوا۟ بِهِۦ فَتُخۡبِتَ لَهُۥ قُلُوبُهُمۡۗ وَإِنَّ ٱللَّهَ لَهَادِ ٱلَّذِینَ ءَامَنُوۤا۟ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "And [God renders Satan’s aspersions null and void] so that they who are endowed with [innate] knowledge might know that this [divine writ] is the truth from thy Sustainer, and that they aught believe in it, and that their hearts might humbly submit unto Him. For, behold, God does guide onto a straight way those who have attained to faith –",
      "ms": "Dan juga supaya orang-orang yang beroleh ilmu mengetahui bahawa ayat-ayat keterangan itu benar dari Tuhanmu, lalu mereka beriman kepadanya, sehingga tunduk taatlah hati mereka mematuhinya; dan sesungguhnya Allah sentiasa memimpin orang-orang yang beriman ke jalan yang lurus.",
      "id": "dan agar orang-orang yang telah diberi ilmu, meyakini bahwasanya Al Quran itulah yang hak dari Tuhan-mu lalu mereka beriman dan tunduk hati mereka kepadanya dan sesungguhnya Allah adalah Pemberi Petunjuk bagi orang-orang yang beriman kepada jalan yang lurus.",
      "ar": "وَلِیَعۡلَمَ ٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ أَنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ فَیُؤۡمِنُوا۟ بِهِۦ فَتُخۡبِتَ لَهُۥ قُلُوبُهُمۡۗ وَإِنَّ ٱللَّهَ لَهَادِ ٱلَّذِینَ ءَامَنُوۤا۟ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 2650,
    "surahId": 22,
    "ayahNumber": 55,
    "arabicText": "وَلَا یَزَالُ ٱلَّذِینَ كَفَرُوا۟ فِی مِرۡیَةࣲ مِّنۡهُ حَتَّىٰ تَأۡتِیَهُمُ ٱلسَّاعَةُ بَغۡتَةً أَوۡ یَأۡتِیَهُمۡ عَذَابُ یَوۡمٍ عَقِیمٍ\n",
    "translations": {
      "en": "whereas those who are bent on denying the truth will not cease to be in doubt about Him until the Last Hour comes suddenly upon them and [supreme] suffering befalls them on a Day void of all hope.",
      "ms": "Dan orang-orang kafir tetap di dalam keraguan terhadap Al-Quran hingga datang kepada mereka saat kiamat secara mengejut, atau datang kepada mereka azab hari yang tidak ada kebaikan untuk mereka.",
      "id": "Dan senantiasalah orang-orang kafir itu berada dalam keragu-raguan terhadap Al Quran, hingga datang kepada mereka saat (kematiannya) dengan tiba-tiba atau datang kepada mereka azab hari kiamat.",
      "ar": "وَلَا یَزَالُ ٱلَّذِینَ كَفَرُوا۟ فِی مِرۡیَةࣲ مِّنۡهُ حَتَّىٰ تَأۡتِیَهُمُ ٱلسَّاعَةُ بَغۡتَةً أَوۡ یَأۡتِیَهُمۡ عَذَابُ یَوۡمٍ عَقِیمٍ\n"
    }
  },
  {
    "id": 2651,
    "surahId": 22,
    "ayahNumber": 56,
    "arabicText": "ٱلۡمُلۡكُ یَوۡمَىِٕذࣲ لِّلَّهِ یَحۡكُمُ بَیۡنَهُمۡۚ فَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فِی جَنَّـٰتِ ٱلنَّعِیمِ\n",
    "translations": {
      "en": "On that Day, all dominion shall [visibly] belong to God, He shall judge [all men and make a distinction] between them: thus, all who had attained to faith and did righteous deeds shall find themselves in gardens of bliss,",
      "ms": "Kuasa pemerintahan pada hari kiamat itu tertentu bagi Allah. Ia akan menghukum di antara mereka. Maka orang-orang yang beriman dan beramal soleh ditempatkan di dalam Syurga yang penuh dengan segala nikmat dan kesenangan;",
      "id": "Kekuasaan di hari itu ada pada Allah, Dia memberi keputusan di antara mereka. Maka orang-orang yang beriman dan beramal saleh adalah di dalam surga yang penuh kenikmatan.",
      "ar": "ٱلۡمُلۡكُ یَوۡمَىِٕذࣲ لِّلَّهِ یَحۡكُمُ بَیۡنَهُمۡۚ فَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فِی جَنَّـٰتِ ٱلنَّعِیمِ\n"
    }
  },
  {
    "id": 2652,
    "surahId": 22,
    "ayahNumber": 57,
    "arabicText": "وَٱلَّذِینَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔایَـٰتِنَا فَأُو۟لَـٰۤىِٕكَ لَهُمۡ عَذَابࣱ مُّهِینࣱ\n",
    "translations": {
      "en": "whereas for those who were bent on denying the truth and gave the lie to Our messages, there shall be shameful suffering in store.",
      "ms": "Dan orang-orang yang kafir serta mendustakan ayat-ayat keterangan kami, maka mereka beroleh azab seksa yang menghina.",
      "id": "Dan orang-orang yang kafir dan mendustakan ayat-ayat Kami, maka bagi mereka azab yang menghinakan.",
      "ar": "وَٱلَّذِینَ كَفَرُوا۟ وَكَذَّبُوا۟ بِـَٔایَـٰتِنَا فَأُو۟لَـٰۤىِٕكَ لَهُمۡ عَذَابࣱ مُّهِینࣱ\n"
    }
  },
  {
    "id": 2653,
    "surahId": 22,
    "ayahNumber": 58,
    "arabicText": "وَٱلَّذِینَ هَاجَرُوا۟ فِی سَبِیلِ ٱللَّهِ ثُمَّ قُتِلُوۤا۟ أَوۡ مَاتُوا۟ لَیَرۡزُقَنَّهُمُ ٱللَّهُ رِزۡقًا حَسَنࣰاۚ وَإِنَّ ٱللَّهَ لَهُوَ خَیۡرُ ٱلرَّ ٰ⁠زِقِینَ\n",
    "translations": {
      "en": "AND AS FOR those who forsake the domain of evil (and strive) in God’s cause, and then are slain or die - God will most certainly provide for them a goodly sustenance [in the life to come] for, verily, God - He alone - is the best of providers;",
      "ms": "Dan orang-orang yang berhijrah pada jalan Allah, kemudian mereka terbunuh atau mati, sudah tentu Allah akan mengurniakan kepada mereka limpah kurnia yang baik. Dan (ingatlah) sesungguhnya Allah adalah sebaik-baik pemberi limpah kurnia.",
      "id": "Dan orang-orang yang berhijrah di jalan Allah, kemudian mereka di bunuh atau mati, benar-benar Allah akan memberikan kepada mereka rezeki yang baik (surga). Dan sesungguhnya Allah adalah sebaik-baik pemberi rezeki.",
      "ar": "وَٱلَّذِینَ هَاجَرُوا۟ فِی سَبِیلِ ٱللَّهِ ثُمَّ قُتِلُوۤا۟ أَوۡ مَاتُوا۟ لَیَرۡزُقَنَّهُمُ ٱللَّهُ رِزۡقًا حَسَنࣰاۚ وَإِنَّ ٱللَّهَ لَهُوَ خَیۡرُ ٱلرَّ ٰ⁠زِقِینَ\n"
    }
  },
  {
    "id": 2654,
    "surahId": 22,
    "ayahNumber": 59,
    "arabicText": "لَیُدۡخِلَنَّهُم مُّدۡخَلࣰا یَرۡضَوۡنَهُۥۚ وَإِنَّ ٱللَّهَ لَعَلِیمٌ حَلِیمࣱ\n",
    "translations": {
      "en": "[and] He will most certainly cause them to enter upon a state (of being) that shall please them well: for, verily, God is all-knowing, most forbearing.",
      "ms": "Sudah tentu Allah akan memasukkan mereka (yang tersebut itu) ke tempat yang mereka sukai (Syurga), dan sesungguhnya Allah Maha Mengetahui, lagi Maha Penyabar.",
      "id": "Sesungguhnya Allah akan memasukkan mereka ke dalam suatu tempat (surga) yang mereka menyukainya. Dan sesungguhnya Allah Maha mengetahui lagi Maha Penyantun.",
      "ar": "لَیُدۡخِلَنَّهُم مُّدۡخَلࣰا یَرۡضَوۡنَهُۥۚ وَإِنَّ ٱللَّهَ لَعَلِیمٌ حَلِیمࣱ\n"
    }
  },
  {
    "id": 2655,
    "surahId": 22,
    "ayahNumber": 60,
    "arabicText": "۞ ذَ ٰ⁠لِكَۖ وَمَنۡ عَاقَبَ بِمِثۡلِ مَا عُوقِبَ بِهِۦ ثُمَّ بُغِیَ عَلَیۡهِ لَیَنصُرَنَّهُ ٱللَّهُۚ إِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورࣱ\n",
    "translations": {
      "en": "Thus shall it be. And as for him who responds to aggression only to the extent of the attack levelled against him, and is thereupon [again] treacherously attacked - God will most certainly succour him: for, behold, God is indeed an absolver of sins, much-forgiving.",
      "ms": "Demikianlah (janji balasan Allah yang melimpah-limpah itu). Dan sesiapa yang membalas kejahatan orang, sama seperti yang dilakukan kepadanya, kemudian ia dianiaya lagi, demi sesungguhnya Allah akan menolongnya. (Dalam pada itu ingatlah) sesungguhnya Allah Maha Pemaaf, lagi Maha Pengampun.",
      "id": "Demikianlah, dan barangsiapa membalas seimbang dengan penganiayaan yang pernah ia derita kemudian ia dianiaya (lagi), pasti Allah akan menolongnya. Sesungguhnya Allah benar-benar Maha Pemaaf lagi Maha Pengampun.",
      "ar": "۞ ذَ ٰ⁠لِكَۖ وَمَنۡ عَاقَبَ بِمِثۡلِ مَا عُوقِبَ بِهِۦ ثُمَّ بُغِیَ عَلَیۡهِ لَیَنصُرَنَّهُ ٱللَّهُۚ إِنَّ ٱللَّهَ لَعَفُوٌّ غَفُورࣱ\n"
    }
  },
  {
    "id": 2656,
    "surahId": 22,
    "ayahNumber": 61,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّ ٱللَّهَ یُولِجُ ٱلَّیۡلَ فِی ٱلنَّهَارِ وَیُولِجُ ٱلنَّهَارَ فِی ٱلَّیۡلِ وَأَنَّ ٱللَّهَ سَمِیعُۢ بَصِیرࣱ\n",
    "translations": {
      "en": "Thus it is, because God [is almighty the One who] makes the night grow longer by shortening the day, and makes the day grow longer by shortening the night; and because God is all-hearing, all-seeing.",
      "ms": "(Pertolongan yang dijanjikan Allah tetap berlaku) kerana Allah berkuasa menukar gantikan sesuatu keadaan sebagaimana kuasaNya memasukkan malam pada siang dan memasukkan siang pada malam (silih berganti); dan (ingatlah) sesungguhnya Allah Maha Mendengar, lagi Maha Melihat.",
      "id": "Yang demikian itu, adalah karena sesungguhnya Allah (kuasa) memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan bahwasanya Allah Maha Mendengar lagi Maha Melihat.",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّ ٱللَّهَ یُولِجُ ٱلَّیۡلَ فِی ٱلنَّهَارِ وَیُولِجُ ٱلنَّهَارَ فِی ٱلَّیۡلِ وَأَنَّ ٱللَّهَ سَمِیعُۢ بَصِیرࣱ\n"
    }
  },
  {
    "id": 2657,
    "surahId": 22,
    "ayahNumber": 62,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّ مَا یَدۡعُونَ مِن دُونِهِۦ هُوَ ٱلۡبَـٰطِلُ وَأَنَّ ٱللَّهَ هُوَ ٱلۡعَلِیُّ ٱلۡكَبِیرُ\n",
    "translations": {
      "en": "Thus it is, because God alone is the Ultimate Truth, so that all that men invoke beside Him is sheer falsehood, and because God alone is exalted, great!",
      "ms": "Bersifatnya Allah dengan kekuasaan dan luas ilmu pengetahuan itu kerana bahawasanya Allah, Dia lah sahaja Tuhan Yang Sebenar-benarnya, dan bahawa segala yang mereka sembah selain dari Allah itulah yang nyata palsunya. Dan (ingatlah) sesungguhnya Allah jualah Yang Maha Tinggi keadaanNya, lagi Maha Besar (kekuasaanNya)",
      "id": "(Kuasa Allah) yang demikian itu, adalah karena sesungguhnya Allah, Dialah (Tuhan) Yang Haq dan sesungguhnya apa saja yang mereka seru selain dari Allah, itulah yang batil, dan sesungguhnya Allah, Dialah Yang Maha Tinggi lagi Maha Besar.",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّ مَا یَدۡعُونَ مِن دُونِهِۦ هُوَ ٱلۡبَـٰطِلُ وَأَنَّ ٱللَّهَ هُوَ ٱلۡعَلِیُّ ٱلۡكَبِیرُ\n"
    }
  },
  {
    "id": 2658,
    "surahId": 22,
    "ayahNumber": 63,
    "arabicText": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَتُصۡبِحُ ٱلۡأَرۡضُ مُخۡضَرَّةًۚ إِنَّ ٱللَّهَ لَطِیفٌ خَبِیرࣱ\n",
    "translations": {
      "en": "Art thou not aware that it’s God who sends down water from the skies, whereupon the earth becomes green? Verily, God is unfathomable [in His wisdom], all-aware.",
      "ms": "Tidakkah engkau melihat bahawa Allah telah menurunkan hujan dari langit, lalu menjadilah bumi ini hijau subur (dengan sebabnya)? Sesungguhnya Allah Maha Halus serta lemah-lembut (urusan tadbirNya), lagi Maha Mendalam pengetahuanNya (akan hal-ehwal sekalian makhlukNya).",
      "id": "Apakah kamu tiada melihat, bahwasanya Allah menurunkan air dari langit, lalu jadilah bumi itu hijau? Sesungguhnya Allah Maha Halus lagi Maha Mengetahui.",
      "ar": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَتُصۡبِحُ ٱلۡأَرۡضُ مُخۡضَرَّةًۚ إِنَّ ٱللَّهَ لَطِیفٌ خَبِیرࣱ\n"
    }
  },
  {
    "id": 2659,
    "surahId": 22,
    "ayahNumber": 64,
    "arabicText": "لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلۡغَنِیُّ ٱلۡحَمِیدُ\n",
    "translations": {
      "en": "Unto Him belongs all that is in the heavens and all that is on earth; and, verily, God - He alone - is self-sufficient, the One to whom all praise is due.",
      "ms": "Segala yang ada di langit dan di bumi adalah kepunyaanNya. Dan sesungguhnya Allah, Dia lah jua Yang Maha Kaya, lagi Maha Terpuji.",
      "id": "Kepunyaan Allah-lah segala yang ada di langit dan segala yang ada di bumi. Dan sesungguhnya Allah benar-benar Maha Kaya lagi Maha Terpuji.",
      "ar": "لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَإِنَّ ٱللَّهَ لَهُوَ ٱلۡغَنِیُّ ٱلۡحَمِیدُ\n"
    }
  },
  {
    "id": 2660,
    "surahId": 22,
    "ayahNumber": 65,
    "arabicText": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِی ٱلۡأَرۡضِ وَٱلۡفُلۡكَ تَجۡرِی فِی ٱلۡبَحۡرِ بِأَمۡرِهِۦ وَیُمۡسِكُ ٱلسَّمَاۤءَ أَن تَقَعَ عَلَى ٱلۡأَرۡضِ إِلَّا بِإِذۡنِهِۦۤۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "Art thou not aware that it is God who has made subservient to you all that is on earth, and the ships that sail through the sea at His behest - and [that it is He who] holds the celestial bodies [in their orbits], so that they may not fall upon the earth otherwise than by His leave? Verily, God is most compassionate towards men, a dispenser of grace –",
      "ms": "Tidakkah engkau melihat bahawa Allah telah memudahkan apa yang ada di bumi untuk kegunaan kamu, dan (demikian juga) kapal-kapal yang belayar di laut dengan perintahNya? Dan Ia pula menahan langit daripada runtuh menimpa bumi, kecuali dengan izinNya; sesungguhnya Allah Amat melimpah belas kasihanNya dan rahmatNya kepada umat manusia.",
      "id": "Apakah kamu tiada melihat bahwasanya Allah menundukkan bagimu apa yang ada di bumi dan bahtera yang berlayar di lautan dengan perintah-Nya. Dan Dia menahan (benda-benda) langit jatuh ke bumi, melainkan dengan izin-Nya? Sesungguhnya Allah benar-benar Maha Pengasih lagi Maha Penyayang kepada Manusia.",
      "ar": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِی ٱلۡأَرۡضِ وَٱلۡفُلۡكَ تَجۡرِی فِی ٱلۡبَحۡرِ بِأَمۡرِهِۦ وَیُمۡسِكُ ٱلسَّمَاۤءَ أَن تَقَعَ عَلَى ٱلۡأَرۡضِ إِلَّا بِإِذۡنِهِۦۤۚ إِنَّ ٱللَّهَ بِٱلنَّاسِ لَرَءُوفࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 2661,
    "surahId": 22,
    "ayahNumber": 66,
    "arabicText": "وَهُوَ ٱلَّذِیۤ أَحۡیَاكُمۡ ثُمَّ یُمِیتُكُمۡ ثُمَّ یُحۡیِیكُمۡۗ إِنَّ ٱلۡإِنسَـٰنَ لَكَفُورࣱ\n",
    "translations": {
      "en": "seeing that it is He who gave you life, and then will cause you to die, and then will bring you back to life: [but,] verily, bereft of all gratitude is man!",
      "ms": "Dan Dia lah yang menghidupkan kamu, kemudian Ia mematikan kamu, kemudian Ia menghidupkan kamu semula. Sesungguhnya manusia sangatlah tidak bersyukur.",
      "id": "Dan Dialah Allah yang telah menghidupkan kamu, kemudian mematikan kamu, kemudian menghidupkan kamu (lagi), sesungguhnya manusia itu, benar-benar sangat mengingkari nikmat.",
      "ar": "وَهُوَ ٱلَّذِیۤ أَحۡیَاكُمۡ ثُمَّ یُمِیتُكُمۡ ثُمَّ یُحۡیِیكُمۡۗ إِنَّ ٱلۡإِنسَـٰنَ لَكَفُورࣱ\n"
    }
  },
  {
    "id": 2662,
    "surahId": 22,
    "ayahNumber": 67,
    "arabicText": "لِّكُلِّ أُمَّةࣲ جَعَلۡنَا مَنسَكًا هُمۡ نَاسِكُوهُۖ فَلَا یُنَـٰزِعُنَّكَ فِی ٱلۡأَمۡرِۚ وَٱدۡعُ إِلَىٰ رَبِّكَۖ إِنَّكَ لَعَلَىٰ هُدࣰى مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "UNTO every community have We appointed [different] ways of worship, which they ought to observe. Hence, [O believer,] do not let those [who follow ways other than thine] draw thee into disputes on this score, but summon [them all] unto thy Sustainer: for, behold, thou art indeed on the right way.",
      "ms": "Bagi tiap-tiap umat, Kami adakan satu syariat yang tertentu untuk mereka ikuti dan jalankan, maka janganlah ahli-ahli syariat yang lain membantahmu dalam urusan syariaatmu; dan serulah (wahai Muhammad) umat manusia kepada ugama Tuhanmu, kerana sesungguhnya engkau adalah berada di atas jalan yang lurus.",
      "id": "Bagi tiap-tiap umat telah Kami tetapkan syari'at tertentu yang mereka lakukan, maka janganlah sekali-kali mereka membantah kamu dalam urusan (syari'at) ini dan serulah kepada (agama) Tuhanmu. Sesungguhnya kamu benar-benar berada pada jalan yang lurus.",
      "ar": "لِّكُلِّ أُمَّةࣲ جَعَلۡنَا مَنسَكًا هُمۡ نَاسِكُوهُۖ فَلَا یُنَـٰزِعُنَّكَ فِی ٱلۡأَمۡرِۚ وَٱدۡعُ إِلَىٰ رَبِّكَۖ إِنَّكَ لَعَلَىٰ هُدࣰى مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 2663,
    "surahId": 22,
    "ayahNumber": 68,
    "arabicText": "وَإِن جَـٰدَلُوكَ فَقُلِ ٱللَّهُ أَعۡلَمُ بِمَا تَعۡمَلُونَ\n",
    "translations": {
      "en": "And if they [try to] argue with thee, say [only]: “God knows best what you are doing.”",
      "ms": "Dan jika mereka mengemukakan bantahan kepadamu, maka katakanlah: \"Allah Amat\" mengetahui akan apa yang kamu lakukan.",
      "id": "Dan jika mereka membantah kamu, maka katakanlah: \"Allah lebih mengetahui tentang apa yang kamu kerjakan\".",
      "ar": "وَإِن جَـٰدَلُوكَ فَقُلِ ٱللَّهُ أَعۡلَمُ بِمَا تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 2664,
    "surahId": 22,
    "ayahNumber": 69,
    "arabicText": "ٱللَّهُ یَحۡكُمُ بَیۡنَكُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ فِیمَا كُنتُمۡ فِیهِ تَخۡتَلِفُونَ\n",
    "translations": {
      "en": "[For, indeed,] God will judge between you [all] on Resurrection Day with regard to all on which you were wont to differ.",
      "ms": "\"Allah akan menghukum di antara kamu semua pada hari kiamat, mengenai apa yang kamu berselisihan padanya\".",
      "id": "Allah akan mengadili di antara kamu pada hari kiamat tentang apa yang kamu dahulu selalu berselisih padanya.",
      "ar": "ٱللَّهُ یَحۡكُمُ بَیۡنَكُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ فِیمَا كُنتُمۡ فِیهِ تَخۡتَلِفُونَ\n"
    }
  },
  {
    "id": 2665,
    "surahId": 22,
    "ayahNumber": 70,
    "arabicText": "أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ یَعۡلَمُ مَا فِی ٱلسَّمَاۤءِ وَٱلۡأَرۡضِۚ إِنَّ ذَ ٰ⁠لِكَ فِی كِتَـٰبٍۚ إِنَّ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرࣱ\n",
    "translations": {
      "en": "Dost thou not know that God knows all that occurs in heaven as well as on earth? All this, behold, is in [God’s] record: verily, [to know] all this is easy for God.",
      "ms": "Bukankah engkau telah mengetahui bahawasanya Allah mengetahui segala yang ada di langit dan di bumi? Sesungguhnya yang demikian itu ada tertulis di dalam Kitab (Lauh Mahfuz); sesungguhnya hal itu amatlah mudah bagi Allah.",
      "id": "Apakah kamu tidak mengetahui bahwa sesungguhnya Allah mengetahui apa saja yang ada di langit dan di bumi?; bahwasanya yang demikian itu terdapat dalam sebuah kitab (Lauh Mahfuzh). Sesungguhnya yang demikian itu amat mudah bagi Allah.",
      "ar": "أَلَمۡ تَعۡلَمۡ أَنَّ ٱللَّهَ یَعۡلَمُ مَا فِی ٱلسَّمَاۤءِ وَٱلۡأَرۡضِۚ إِنَّ ذَ ٰ⁠لِكَ فِی كِتَـٰبٍۚ إِنَّ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرࣱ\n"
    }
  },
  {
    "id": 2666,
    "surahId": 22,
    "ayahNumber": 71,
    "arabicText": "وَیَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَمۡ یُنَزِّلۡ بِهِۦ سُلۡطَـٰنࣰا وَمَا لَیۡسَ لَهُم بِهِۦ عِلۡمࣱۗ وَمَا لِلظَّـٰلِمِینَ مِن نَّصِیرࣲ\n",
    "translations": {
      "en": "And yet they [who claim to believe in Him often] worship [other beings or forces] beside God - something for which He has never bestoweed any warrant from on high, and [of the reality] whereof they cannot have any knowledge: and such evildoers shall have none to succour them [on Judgment Day].",
      "ms": "Dan mereka menyembah yang lain dari Allah iaitu benda-benda yang Allah tidak menurunkan sebarang keterangan membenarkannya, dan yang mereka tidak mempunyai sebarang pengetahuan mengenainya dan (ingatlah) tiadalah bagi orang-orang yang zalim (dengan perbuatan syirik) itu sesiapapun yang dapat memberikan pertolongan (di dunia dan di akhirat).",
      "id": "Dan mereka menyembah selain Allah, apa yang Allah tidak menurunkan keterangan tentang itu, dan apa yang mereka sendiri tiada mempunyai pengetahuan terhadapnya. Dan bagi orang-orang yang zalim sekali-kali tidak ada seorang penolongpun.",
      "ar": "وَیَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَمۡ یُنَزِّلۡ بِهِۦ سُلۡطَـٰنࣰا وَمَا لَیۡسَ لَهُم بِهِۦ عِلۡمࣱۗ وَمَا لِلظَّـٰلِمِینَ مِن نَّصِیرࣲ\n"
    }
  },
  {
    "id": 2667,
    "surahId": 22,
    "ayahNumber": 72,
    "arabicText": "وَإِذَا تُتۡلَىٰ عَلَیۡهِمۡ ءَایَـٰتُنَا بَیِّنَـٰتࣲ تَعۡرِفُ فِی وُجُوهِ ٱلَّذِینَ كَفَرُوا۟ ٱلۡمُنكَرَۖ یَكَادُونَ یَسۡطُونَ بِٱلَّذِینَ یَتۡلُونَ عَلَیۡهِمۡ ءَایَـٰتِنَاۗ قُلۡ أَفَأُنَبِّئُكُم بِشَرࣲّ مِّن ذَ ٰ⁠لِكُمُۚ ٱلنَّارُ وَعَدَهَا ٱللَّهُ ٱلَّذِینَ كَفَرُوا۟ۖ وَبِئۡسَ ٱلۡمَصِیرُ\n",
    "translations": {
      "en": "As it is, whenever Our messages are conveyed unto them in all their clarity, thou canst perceive utter repugnance on the faces of those who are bent on denying the truth: they would almost assault those who convey Our messages unto them! Say: “Shall I, then, tell you of something worse than what you feel at present? It is the fire [of the hereafter] that God has promised to those who are bent on denying the truth: and how vile a journey’s end!”",
      "ms": "Dan apabila dibacakan kepada mereka ayat-ayat Kami yang jelas nyata, engkau akan dapat melihat pada muka orang-orang yang kafir itu tanda marah dan benci, hampir-hampir mereka hendak menerkam dan menyerang orang-orang yang membacakan ayat-ayat Kami kepada mereka. Katakanlah (wahai Muhammad): \"Jika demikian, mahukah, aku khabarkan kepada kamu: yang lebih buruk lagi daripada apa yang telah menyebabkan kemarahan kamu itu? Ialah neraka yang telah dijanjikan oleh Allah kepada orang-orang yang kafir, dan itulah seburuk-buruk tempat kembali! \"",
      "id": "Dan apabila dibacakan di hadapan mereka ayat-ayat Kami yang terang, niscaya kamu melihat tanda-tanda keingkaran pada muka orang-orang yang kafir itu. Hampir-hampir mereka menyerang orang-orang yang membacakan ayat-ayat Kami di hadapan mereka. Katakanlah: \"Apakah akan aku kabarkan kepadamu yang lebih buruk daripada itu, yaitu neraka?\" Allah telah mengancamkannya kepada orang-orang yang kafir. Dan neraka itu adalah seburuk-buruknya tempat kembali.",
      "ar": "وَإِذَا تُتۡلَىٰ عَلَیۡهِمۡ ءَایَـٰتُنَا بَیِّنَـٰتࣲ تَعۡرِفُ فِی وُجُوهِ ٱلَّذِینَ كَفَرُوا۟ ٱلۡمُنكَرَۖ یَكَادُونَ یَسۡطُونَ بِٱلَّذِینَ یَتۡلُونَ عَلَیۡهِمۡ ءَایَـٰتِنَاۗ قُلۡ أَفَأُنَبِّئُكُم بِشَرࣲّ مِّن ذَ ٰ⁠لِكُمُۚ ٱلنَّارُ وَعَدَهَا ٱللَّهُ ٱلَّذِینَ كَفَرُوا۟ۖ وَبِئۡسَ ٱلۡمَصِیرُ\n"
    }
  },
  {
    "id": 2668,
    "surahId": 22,
    "ayahNumber": 73,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ ضُرِبَ مَثَلࣱ فَٱسۡتَمِعُوا۟ لَهُۥۤۚ إِنَّ ٱلَّذِینَ تَدۡعُونَ مِن دُونِ ٱللَّهِ لَن یَخۡلُقُوا۟ ذُبَابࣰا وَلَوِ ٱجۡتَمَعُوا۟ لَهُۥۖ وَإِن یَسۡلُبۡهُمُ ٱلذُّبَابُ شَیۡـࣰٔا لَّا یَسۡتَنقِذُوهُ مِنۡهُۚ ضَعُفَ ٱلطَّالِبُ وَٱلۡمَطۡلُوبُ\n",
    "translations": {
      "en": "O MEN! A parable is set forth [herewith]; hearken, then, to it! Behold, those beings whom you invoke instead of God cannot create [as much as] a fly, even were they to join all their forces to that end! And if a fly robs them of anything, they cannot [even] rescue it from him! Weak indeed is the seeker, and [weak] the sought!",
      "ms": "Wahai umat manusia, inilah diberikan satu misal perbandingan, maka dengarlah mengenainya dengan bersungguh-sungguh. Sebenarnya mereka yang kamu seru dan sembah, yang lain dari Allah itu, tidak sekali-kali akan dapat mencipta seekor lalat walaupun mereka berhimpun beramai-ramai untuk membuatnya; dan jika lalat itu mengambil sesuatu dari mereka, mereka tidak dapat mengambilnya balik daripadanya. (Kedua-duanya lemah belaka), lemah yang meminta (dari mendapat hajatnya), dan lemah yang diminta (daripada menunaikannya).",
      "id": "Hai manusia, telah dibuat perumpamaan, maka dengarkanlah olehmu perumpamaan itu. Sesungguhnya segala yang kamu seru selain Allah sekali-kali tidak dapat menciptakan seekor lalatpun, walaupun mereka bersatu menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, tiadalah mereka dapat merebutnya kembali dari lalat itu. Amat lemahlah yang menyembah dan amat lemah (pulalah) yang disembah.",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ ضُرِبَ مَثَلࣱ فَٱسۡتَمِعُوا۟ لَهُۥۤۚ إِنَّ ٱلَّذِینَ تَدۡعُونَ مِن دُونِ ٱللَّهِ لَن یَخۡلُقُوا۟ ذُبَابࣰا وَلَوِ ٱجۡتَمَعُوا۟ لَهُۥۖ وَإِن یَسۡلُبۡهُمُ ٱلذُّبَابُ شَیۡـࣰٔا لَّا یَسۡتَنقِذُوهُ مِنۡهُۚ ضَعُفَ ٱلطَّالِبُ وَٱلۡمَطۡلُوبُ\n"
    }
  },
  {
    "id": 2669,
    "surahId": 22,
    "ayahNumber": 74,
    "arabicText": "مَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدۡرِهِۦۤۚ إِنَّ ٱللَّهَ لَقَوِیٌّ عَزِیزٌ\n",
    "translations": {
      "en": "No true understanding of God have they [who err in this way]: for, verily, God is most powerful, almighty!",
      "ms": "Mereka (yang kafir musyrik) itu tidak menghormati Allah menurut penghormatan yang selayaknya (sebagaimana yang ditetapkanNya); sesungguhnya Allah adalah Maha Kuat, lagi Maha Kuasa.",
      "id": "Mereka tidak mengenal Allah dengan sebenar-benarnya. Sesungguhnya Allah benar-benar Maha Kuat lagi Maha Perkasa.",
      "ar": "مَا قَدَرُوا۟ ٱللَّهَ حَقَّ قَدۡرِهِۦۤۚ إِنَّ ٱللَّهَ لَقَوِیٌّ عَزِیزٌ\n"
    }
  },
  {
    "id": 2670,
    "surahId": 22,
    "ayahNumber": 75,
    "arabicText": "ٱللَّهُ یَصۡطَفِی مِنَ ٱلۡمَلَـٰۤىِٕكَةِ رُسُلࣰا وَمِنَ ٱلنَّاسِۚ إِنَّ ٱللَّهَ سَمِیعُۢ بَصِیرࣱ\n",
    "translations": {
      "en": "[In His almightiness,] God chooses message-bearers from among the angels as well as from among men. But, behold, God [alone] is all-hearing, all-see­ing:",
      "ms": "Allah memilih utusan-utusanNya dari malaikat dan dari manusia; sesungguhnya Allah Maha Mendengar, lagi Maha Mengetahui.",
      "id": "Allah memilih utusan-utusan-(Nya) dari malaikat dan dari manusia; sesungguhnya Allah Maha Mendengar lagi Maha Melihat.",
      "ar": "ٱللَّهُ یَصۡطَفِی مِنَ ٱلۡمَلَـٰۤىِٕكَةِ رُسُلࣰا وَمِنَ ٱلنَّاسِۚ إِنَّ ٱللَّهَ سَمِیعُۢ بَصِیرࣱ\n"
    }
  },
  {
    "id": 2671,
    "surahId": 22,
    "ayahNumber": 76,
    "arabicText": "یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ\n",
    "translations": {
      "en": "[whereas their knowledge is limited,] He knows all that lies open before them and all that is hidden from them for all things go back to God [as their source].",
      "ms": "Ia mengetahui apa yang ada di hadapan mereka dan apa yang ada di belakang mereka; dan kepada Allah jualah kembalinya segala urusan.",
      "id": "Allah mengetahui apa yang di hadapan mereka dan apa yang di belakang mereka. Dan hanya kepada Allah dikembalikan semua urusan.",
      "ar": "یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ\n"
    }
  },
  {
    "id": 2672,
    "surahId": 22,
    "ayahNumber": 77,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ٱرۡكَعُوا۟ وَٱسۡجُدُوا۟ وَٱعۡبُدُوا۟ رَبَّكُمۡ وَٱفۡعَلُوا۟ ٱلۡخَیۡرَ لَعَلَّكُمۡ تُفۡلِحُونَ ۩\n",
    "translations": {
      "en": "O YOU who have attained to faith! Bow down and prostrate yourselves, and worship your Sustainer [alone], and do good, so that you might attain to a happy state!",
      "ms": "Wahai orang-orang yang beriman, rukuklah serta sujudlah (mengerjakan sembahyang), dan beribadatlah kepada Tuhan kamu (dengan mentauhidkanNya), serta kerjakanlah amal-amal kebajikan; supaya kamu berjaya (di dunia dan di akhirat).",
      "id": "Hai orang-orang yang beriman, ruku'lah kamu, sujudlah kamu, sembahlah Tuhanmu dan perbuatlah kebajikan, supaya kamu mendapat kemenangan.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ ٱرۡكَعُوا۟ وَٱسۡجُدُوا۟ وَٱعۡبُدُوا۟ رَبَّكُمۡ وَٱفۡعَلُوا۟ ٱلۡخَیۡرَ لَعَلَّكُمۡ تُفۡلِحُونَ ۩\n"
    }
  },
  {
    "id": 2673,
    "surahId": 22,
    "ayahNumber": 78,
    "arabicText": "وَجَـٰهِدُوا۟ فِی ٱللَّهِ حَقَّ جِهَادِهِۦۚ هُوَ ٱجۡتَبَىٰكُمۡ وَمَا جَعَلَ عَلَیۡكُمۡ فِی ٱلدِّینِ مِنۡ حَرَجࣲۚ مِّلَّةَ أَبِیكُمۡ إِبۡرَ ٰ⁠هِیمَۚ هُوَ سَمَّىٰكُمُ ٱلۡمُسۡلِمِینَ مِن قَبۡلُ وَفِی هَـٰذَا لِیَكُونَ ٱلرَّسُولُ شَهِیدًا عَلَیۡكُمۡ وَتَكُونُوا۟ شُهَدَاۤءَ عَلَى ٱلنَّاسِۚ فَأَقِیمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَٱعۡتَصِمُوا۟ بِٱللَّهِ هُوَ مَوۡلَىٰكُمۡۖ فَنِعۡمَ ٱلۡمَوۡلَىٰ وَنِعۡمَ ٱلنَّصِیرُ\n",
    "translations": {
      "en": "And strive hard in God’s cause with all the striving that is due to Him: it is He who has elected you [to carry His message], and has laid no hardship on you in [anything that pertains to religion, [and made you follow] the creed of your forefather Abraham. It is He who has named you in bygone times as well as in this [divine writ] – “those who have surrendered themselves to God”, so that the Apostle might bear witness to the truth before you, and that you might bear witness to it before all mankind. Thus, be constant in prayer, and render the purifying dues, and hold fast unto God. He is your Lord Supreme: and how excellent is this Lord Supreme, and how excellent this Giver of Succour!",
      "ms": "Dan berjihadlah kamu pada jalan Allah dengan jihad yang sebenar-benarnya Dia lah yang memilih kamu (untuk mengerjakan suruhan ugamanya); dan Ia tidak menjadikan kamu menanggung sesuatu keberatan dan susah payah dalam perkara ugama, ugama bapa kamu Ibrahim. Ia menamakan kamu: \"orang-orang Islam\" semenjak dahulu dan di dalam (Al-Quran) ini, supaya Rasulullah (Muhammad) menjadi saksi yang menerangkan kebenaran perbuatan kamu, dan supaya kamu pula layak menjadi orang-orang yang memberi keterangan kepada umat manusia (tentang yang benar dan yang salah). Oleh itu, dirikanlah sembahyang, dan berilah zakat, serta berpegang teguhlah kamu kepada Allah! Dia lah Pelindung kamu. Maka (Allah yang demikian sifatNya) Dia lah sahaja sebaik-baik Pelindung dan sebaik-baik Pemberi pertolongan.",
      "id": "Dan berjihadlah kamu pada jalan Allah dengan jihad yang sebenar-benarnya. Dia telah memilih kamu dan Dia sekali-kali tidak menjadikan untuk kamu dalam agama suatu kesempitan. (Ikutilah) agama orang tuamu Ibrahim. Dia (Allah) telah menamai kamu sekalian orang-orang muslim dari dahulu, dan (begitu pula) dalam (Al Quran) ini, supaya Rasul itu menjadi saksi atas dirimu dan supaya kamu semua menjadi saksi atas segenap manusia, maka dirikanlah sembahyang, tunaikanlah zakat dan berpeganglah kamu pada tali Allah. Dia adalah Pelindungmu, maka Dialah sebaik-baik Pelindung dan sebaik-baik Penolong.",
      "ar": "وَجَـٰهِدُوا۟ فِی ٱللَّهِ حَقَّ جِهَادِهِۦۚ هُوَ ٱجۡتَبَىٰكُمۡ وَمَا جَعَلَ عَلَیۡكُمۡ فِی ٱلدِّینِ مِنۡ حَرَجࣲۚ مِّلَّةَ أَبِیكُمۡ إِبۡرَ ٰ⁠هِیمَۚ هُوَ سَمَّىٰكُمُ ٱلۡمُسۡلِمِینَ مِن قَبۡلُ وَفِی هَـٰذَا لِیَكُونَ ٱلرَّسُولُ شَهِیدًا عَلَیۡكُمۡ وَتَكُونُوا۟ شُهَدَاۤءَ عَلَى ٱلنَّاسِۚ فَأَقِیمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ وَٱعۡتَصِمُوا۟ بِٱللَّهِ هُوَ مَوۡلَىٰكُمۡۖ فَنِعۡمَ ٱلۡمَوۡلَىٰ وَنِعۡمَ ٱلنَّصِیرُ\n"
    }
  }
]