[
  {
    "id": 4584,
    "surahId": 48,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ إِنَّا فَتَحۡنَا لَكَ فَتۡحࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "VERILY, [O Muhammad,] We have laid open before thee a manifest victory,",
      "ms": "",
      "id": "",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ إِنَّا فَتَحۡنَا لَكَ فَتۡحࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 4585,
    "surahId": 48,
    "ayahNumber": 2,
    "arabicText": "لِّیَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَیُتِمَّ نِعۡمَتَهُۥ عَلَیۡكَ وَیَهۡدِیَكَ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n",
    "translations": {
      "en": "so that God might show His forgiveness of all thy faults, past as well as future, and [thus] bestow upon thee the full measure of His blessings, and guide thee on a straight way,",
      "ms": "",
      "id": "",
      "ar": "لِّیَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَیُتِمَّ نِعۡمَتَهُۥ عَلَیۡكَ وَیَهۡدِیَكَ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n"
    }
  },
  {
    "id": 4586,
    "surahId": 48,
    "ayahNumber": 3,
    "arabicText": "وَیَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِیزًا\n",
    "translations": {
      "en": "and [show] that God will succour thee with [His] mighty succour.",
      "ms": "",
      "id": "",
      "ar": "وَیَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِیزًا\n"
    }
  },
  {
    "id": 4587,
    "surahId": 48,
    "ayahNumber": 4,
    "arabicText": "هُوَ ٱلَّذِیۤ أَنزَلَ ٱلسَّكِینَةَ فِی قُلُوبِ ٱلۡمُؤۡمِنِینَ لِیَزۡدَادُوۤا۟ إِیمَـٰنࣰا مَّعَ إِیمَـٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "It is He who from on high has bestowed inner peace upon the hearts of the believers, so that - seeing that God’s are all the forces of the heavens and the earth, and that God is all-knowing, truly wise - they might grow yet more firm in their faith;",
      "ms": "",
      "id": "",
      "ar": "هُوَ ٱلَّذِیۤ أَنزَلَ ٱلسَّكِینَةَ فِی قُلُوبِ ٱلۡمُؤۡمِنِینَ لِیَزۡدَادُوۤا۟ إِیمَـٰنࣰا مَّعَ إِیمَـٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 4588,
    "surahId": 48,
    "ayahNumber": 5,
    "arabicText": "لِّیُدۡخِلَ ٱلۡمُؤۡمِنِینَ وَٱلۡمُؤۡمِنَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَا وَیُكَفِّرَ عَنۡهُمۡ سَیِّـَٔاتِهِمۡۚ وَكَانَ ذَ ٰ⁠لِكَ عِندَ ٱللَّهِ فَوۡزًا عَظِیمࣰا\n",
    "translations": {
      "en": "[and] that He might admit the believers, both men and women, into gardens through which running waters flow, therein to abide, and that He might efface their [past bad] deeds: and that is, in the sight of God, indeed a triumph supreme!",
      "ms": "",
      "id": "",
      "ar": "لِّیُدۡخِلَ ٱلۡمُؤۡمِنِینَ وَٱلۡمُؤۡمِنَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَا وَیُكَفِّرَ عَنۡهُمۡ سَیِّـَٔاتِهِمۡۚ وَكَانَ ذَ ٰ⁠لِكَ عِندَ ٱللَّهِ فَوۡزًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 4589,
    "surahId": 48,
    "ayahNumber": 6,
    "arabicText": "وَیُعَذِّبَ ٱلۡمُنَـٰفِقِینَ وَٱلۡمُنَـٰفِقَـٰتِ وَٱلۡمُشۡرِكِینَ وَٱلۡمُشۡرِكَـٰتِ ٱلظَّاۤنِّینَ بِٱللَّهِ ظَنَّ ٱلسَّوۡءِۚ عَلَیۡهِمۡ دَاۤىِٕرَةُ ٱلسَّوۡءِۖ وَغَضِبَ ٱللَّهُ عَلَیۡهِمۡ وَلَعَنَهُمۡ وَأَعَدَّ لَهُمۡ جَهَنَّمَۖ وَسَاۤءَتۡ مَصِیرࣰا\n",
    "translations": {
      "en": "And [God has willed] to impose suffering [in the life to come] on the hypocrites, both men and women, and on those who ascribe divinity to aught beside Him, both men and women: all who entertain evil thoughts about God. Evil encompasses them from all sides, and God’s condemnation rests upon them; and He has rejected them [from His grace], and has readied hell for them: and how evil a journey’s end!",
      "ms": "",
      "id": "",
      "ar": "وَیُعَذِّبَ ٱلۡمُنَـٰفِقِینَ وَٱلۡمُنَـٰفِقَـٰتِ وَٱلۡمُشۡرِكِینَ وَٱلۡمُشۡرِكَـٰتِ ٱلظَّاۤنِّینَ بِٱللَّهِ ظَنَّ ٱلسَّوۡءِۚ عَلَیۡهِمۡ دَاۤىِٕرَةُ ٱلسَّوۡءِۖ وَغَضِبَ ٱللَّهُ عَلَیۡهِمۡ وَلَعَنَهُمۡ وَأَعَدَّ لَهُمۡ جَهَنَّمَۖ وَسَاۤءَتۡ مَصِیرࣰا\n"
    }
  },
  {
    "id": 4590,
    "surahId": 48,
    "ayahNumber": 7,
    "arabicText": "وَلِلَّهِ جُنُودُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمًا\n",
    "translations": {
      "en": "For, God’s are all the forces of the heavens and the earth; and God is indeed almighty, truly wise!",
      "ms": "",
      "id": "",
      "ar": "وَلِلَّهِ جُنُودُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمًا\n"
    }
  },
  {
    "id": 4591,
    "surahId": 48,
    "ayahNumber": 8,
    "arabicText": "إِنَّاۤ أَرۡسَلۡنَـٰكَ شَـٰهِدࣰا وَمُبَشِّرࣰا وَنَذِیرࣰا\n",
    "translations": {
      "en": "VERILY, [O Muhammad,] We have sent thee as a witness [to the truth], and as a herald of glad tidings and a warner –",
      "ms": "",
      "id": "",
      "ar": "إِنَّاۤ أَرۡسَلۡنَـٰكَ شَـٰهِدࣰا وَمُبَشِّرࣰا وَنَذِیرࣰا\n"
    }
  },
  {
    "id": 4592,
    "surahId": 48,
    "ayahNumber": 9,
    "arabicText": "لِّتُؤۡمِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُۚ وَتُسَبِّحُوهُ بُكۡرَةࣰ وَأَصِیلًا\n",
    "translations": {
      "en": "so that you [O men] might believe in God and His Apostle, and might honour Him, and revere Him, and extol His limitless glory from morn to evening.",
      "ms": "",
      "id": "",
      "ar": "لِّتُؤۡمِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُۚ وَتُسَبِّحُوهُ بُكۡرَةࣰ وَأَصِیلًا\n"
    }
  },
  {
    "id": 4593,
    "surahId": 48,
    "ayahNumber": 10,
    "arabicText": "إِنَّ ٱلَّذِینَ یُبَایِعُونَكَ إِنَّمَا یُبَایِعُونَ ٱللَّهَ یَدُ ٱللَّهِ فَوۡقَ أَیۡدِیهِمۡۚ فَمَن نَّكَثَ فَإِنَّمَا یَنكُثُ عَلَىٰ نَفۡسِهِۦۖ وَمَنۡ أَوۡفَىٰ بِمَا عَـٰهَدَ عَلَیۡهُ ٱللَّهَ فَسَیُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "Behold, all who pledge their allegiance to thee pledge their allegiance to God: the hand of God is over their hands. Hence, he who breaks his oath, breaks it only to his own hurt; whereas he who remains true to what he has pledged unto God, on him will He bestow a reward supreme.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ یُبَایِعُونَكَ إِنَّمَا یُبَایِعُونَ ٱللَّهَ یَدُ ٱللَّهِ فَوۡقَ أَیۡدِیهِمۡۚ فَمَن نَّكَثَ فَإِنَّمَا یَنكُثُ عَلَىٰ نَفۡسِهِۦۖ وَمَنۡ أَوۡفَىٰ بِمَا عَـٰهَدَ عَلَیۡهُ ٱللَّهَ فَسَیُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 4594,
    "surahId": 48,
    "ayahNumber": 11,
    "arabicText": "سَیَقُولُ لَكَ ٱلۡمُخَلَّفُونَ مِنَ ٱلۡأَعۡرَابِ شَغَلَتۡنَاۤ أَمۡوَ ٰ⁠لُنَا وَأَهۡلُونَا فَٱسۡتَغۡفِرۡ لَنَاۚ یَقُولُونَ بِأَلۡسِنَتِهِم مَّا لَیۡسَ فِی قُلُوبِهِمۡۚ قُلۡ فَمَن یَمۡلِكُ لَكُم مِّنَ ٱللَّهِ شَیۡـًٔا إِنۡ أَرَادَ بِكُمۡ ضَرًّا أَوۡ أَرَادَ بِكُمۡ نَفۡعَۢاۚ بَلۡ كَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ خَبِیرَۢا\n",
    "translations": {
      "en": "Those of the bedouin who stayed behind will say unto thee: “[The need to take care of] our chat­tels and our families kept us busy: do then, [O Prophet,] ask God to forgive us!” [Thus,] they will utter with their tongues something that is not in their hearts. Say: “Who, then, has it in his power to avert from you aught that God may have willed, whether it be His will to harm you or to confer a benefit on you? Nay, but God is fully aware of what you do!",
      "ms": "",
      "id": "",
      "ar": "سَیَقُولُ لَكَ ٱلۡمُخَلَّفُونَ مِنَ ٱلۡأَعۡرَابِ شَغَلَتۡنَاۤ أَمۡوَ ٰ⁠لُنَا وَأَهۡلُونَا فَٱسۡتَغۡفِرۡ لَنَاۚ یَقُولُونَ بِأَلۡسِنَتِهِم مَّا لَیۡسَ فِی قُلُوبِهِمۡۚ قُلۡ فَمَن یَمۡلِكُ لَكُم مِّنَ ٱللَّهِ شَیۡـًٔا إِنۡ أَرَادَ بِكُمۡ ضَرًّا أَوۡ أَرَادَ بِكُمۡ نَفۡعَۢاۚ بَلۡ كَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ خَبِیرَۢا\n"
    }
  },
  {
    "id": 4595,
    "surahId": 48,
    "ayahNumber": 12,
    "arabicText": "بَلۡ ظَنَنتُمۡ أَن لَّن یَنقَلِبَ ٱلرَّسُولُ وَٱلۡمُؤۡمِنُونَ إِلَىٰۤ أَهۡلِیهِمۡ أَبَدࣰا وَزُیِّنَ ذَ ٰ⁠لِكَ فِی قُلُوبِكُمۡ وَظَنَنتُمۡ ظَنَّ ٱلسَّوۡءِ وَكُنتُمۡ قَوۡمَۢا بُورࣰا\n",
    "translations": {
      "en": "Nay, you thought that the Apostle and the believers would never return to their kith and kin: and this seemed goodly to your hearts. And you entertained [such] evil thoughts because you have always been people devoid of all good!”",
      "ms": "",
      "id": "",
      "ar": "بَلۡ ظَنَنتُمۡ أَن لَّن یَنقَلِبَ ٱلرَّسُولُ وَٱلۡمُؤۡمِنُونَ إِلَىٰۤ أَهۡلِیهِمۡ أَبَدࣰا وَزُیِّنَ ذَ ٰ⁠لِكَ فِی قُلُوبِكُمۡ وَظَنَنتُمۡ ظَنَّ ٱلسَّوۡءِ وَكُنتُمۡ قَوۡمَۢا بُورࣰا\n"
    }
  },
  {
    "id": 4596,
    "surahId": 48,
    "ayahNumber": 13,
    "arabicText": "وَمَن لَّمۡ یُؤۡمِنۢ بِٱللَّهِ وَرَسُولِهِۦ فَإِنَّاۤ أَعۡتَدۡنَا لِلۡكَـٰفِرِینَ سَعِیرࣰا\n",
    "translations": {
      "en": "Now as for those who will not believe in God and His Apostle - verily, We have readied a blazing flame for all [such] deniers of the truth!",
      "ms": "",
      "id": "",
      "ar": "وَمَن لَّمۡ یُؤۡمِنۢ بِٱللَّهِ وَرَسُولِهِۦ فَإِنَّاۤ أَعۡتَدۡنَا لِلۡكَـٰفِرِینَ سَعِیرࣰا\n"
    }
  },
  {
    "id": 4597,
    "surahId": 48,
    "ayahNumber": 14,
    "arabicText": "وَلِلَّهِ مُلۡكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ یَغۡفِرُ لِمَن یَشَاۤءُ وَیُعَذِّبُ مَن یَشَاۤءُۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "But God’s is the dominion over the heavens and the earth: He forgives whomever He wills, and imposes suffering on whomever He wills - and [withal,] He is indeed much-forgiving, a dispenser of grace.",
      "ms": "",
      "id": "",
      "ar": "وَلِلَّهِ مُلۡكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ یَغۡفِرُ لِمَن یَشَاۤءُ وَیُعَذِّبُ مَن یَشَاۤءُۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 4598,
    "surahId": 48,
    "ayahNumber": 15,
    "arabicText": "سَیَقُولُ ٱلۡمُخَلَّفُونَ إِذَا ٱنطَلَقۡتُمۡ إِلَىٰ مَغَانِمَ لِتَأۡخُذُوهَا ذَرُونَا نَتَّبِعۡكُمۡۖ یُرِیدُونَ أَن یُبَدِّلُوا۟ كَلَـٰمَ ٱللَّهِۚ قُل لَّن تَتَّبِعُونَا كَذَ ٰ⁠لِكُمۡ قَالَ ٱللَّهُ مِن قَبۡلُۖ فَسَیَقُولُونَ بَلۡ تَحۡسُدُونَنَاۚ بَلۡ كَانُوا۟ لَا یَفۡقَهُونَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "As soon as you [O believers] are about to set forth on a war that promises booty, those who stayed behind [aforetime] will surely say, “Allow us to go with you” - [thus showing that] they would like to alter the Word of God. Say: “By no means shall you go with us: God has declared aforetime [to whom all spoils shall belong].” Thereupon they will [surely] answer, “Nay, but you begrudge us [our share of booty]!” Nay, they can grasp but so little of the truth!",
      "ms": "",
      "id": "",
      "ar": "سَیَقُولُ ٱلۡمُخَلَّفُونَ إِذَا ٱنطَلَقۡتُمۡ إِلَىٰ مَغَانِمَ لِتَأۡخُذُوهَا ذَرُونَا نَتَّبِعۡكُمۡۖ یُرِیدُونَ أَن یُبَدِّلُوا۟ كَلَـٰمَ ٱللَّهِۚ قُل لَّن تَتَّبِعُونَا كَذَ ٰ⁠لِكُمۡ قَالَ ٱللَّهُ مِن قَبۡلُۖ فَسَیَقُولُونَ بَلۡ تَحۡسُدُونَنَاۚ بَلۡ كَانُوا۟ لَا یَفۡقَهُونَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 4599,
    "surahId": 48,
    "ayahNumber": 16,
    "arabicText": "قُل لِّلۡمُخَلَّفِینَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُو۟لِی بَأۡسࣲ شَدِیدࣲ تُقَـٰتِلُونَهُمۡ أَوۡ یُسۡلِمُونَۖ فَإِن تُطِیعُوا۟ یُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنࣰاۖ وَإِن تَتَوَلَّوۡا۟ كَمَا تَوَلَّیۡتُم مِّن قَبۡلُ یُعَذِّبۡكُمۡ عَذَابًا أَلِیمࣰا\n",
    "translations": {
      "en": "Say unto those bedouin who stayed behind: “In time you will be called upon [to fight] against people of great prowess in war: you will have to fight against them [until you die] or they surrender. And then, if you heed [that call], God will bestow on you a goodly reward; but if you turn away as you turned away this time, He will chastise you with grievous chastisement.”",
      "ms": "",
      "id": "",
      "ar": "قُل لِّلۡمُخَلَّفِینَ مِنَ ٱلۡأَعۡرَابِ سَتُدۡعَوۡنَ إِلَىٰ قَوۡمٍ أُو۟لِی بَأۡسࣲ شَدِیدࣲ تُقَـٰتِلُونَهُمۡ أَوۡ یُسۡلِمُونَۖ فَإِن تُطِیعُوا۟ یُؤۡتِكُمُ ٱللَّهُ أَجۡرًا حَسَنࣰاۖ وَإِن تَتَوَلَّوۡا۟ كَمَا تَوَلَّیۡتُم مِّن قَبۡلُ یُعَذِّبۡكُمۡ عَذَابًا أَلِیمࣰا\n"
    }
  },
  {
    "id": 4600,
    "surahId": 48,
    "ayahNumber": 17,
    "arabicText": "لَّیۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجࣱ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجࣱ وَلَا عَلَى ٱلۡمَرِیضِ حَرَجࣱۗ وَمَن یُطِعِ ٱللَّهَ وَرَسُولَهُۥ یُدۡخِلۡهُ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ وَمَن یَتَوَلَّ یُعَذِّبۡهُ عَذَابًا أَلِیمࣰا\n",
    "translations": {
      "en": "No blame attaches to the blind, nor does blame attach to the lame, nor does blame attach to the sick [for staying away from a war in God’s cause]; but whoever heeds [the call of] God and His Apostle [in deed or in heart], him will He admit into gardens through which running waters flow; whereas him who turns away will He chastise with grievous chastise­ment.",
      "ms": "",
      "id": "",
      "ar": "لَّیۡسَ عَلَى ٱلۡأَعۡمَىٰ حَرَجࣱ وَلَا عَلَى ٱلۡأَعۡرَجِ حَرَجࣱ وَلَا عَلَى ٱلۡمَرِیضِ حَرَجࣱۗ وَمَن یُطِعِ ٱللَّهَ وَرَسُولَهُۥ یُدۡخِلۡهُ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ وَمَن یَتَوَلَّ یُعَذِّبۡهُ عَذَابًا أَلِیمࣰا\n"
    }
  },
  {
    "id": 4601,
    "surahId": 48,
    "ayahNumber": 18,
    "arabicText": "۞ لَّقَدۡ رَضِیَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِینَ إِذۡ یُبَایِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِی قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِینَةَ عَلَیۡهِمۡ وَأَثَـٰبَهُمۡ فَتۡحࣰا قَرِیبࣰا\n",
    "translations": {
      "en": "INDEED, well-pleased was God with the believers when they pledged their allegiance unto thee [O Muhammad] under that tree, for He knew what was in their hearts; and so He bestowed inner peace upon them from on high, and rewarded them with [the glad tiding of] a victory soon to come",
      "ms": "",
      "id": "",
      "ar": "۞ لَّقَدۡ رَضِیَ ٱللَّهُ عَنِ ٱلۡمُؤۡمِنِینَ إِذۡ یُبَایِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِی قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِینَةَ عَلَیۡهِمۡ وَأَثَـٰبَهُمۡ فَتۡحࣰا قَرِیبࣰا\n"
    }
  },
  {
    "id": 4602,
    "surahId": 48,
    "ayahNumber": 19,
    "arabicText": "وَمَغَانِمَ كَثِیرَةࣰ یَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n",
    "translations": {
      "en": "and [of] many war-gains which they would achieve: for God is indeed almighty, wise.",
      "ms": "",
      "id": "",
      "ar": "وَمَغَانِمَ كَثِیرَةࣰ یَأۡخُذُونَهَاۗ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 4603,
    "surahId": 48,
    "ayahNumber": 20,
    "arabicText": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِیرَةࣰ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَـٰذِهِۦ وَكَفَّ أَیۡدِیَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَایَةࣰ لِّلۡمُؤۡمِنِینَ وَیَهۡدِیَكُمۡ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n",
    "translations": {
      "en": "[O you who believe!] God has promised you many war-gains which you shall yet achieve; and He has vouchsafed you these [worldly gains] well in advance, and has stayed from you the hands of [hostile] people, so that this [your inner strength] may become a symbol to the believers [who will come after you], and that He may guide you all on a straight way.",
      "ms": "",
      "id": "",
      "ar": "وَعَدَكُمُ ٱللَّهُ مَغَانِمَ كَثِیرَةࣰ تَأۡخُذُونَهَا فَعَجَّلَ لَكُمۡ هَـٰذِهِۦ وَكَفَّ أَیۡدِیَ ٱلنَّاسِ عَنكُمۡ وَلِتَكُونَ ءَایَةࣰ لِّلۡمُؤۡمِنِینَ وَیَهۡدِیَكُمۡ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n"
    }
  },
  {
    "id": 4604,
    "surahId": 48,
    "ayahNumber": 21,
    "arabicText": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُوا۟ عَلَیۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣰا\n",
    "translations": {
      "en": "And there are yet other [gains] which are still beyond your grasp, [but] which God has already encompassed [for you]: for God has the power to will anything.",
      "ms": "",
      "id": "",
      "ar": "وَأُخۡرَىٰ لَمۡ تَقۡدِرُوا۟ عَلَیۡهَا قَدۡ أَحَاطَ ٱللَّهُ بِهَاۚ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣰا\n"
    }
  },
  {
    "id": 4605,
    "surahId": 48,
    "ayahNumber": 22,
    "arabicText": "وَلَوۡ قَـٰتَلَكُمُ ٱلَّذِینَ كَفَرُوا۟ لَوَلَّوُا۟ ٱلۡأَدۡبَـٰرَ ثُمَّ لَا یَجِدُونَ وَلِیࣰّا وَلَا نَصِیرࣰا\n",
    "translations": {
      "en": "And [now,] if they who are bent on denying the truth should fight against you, they will indeed turn their backs [in flight], and will find none to protect them and none to bring them succour:",
      "ms": "",
      "id": "",
      "ar": "وَلَوۡ قَـٰتَلَكُمُ ٱلَّذِینَ كَفَرُوا۟ لَوَلَّوُا۟ ٱلۡأَدۡبَـٰرَ ثُمَّ لَا یَجِدُونَ وَلِیࣰّا وَلَا نَصِیرࣰا\n"
    }
  },
  {
    "id": 4606,
    "surahId": 48,
    "ayahNumber": 23,
    "arabicText": "سُنَّةَ ٱللَّهِ ٱلَّتِی قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِیلࣰا\n",
    "translations": {
      "en": "such being God’s way which has ever obtained in the past - and never wilt thou find any change in God’s way!",
      "ms": "",
      "id": "",
      "ar": "سُنَّةَ ٱللَّهِ ٱلَّتِی قَدۡ خَلَتۡ مِن قَبۡلُۖ وَلَن تَجِدَ لِسُنَّةِ ٱللَّهِ تَبۡدِیلࣰا\n"
    }
  },
  {
    "id": 4607,
    "surahId": 48,
    "ayahNumber": 24,
    "arabicText": "وَهُوَ ٱلَّذِی كَفَّ أَیۡدِیَهُمۡ عَنكُمۡ وَأَیۡدِیَكُمۡ عَنۡهُم بِبَطۡنِ مَكَّةَ مِنۢ بَعۡدِ أَنۡ أَظۡفَرَكُمۡ عَلَیۡهِمۡۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِیرًا\n",
    "translations": {
      "en": "And He it is who, in the valley of Mecca, stayed their hands from you, and your hands from them, after He had enabled you to vanquish them; and God saw indeed what you were doing.",
      "ms": "",
      "id": "",
      "ar": "وَهُوَ ٱلَّذِی كَفَّ أَیۡدِیَهُمۡ عَنكُمۡ وَأَیۡدِیَكُمۡ عَنۡهُم بِبَطۡنِ مَكَّةَ مِنۢ بَعۡدِ أَنۡ أَظۡفَرَكُمۡ عَلَیۡهِمۡۚ وَكَانَ ٱللَّهُ بِمَا تَعۡمَلُونَ بَصِیرًا\n"
    }
  },
  {
    "id": 4608,
    "surahId": 48,
    "ayahNumber": 25,
    "arabicText": "هُمُ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَٱلۡهَدۡیَ مَعۡكُوفًا أَن یَبۡلُغَ مَحِلَّهُۥۚ وَلَوۡلَا رِجَالࣱ مُّؤۡمِنُونَ وَنِسَاۤءࣱ مُّؤۡمِنَـٰتࣱ لَّمۡ تَعۡلَمُوهُمۡ أَن تَطَـُٔوهُمۡ فَتُصِیبَكُم مِّنۡهُم مَّعَرَّةُۢ بِغَیۡرِ عِلۡمࣲۖ لِّیُدۡخِلَ ٱللَّهُ فِی رَحۡمَتِهِۦ مَن یَشَاۤءُۚ لَوۡ تَزَیَّلُوا۟ لَعَذَّبۡنَا ٱلَّذِینَ كَفَرُوا۟ مِنۡهُمۡ عَذَابًا أَلِیمًا\n",
    "translations": {
      "en": "[It was not for your enemies sake that He stayed your hands from them: for] it was they who were bent on denying the truth, and who debarred you from the Inviolable House of Worship and prevented your offering from reaching its destina­tion. And had it not been for the believing men and believing women [in Mecca], whom you might have unwittingly trampled underfoot, and on whose account you might have become guilty, without knowing it, of a grievous wrong-: [had it not been for this, you would have been allowed to fight your way into the city: but you were forbidden to fight] so that [in time] God might admit to His grace whomever He wills. Had they [who deserve Our mercy and they whom We have condemned] been clearly discernible [to you], We would indeed have imposed grievous suffering [at your hands] on such of them as were bent on denying the truth.",
      "ms": "",
      "id": "",
      "ar": "هُمُ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوكُمۡ عَنِ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ وَٱلۡهَدۡیَ مَعۡكُوفًا أَن یَبۡلُغَ مَحِلَّهُۥۚ وَلَوۡلَا رِجَالࣱ مُّؤۡمِنُونَ وَنِسَاۤءࣱ مُّؤۡمِنَـٰتࣱ لَّمۡ تَعۡلَمُوهُمۡ أَن تَطَـُٔوهُمۡ فَتُصِیبَكُم مِّنۡهُم مَّعَرَّةُۢ بِغَیۡرِ عِلۡمࣲۖ لِّیُدۡخِلَ ٱللَّهُ فِی رَحۡمَتِهِۦ مَن یَشَاۤءُۚ لَوۡ تَزَیَّلُوا۟ لَعَذَّبۡنَا ٱلَّذِینَ كَفَرُوا۟ مِنۡهُمۡ عَذَابًا أَلِیمًا\n"
    }
  },
  {
    "id": 4609,
    "surahId": 48,
    "ayahNumber": 26,
    "arabicText": "إِذۡ جَعَلَ ٱلَّذِینَ كَفَرُوا۟ فِی قُلُوبِهِمُ ٱلۡحَمِیَّةَ حَمِیَّةَ ٱلۡجَـٰهِلِیَّةِ فَأَنزَلَ ٱللَّهُ سَكِینَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِینَ وَأَلۡزَمَهُمۡ كَلِمَةَ ٱلتَّقۡوَىٰ وَكَانُوۤا۟ أَحَقَّ بِهَا وَأَهۡلَهَاۚ وَكَانَ ٱللَّهُ بِكُلِّ شَیۡءٍ عَلِیمࣰا\n",
    "translations": {
      "en": "Whereas they who are bent on denying the truth harboured a stubborn disdain in their hearts - the stubborn disdain [born] of ignorance God bestowed from on high His [gift of] inner peace upon His Apostle and the believers, and bound them to the spirit of God-consciousness: for they were most worthy of this [divine gift], and deserved it well. And God has full knowledge of all things.",
      "ms": "",
      "id": "",
      "ar": "إِذۡ جَعَلَ ٱلَّذِینَ كَفَرُوا۟ فِی قُلُوبِهِمُ ٱلۡحَمِیَّةَ حَمِیَّةَ ٱلۡجَـٰهِلِیَّةِ فَأَنزَلَ ٱللَّهُ سَكِینَتَهُۥ عَلَىٰ رَسُولِهِۦ وَعَلَى ٱلۡمُؤۡمِنِینَ وَأَلۡزَمَهُمۡ كَلِمَةَ ٱلتَّقۡوَىٰ وَكَانُوۤا۟ أَحَقَّ بِهَا وَأَهۡلَهَاۚ وَكَانَ ٱللَّهُ بِكُلِّ شَیۡءٍ عَلِیمࣰا\n"
    }
  },
  {
    "id": 4610,
    "surahId": 48,
    "ayahNumber": 27,
    "arabicText": "لَّقَدۡ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءۡیَا بِٱلۡحَقِّۖ لَتَدۡخُلُنَّ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ إِن شَاۤءَ ٱللَّهُ ءَامِنِینَ مُحَلِّقِینَ رُءُوسَكُمۡ وَمُقَصِّرِینَ لَا تَخَافُونَۖ فَعَلِمَ مَا لَمۡ تَعۡلَمُوا۟ فَجَعَلَ مِن دُونِ ذَ ٰ⁠لِكَ فَتۡحࣰا قَرِیبًا\n",
    "translations": {
      "en": "Indeed, God has shown the truth in His Apostle’s true vision: most certainly shall you enter the Inviolable House of Worship, if God so wills, in full security, with your heads shaved or your hair cut short, without any fear: for He has [always] known that which you yourselves could not know. And He has ordained [for you], besides this, a victory soon to come.",
      "ms": "",
      "id": "",
      "ar": "لَّقَدۡ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءۡیَا بِٱلۡحَقِّۖ لَتَدۡخُلُنَّ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ إِن شَاۤءَ ٱللَّهُ ءَامِنِینَ مُحَلِّقِینَ رُءُوسَكُمۡ وَمُقَصِّرِینَ لَا تَخَافُونَۖ فَعَلِمَ مَا لَمۡ تَعۡلَمُوا۟ فَجَعَلَ مِن دُونِ ذَ ٰ⁠لِكَ فَتۡحࣰا قَرِیبًا\n"
    }
  },
  {
    "id": 4611,
    "surahId": 48,
    "ayahNumber": 28,
    "arabicText": "هُوَ ٱلَّذِیۤ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِینِ ٱلۡحَقِّ لِیُظۡهِرَهُۥ عَلَى ٱلدِّینِ كُلِّهِۦۚ وَكَفَىٰ بِٱللَّهِ شَهِیدࣰا\n",
    "translations": {
      "en": "He it is who has sent forth His Apostle with the [task of spreading] guidance and the religion of truth, to the end that He make it prevail over every [false] religion; and none can bear witness [to the truth] as God does.",
      "ms": "",
      "id": "",
      "ar": "هُوَ ٱلَّذِیۤ أَرۡسَلَ رَسُولَهُۥ بِٱلۡهُدَىٰ وَدِینِ ٱلۡحَقِّ لِیُظۡهِرَهُۥ عَلَى ٱلدِّینِ كُلِّهِۦۚ وَكَفَىٰ بِٱللَّهِ شَهِیدࣰا\n"
    }
  },
  {
    "id": 4612,
    "surahId": 48,
    "ayahNumber": 29,
    "arabicText": "مُّحَمَّدࣱ رَّسُولُ ٱللَّهِۚ وَٱلَّذِینَ مَعَهُۥۤ أَشِدَّاۤءُ عَلَى ٱلۡكُفَّارِ رُحَمَاۤءُ بَیۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعࣰا سُجَّدࣰا یَبۡتَغُونَ فَضۡلࣰا مِّنَ ٱللَّهِ وَرِضۡوَ ٰ⁠نࣰاۖ سِیمَاهُمۡ فِی وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَ ٰ⁠لِكَ مَثَلُهُمۡ فِی ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِی ٱلۡإِنجِیلِ كَزَرۡعٍ أَخۡرَجَ شَطۡـَٔهُۥ فَـَٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ یُعۡجِبُ ٱلزُّرَّاعَ لِیَغِیظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ مِنۡهُم مَّغۡفِرَةࣰ وَأَجۡرًا عَظِیمَۢا\n",
    "translations": {
      "en": "MUHAMMAD is God’s Apostle; and those who are [truly] with him are firm and unyielding towards all deniers of the truth, [yet] full of mercy towards one another. Thou canst see them bowing down, pros­trating themselves [in prayer], seeking favour with God and [His] goodly acceptance: their marks are on their faces, traced by prostration. This is their parable in the Torah as well as their parable in the Gospel: [they are] like a seed that brings forth its shoot, and then He strengthens it, so that it grows stout, and [in the end] stands firm upon its stem, delighting the sowers. [Thus will God cause the believers to grow in strength,] so that through them He might confound the deniers of the truth. [But] unto such of them as may [yet] attain to faith and do righteous deeds, God has promised forgiveness and a reward supreme.",
      "ms": "",
      "id": "",
      "ar": "مُّحَمَّدࣱ رَّسُولُ ٱللَّهِۚ وَٱلَّذِینَ مَعَهُۥۤ أَشِدَّاۤءُ عَلَى ٱلۡكُفَّارِ رُحَمَاۤءُ بَیۡنَهُمۡۖ تَرَىٰهُمۡ رُكَّعࣰا سُجَّدࣰا یَبۡتَغُونَ فَضۡلࣰا مِّنَ ٱللَّهِ وَرِضۡوَ ٰ⁠نࣰاۖ سِیمَاهُمۡ فِی وُجُوهِهِم مِّنۡ أَثَرِ ٱلسُّجُودِۚ ذَ ٰ⁠لِكَ مَثَلُهُمۡ فِی ٱلتَّوۡرَىٰةِۚ وَمَثَلُهُمۡ فِی ٱلۡإِنجِیلِ كَزَرۡعٍ أَخۡرَجَ شَطۡـَٔهُۥ فَـَٔازَرَهُۥ فَٱسۡتَغۡلَظَ فَٱسۡتَوَىٰ عَلَىٰ سُوقِهِۦ یُعۡجِبُ ٱلزُّرَّاعَ لِیَغِیظَ بِهِمُ ٱلۡكُفَّارَۗ وَعَدَ ٱللَّهُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ مِنۡهُم مَّغۡفِرَةࣰ وَأَجۡرًا عَظِیمَۢا\n"
    }
  }
]