[
  {
    "id": 1365,
    "surahId": 10,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِ ٱلۡحَكِیمِ\n",
    "translations": {
      "en": "Alif Lam. Ra. THESE ARE MESSAGES of the divine writ, full of wisdom.",
      "ms": "",
      "id": "",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِ ٱلۡحَكِیمِ\n"
    }
  },
  {
    "id": 1366,
    "surahId": 10,
    "ayahNumber": 2,
    "arabicText": "أَكَانَ لِلنَّاسِ عَجَبًا أَنۡ أَوۡحَیۡنَاۤ إِلَىٰ رَجُلࣲ مِّنۡهُمۡ أَنۡ أَنذِرِ ٱلنَّاسَ وَبَشِّرِ ٱلَّذِینَ ءَامَنُوۤا۟ أَنَّ لَهُمۡ قَدَمَ صِدۡقٍ عِندَ رَبِّهِمۡۗ قَالَ ٱلۡكَـٰفِرُونَ إِنَّ هَـٰذَا لَسَـٰحِرࣱ مُّبِینٌ\n",
    "translations": {
      "en": "Do people deem it strange that We should have inspired a man from their own midst [with this Our message]: \"Warn all mankind, and give unto those who have attained to faith the glad tiding that in their Sustainer's sight they surpass all others in that they are completely sincere-? [Only] they who deny the truth say, \"Behold. he is clearly but a spellbinder!\"",
      "ms": "",
      "id": "",
      "ar": "أَكَانَ لِلنَّاسِ عَجَبًا أَنۡ أَوۡحَیۡنَاۤ إِلَىٰ رَجُلࣲ مِّنۡهُمۡ أَنۡ أَنذِرِ ٱلنَّاسَ وَبَشِّرِ ٱلَّذِینَ ءَامَنُوۤا۟ أَنَّ لَهُمۡ قَدَمَ صِدۡقٍ عِندَ رَبِّهِمۡۗ قَالَ ٱلۡكَـٰفِرُونَ إِنَّ هَـٰذَا لَسَـٰحِرࣱ مُّبِینٌ\n"
    }
  },
  {
    "id": 1367,
    "surahId": 10,
    "ayahNumber": 3,
    "arabicText": "إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ فِی سِتَّةِ أَیَّامࣲ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ یُدَبِّرُ ٱلۡأَمۡرَۖ مَا مِن شَفِیعٍ إِلَّا مِنۢ بَعۡدِ إِذۡنِهِۦۚ ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمۡ فَٱعۡبُدُوهُۚ أَفَلَا تَذَكَّرُونَ\n",
    "translations": {
      "en": "VERILY, your Sustainer is God, who has created the heavens and the earth in six aeons, and is established on the throne of His almightiness, governing all that exists. There is none that could intercede with Him unless He grants leave therefor. Thus is God, your Sustainer: worship, therefore, Him [alone]: will you not, then, keep this in mind?",
      "ms": "",
      "id": "",
      "ar": "إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ فِی سِتَّةِ أَیَّامࣲ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ یُدَبِّرُ ٱلۡأَمۡرَۖ مَا مِن شَفِیعٍ إِلَّا مِنۢ بَعۡدِ إِذۡنِهِۦۚ ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمۡ فَٱعۡبُدُوهُۚ أَفَلَا تَذَكَّرُونَ\n"
    }
  },
  {
    "id": 1368,
    "surahId": 10,
    "ayahNumber": 4,
    "arabicText": "إِلَیۡهِ مَرۡجِعُكُمۡ جَمِیعࣰاۖ وَعۡدَ ٱللَّهِ حَقًّاۚ إِنَّهُۥ یَبۡدَؤُا۟ ٱلۡخَلۡقَ ثُمَّ یُعِیدُهُۥ لِیَجۡزِیَ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ بِٱلۡقِسۡطِۚ وَٱلَّذِینَ كَفَرُوا۟ لَهُمۡ شَرَابࣱ مِّنۡ حَمِیمࣲ وَعَذَابٌ أَلِیمُۢ بِمَا كَانُوا۟ یَكۡفُرُونَ\n",
    "translations": {
      "en": "Unto Him you all must return: this is, in truth, God's promise-for, behold, He creates [man] in the first instance, and then brings him forth anew to the end that He may reward with equity all who attain to faith and do righteous deeds; whereas for those who are bent on denying the truth there is in store a draught of burning despair and grievous suffering because of their persistent refusal to acknowledge the truth.",
      "ms": "",
      "id": "",
      "ar": "إِلَیۡهِ مَرۡجِعُكُمۡ جَمِیعࣰاۖ وَعۡدَ ٱللَّهِ حَقًّاۚ إِنَّهُۥ یَبۡدَؤُا۟ ٱلۡخَلۡقَ ثُمَّ یُعِیدُهُۥ لِیَجۡزِیَ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ بِٱلۡقِسۡطِۚ وَٱلَّذِینَ كَفَرُوا۟ لَهُمۡ شَرَابࣱ مِّنۡ حَمِیمࣲ وَعَذَابٌ أَلِیمُۢ بِمَا كَانُوا۟ یَكۡفُرُونَ\n"
    }
  },
  {
    "id": 1369,
    "surahId": 10,
    "ayahNumber": 5,
    "arabicText": "هُوَ ٱلَّذِی جَعَلَ ٱلشَّمۡسَ ضِیَاۤءࣰ وَٱلۡقَمَرَ نُورࣰا وَقَدَّرَهُۥ مَنَازِلَ لِتَعۡلَمُوا۟ عَدَدَ ٱلسِّنِینَ وَٱلۡحِسَابَۚ مَا خَلَقَ ٱللَّهُ ذَ ٰ⁠لِكَ إِلَّا بِٱلۡحَقِّۚ یُفَصِّلُ ٱلۡـَٔایَـٰتِ لِقَوۡمࣲ یَعۡلَمُونَ\n",
    "translations": {
      "en": "He it is who has made the sun a [source of] radiant light and the moon a light [reflected], and has determined for it phases so that you might know how to compute the years and to measure [time]. None of this has God created without [an inner] truth. Clearly does He spell out these messages unto people of [innate] knowledge:",
      "ms": "",
      "id": "",
      "ar": "هُوَ ٱلَّذِی جَعَلَ ٱلشَّمۡسَ ضِیَاۤءࣰ وَٱلۡقَمَرَ نُورࣰا وَقَدَّرَهُۥ مَنَازِلَ لِتَعۡلَمُوا۟ عَدَدَ ٱلسِّنِینَ وَٱلۡحِسَابَۚ مَا خَلَقَ ٱللَّهُ ذَ ٰ⁠لِكَ إِلَّا بِٱلۡحَقِّۚ یُفَصِّلُ ٱلۡـَٔایَـٰتِ لِقَوۡمࣲ یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1370,
    "surahId": 10,
    "ayahNumber": 6,
    "arabicText": "إِنَّ فِی ٱخۡتِلَـٰفِ ٱلَّیۡلِ وَٱلنَّهَارِ وَمَا خَلَقَ ٱللَّهُ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَتَّقُونَ\n",
    "translations": {
      "en": "for, verily, in the alternating of night and day, and in all that God has created in the heavens and on earth there are messages indeed for people who are conscious of Him!",
      "ms": "",
      "id": "",
      "ar": "إِنَّ فِی ٱخۡتِلَـٰفِ ٱلَّیۡلِ وَٱلنَّهَارِ وَمَا خَلَقَ ٱللَّهُ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَتَّقُونَ\n"
    }
  },
  {
    "id": 1371,
    "surahId": 10,
    "ayahNumber": 7,
    "arabicText": "إِنَّ ٱلَّذِینَ لَا یَرۡجُونَ لِقَاۤءَنَا وَرَضُوا۟ بِٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَٱطۡمَأَنُّوا۟ بِهَا وَٱلَّذِینَ هُمۡ عَنۡ ءَایَـٰتِنَا غَـٰفِلُونَ\n",
    "translations": {
      "en": "Verily, as for those who do not believe that they are destined to meet Us, but content themselves with the life of this world and do not look beyond it, and are heedless of Our messages -",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ لَا یَرۡجُونَ لِقَاۤءَنَا وَرَضُوا۟ بِٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَٱطۡمَأَنُّوا۟ بِهَا وَٱلَّذِینَ هُمۡ عَنۡ ءَایَـٰتِنَا غَـٰفِلُونَ\n"
    }
  },
  {
    "id": 1372,
    "surahId": 10,
    "ayahNumber": 8,
    "arabicText": "أُو۟لَـٰۤىِٕكَ مَأۡوَىٰهُمُ ٱلنَّارُ بِمَا كَانُوا۟ یَكۡسِبُونَ\n",
    "translations": {
      "en": "their goal is the fire in return for all [the evil] that they were wont to do.",
      "ms": "",
      "id": "",
      "ar": "أُو۟لَـٰۤىِٕكَ مَأۡوَىٰهُمُ ٱلنَّارُ بِمَا كَانُوا۟ یَكۡسِبُونَ\n"
    }
  },
  {
    "id": 1373,
    "surahId": 10,
    "ayahNumber": 9,
    "arabicText": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ یَهۡدِیهِمۡ رَبُّهُم بِإِیمَـٰنِهِمۡۖ تَجۡرِی مِن تَحۡتِهِمُ ٱلۡأَنۡهَـٰرُ فِی جَنَّـٰتِ ٱلنَّعِیمِ\n",
    "translations": {
      "en": "[But,] verily, as for those who have attained to faith and do righteous deeds - their Sustainer guides them aright by means of their faith. [In the life to come,] running waters will flow at their feet in gardens of bliss;",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ یَهۡدِیهِمۡ رَبُّهُم بِإِیمَـٰنِهِمۡۖ تَجۡرِی مِن تَحۡتِهِمُ ٱلۡأَنۡهَـٰرُ فِی جَنَّـٰتِ ٱلنَّعِیمِ\n"
    }
  },
  {
    "id": 1374,
    "surahId": 10,
    "ayahNumber": 10,
    "arabicText": "دَعۡوَىٰهُمۡ فِیهَا سُبۡحَـٰنَكَ ٱللَّهُمَّ وَتَحِیَّتُهُمۡ فِیهَا سَلَـٰمࣱۚ وَءَاخِرُ دَعۡوَىٰهُمۡ أَنِ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "[and] in that [state of happiness] they will call out, \"Limitless art Thou in Thy glory, O God!\"-and will be answered with the greeting, \"Peace!\" And their call will close with [the words], \"All praise is due to God, the Sustainer of all the worlds!\"",
      "ms": "",
      "id": "",
      "ar": "دَعۡوَىٰهُمۡ فِیهَا سُبۡحَـٰنَكَ ٱللَّهُمَّ وَتَحِیَّتُهُمۡ فِیهَا سَلَـٰمࣱۚ وَءَاخِرُ دَعۡوَىٰهُمۡ أَنِ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 1375,
    "surahId": 10,
    "ayahNumber": 11,
    "arabicText": "۞ وَلَوۡ یُعَجِّلُ ٱللَّهُ لِلنَّاسِ ٱلشَّرَّ ٱسۡتِعۡجَالَهُم بِٱلۡخَیۡرِ لَقُضِیَ إِلَیۡهِمۡ أَجَلُهُمۡۖ فَنَذَرُ ٱلَّذِینَ لَا یَرۡجُونَ لِقَاۤءَنَا فِی طُغۡیَـٰنِهِمۡ یَعۡمَهُونَ\n",
    "translations": {
      "en": "NOW IF GOD were to hasten for human beings the ill [which they deserve by their sinning] in the same manner as they [themselves] would hasten [the coming to them of what they consider to be] good, their end would indeed come forthwith! But We leave them alone [for a while] -all those who do not believe that they are destined to meet Us: [We leave them alone] in their overweening arrogance, blindly stumbling to and fro.",
      "ms": "",
      "id": "",
      "ar": "۞ وَلَوۡ یُعَجِّلُ ٱللَّهُ لِلنَّاسِ ٱلشَّرَّ ٱسۡتِعۡجَالَهُم بِٱلۡخَیۡرِ لَقُضِیَ إِلَیۡهِمۡ أَجَلُهُمۡۖ فَنَذَرُ ٱلَّذِینَ لَا یَرۡجُونَ لِقَاۤءَنَا فِی طُغۡیَـٰنِهِمۡ یَعۡمَهُونَ\n"
    }
  },
  {
    "id": 1376,
    "surahId": 10,
    "ayahNumber": 12,
    "arabicText": "وَإِذَا مَسَّ ٱلۡإِنسَـٰنَ ٱلضُّرُّ دَعَانَا لِجَنۢبِهِۦۤ أَوۡ قَاعِدًا أَوۡ قَاۤىِٕمࣰا فَلَمَّا كَشَفۡنَا عَنۡهُ ضُرَّهُۥ مَرَّ كَأَن لَّمۡ یَدۡعُنَاۤ إِلَىٰ ضُرࣲّ مَّسَّهُۥۚ كَذَ ٰ⁠لِكَ زُیِّنَ لِلۡمُسۡرِفِینَ مَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "For [thus it is:] when affliction befalls man, he cries out unto Us, whether he be lying on his side or sitting or standing; but as soon as We have freed him of his affliction, he goes on as though he had never invoked Us to save him from the affliction that befell him! Thus do their own doings seem goodly unto those who waste their own selves.",
      "ms": "",
      "id": "",
      "ar": "وَإِذَا مَسَّ ٱلۡإِنسَـٰنَ ٱلضُّرُّ دَعَانَا لِجَنۢبِهِۦۤ أَوۡ قَاعِدًا أَوۡ قَاۤىِٕمࣰا فَلَمَّا كَشَفۡنَا عَنۡهُ ضُرَّهُۥ مَرَّ كَأَن لَّمۡ یَدۡعُنَاۤ إِلَىٰ ضُرࣲّ مَّسَّهُۥۚ كَذَ ٰ⁠لِكَ زُیِّنَ لِلۡمُسۡرِفِینَ مَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1377,
    "surahId": 10,
    "ayahNumber": 13,
    "arabicText": "وَلَقَدۡ أَهۡلَكۡنَا ٱلۡقُرُونَ مِن قَبۡلِكُمۡ لَمَّا ظَلَمُوا۟ وَجَاۤءَتۡهُمۡ رُسُلُهُم بِٱلۡبَیِّنَـٰتِ وَمَا كَانُوا۟ لِیُؤۡمِنُوا۟ۚ كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡقَوۡمَ ٱلۡمُجۡرِمِینَ\n",
    "translations": {
      "en": "And, indeed, We destroyed before your time [whole] generations when they [persistently] did evil although the apostles sent unto them brought them all evidence of the truth; for they refused to believe [them]. Thus do We requite people who are lost in sin.",
      "ms": "",
      "id": "",
      "ar": "وَلَقَدۡ أَهۡلَكۡنَا ٱلۡقُرُونَ مِن قَبۡلِكُمۡ لَمَّا ظَلَمُوا۟ وَجَاۤءَتۡهُمۡ رُسُلُهُم بِٱلۡبَیِّنَـٰتِ وَمَا كَانُوا۟ لِیُؤۡمِنُوا۟ۚ كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡقَوۡمَ ٱلۡمُجۡرِمِینَ\n"
    }
  },
  {
    "id": 1378,
    "surahId": 10,
    "ayahNumber": 14,
    "arabicText": "ثُمَّ جَعَلۡنَـٰكُمۡ خَلَـٰۤىِٕفَ فِی ٱلۡأَرۡضِ مِنۢ بَعۡدِهِمۡ لِنَنظُرَ كَیۡفَ تَعۡمَلُونَ\n",
    "translations": {
      "en": "And thereupon We made you their successors on earth, so that We might behold how you act.",
      "ms": "",
      "id": "",
      "ar": "ثُمَّ جَعَلۡنَـٰكُمۡ خَلَـٰۤىِٕفَ فِی ٱلۡأَرۡضِ مِنۢ بَعۡدِهِمۡ لِنَنظُرَ كَیۡفَ تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1379,
    "surahId": 10,
    "ayahNumber": 15,
    "arabicText": "وَإِذَا تُتۡلَىٰ عَلَیۡهِمۡ ءَایَاتُنَا بَیِّنَـٰتࣲ قَالَ ٱلَّذِینَ لَا یَرۡجُونَ لِقَاۤءَنَا ٱئۡتِ بِقُرۡءَانٍ غَیۡرِ هَـٰذَاۤ أَوۡ بَدِّلۡهُۚ قُلۡ مَا یَكُونُ لِیۤ أَنۡ أُبَدِّلَهُۥ مِن تِلۡقَاۤىِٕ نَفۡسِیۤۖ إِنۡ أَتَّبِعُ إِلَّا مَا یُوحَىٰۤ إِلَیَّۖ إِنِّیۤ أَخَافُ إِنۡ عَصَیۡتُ رَبِّی عَذَابَ یَوۡمٍ عَظِیمࣲ\n",
    "translations": {
      "en": "AND [thus it is:] whenever Our messages are conveyed unto them in all their clarity, those who do not believe that they are destined to meet Us [are wont to] say, \"Bring us a discourse other than this, or alter this one.” Say [O Prophet]: \"It is not conceivable that I should alter it of my own volition; I only follow what is revealed to me. Behold, I would dread, were I [thus] to rebel against my Sustainer, the suffering [which would befall me] on that awesome Day [of Judgment]!\"",
      "ms": "",
      "id": "",
      "ar": "وَإِذَا تُتۡلَىٰ عَلَیۡهِمۡ ءَایَاتُنَا بَیِّنَـٰتࣲ قَالَ ٱلَّذِینَ لَا یَرۡجُونَ لِقَاۤءَنَا ٱئۡتِ بِقُرۡءَانٍ غَیۡرِ هَـٰذَاۤ أَوۡ بَدِّلۡهُۚ قُلۡ مَا یَكُونُ لِیۤ أَنۡ أُبَدِّلَهُۥ مِن تِلۡقَاۤىِٕ نَفۡسِیۤۖ إِنۡ أَتَّبِعُ إِلَّا مَا یُوحَىٰۤ إِلَیَّۖ إِنِّیۤ أَخَافُ إِنۡ عَصَیۡتُ رَبِّی عَذَابَ یَوۡمٍ عَظِیمࣲ\n"
    }
  },
  {
    "id": 1380,
    "surahId": 10,
    "ayahNumber": 16,
    "arabicText": "قُل لَّوۡ شَاۤءَ ٱللَّهُ مَا تَلَوۡتُهُۥ عَلَیۡكُمۡ وَلَاۤ أَدۡرَىٰكُم بِهِۦۖ فَقَدۡ لَبِثۡتُ فِیكُمۡ عُمُرࣰا مِّن قَبۡلِهِۦۤۚ أَفَلَا تَعۡقِلُونَ\n",
    "translations": {
      "en": "Say: \"Had God willed it [otherwise], I would not have conveyed this [divine writ] unto you, nor would He have brought it to your knowledge. Indeed. a whole lifetime have I dwelt among you ere this [revelation came unto me]: will you not, then, use your reason?”",
      "ms": "",
      "id": "",
      "ar": "قُل لَّوۡ شَاۤءَ ٱللَّهُ مَا تَلَوۡتُهُۥ عَلَیۡكُمۡ وَلَاۤ أَدۡرَىٰكُم بِهِۦۖ فَقَدۡ لَبِثۡتُ فِیكُمۡ عُمُرࣰا مِّن قَبۡلِهِۦۤۚ أَفَلَا تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1381,
    "surahId": 10,
    "ayahNumber": 17,
    "arabicText": "فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِـَٔایَـٰتِهِۦۤۚ إِنَّهُۥ لَا یُفۡلِحُ ٱلۡمُجۡرِمُونَ\n",
    "translations": {
      "en": "And who could be more wicked than they who attribute their own lying inventions to God or give the lie to His messages? Verily, those who are lost in sin will never attain to a happy state -",
      "ms": "",
      "id": "",
      "ar": "فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًا أَوۡ كَذَّبَ بِـَٔایَـٰتِهِۦۤۚ إِنَّهُۥ لَا یُفۡلِحُ ٱلۡمُجۡرِمُونَ\n"
    }
  },
  {
    "id": 1382,
    "surahId": 10,
    "ayahNumber": 18,
    "arabicText": "وَیَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا یَضُرُّهُمۡ وَلَا یَنفَعُهُمۡ وَیَقُولُونَ هَـٰۤؤُلَاۤءِ شُفَعَـٰۤؤُنَا عِندَ ٱللَّهِۚ قُلۡ أَتُنَبِّـُٔونَ ٱللَّهَ بِمَا لَا یَعۡلَمُ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَلَا فِی ٱلۡأَرۡضِۚ سُبۡحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا یُشۡرِكُونَ\n",
    "translations": {
      "en": "and [neither will] they [who] worship, side by side with God, things or beings that can neither harm nor benefit them, saying [to themselves], \"These are our intercessors with God!\" Say: \"Do you [think that you could] inform God of anything in the heavens or on earth that He does not know? Limitless is He in His glory, and sublimely exalted above anything to which men may ascribe a share in His divinity!\"",
      "ms": "",
      "id": "",
      "ar": "وَیَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا یَضُرُّهُمۡ وَلَا یَنفَعُهُمۡ وَیَقُولُونَ هَـٰۤؤُلَاۤءِ شُفَعَـٰۤؤُنَا عِندَ ٱللَّهِۚ قُلۡ أَتُنَبِّـُٔونَ ٱللَّهَ بِمَا لَا یَعۡلَمُ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَلَا فِی ٱلۡأَرۡضِۚ سُبۡحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا یُشۡرِكُونَ\n"
    }
  },
  {
    "id": 1383,
    "surahId": 10,
    "ayahNumber": 19,
    "arabicText": "وَمَا كَانَ ٱلنَّاسُ إِلَّاۤ أُمَّةࣰ وَ ٰ⁠حِدَةࣰ فَٱخۡتَلَفُوا۟ۚ وَلَوۡلَا كَلِمَةࣱ سَبَقَتۡ مِن رَّبِّكَ لَقُضِیَ بَیۡنَهُمۡ فِیمَا فِیهِ یَخۡتَلِفُونَ\n",
    "translations": {
      "en": "AND [know that] all mankind were once but one single community, and only later did they begin to hold divergent views. And had it not been for a decree- that had already gone forth from thy Sustainer, all their differences would indeed have been settled [from the outset].",
      "ms": "",
      "id": "",
      "ar": "وَمَا كَانَ ٱلنَّاسُ إِلَّاۤ أُمَّةࣰ وَ ٰ⁠حِدَةࣰ فَٱخۡتَلَفُوا۟ۚ وَلَوۡلَا كَلِمَةࣱ سَبَقَتۡ مِن رَّبِّكَ لَقُضِیَ بَیۡنَهُمۡ فِیمَا فِیهِ یَخۡتَلِفُونَ\n"
    }
  },
  {
    "id": 1384,
    "surahId": 10,
    "ayahNumber": 20,
    "arabicText": "وَیَقُولُونَ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۖ فَقُلۡ إِنَّمَا ٱلۡغَیۡبُ لِلَّهِ فَٱنتَظِرُوۤا۟ إِنِّی مَعَكُم مِّنَ ٱلۡمُنتَظِرِینَ\n",
    "translations": {
      "en": "NOW THEY [who deny the truth] are wont to ask, \"Why has no miraculous sign ever been bestowed upon him from on high by his Sustainer?\" Say, then: \"God's alone is the knowledge of that which. is beyond the reach of human perception. Wait, then, [until His will becomes manifest:] verily, I shall wait with you!\"",
      "ms": "",
      "id": "",
      "ar": "وَیَقُولُونَ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۖ فَقُلۡ إِنَّمَا ٱلۡغَیۡبُ لِلَّهِ فَٱنتَظِرُوۤا۟ إِنِّی مَعَكُم مِّنَ ٱلۡمُنتَظِرِینَ\n"
    }
  },
  {
    "id": 1385,
    "surahId": 10,
    "ayahNumber": 21,
    "arabicText": "وَإِذَاۤ أَذَقۡنَا ٱلنَّاسَ رَحۡمَةࣰ مِّنۢ بَعۡدِ ضَرَّاۤءَ مَسَّتۡهُمۡ إِذَا لَهُم مَّكۡرࣱ فِیۤ ءَایَاتِنَاۚ قُلِ ٱللَّهُ أَسۡرَعُ مَكۡرًاۚ إِنَّ رُسُلَنَا یَكۡتُبُونَ مَا تَمۡكُرُونَ\n",
    "translations": {
      "en": "And [thus it is:] whenever We let [such] people taste [some of Our] grace after hardship has visited them-lo! they forthwith turn to devising false arguments against Our messages. Say: \"God is swifter [than you] in His deep devising!\" Behold, Our [heavenly] messengers are recording all that you may devise!",
      "ms": "",
      "id": "",
      "ar": "وَإِذَاۤ أَذَقۡنَا ٱلنَّاسَ رَحۡمَةࣰ مِّنۢ بَعۡدِ ضَرَّاۤءَ مَسَّتۡهُمۡ إِذَا لَهُم مَّكۡرࣱ فِیۤ ءَایَاتِنَاۚ قُلِ ٱللَّهُ أَسۡرَعُ مَكۡرًاۚ إِنَّ رُسُلَنَا یَكۡتُبُونَ مَا تَمۡكُرُونَ\n"
    }
  },
  {
    "id": 1386,
    "surahId": 10,
    "ayahNumber": 22,
    "arabicText": "هُوَ ٱلَّذِی یُسَیِّرُكُمۡ فِی ٱلۡبَرِّ وَٱلۡبَحۡرِۖ حَتَّىٰۤ إِذَا كُنتُمۡ فِی ٱلۡفُلۡكِ وَجَرَیۡنَ بِهِم بِرِیحࣲ طَیِّبَةࣲ وَفَرِحُوا۟ بِهَا جَاۤءَتۡهَا رِیحٌ عَاصِفࣱ وَجَاۤءَهُمُ ٱلۡمَوۡجُ مِن كُلِّ مَكَانࣲ وَظَنُّوۤا۟ أَنَّهُمۡ أُحِیطَ بِهِمۡ دَعَوُا۟ ٱللَّهَ مُخۡلِصِینَ لَهُ ٱلدِّینَ لَىِٕنۡ أَنجَیۡتَنَا مِنۡ هَـٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّـٰكِرِینَ\n",
    "translations": {
      "en": "He it is who enables you to travel on land and sea. And [behold what happens] when you go to sea in ships: [they go to sea in ships,] and they sail on in them in a favourable wind, and they rejoice thereat until there comes upon them a tempest, and waves surge towards them from all sides, so that they believe themselves to be encompassed [by death; and then] they call unto God, [at that moment] sincere in their faith in Him alone, \"If Thou wilt but save us from this, we shall most certainly be among the grateful!\"",
      "ms": "",
      "id": "",
      "ar": "هُوَ ٱلَّذِی یُسَیِّرُكُمۡ فِی ٱلۡبَرِّ وَٱلۡبَحۡرِۖ حَتَّىٰۤ إِذَا كُنتُمۡ فِی ٱلۡفُلۡكِ وَجَرَیۡنَ بِهِم بِرِیحࣲ طَیِّبَةࣲ وَفَرِحُوا۟ بِهَا جَاۤءَتۡهَا رِیحٌ عَاصِفࣱ وَجَاۤءَهُمُ ٱلۡمَوۡجُ مِن كُلِّ مَكَانࣲ وَظَنُّوۤا۟ أَنَّهُمۡ أُحِیطَ بِهِمۡ دَعَوُا۟ ٱللَّهَ مُخۡلِصِینَ لَهُ ٱلدِّینَ لَىِٕنۡ أَنجَیۡتَنَا مِنۡ هَـٰذِهِۦ لَنَكُونَنَّ مِنَ ٱلشَّـٰكِرِینَ\n"
    }
  },
  {
    "id": 1387,
    "surahId": 10,
    "ayahNumber": 23,
    "arabicText": "فَلَمَّاۤ أَنجَىٰهُمۡ إِذَا هُمۡ یَبۡغُونَ فِی ٱلۡأَرۡضِ بِغَیۡرِ ٱلۡحَقِّۗ یَـٰۤأَیُّهَا ٱلنَّاسُ إِنَّمَا بَغۡیُكُمۡ عَلَىٰۤ أَنفُسِكُمۖ مَّتَـٰعَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۖ ثُمَّ إِلَیۡنَا مَرۡجِعُكُمۡ فَنُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ\n",
    "translations": {
      "en": "Yet as soon as He has saved them from this [danger], lo! they behave outrageously on earth, offending against all right! O men! All your outrageous deeds are bound to fall back upon your own selves! [You care only for] the enjoyment of life in this world: [but remember that] in the end unto Us you must return, whereupon We shall make you truly understand all that you were doing [in life].",
      "ms": "",
      "id": "",
      "ar": "فَلَمَّاۤ أَنجَىٰهُمۡ إِذَا هُمۡ یَبۡغُونَ فِی ٱلۡأَرۡضِ بِغَیۡرِ ٱلۡحَقِّۗ یَـٰۤأَیُّهَا ٱلنَّاسُ إِنَّمَا بَغۡیُكُمۡ عَلَىٰۤ أَنفُسِكُمۖ مَّتَـٰعَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۖ ثُمَّ إِلَیۡنَا مَرۡجِعُكُمۡ فَنُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1388,
    "surahId": 10,
    "ayahNumber": 24,
    "arabicText": "إِنَّمَا مَثَلُ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا كَمَاۤءٍ أَنزَلۡنَـٰهُ مِنَ ٱلسَّمَاۤءِ فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ مِمَّا یَأۡكُلُ ٱلنَّاسُ وَٱلۡأَنۡعَـٰمُ حَتَّىٰۤ إِذَاۤ أَخَذَتِ ٱلۡأَرۡضُ زُخۡرُفَهَا وَٱزَّیَّنَتۡ وَظَنَّ أَهۡلُهَاۤ أَنَّهُمۡ قَـٰدِرُونَ عَلَیۡهَاۤ أَتَىٰهَاۤ أَمۡرُنَا لَیۡلًا أَوۡ نَهَارࣰا فَجَعَلۡنَـٰهَا حَصِیدࣰا كَأَن لَّمۡ تَغۡنَ بِٱلۡأَمۡسِۚ كَذَ ٰ⁠لِكَ نُفَصِّلُ ٱلۡـَٔایَـٰتِ لِقَوۡمࣲ یَتَفَكَّرُونَ\n",
    "translations": {
      "en": "The parable of the life of this world is but that of rain which We send down from the sky, and which is absorbed by the plants of the earth whereof men and animals draw nourishment, until -when the earth has assumed its artful adornment and has been embellished, and they who dwell on it believe that they have gained mastery over it -there comes down upon it Our judgment, by night or by day, and We cause it to become [like] a field mown down, as if there had been no yesterday. Thus clearly do We spell out these messages unto people who think!",
      "ms": "",
      "id": "",
      "ar": "إِنَّمَا مَثَلُ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا كَمَاۤءٍ أَنزَلۡنَـٰهُ مِنَ ٱلسَّمَاۤءِ فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ مِمَّا یَأۡكُلُ ٱلنَّاسُ وَٱلۡأَنۡعَـٰمُ حَتَّىٰۤ إِذَاۤ أَخَذَتِ ٱلۡأَرۡضُ زُخۡرُفَهَا وَٱزَّیَّنَتۡ وَظَنَّ أَهۡلُهَاۤ أَنَّهُمۡ قَـٰدِرُونَ عَلَیۡهَاۤ أَتَىٰهَاۤ أَمۡرُنَا لَیۡلًا أَوۡ نَهَارࣰا فَجَعَلۡنَـٰهَا حَصِیدࣰا كَأَن لَّمۡ تَغۡنَ بِٱلۡأَمۡسِۚ كَذَ ٰ⁠لِكَ نُفَصِّلُ ٱلۡـَٔایَـٰتِ لِقَوۡمࣲ یَتَفَكَّرُونَ\n"
    }
  },
  {
    "id": 1389,
    "surahId": 10,
    "ayahNumber": 25,
    "arabicText": "وَٱللَّهُ یَدۡعُوۤا۟ إِلَىٰ دَارِ ٱلسَّلَـٰمِ وَیَهۡدِی مَن یَشَاۤءُ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "AND [know that] God invites [man] unto the abode of peace, and guides him that wills [to be guided] onto a straight way.",
      "ms": "",
      "id": "",
      "ar": "وَٱللَّهُ یَدۡعُوۤا۟ إِلَىٰ دَارِ ٱلسَّلَـٰمِ وَیَهۡدِی مَن یَشَاۤءُ إِلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 1390,
    "surahId": 10,
    "ayahNumber": 26,
    "arabicText": "۞ لِّلَّذِینَ أَحۡسَنُوا۟ ٱلۡحُسۡنَىٰ وَزِیَادَةࣱۖ وَلَا یَرۡهَقُ وُجُوهَهُمۡ قَتَرࣱ وَلَا ذِلَّةٌۚ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلۡجَنَّةِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n",
    "translations": {
      "en": "For those who persevere in doing good there is the ultimate good in store, and more [than that]. No darkness and no ignominy will overshadow their faces [on Resurrection Day]: it is they who are destined for paradise, therein to abide.",
      "ms": "",
      "id": "",
      "ar": "۞ لِّلَّذِینَ أَحۡسَنُوا۟ ٱلۡحُسۡنَىٰ وَزِیَادَةࣱۖ وَلَا یَرۡهَقُ وُجُوهَهُمۡ قَتَرࣱ وَلَا ذِلَّةٌۚ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلۡجَنَّةِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n"
    }
  },
  {
    "id": 1391,
    "surahId": 10,
    "ayahNumber": 27,
    "arabicText": "وَٱلَّذِینَ كَسَبُوا۟ ٱلسَّیِّـَٔاتِ جَزَاۤءُ سَیِّئَةِۭ بِمِثۡلِهَا وَتَرۡهَقُهُمۡ ذِلَّةࣱۖ مَّا لَهُم مِّنَ ٱللَّهِ مِنۡ عَاصِمࣲۖ كَأَنَّمَاۤ أُغۡشِیَتۡ وُجُوهُهُمۡ قِطَعࣰا مِّنَ ٱلَّیۡلِ مُظۡلِمًاۚ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلنَّارِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n",
    "translations": {
      "en": "But us for those who have done evil deeds - the recompense of an evil, deed shall be the like thereof: and - since they will have none to defend them against God - ignominy will overshadow them as though their faces were veiled by the night's own darkness: it is they who are destined for the fire. therein to abide.",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذِینَ كَسَبُوا۟ ٱلسَّیِّـَٔاتِ جَزَاۤءُ سَیِّئَةِۭ بِمِثۡلِهَا وَتَرۡهَقُهُمۡ ذِلَّةࣱۖ مَّا لَهُم مِّنَ ٱللَّهِ مِنۡ عَاصِمࣲۖ كَأَنَّمَاۤ أُغۡشِیَتۡ وُجُوهُهُمۡ قِطَعࣰا مِّنَ ٱلَّیۡلِ مُظۡلِمًاۚ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلنَّارِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n"
    }
  },
  {
    "id": 1392,
    "surahId": 10,
    "ayahNumber": 28,
    "arabicText": "وَیَوۡمَ نَحۡشُرُهُمۡ جَمِیعࣰا ثُمَّ نَقُولُ لِلَّذِینَ أَشۡرَكُوا۟ مَكَانَكُمۡ أَنتُمۡ وَشُرَكَاۤؤُكُمۡۚ فَزَیَّلۡنَا بَیۡنَهُمۡۖ وَقَالَ شُرَكَاۤؤُهُم مَّا كُنتُمۡ إِیَّانَا تَعۡبُدُونَ\n",
    "translations": {
      "en": "For, one Day We shall gather them all together, and then We shall say unto those who [in their lifetime] ascribed divinity to aught but God, \"Stand where you are, you and those [beings and powers] to whom you were wont to ascribe a share in God's divinity! -for by then We shall have [visibly] separated them from one another. And the beings to whom they had ascribed a share in God's divinity will say [to those who had worshipped them], \"It was not us that you were wont to worship;",
      "ms": "",
      "id": "",
      "ar": "وَیَوۡمَ نَحۡشُرُهُمۡ جَمِیعࣰا ثُمَّ نَقُولُ لِلَّذِینَ أَشۡرَكُوا۟ مَكَانَكُمۡ أَنتُمۡ وَشُرَكَاۤؤُكُمۡۚ فَزَیَّلۡنَا بَیۡنَهُمۡۖ وَقَالَ شُرَكَاۤؤُهُم مَّا كُنتُمۡ إِیَّانَا تَعۡبُدُونَ\n"
    }
  },
  {
    "id": 1393,
    "surahId": 10,
    "ayahNumber": 29,
    "arabicText": "فَكَفَىٰ بِٱللَّهِ شَهِیدَۢا بَیۡنَنَا وَبَیۡنَكُمۡ إِن كُنَّا عَنۡ عِبَادَتِكُمۡ لَغَـٰفِلِینَ\n",
    "translations": {
      "en": "and none can bear witness between us and you as God does: we were, for certain, unaware of your worshipping [us].",
      "ms": "",
      "id": "",
      "ar": "فَكَفَىٰ بِٱللَّهِ شَهِیدَۢا بَیۡنَنَا وَبَیۡنَكُمۡ إِن كُنَّا عَنۡ عِبَادَتِكُمۡ لَغَـٰفِلِینَ\n"
    }
  },
  {
    "id": 1394,
    "surahId": 10,
    "ayahNumber": 30,
    "arabicText": "هُنَالِكَ تَبۡلُوا۟ كُلُّ نَفۡسࣲ مَّاۤ أَسۡلَفَتۡۚ وَرُدُّوۤا۟ إِلَى ٱللَّهِ مَوۡلَىٰهُمُ ٱلۡحَقِّۖ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n",
    "translations": {
      "en": "There and then will every human being clearly apprehend what he has done in the past; and all will be brought back unto God, their true Lord Supreme, and all their false imagery will have forsaken them.",
      "ms": "",
      "id": "",
      "ar": "هُنَالِكَ تَبۡلُوا۟ كُلُّ نَفۡسࣲ مَّاۤ أَسۡلَفَتۡۚ وَرُدُّوۤا۟ إِلَى ٱللَّهِ مَوۡلَىٰهُمُ ٱلۡحَقِّۖ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n"
    }
  },
  {
    "id": 1395,
    "surahId": 10,
    "ayahNumber": 31,
    "arabicText": "قُلۡ مَن یَرۡزُقُكُم مِّنَ ٱلسَّمَاۤءِ وَٱلۡأَرۡضِ أَمَّن یَمۡلِكُ ٱلسَّمۡعَ وَٱلۡأَبۡصَـٰرَ وَمَن یُخۡرِجُ ٱلۡحَیَّ مِنَ ٱلۡمَیِّتِ وَیُخۡرِجُ ٱلۡمَیِّتَ مِنَ ٱلۡحَیِّ وَمَن یُدَبِّرُ ٱلۡأَمۡرَۚ فَسَیَقُولُونَ ٱللَّهُۚ فَقُلۡ أَفَلَا تَتَّقُونَ\n",
    "translations": {
      "en": "SAY: \"Who is it that provides you with sustenance out of heaven and earth, or who is it that has full power over [your] hearing and sight? And who is it that brings forth the living out of that which is dead, and brings forth the dead out of that which is alive? And who is it that governs all that exists?\" And they will [surely] answer: \"[It is] God.\" Say, then: \"Will you not, then, become [fully] conscious of Him-",
      "ms": "",
      "id": "",
      "ar": "قُلۡ مَن یَرۡزُقُكُم مِّنَ ٱلسَّمَاۤءِ وَٱلۡأَرۡضِ أَمَّن یَمۡلِكُ ٱلسَّمۡعَ وَٱلۡأَبۡصَـٰرَ وَمَن یُخۡرِجُ ٱلۡحَیَّ مِنَ ٱلۡمَیِّتِ وَیُخۡرِجُ ٱلۡمَیِّتَ مِنَ ٱلۡحَیِّ وَمَن یُدَبِّرُ ٱلۡأَمۡرَۚ فَسَیَقُولُونَ ٱللَّهُۚ فَقُلۡ أَفَلَا تَتَّقُونَ\n"
    }
  },
  {
    "id": 1396,
    "surahId": 10,
    "ayahNumber": 32,
    "arabicText": "فَذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمُ ٱلۡحَقُّۖ فَمَاذَا بَعۡدَ ٱلۡحَقِّ إِلَّا ٱلضَّلَـٰلُۖ فَأَنَّىٰ تُصۡرَفُونَ\n",
    "translations": {
      "en": "seeing that He is God, your Sustainer, the Ultimate Truth? For, after the truth [has been forsaken], what is there [left] but error? How, then, can you lose sight of the truth?\"",
      "ms": "",
      "id": "",
      "ar": "فَذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمُ ٱلۡحَقُّۖ فَمَاذَا بَعۡدَ ٱلۡحَقِّ إِلَّا ٱلضَّلَـٰلُۖ فَأَنَّىٰ تُصۡرَفُونَ\n"
    }
  },
  {
    "id": 1397,
    "surahId": 10,
    "ayahNumber": 33,
    "arabicText": "كَذَ ٰ⁠لِكَ حَقَّتۡ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِینَ فَسَقُوۤا۟ أَنَّهُمۡ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Thus is thy Sustainer's word proved true with regard to such as are bent on sinful doings: they will not believes",
      "ms": "",
      "id": "",
      "ar": "كَذَ ٰ⁠لِكَ حَقَّتۡ كَلِمَتُ رَبِّكَ عَلَى ٱلَّذِینَ فَسَقُوۤا۟ أَنَّهُمۡ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 1398,
    "surahId": 10,
    "ayahNumber": 34,
    "arabicText": "قُلۡ هَلۡ مِن شُرَكَاۤىِٕكُم مَّن یَبۡدَؤُا۟ ٱلۡخَلۡقَ ثُمَّ یُعِیدُهُۥۚ قُلِ ٱللَّهُ یَبۡدَؤُا۟ ٱلۡخَلۡقَ ثُمَّ یُعِیدُهُۥۖ فَأَنَّىٰ تُؤۡفَكُونَ\n",
    "translations": {
      "en": "Say: \"Can any of those beings to whom you ascribe a share in God's divinity create [life] in the first instance, and then bring it forth anew?” Say: \"It is God [alone] who creates [all life] in the first instance, and then brings it forth anew. How perverted, then, are your minds!\"",
      "ms": "",
      "id": "",
      "ar": "قُلۡ هَلۡ مِن شُرَكَاۤىِٕكُم مَّن یَبۡدَؤُا۟ ٱلۡخَلۡقَ ثُمَّ یُعِیدُهُۥۚ قُلِ ٱللَّهُ یَبۡدَؤُا۟ ٱلۡخَلۡقَ ثُمَّ یُعِیدُهُۥۖ فَأَنَّىٰ تُؤۡفَكُونَ\n"
    }
  },
  {
    "id": 1399,
    "surahId": 10,
    "ayahNumber": 35,
    "arabicText": "قُلۡ هَلۡ مِن شُرَكَاۤىِٕكُم مَّن یَهۡدِیۤ إِلَى ٱلۡحَقِّۚ قُلِ ٱللَّهُ یَهۡدِی لِلۡحَقِّۗ أَفَمَن یَهۡدِیۤ إِلَى ٱلۡحَقِّ أَحَقُّ أَن یُتَّبَعَ أَمَّن لَّا یَهِدِّیۤ إِلَّاۤ أَن یُهۡدَىٰۖ فَمَا لَكُمۡ كَیۡفَ تَحۡكُمُونَ\n",
    "translations": {
      "en": "Say: \"Does any of those beings to whom you ascribe a share in God's divinity guide unto the truth?\" Say: \"It is God [alone] who guides unto the truth. Which, then, is more worthy to be followed - He who guides unto the truth, or he who cannot find the right way unless he is guided? What, then, is amiss with you and your judgment?\"",
      "ms": "",
      "id": "",
      "ar": "قُلۡ هَلۡ مِن شُرَكَاۤىِٕكُم مَّن یَهۡدِیۤ إِلَى ٱلۡحَقِّۚ قُلِ ٱللَّهُ یَهۡدِی لِلۡحَقِّۗ أَفَمَن یَهۡدِیۤ إِلَى ٱلۡحَقِّ أَحَقُّ أَن یُتَّبَعَ أَمَّن لَّا یَهِدِّیۤ إِلَّاۤ أَن یُهۡدَىٰۖ فَمَا لَكُمۡ كَیۡفَ تَحۡكُمُونَ\n"
    }
  },
  {
    "id": 1400,
    "surahId": 10,
    "ayahNumber": 36,
    "arabicText": "وَمَا یَتَّبِعُ أَكۡثَرُهُمۡ إِلَّا ظَنًّاۚ إِنَّ ٱلظَّنَّ لَا یُغۡنِی مِنَ ٱلۡحَقِّ شَیۡـًٔاۚ إِنَّ ٱللَّهَ عَلِیمُۢ بِمَا یَفۡعَلُونَ\n",
    "translations": {
      "en": "For, most of them follow nothing but conjecture: [and,] behold, conjecture can never be a substitute for truth. Verily, God has full knowledge of all that they do.",
      "ms": "",
      "id": "",
      "ar": "وَمَا یَتَّبِعُ أَكۡثَرُهُمۡ إِلَّا ظَنًّاۚ إِنَّ ٱلظَّنَّ لَا یُغۡنِی مِنَ ٱلۡحَقِّ شَیۡـًٔاۚ إِنَّ ٱللَّهَ عَلِیمُۢ بِمَا یَفۡعَلُونَ\n"
    }
  },
  {
    "id": 1401,
    "surahId": 10,
    "ayahNumber": 37,
    "arabicText": "وَمَا كَانَ هَـٰذَا ٱلۡقُرۡءَانُ أَن یُفۡتَرَىٰ مِن دُونِ ٱللَّهِ وَلَـٰكِن تَصۡدِیقَ ٱلَّذِی بَیۡنَ یَدَیۡهِ وَتَفۡصِیلَ ٱلۡكِتَـٰبِ لَا رَیۡبَ فِیهِ مِن رَّبِّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "Now this Qur'an could not possibly have been devised by anyone save God: nay indeed, it confirms the truth of whatever there still remains [of earlier revelations] and clearly spells out the revelation [which comes] -let there be no doubt about it-from the Sustainer of all the worlds.",
      "ms": "",
      "id": "",
      "ar": "وَمَا كَانَ هَـٰذَا ٱلۡقُرۡءَانُ أَن یُفۡتَرَىٰ مِن دُونِ ٱللَّهِ وَلَـٰكِن تَصۡدِیقَ ٱلَّذِی بَیۡنَ یَدَیۡهِ وَتَفۡصِیلَ ٱلۡكِتَـٰبِ لَا رَیۡبَ فِیهِ مِن رَّبِّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 1402,
    "surahId": 10,
    "ayahNumber": 38,
    "arabicText": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُوا۟ بِسُورَةࣲ مِّثۡلِهِۦ وَٱدۡعُوا۟ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "And yet, they [who are bent on denying the truth] assert, \"[Muhammad] has invented it!\" Say [unto them]: \"Produce, then, a surah of similar merit; and [to this end] call to your aid whomever you can, other than God, if what you say is true!",
      "ms": "",
      "id": "",
      "ar": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُوا۟ بِسُورَةࣲ مِّثۡلِهِۦ وَٱدۡعُوا۟ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 1403,
    "surahId": 10,
    "ayahNumber": 39,
    "arabicText": "بَلۡ كَذَّبُوا۟ بِمَا لَمۡ یُحِیطُوا۟ بِعِلۡمِهِۦ وَلَمَّا یَأۡتِهِمۡ تَأۡوِیلُهُۥۚ كَذَ ٰ⁠لِكَ كَذَّبَ ٱلَّذِینَ مِن قَبۡلِهِمۡۖ فَٱنظُرۡ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "Nay, but they are bent on giving the lie to everything the wisdom whereof they do not comprehend, and ere its inner meaning has become clear to them Even thus did those who lived before their time give the lie to the truth: and behold what happened in the end to those evildoers!",
      "ms": "",
      "id": "",
      "ar": "بَلۡ كَذَّبُوا۟ بِمَا لَمۡ یُحِیطُوا۟ بِعِلۡمِهِۦ وَلَمَّا یَأۡتِهِمۡ تَأۡوِیلُهُۥۚ كَذَ ٰ⁠لِكَ كَذَّبَ ٱلَّذِینَ مِن قَبۡلِهِمۡۖ فَٱنظُرۡ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1404,
    "surahId": 10,
    "ayahNumber": 40,
    "arabicText": "وَمِنۡهُم مَّن یُؤۡمِنُ بِهِۦ وَمِنۡهُم مَّن لَّا یُؤۡمِنُ بِهِۦۚ وَرَبُّكَ أَعۡلَمُ بِٱلۡمُفۡسِدِینَ\n",
    "translations": {
      "en": "And there are among them such as will in time come to believe in this [divine writ], just as there are among them such as will never believe in it; and thy Sustainer is fully aware as to who are the spreaders of corruption.",
      "ms": "",
      "id": "",
      "ar": "وَمِنۡهُم مَّن یُؤۡمِنُ بِهِۦ وَمِنۡهُم مَّن لَّا یُؤۡمِنُ بِهِۦۚ وَرَبُّكَ أَعۡلَمُ بِٱلۡمُفۡسِدِینَ\n"
    }
  },
  {
    "id": 1405,
    "surahId": 10,
    "ayahNumber": 41,
    "arabicText": "وَإِن كَذَّبُوكَ فَقُل لِّی عَمَلِی وَلَكُمۡ عَمَلُكُمۡۖ أَنتُم بَرِیۤـُٔونَ مِمَّاۤ أَعۡمَلُ وَأَنَا۠ بَرِیۤءࣱ مِّمَّا تَعۡمَلُونَ\n",
    "translations": {
      "en": "And [so, O Prophet,] if they give thee the lie, say: \"To me [shall be accounted] my doings, and to you, your doings: you are not accountable for what I am doing, and I am not accountable for whatever you do.\"",
      "ms": "",
      "id": "",
      "ar": "وَإِن كَذَّبُوكَ فَقُل لِّی عَمَلِی وَلَكُمۡ عَمَلُكُمۡۖ أَنتُم بَرِیۤـُٔونَ مِمَّاۤ أَعۡمَلُ وَأَنَا۠ بَرِیۤءࣱ مِّمَّا تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1406,
    "surahId": 10,
    "ayahNumber": 42,
    "arabicText": "وَمِنۡهُم مَّن یَسۡتَمِعُونَ إِلَیۡكَۚ أَفَأَنتَ تُسۡمِعُ ٱلصُّمَّ وَلَوۡ كَانُوا۟ لَا یَعۡقِلُونَ\n",
    "translations": {
      "en": "And there are among them such as (pretend to] listen to thee: but canst thou cause the deaf to hearken even though they will not use their reason?",
      "ms": "",
      "id": "",
      "ar": "وَمِنۡهُم مَّن یَسۡتَمِعُونَ إِلَیۡكَۚ أَفَأَنتَ تُسۡمِعُ ٱلصُّمَّ وَلَوۡ كَانُوا۟ لَا یَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1407,
    "surahId": 10,
    "ayahNumber": 43,
    "arabicText": "وَمِنۡهُم مَّن یَنظُرُ إِلَیۡكَۚ أَفَأَنتَ تَهۡدِی ٱلۡعُمۡیَ وَلَوۡ كَانُوا۟ لَا یُبۡصِرُونَ\n",
    "translations": {
      "en": "And there are among them such as [pretend to] look towards thee: but canst thou show the right way to the blind even though they cannot see?",
      "ms": "",
      "id": "",
      "ar": "وَمِنۡهُم مَّن یَنظُرُ إِلَیۡكَۚ أَفَأَنتَ تَهۡدِی ٱلۡعُمۡیَ وَلَوۡ كَانُوا۟ لَا یُبۡصِرُونَ\n"
    }
  },
  {
    "id": 1408,
    "surahId": 10,
    "ayahNumber": 44,
    "arabicText": "إِنَّ ٱللَّهَ لَا یَظۡلِمُ ٱلنَّاسَ شَیۡـࣰٔا وَلَـٰكِنَّ ٱلنَّاسَ أَنفُسَهُمۡ یَظۡلِمُونَ\n",
    "translations": {
      "en": "Verily, God does not do the least wrong unto men, but it is men who wrong themselves.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱللَّهَ لَا یَظۡلِمُ ٱلنَّاسَ شَیۡـࣰٔا وَلَـٰكِنَّ ٱلنَّاسَ أَنفُسَهُمۡ یَظۡلِمُونَ\n"
    }
  },
  {
    "id": 1409,
    "surahId": 10,
    "ayahNumber": 45,
    "arabicText": "وَیَوۡمَ یَحۡشُرُهُمۡ كَأَن لَّمۡ یَلۡبَثُوۤا۟ إِلَّا سَاعَةࣰ مِّنَ ٱلنَّهَارِ یَتَعَارَفُونَ بَیۡنَهُمۡۚ قَدۡ خَسِرَ ٱلَّذِینَ كَذَّبُوا۟ بِلِقَاۤءِ ٱللَّهِ وَمَا كَانُوا۟ مُهۡتَدِینَ\n",
    "translations": {
      "en": "And on the Day when He shall gather them [unto Himself, it will seem to them] as if they had not tarried [on earth] longer than an hour of a day, knowing one another; [and] lost indeed will be they who [in their lifetime] considered it a lie that they were destined to meet God, and [thus] failed to find the right' way.",
      "ms": "",
      "id": "",
      "ar": "وَیَوۡمَ یَحۡشُرُهُمۡ كَأَن لَّمۡ یَلۡبَثُوۤا۟ إِلَّا سَاعَةࣰ مِّنَ ٱلنَّهَارِ یَتَعَارَفُونَ بَیۡنَهُمۡۚ قَدۡ خَسِرَ ٱلَّذِینَ كَذَّبُوا۟ بِلِقَاۤءِ ٱللَّهِ وَمَا كَانُوا۟ مُهۡتَدِینَ\n"
    }
  },
  {
    "id": 1410,
    "surahId": 10,
    "ayahNumber": 46,
    "arabicText": "وَإِمَّا نُرِیَنَّكَ بَعۡضَ ٱلَّذِی نَعِدُهُمۡ أَوۡ نَتَوَفَّیَنَّكَ فَإِلَیۡنَا مَرۡجِعُهُمۡ ثُمَّ ٱللَّهُ شَهِیدٌ عَلَىٰ مَا یَفۡعَلُونَ\n",
    "translations": {
      "en": "And whether We show thee [in this world something of what We hold in store for those [deniers of the truth], or whether We cause thee to die [before that retribution takes place - know that, in the end], it is unto Us that they must return; and God is witness to all that they do.",
      "ms": "",
      "id": "",
      "ar": "وَإِمَّا نُرِیَنَّكَ بَعۡضَ ٱلَّذِی نَعِدُهُمۡ أَوۡ نَتَوَفَّیَنَّكَ فَإِلَیۡنَا مَرۡجِعُهُمۡ ثُمَّ ٱللَّهُ شَهِیدٌ عَلَىٰ مَا یَفۡعَلُونَ\n"
    }
  },
  {
    "id": 1411,
    "surahId": 10,
    "ayahNumber": 47,
    "arabicText": "وَلِكُلِّ أُمَّةࣲ رَّسُولࣱۖ فَإِذَا جَاۤءَ رَسُولُهُمۡ قُضِیَ بَیۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا یُظۡلَمُونَ\n",
    "translations": {
      "en": "NOW every community has had an apostle; and only after their apostle has appeared [and delivered his message] is judgment passed on them, in all equity; and never are they wronged.",
      "ms": "",
      "id": "",
      "ar": "وَلِكُلِّ أُمَّةࣲ رَّسُولࣱۖ فَإِذَا جَاۤءَ رَسُولُهُمۡ قُضِیَ بَیۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا یُظۡلَمُونَ\n"
    }
  },
  {
    "id": 1412,
    "surahId": 10,
    "ayahNumber": 48,
    "arabicText": "وَیَقُولُونَ مَتَىٰ هَـٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "And yet, they [who deny the truth] are wont to ask, \"When is that promise [of resurrection and judgment] to be fulfilled? [Answer this, O you who believe in it,] if you are men of truth!\"",
      "ms": "",
      "id": "",
      "ar": "وَیَقُولُونَ مَتَىٰ هَـٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 1413,
    "surahId": 10,
    "ayahNumber": 49,
    "arabicText": "قُل لَّاۤ أَمۡلِكُ لِنَفۡسِی ضَرࣰّا وَلَا نَفۡعًا إِلَّا مَا شَاۤءَ ٱللَّهُۗ لِكُلِّ أُمَّةٍ أَجَلٌۚ إِذَا جَاۤءَ أَجَلُهُمۡ فَلَا یَسۡتَـٔۡخِرُونَ سَاعَةࣰ وَلَا یَسۡتَقۡدِمُونَ\n",
    "translations": {
      "en": "Say [O Prophet]: \"It is not within my power to avert harm from, or bring benefit to, myself, except as God may please. For all people a term has been set: when the end of their term approaches, they can neither delay it by a single moment, nor hasten it.\"",
      "ms": "",
      "id": "",
      "ar": "قُل لَّاۤ أَمۡلِكُ لِنَفۡسِی ضَرࣰّا وَلَا نَفۡعًا إِلَّا مَا شَاۤءَ ٱللَّهُۗ لِكُلِّ أُمَّةٍ أَجَلٌۚ إِذَا جَاۤءَ أَجَلُهُمۡ فَلَا یَسۡتَـٔۡخِرُونَ سَاعَةࣰ وَلَا یَسۡتَقۡدِمُونَ\n"
    }
  },
  {
    "id": 1414,
    "surahId": 10,
    "ayahNumber": 50,
    "arabicText": "قُلۡ أَرَءَیۡتُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُهُۥ بَیَـٰتًا أَوۡ نَهَارࣰا مَّاذَا یَسۡتَعۡجِلُ مِنۡهُ ٱلۡمُجۡرِمُونَ\n",
    "translations": {
      "en": "Say: \"Have you ever considered [how you would feel] if His chastisement were to befall you by night or by day? What could there be in that prospect that people lost in sin should wish to hasten?",
      "ms": "",
      "id": "",
      "ar": "قُلۡ أَرَءَیۡتُمۡ إِنۡ أَتَىٰكُمۡ عَذَابُهُۥ بَیَـٰتًا أَوۡ نَهَارࣰا مَّاذَا یَسۡتَعۡجِلُ مِنۡهُ ٱلۡمُجۡرِمُونَ\n"
    }
  },
  {
    "id": 1415,
    "surahId": 10,
    "ayahNumber": 51,
    "arabicText": "أَثُمَّ إِذَا مَا وَقَعَ ءَامَنتُم بِهِۦۤۚ ءَاۤلۡـَٔـٰنَ وَقَدۡ كُنتُم بِهِۦ تَسۡتَعۡجِلُونَ\n",
    "translations": {
      "en": "Will you, then, believe in it [only] after it has come to pass -[on the Day when you will be asked, `Do you believe in it] now, after having [contemptuously] called for its speedy advent?'",
      "ms": "",
      "id": "",
      "ar": "أَثُمَّ إِذَا مَا وَقَعَ ءَامَنتُم بِهِۦۤۚ ءَاۤلۡـَٔـٰنَ وَقَدۡ كُنتُم بِهِۦ تَسۡتَعۡجِلُونَ\n"
    }
  },
  {
    "id": 1416,
    "surahId": 10,
    "ayahNumber": 52,
    "arabicText": "ثُمَّ قِیلَ لِلَّذِینَ ظَلَمُوا۟ ذُوقُوا۟ عَذَابَ ٱلۡخُلۡدِ هَلۡ تُجۡزَوۡنَ إِلَّا بِمَا كُنتُمۡ تَكۡسِبُونَ\n",
    "translations": {
      "en": "-whereupon those who [in their lifetime] were bent on evildoing will be told, `Taste suffering abiding! Is this requital anything but the just due for what you were wont to do?\"",
      "ms": "",
      "id": "",
      "ar": "ثُمَّ قِیلَ لِلَّذِینَ ظَلَمُوا۟ ذُوقُوا۟ عَذَابَ ٱلۡخُلۡدِ هَلۡ تُجۡزَوۡنَ إِلَّا بِمَا كُنتُمۡ تَكۡسِبُونَ\n"
    }
  },
  {
    "id": 1417,
    "surahId": 10,
    "ayahNumber": 53,
    "arabicText": "۞ وَیَسۡتَنۢبِـُٔونَكَ أَحَقٌّ هُوَۖ قُلۡ إِی وَرَبِّیۤ إِنَّهُۥ لَحَقࣱّۖ وَمَاۤ أَنتُم بِمُعۡجِزِینَ\n",
    "translations": {
      "en": "And some people ask thee, \"Is all this true?\" Say: \"Yea, by my Sustainer! It is most certainly true, and you cannot elude [the final reckoning]!\"",
      "ms": "",
      "id": "",
      "ar": "۞ وَیَسۡتَنۢبِـُٔونَكَ أَحَقٌّ هُوَۖ قُلۡ إِی وَرَبِّیۤ إِنَّهُۥ لَحَقࣱّۖ وَمَاۤ أَنتُم بِمُعۡجِزِینَ\n"
    }
  },
  {
    "id": 1418,
    "surahId": 10,
    "ayahNumber": 54,
    "arabicText": "وَلَوۡ أَنَّ لِكُلِّ نَفۡسࣲ ظَلَمَتۡ مَا فِی ٱلۡأَرۡضِ لَٱفۡتَدَتۡ بِهِۦۗ وَأَسَرُّوا۟ ٱلنَّدَامَةَ لَمَّا رَأَوُا۟ ٱلۡعَذَابَۖ وَقُضِیَ بَیۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا یُظۡلَمُونَ\n",
    "translations": {
      "en": "And all human beings that have been doing evil's would surely, if they possessed all that is on earth, offer it as ransom [on Judgment Day]; and when they see the suffering [that awaits them], they will be unable to express their remorse. But judgment will be passed on them in all equity; and they will not be wronged.",
      "ms": "",
      "id": "",
      "ar": "وَلَوۡ أَنَّ لِكُلِّ نَفۡسࣲ ظَلَمَتۡ مَا فِی ٱلۡأَرۡضِ لَٱفۡتَدَتۡ بِهِۦۗ وَأَسَرُّوا۟ ٱلنَّدَامَةَ لَمَّا رَأَوُا۟ ٱلۡعَذَابَۖ وَقُضِیَ بَیۡنَهُم بِٱلۡقِسۡطِ وَهُمۡ لَا یُظۡلَمُونَ\n"
    }
  },
  {
    "id": 1419,
    "surahId": 10,
    "ayahNumber": 55,
    "arabicText": "أَلَاۤ إِنَّ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۗ أَلَاۤ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّ وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "Oh, verily, unto God belongs all that is in the heavens and on earth! Oh, verily, God's promise always comes true-but most of them know it not!",
      "ms": "",
      "id": "",
      "ar": "أَلَاۤ إِنَّ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۗ أَلَاۤ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّ وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1420,
    "surahId": 10,
    "ayahNumber": 56,
    "arabicText": "هُوَ یُحۡیِۦ وَیُمِیتُ وَإِلَیۡهِ تُرۡجَعُونَ\n",
    "translations": {
      "en": "He alone grants life and deals death; and unto Him you all must return.",
      "ms": "",
      "id": "",
      "ar": "هُوَ یُحۡیِۦ وَیُمِیتُ وَإِلَیۡهِ تُرۡجَعُونَ\n"
    }
  },
  {
    "id": 1421,
    "surahId": 10,
    "ayahNumber": 57,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَتۡكُم مَّوۡعِظَةࣱ مِّن رَّبِّكُمۡ وَشِفَاۤءࣱ لِّمَا فِی ٱلصُّدُورِ وَهُدࣰى وَرَحۡمَةࣱ لِّلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "O MANKIND! There has now come unto you an admonition from your Sustainer, and a cure for all [the ill] that may be in men's hearts, and guidance and grace unto all who believe [in Him].",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَتۡكُم مَّوۡعِظَةࣱ مِّن رَّبِّكُمۡ وَشِفَاۤءࣱ لِّمَا فِی ٱلصُّدُورِ وَهُدࣰى وَرَحۡمَةࣱ لِّلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1422,
    "surahId": 10,
    "ayahNumber": 58,
    "arabicText": "قُلۡ بِفَضۡلِ ٱللَّهِ وَبِرَحۡمَتِهِۦ فَبِذَ ٰ⁠لِكَ فَلۡیَفۡرَحُوا۟ هُوَ خَیۡرࣱ مِّمَّا یَجۡمَعُونَ\n",
    "translations": {
      "en": "Say: \"In [this] bounty of God and in His grace-in this, then, let them rejoice: it is better than all [the worldly wealth] that they may amass!\"",
      "ms": "",
      "id": "",
      "ar": "قُلۡ بِفَضۡلِ ٱللَّهِ وَبِرَحۡمَتِهِۦ فَبِذَ ٰ⁠لِكَ فَلۡیَفۡرَحُوا۟ هُوَ خَیۡرࣱ مِّمَّا یَجۡمَعُونَ\n"
    }
  },
  {
    "id": 1423,
    "surahId": 10,
    "ayahNumber": 59,
    "arabicText": "قُلۡ أَرَءَیۡتُم مَّاۤ أَنزَلَ ٱللَّهُ لَكُم مِّن رِّزۡقࣲ فَجَعَلۡتُم مِّنۡهُ حَرَامࣰا وَحَلَـٰلࣰا قُلۡ ءَاۤللَّهُ أَذِنَ لَكُمۡۖ أَمۡ عَلَى ٱللَّهِ تَفۡتَرُونَ\n",
    "translations": {
      "en": "Say: \"Have you ever considered all the means of sustenance which God has bestowed upon you from on high -and which you thereupon divide into 'things forbidden' and 'things lawful? Say: \"Has God given you leave [to do this] -or do you, perchance, attribute your own guesswork to God?\"",
      "ms": "",
      "id": "",
      "ar": "قُلۡ أَرَءَیۡتُم مَّاۤ أَنزَلَ ٱللَّهُ لَكُم مِّن رِّزۡقࣲ فَجَعَلۡتُم مِّنۡهُ حَرَامࣰا وَحَلَـٰلࣰا قُلۡ ءَاۤللَّهُ أَذِنَ لَكُمۡۖ أَمۡ عَلَى ٱللَّهِ تَفۡتَرُونَ\n"
    }
  },
  {
    "id": 1424,
    "surahId": 10,
    "ayahNumber": 60,
    "arabicText": "وَمَا ظَنُّ ٱلَّذِینَ یَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ یَوۡمَ ٱلۡقِیَـٰمَةِۗ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَشۡكُرُونَ\n",
    "translations": {
      "en": "But what do they think-they who attribute their own lying inventions to God-[what do they think will happen to them]. on the Day of Resurrection? Behold, God is indeed limitless in His bounty unto men -but most of them are ungrateful.",
      "ms": "",
      "id": "",
      "ar": "وَمَا ظَنُّ ٱلَّذِینَ یَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ یَوۡمَ ٱلۡقِیَـٰمَةِۗ إِنَّ ٱللَّهَ لَذُو فَضۡلٍ عَلَى ٱلنَّاسِ وَلَـٰكِنَّ أَكۡثَرَهُمۡ لَا یَشۡكُرُونَ\n"
    }
  },
  {
    "id": 1425,
    "surahId": 10,
    "ayahNumber": 61,
    "arabicText": "وَمَا تَكُونُ فِی شَأۡنࣲ وَمَا تَتۡلُوا۟ مِنۡهُ مِن قُرۡءَانࣲ وَلَا تَعۡمَلُونَ مِنۡ عَمَلٍ إِلَّا كُنَّا عَلَیۡكُمۡ شُهُودًا إِذۡ تُفِیضُونَ فِیهِۚ وَمَا یَعۡزُبُ عَن رَّبِّكَ مِن مِّثۡقَالِ ذَرَّةࣲ فِی ٱلۡأَرۡضِ وَلَا فِی ٱلسَّمَاۤءِ وَلَاۤ أَصۡغَرَ مِن ذَ ٰ⁠لِكَ وَلَاۤ أَكۡبَرَ إِلَّا فِی كِتَـٰبࣲ مُّبِینٍ\n",
    "translations": {
      "en": "AND IN whatever condition thou mayest find thyself, [O Prophet,] and whatever discourse of this [divine writ] thou mayest be reciting, and whatever work you [all, O men,] may do -[remember that] We are your witness [from the moment] when you enter upon it: for, not even an atom's weight [of whatever there is] on earth or in heaven escapes thy Sustainer's knowledge; and neither is there anything smaller than that, or larger, but is recorded in [His] clear decree.",
      "ms": "",
      "id": "",
      "ar": "وَمَا تَكُونُ فِی شَأۡنࣲ وَمَا تَتۡلُوا۟ مِنۡهُ مِن قُرۡءَانࣲ وَلَا تَعۡمَلُونَ مِنۡ عَمَلٍ إِلَّا كُنَّا عَلَیۡكُمۡ شُهُودًا إِذۡ تُفِیضُونَ فِیهِۚ وَمَا یَعۡزُبُ عَن رَّبِّكَ مِن مِّثۡقَالِ ذَرَّةࣲ فِی ٱلۡأَرۡضِ وَلَا فِی ٱلسَّمَاۤءِ وَلَاۤ أَصۡغَرَ مِن ذَ ٰ⁠لِكَ وَلَاۤ أَكۡبَرَ إِلَّا فِی كِتَـٰبࣲ مُّبِینٍ\n"
    }
  },
  {
    "id": 1426,
    "surahId": 10,
    "ayahNumber": 62,
    "arabicText": "أَلَاۤ إِنَّ أَوۡلِیَاۤءَ ٱللَّهِ لَا خَوۡفٌ عَلَیۡهِمۡ وَلَا هُمۡ یَحۡزَنُونَ\n",
    "translations": {
      "en": "Oh, verily, they who are close to God - no fear need they have, and neither shall they grieve:",
      "ms": "",
      "id": "",
      "ar": "أَلَاۤ إِنَّ أَوۡلِیَاۤءَ ٱللَّهِ لَا خَوۡفٌ عَلَیۡهِمۡ وَلَا هُمۡ یَحۡزَنُونَ\n"
    }
  },
  {
    "id": 1427,
    "surahId": 10,
    "ayahNumber": 63,
    "arabicText": "ٱلَّذِینَ ءَامَنُوا۟ وَكَانُوا۟ یَتَّقُونَ\n",
    "translations": {
      "en": "they who have attained to faith and have always been conscious of Him.",
      "ms": "",
      "id": "",
      "ar": "ٱلَّذِینَ ءَامَنُوا۟ وَكَانُوا۟ یَتَّقُونَ\n"
    }
  },
  {
    "id": 1428,
    "surahId": 10,
    "ayahNumber": 64,
    "arabicText": "لَهُمُ ٱلۡبُشۡرَىٰ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَفِی ٱلۡـَٔاخِرَةِۚ لَا تَبۡدِیلَ لِكَلِمَـٰتِ ٱللَّهِۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n",
    "translations": {
      "en": "For them there is the glad tiding [of happiness] in the life of this world and in the life to come; [and since] nothing could ever alter [the outcome of] God's promises, this, this is the triumph supreme!",
      "ms": "",
      "id": "",
      "ar": "لَهُمُ ٱلۡبُشۡرَىٰ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَفِی ٱلۡـَٔاخِرَةِۚ لَا تَبۡدِیلَ لِكَلِمَـٰتِ ٱللَّهِۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n"
    }
  },
  {
    "id": 1429,
    "surahId": 10,
    "ayahNumber": 65,
    "arabicText": "وَلَا یَحۡزُنكَ قَوۡلُهُمۡۘ إِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِیعًاۚ هُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n",
    "translations": {
      "en": "And be not grieved by the sayings of those [who deny the truth]. Behold, all might and glory belong to God alone: He alone is all-hearing, all-knowing.",
      "ms": "",
      "id": "",
      "ar": "وَلَا یَحۡزُنكَ قَوۡلُهُمۡۘ إِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِیعًاۚ هُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n"
    }
  },
  {
    "id": 1430,
    "surahId": 10,
    "ayahNumber": 66,
    "arabicText": "أَلَاۤ إِنَّ لِلَّهِ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَن فِی ٱلۡأَرۡضِۗ وَمَا یَتَّبِعُ ٱلَّذِینَ یَدۡعُونَ مِن دُونِ ٱللَّهِ شُرَكَاۤءَۚ إِن یَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ هُمۡ إِلَّا یَخۡرُصُونَ\n",
    "translations": {
      "en": "OH, VERILY, unto God belongs whoever is in the heavens and whoever is on earth: hence, what is it that they follow-those who invoke, beside God. beings to whom they ascribe a share in His divinity? They follow but the conjectures [of others], and themselves do nothing but guess -",
      "ms": "",
      "id": "",
      "ar": "أَلَاۤ إِنَّ لِلَّهِ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَن فِی ٱلۡأَرۡضِۗ وَمَا یَتَّبِعُ ٱلَّذِینَ یَدۡعُونَ مِن دُونِ ٱللَّهِ شُرَكَاۤءَۚ إِن یَتَّبِعُونَ إِلَّا ٱلظَّنَّ وَإِنۡ هُمۡ إِلَّا یَخۡرُصُونَ\n"
    }
  },
  {
    "id": 1431,
    "surahId": 10,
    "ayahNumber": 67,
    "arabicText": "هُوَ ٱلَّذِی جَعَلَ لَكُمُ ٱلَّیۡلَ لِتَسۡكُنُوا۟ فِیهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَسۡمَعُونَ\n",
    "translations": {
      "en": "[whereas] it is He who has made the night for you, so that you might have rest therein, and the day, to make [you] see in this, behold, there are messages indeed for people who [are willing to] listen.",
      "ms": "",
      "id": "",
      "ar": "هُوَ ٱلَّذِی جَعَلَ لَكُمُ ٱلَّیۡلَ لِتَسۡكُنُوا۟ فِیهِ وَٱلنَّهَارَ مُبۡصِرًاۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَسۡمَعُونَ\n"
    }
  },
  {
    "id": 1432,
    "surahId": 10,
    "ayahNumber": 68,
    "arabicText": "قَالُوا۟ ٱتَّخَذَ ٱللَّهُ وَلَدࣰاۗ سُبۡحَـٰنَهُۥۖ هُوَ ٱلۡغَنِیُّۖ لَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ إِنۡ عِندَكُم مِّن سُلۡطَـٰنِۭ بِهَـٰذَاۤۚ أَتَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ\n",
    "translations": {
      "en": "[And yet] they assert, \"God has taken unto Himself a son!\" Limitless is He in His glory! Self-sufficient is He: unto Him belongs all that is in the heavens and all that is on earth! No evidence whatever have you for this [assertion]! Would you ascribe unto God something which you cannot know?",
      "ms": "",
      "id": "",
      "ar": "قَالُوا۟ ٱتَّخَذَ ٱللَّهُ وَلَدࣰاۗ سُبۡحَـٰنَهُۥۖ هُوَ ٱلۡغَنِیُّۖ لَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ إِنۡ عِندَكُم مِّن سُلۡطَـٰنِۭ بِهَـٰذَاۤۚ أَتَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1433,
    "surahId": 10,
    "ayahNumber": 69,
    "arabicText": "قُلۡ إِنَّ ٱلَّذِینَ یَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا یُفۡلِحُونَ\n",
    "translations": {
      "en": "Say: \"Verily, they who attribute their own lying inventions to God will never attain to a happy state!\"",
      "ms": "",
      "id": "",
      "ar": "قُلۡ إِنَّ ٱلَّذِینَ یَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ لَا یُفۡلِحُونَ\n"
    }
  },
  {
    "id": 1434,
    "surahId": 10,
    "ayahNumber": 70,
    "arabicText": "مَتَـٰعࣱ فِی ٱلدُّنۡیَا ثُمَّ إِلَیۡنَا مَرۡجِعُهُمۡ ثُمَّ نُذِیقُهُمُ ٱلۡعَذَابَ ٱلشَّدِیدَ بِمَا كَانُوا۟ یَكۡفُرُونَ\n",
    "translations": {
      "en": "[A brief] enjoyment in this world-and thereafter unto Us they must return: and then We shall let them taste suffering severe as an outcome of their persistent denial of the truth.",
      "ms": "",
      "id": "",
      "ar": "مَتَـٰعࣱ فِی ٱلدُّنۡیَا ثُمَّ إِلَیۡنَا مَرۡجِعُهُمۡ ثُمَّ نُذِیقُهُمُ ٱلۡعَذَابَ ٱلشَّدِیدَ بِمَا كَانُوا۟ یَكۡفُرُونَ\n"
    }
  },
  {
    "id": 1435,
    "surahId": 10,
    "ayahNumber": 71,
    "arabicText": "۞ وَٱتۡلُ عَلَیۡهِمۡ نَبَأَ نُوحٍ إِذۡ قَالَ لِقَوۡمِهِۦ یَـٰقَوۡمِ إِن كَانَ كَبُرَ عَلَیۡكُم مَّقَامِی وَتَذۡكِیرِی بِـَٔایَـٰتِ ٱللَّهِ فَعَلَى ٱللَّهِ تَوَكَّلۡتُ فَأَجۡمِعُوۤا۟ أَمۡرَكُمۡ وَشُرَكَاۤءَكُمۡ ثُمَّ لَا یَكُنۡ أَمۡرُكُمۡ عَلَیۡكُمۡ غُمَّةࣰ ثُمَّ ٱقۡضُوۤا۟ إِلَیَّ وَلَا تُنظِرُونِ\n",
    "translations": {
      "en": "AND CONVEY unto them the story of Noah-when he said unto his people: \"O my people! If my presence [among you] and my announcement of God's messages are repugnant to you -well, in God have I placed my trust. Decide, then, upon what you are going to do [against me], and [call to your aid] those beings to whom you ascribe a share in God's divinity; and once you have chosen your course of action, let no hesitation deflect you from it; and then carry out against me [whatever you may have decided], and give me no respite!",
      "ms": "",
      "id": "",
      "ar": "۞ وَٱتۡلُ عَلَیۡهِمۡ نَبَأَ نُوحٍ إِذۡ قَالَ لِقَوۡمِهِۦ یَـٰقَوۡمِ إِن كَانَ كَبُرَ عَلَیۡكُم مَّقَامِی وَتَذۡكِیرِی بِـَٔایَـٰتِ ٱللَّهِ فَعَلَى ٱللَّهِ تَوَكَّلۡتُ فَأَجۡمِعُوۤا۟ أَمۡرَكُمۡ وَشُرَكَاۤءَكُمۡ ثُمَّ لَا یَكُنۡ أَمۡرُكُمۡ عَلَیۡكُمۡ غُمَّةࣰ ثُمَّ ٱقۡضُوۤا۟ إِلَیَّ وَلَا تُنظِرُونِ\n"
    }
  },
  {
    "id": 1436,
    "surahId": 10,
    "ayahNumber": 72,
    "arabicText": "فَإِن تَوَلَّیۡتُمۡ فَمَا سَأَلۡتُكُم مِّنۡ أَجۡرٍۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱللَّهِۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُسۡلِمِینَ\n",
    "translations": {
      "en": "But if you turn away [from the message which I bear, remember that] I have asked no reward whatever of you: my reward rests with none but God, for I have been bidden to be among those who have surrendered themselves unto Him.\"",
      "ms": "",
      "id": "",
      "ar": "فَإِن تَوَلَّیۡتُمۡ فَمَا سَأَلۡتُكُم مِّنۡ أَجۡرٍۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱللَّهِۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُسۡلِمِینَ\n"
    }
  },
  {
    "id": 1437,
    "surahId": 10,
    "ayahNumber": 73,
    "arabicText": "فَكَذَّبُوهُ فَنَجَّیۡنَـٰهُ وَمَن مَّعَهُۥ فِی ٱلۡفُلۡكِ وَجَعَلۡنَـٰهُمۡ خَلَـٰۤىِٕفَ وَأَغۡرَقۡنَا ٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِنَاۖ فَٱنظُرۡ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلۡمُنذَرِینَ\n",
    "translations": {
      "en": "And yet they gave him the lie! And so We saved him and all who stood by him, in the ark, and made them inherit [the earth], the while We caused those who gave the lie to Our messages to drown: behold, then, what happened in the end to those people who had been warned [in vain]!",
      "ms": "",
      "id": "",
      "ar": "فَكَذَّبُوهُ فَنَجَّیۡنَـٰهُ وَمَن مَّعَهُۥ فِی ٱلۡفُلۡكِ وَجَعَلۡنَـٰهُمۡ خَلَـٰۤىِٕفَ وَأَغۡرَقۡنَا ٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِنَاۖ فَٱنظُرۡ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلۡمُنذَرِینَ\n"
    }
  },
  {
    "id": 1438,
    "surahId": 10,
    "ayahNumber": 74,
    "arabicText": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِۦ رُسُلًا إِلَىٰ قَوۡمِهِمۡ فَجَاۤءُوهُم بِٱلۡبَیِّنَـٰتِ فَمَا كَانُوا۟ لِیُؤۡمِنُوا۟ بِمَا كَذَّبُوا۟ بِهِۦ مِن قَبۡلُۚ كَذَ ٰ⁠لِكَ نَطۡبَعُ عَلَىٰ قُلُوبِ ٱلۡمُعۡتَدِینَ\n",
    "translations": {
      "en": "AND THEN, after him, We sent forth [other] apostles-each one unto his own people -and they brought them all evidence of the truth; but they would not believe in anything to which they had once given the lie: thus it is that We seal the hearts of such as [are wont to] transgress the bounds of what is right.",
      "ms": "",
      "id": "",
      "ar": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِۦ رُسُلًا إِلَىٰ قَوۡمِهِمۡ فَجَاۤءُوهُم بِٱلۡبَیِّنَـٰتِ فَمَا كَانُوا۟ لِیُؤۡمِنُوا۟ بِمَا كَذَّبُوا۟ بِهِۦ مِن قَبۡلُۚ كَذَ ٰ⁠لِكَ نَطۡبَعُ عَلَىٰ قُلُوبِ ٱلۡمُعۡتَدِینَ\n"
    }
  },
  {
    "id": 1439,
    "surahId": 10,
    "ayahNumber": 75,
    "arabicText": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِم مُّوسَىٰ وَهَـٰرُونَ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِی۟هِۦ بِـَٔایَـٰتِنَا فَٱسۡتَكۡبَرُوا۟ وَكَانُوا۟ قَوۡمࣰا مُّجۡرِمِینَ\n",
    "translations": {
      "en": "And after those [earlier prophets] We sent Moses and Aaron with Our messages unto Pharaoh and his great ones: but they gloried in their arrogance, for they were people lost in sin.",
      "ms": "",
      "id": "",
      "ar": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِم مُّوسَىٰ وَهَـٰرُونَ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِی۟هِۦ بِـَٔایَـٰتِنَا فَٱسۡتَكۡبَرُوا۟ وَكَانُوا۟ قَوۡمࣰا مُّجۡرِمِینَ\n"
    }
  },
  {
    "id": 1440,
    "surahId": 10,
    "ayahNumber": 76,
    "arabicText": "فَلَمَّا جَاۤءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُوۤا۟ إِنَّ هَـٰذَا لَسِحۡرࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "And so, when the truth came to them from Us, they said, \"Behold, this is clearly nothing but sorcery!\"",
      "ms": "",
      "id": "",
      "ar": "فَلَمَّا جَاۤءَهُمُ ٱلۡحَقُّ مِنۡ عِندِنَا قَالُوۤا۟ إِنَّ هَـٰذَا لَسِحۡرࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 1441,
    "surahId": 10,
    "ayahNumber": 77,
    "arabicText": "قَالَ مُوسَىٰۤ أَتَقُولُونَ لِلۡحَقِّ لَمَّا جَاۤءَكُمۡۖ أَسِحۡرٌ هَـٰذَا وَلَا یُفۡلِحُ ٱلسَّـٰحِرُونَ\n",
    "translations": {
      "en": "Said Moses: \"Do you speak thus of the truth after it has been brought to you? Can this be sorcery? But sorcerers can never come to a happy end!\"",
      "ms": "",
      "id": "",
      "ar": "قَالَ مُوسَىٰۤ أَتَقُولُونَ لِلۡحَقِّ لَمَّا جَاۤءَكُمۡۖ أَسِحۡرٌ هَـٰذَا وَلَا یُفۡلِحُ ٱلسَّـٰحِرُونَ\n"
    }
  },
  {
    "id": 1442,
    "surahId": 10,
    "ayahNumber": 78,
    "arabicText": "قَالُوۤا۟ أَجِئۡتَنَا لِتَلۡفِتَنَا عَمَّا وَجَدۡنَا عَلَیۡهِ ءَابَاۤءَنَا وَتَكُونَ لَكُمَا ٱلۡكِبۡرِیَاۤءُ فِی ٱلۡأَرۡضِ وَمَا نَحۡنُ لَكُمَا بِمُؤۡمِنِینَ\n",
    "translations": {
      "en": "[The great ones] replied: \"Hast thou come to turn us away from what we found our forefathers believing in and doing, so that the two of you might become supreme in this land? However, we do not believe in you two!\"",
      "ms": "",
      "id": "",
      "ar": "قَالُوۤا۟ أَجِئۡتَنَا لِتَلۡفِتَنَا عَمَّا وَجَدۡنَا عَلَیۡهِ ءَابَاۤءَنَا وَتَكُونَ لَكُمَا ٱلۡكِبۡرِیَاۤءُ فِی ٱلۡأَرۡضِ وَمَا نَحۡنُ لَكُمَا بِمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1443,
    "surahId": 10,
    "ayahNumber": 79,
    "arabicText": "وَقَالَ فِرۡعَوۡنُ ٱئۡتُونِی بِكُلِّ سَـٰحِرٍ عَلِیمࣲ\n",
    "translations": {
      "en": "And Pharaoh commanded: \"Bring before me every sorcerer of great knowledge!\"",
      "ms": "",
      "id": "",
      "ar": "وَقَالَ فِرۡعَوۡنُ ٱئۡتُونِی بِكُلِّ سَـٰحِرٍ عَلِیمࣲ\n"
    }
  },
  {
    "id": 1444,
    "surahId": 10,
    "ayahNumber": 80,
    "arabicText": "فَلَمَّا جَاۤءَ ٱلسَّحَرَةُ قَالَ لَهُم مُّوسَىٰۤ أَلۡقُوا۟ مَاۤ أَنتُم مُّلۡقُونَ\n",
    "translations": {
      "en": "And when the sorcerers came, Moses said unto them: \"Throw whatever you may [wish to] throw!\"",
      "ms": "",
      "id": "",
      "ar": "فَلَمَّا جَاۤءَ ٱلسَّحَرَةُ قَالَ لَهُم مُّوسَىٰۤ أَلۡقُوا۟ مَاۤ أَنتُم مُّلۡقُونَ\n"
    }
  },
  {
    "id": 1445,
    "surahId": 10,
    "ayahNumber": 81,
    "arabicText": "فَلَمَّاۤ أَلۡقَوۡا۟ قَالَ مُوسَىٰ مَا جِئۡتُم بِهِ ٱلسِّحۡرُۖ إِنَّ ٱللَّهَ سَیُبۡطِلُهُۥۤ إِنَّ ٱللَّهَ لَا یُصۡلِحُ عَمَلَ ٱلۡمُفۡسِدِینَ\n",
    "translations": {
      "en": "And when they threw down [their staffs and cast a spell upon the people's eyes], Moses said unto them: \"What you have contrived is [but] sorcery which, verily, God will bring to nought! Verily, God does not further the works of spreaders of corruption -",
      "ms": "",
      "id": "",
      "ar": "فَلَمَّاۤ أَلۡقَوۡا۟ قَالَ مُوسَىٰ مَا جِئۡتُم بِهِ ٱلسِّحۡرُۖ إِنَّ ٱللَّهَ سَیُبۡطِلُهُۥۤ إِنَّ ٱللَّهَ لَا یُصۡلِحُ عَمَلَ ٱلۡمُفۡسِدِینَ\n"
    }
  },
  {
    "id": 1446,
    "surahId": 10,
    "ayahNumber": 82,
    "arabicText": "وَیُحِقُّ ٱللَّهُ ٱلۡحَقَّ بِكَلِمَـٰتِهِۦ وَلَوۡ كَرِهَ ٱلۡمُجۡرِمُونَ\n",
    "translations": {
      "en": "whereas by His words God proves the truth to be true, however hateful this may be to those who are lost in sin!\"",
      "ms": "",
      "id": "",
      "ar": "وَیُحِقُّ ٱللَّهُ ٱلۡحَقَّ بِكَلِمَـٰتِهِۦ وَلَوۡ كَرِهَ ٱلۡمُجۡرِمُونَ\n"
    }
  },
  {
    "id": 1447,
    "surahId": 10,
    "ayahNumber": 83,
    "arabicText": "فَمَاۤ ءَامَنَ لِمُوسَىٰۤ إِلَّا ذُرِّیَّةࣱ مِّن قَوۡمِهِۦ عَلَىٰ خَوۡفࣲ مِّن فِرۡعَوۡنَ وَمَلَإِی۟هِمۡ أَن یَفۡتِنَهُمۡۚ وَإِنَّ فِرۡعَوۡنَ لَعَالࣲ فِی ٱلۡأَرۡضِ وَإِنَّهُۥ لَمِنَ ٱلۡمُسۡرِفِینَ\n",
    "translations": {
      "en": "But none save a few of his people declared their faith in Moses, [while others held back] for fear of Pharaoh and their great ones, lest they persecute them: for, verily, Pharaoh was mighty on earth and was, verily, of those who are given to excesses.",
      "ms": "",
      "id": "",
      "ar": "فَمَاۤ ءَامَنَ لِمُوسَىٰۤ إِلَّا ذُرِّیَّةࣱ مِّن قَوۡمِهِۦ عَلَىٰ خَوۡفࣲ مِّن فِرۡعَوۡنَ وَمَلَإِی۟هِمۡ أَن یَفۡتِنَهُمۡۚ وَإِنَّ فِرۡعَوۡنَ لَعَالࣲ فِی ٱلۡأَرۡضِ وَإِنَّهُۥ لَمِنَ ٱلۡمُسۡرِفِینَ\n"
    }
  },
  {
    "id": 1448,
    "surahId": 10,
    "ayahNumber": 84,
    "arabicText": "وَقَالَ مُوسَىٰ یَـٰقَوۡمِ إِن كُنتُمۡ ءَامَنتُم بِٱللَّهِ فَعَلَیۡهِ تَوَكَّلُوۤا۟ إِن كُنتُم مُّسۡلِمِینَ\n",
    "translations": {
      "en": "And Moses said: \"O my people! If you believe in God, place your trust in Him -if you have [truly] surrendered yourselves unto Him!\"",
      "ms": "",
      "id": "",
      "ar": "وَقَالَ مُوسَىٰ یَـٰقَوۡمِ إِن كُنتُمۡ ءَامَنتُم بِٱللَّهِ فَعَلَیۡهِ تَوَكَّلُوۤا۟ إِن كُنتُم مُّسۡلِمِینَ\n"
    }
  },
  {
    "id": 1449,
    "surahId": 10,
    "ayahNumber": 85,
    "arabicText": "فَقَالُوا۟ عَلَى ٱللَّهِ تَوَكَّلۡنَا رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةࣰ لِّلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "Whereupon they answered: \"In God have we placed our trust! O our Sustainer, make us not a plaything for evildoing folk,",
      "ms": "",
      "id": "",
      "ar": "فَقَالُوا۟ عَلَى ٱللَّهِ تَوَكَّلۡنَا رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةࣰ لِّلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1450,
    "surahId": 10,
    "ayahNumber": 86,
    "arabicText": "وَنَجِّنَا بِرَحۡمَتِكَ مِنَ ٱلۡقَوۡمِ ٱلۡكَـٰفِرِینَ\n",
    "translations": {
      "en": "and save us, by Thy grace, from people who deny the truth!\"",
      "ms": "",
      "id": "",
      "ar": "وَنَجِّنَا بِرَحۡمَتِكَ مِنَ ٱلۡقَوۡمِ ٱلۡكَـٰفِرِینَ\n"
    }
  },
  {
    "id": 1451,
    "surahId": 10,
    "ayahNumber": 87,
    "arabicText": "وَأَوۡحَیۡنَاۤ إِلَىٰ مُوسَىٰ وَأَخِیهِ أَن تَبَوَّءَا لِقَوۡمِكُمَا بِمِصۡرَ بُیُوتࣰا وَٱجۡعَلُوا۟ بُیُوتَكُمۡ قِبۡلَةࣰ وَأَقِیمُوا۟ ٱلصَّلَوٰةَۗ وَبَشِّرِ ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "And [thus] did We inspire Moses and his brother: \"Set aside for your people some houses in the city, and [tell them], `Turn your houses into places of worship, and be constant in prayer!' And give thou [O Moses] the glad tiding [of God's succour] to all believers.\"",
      "ms": "",
      "id": "",
      "ar": "وَأَوۡحَیۡنَاۤ إِلَىٰ مُوسَىٰ وَأَخِیهِ أَن تَبَوَّءَا لِقَوۡمِكُمَا بِمِصۡرَ بُیُوتࣰا وَٱجۡعَلُوا۟ بُیُوتَكُمۡ قِبۡلَةࣰ وَأَقِیمُوا۟ ٱلصَّلَوٰةَۗ وَبَشِّرِ ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1452,
    "surahId": 10,
    "ayahNumber": 88,
    "arabicText": "وَقَالَ مُوسَىٰ رَبَّنَاۤ إِنَّكَ ءَاتَیۡتَ فِرۡعَوۡنَ وَمَلَأَهُۥ زِینَةࣰ وَأَمۡوَ ٰ⁠لࣰا فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا رَبَّنَا لِیُضِلُّوا۟ عَن سَبِیلِكَۖ رَبَّنَا ٱطۡمِسۡ عَلَىٰۤ أَمۡوَ ٰ⁠لِهِمۡ وَٱشۡدُدۡ عَلَىٰ قُلُوبِهِمۡ فَلَا یُؤۡمِنُوا۟ حَتَّىٰ یَرَوُا۟ ٱلۡعَذَابَ ٱلۡأَلِیمَ\n",
    "translations": {
      "en": "And Moses prayed: \"O our Sustainer! Verily, splendour and riches hast Thou vouchsafed, in the life of this world, unto Pharaoh and his great ones-with the result, O our Sustainer, that they are leading [others] astray from Thy path! O our Sustainer! Wipe out their riches, and harden their hearts, so that they may not attain to faith ere they see the grievous suffering [that awaits them]!\"",
      "ms": "",
      "id": "",
      "ar": "وَقَالَ مُوسَىٰ رَبَّنَاۤ إِنَّكَ ءَاتَیۡتَ فِرۡعَوۡنَ وَمَلَأَهُۥ زِینَةࣰ وَأَمۡوَ ٰ⁠لࣰا فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا رَبَّنَا لِیُضِلُّوا۟ عَن سَبِیلِكَۖ رَبَّنَا ٱطۡمِسۡ عَلَىٰۤ أَمۡوَ ٰ⁠لِهِمۡ وَٱشۡدُدۡ عَلَىٰ قُلُوبِهِمۡ فَلَا یُؤۡمِنُوا۟ حَتَّىٰ یَرَوُا۟ ٱلۡعَذَابَ ٱلۡأَلِیمَ\n"
    }
  },
  {
    "id": 1453,
    "surahId": 10,
    "ayahNumber": 89,
    "arabicText": "قَالَ قَدۡ أُجِیبَت دَّعۡوَتُكُمَا فَٱسۡتَقِیمَا وَلَا تَتَّبِعَاۤنِّ سَبِیلَ ٱلَّذِینَ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "[God] answered: \"Accepted is this your prayer! Continue, then, both of you, steadfastly on the right way, and follow not the path of those who have no knowledge [of right and wrong].\"",
      "ms": "",
      "id": "",
      "ar": "قَالَ قَدۡ أُجِیبَت دَّعۡوَتُكُمَا فَٱسۡتَقِیمَا وَلَا تَتَّبِعَاۤنِّ سَبِیلَ ٱلَّذِینَ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1454,
    "surahId": 10,
    "ayahNumber": 90,
    "arabicText": "۞ وَجَـٰوَزۡنَا بِبَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ ٱلۡبَحۡرَ فَأَتۡبَعَهُمۡ فِرۡعَوۡنُ وَجُنُودُهُۥ بَغۡیࣰا وَعَدۡوًاۖ حَتَّىٰۤ إِذَاۤ أَدۡرَكَهُ ٱلۡغَرَقُ قَالَ ءَامَنتُ أَنَّهُۥ لَاۤ إِلَـٰهَ إِلَّا ٱلَّذِیۤ ءَامَنَتۡ بِهِۦ بَنُوۤا۟ إِسۡرَ ٰ⁠ۤءِیلَ وَأَنَا۠ مِنَ ٱلۡمُسۡلِمِینَ\n",
    "translations": {
      "en": "And We brought the children of Israel across the sea; and thereupon Pharaoh and his hosts pursued them with vehement insolence and tyranny, until [they were overwhelmed by the waters of the sea. And] when he was about to drown, [Pharaoh] exclaimed: \"I have come to believe that there is no deity save Him in whom the children of Israel believe, and I am of those who surrender themselves unto Him!\"",
      "ms": "",
      "id": "",
      "ar": "۞ وَجَـٰوَزۡنَا بِبَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ ٱلۡبَحۡرَ فَأَتۡبَعَهُمۡ فِرۡعَوۡنُ وَجُنُودُهُۥ بَغۡیࣰا وَعَدۡوًاۖ حَتَّىٰۤ إِذَاۤ أَدۡرَكَهُ ٱلۡغَرَقُ قَالَ ءَامَنتُ أَنَّهُۥ لَاۤ إِلَـٰهَ إِلَّا ٱلَّذِیۤ ءَامَنَتۡ بِهِۦ بَنُوۤا۟ إِسۡرَ ٰ⁠ۤءِیلَ وَأَنَا۠ مِنَ ٱلۡمُسۡلِمِینَ\n"
    }
  },
  {
    "id": 1455,
    "surahId": 10,
    "ayahNumber": 91,
    "arabicText": "ءَاۤلۡـَٔـٰنَ وَقَدۡ عَصَیۡتَ قَبۡلُ وَكُنتَ مِنَ ٱلۡمُفۡسِدِینَ\n",
    "translations": {
      "en": "[But God said:] \"Now? -when ever before this thou hast been rebelling [against Us], and hast been among those who spread corruption?",
      "ms": "",
      "id": "",
      "ar": "ءَاۤلۡـَٔـٰنَ وَقَدۡ عَصَیۡتَ قَبۡلُ وَكُنتَ مِنَ ٱلۡمُفۡسِدِینَ\n"
    }
  },
  {
    "id": 1456,
    "surahId": 10,
    "ayahNumber": 92,
    "arabicText": "فَٱلۡیَوۡمَ نُنَجِّیكَ بِبَدَنِكَ لِتَكُونَ لِمَنۡ خَلۡفَكَ ءَایَةࣰۚ وَإِنَّ كَثِیرࣰا مِّنَ ٱلنَّاسِ عَنۡ ءَایَـٰتِنَا لَغَـٰفِلُونَ\n",
    "translations": {
      "en": "[Nay,] but today We shall save only thy body, so that thou mayest be a [warning] sign unto those who will come after thee: for, behold, a good many people are heedless of Our messages!\"",
      "ms": "",
      "id": "",
      "ar": "فَٱلۡیَوۡمَ نُنَجِّیكَ بِبَدَنِكَ لِتَكُونَ لِمَنۡ خَلۡفَكَ ءَایَةࣰۚ وَإِنَّ كَثِیرࣰا مِّنَ ٱلنَّاسِ عَنۡ ءَایَـٰتِنَا لَغَـٰفِلُونَ\n"
    }
  },
  {
    "id": 1457,
    "surahId": 10,
    "ayahNumber": 93,
    "arabicText": "وَلَقَدۡ بَوَّأۡنَا بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ مُبَوَّأَ صِدۡقࣲ وَرَزَقۡنَـٰهُم مِّنَ ٱلطَّیِّبَـٰتِ فَمَا ٱخۡتَلَفُوا۟ حَتَّىٰ جَاۤءَهُمُ ٱلۡعِلۡمُۚ إِنَّ رَبَّكَ یَقۡضِی بَیۡنَهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ فِیمَا كَانُوا۟ فِیهِ یَخۡتَلِفُونَ\n",
    "translations": {
      "en": "And [thereafter], indeed, We assigned unto the children of Israel a most goodly abode, and provided for them sustenance out of the good things of life. And it was not until knowledge [of God's revelation] was vouchsafed to them that they began to hold divergent views: [but,] verily, thy Sustainer will judge between them on Resurrection Day regarding all on which they were wont to differ.",
      "ms": "",
      "id": "",
      "ar": "وَلَقَدۡ بَوَّأۡنَا بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ مُبَوَّأَ صِدۡقࣲ وَرَزَقۡنَـٰهُم مِّنَ ٱلطَّیِّبَـٰتِ فَمَا ٱخۡتَلَفُوا۟ حَتَّىٰ جَاۤءَهُمُ ٱلۡعِلۡمُۚ إِنَّ رَبَّكَ یَقۡضِی بَیۡنَهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ فِیمَا كَانُوا۟ فِیهِ یَخۡتَلِفُونَ\n"
    }
  },
  {
    "id": 1458,
    "surahId": 10,
    "ayahNumber": 94,
    "arabicText": "فَإِن كُنتَ فِی شَكࣲّ مِّمَّاۤ أَنزَلۡنَاۤ إِلَیۡكَ فَسۡـَٔلِ ٱلَّذِینَ یَقۡرَءُونَ ٱلۡكِتَـٰبَ مِن قَبۡلِكَۚ لَقَدۡ جَاۤءَكَ ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِینَ\n",
    "translations": {
      "en": "AND SO, [O man,] if thou art in doubt about [the truth of] what We have [now] bestowed upon thee from on high, ask those who read the divine writ [revealed] before thy time: [and thou wilt find that,] surely, the truth has now come unto thee from thy Sustainer. Be not, then, among the doubters -",
      "ms": "",
      "id": "",
      "ar": "فَإِن كُنتَ فِی شَكࣲّ مِّمَّاۤ أَنزَلۡنَاۤ إِلَیۡكَ فَسۡـَٔلِ ٱلَّذِینَ یَقۡرَءُونَ ٱلۡكِتَـٰبَ مِن قَبۡلِكَۚ لَقَدۡ جَاۤءَكَ ٱلۡحَقُّ مِن رَّبِّكَ فَلَا تَكُونَنَّ مِنَ ٱلۡمُمۡتَرِینَ\n"
    }
  },
  {
    "id": 1459,
    "surahId": 10,
    "ayahNumber": 95,
    "arabicText": "وَلَا تَكُونَنَّ مِنَ ٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِ ٱللَّهِ فَتَكُونَ مِنَ ٱلۡخَـٰسِرِینَ\n",
    "translations": {
      "en": "and neither be among those who are bent on giving the lie to God's messages, lest thou find thyself among the lost.",
      "ms": "",
      "id": "",
      "ar": "وَلَا تَكُونَنَّ مِنَ ٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِ ٱللَّهِ فَتَكُونَ مِنَ ٱلۡخَـٰسِرِینَ\n"
    }
  },
  {
    "id": 1460,
    "surahId": 10,
    "ayahNumber": 96,
    "arabicText": "إِنَّ ٱلَّذِینَ حَقَّتۡ عَلَیۡهِمۡ كَلِمَتُ رَبِّكَ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Verily, they against whom thy Sustainer's word [of judgment] has come true will not attain to faith -",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ حَقَّتۡ عَلَیۡهِمۡ كَلِمَتُ رَبِّكَ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 1461,
    "surahId": 10,
    "ayahNumber": 97,
    "arabicText": "وَلَوۡ جَاۤءَتۡهُمۡ كُلُّ ءَایَةٍ حَتَّىٰ یَرَوُا۟ ٱلۡعَذَابَ ٱلۡأَلِیمَ\n",
    "translations": {
      "en": "even though every sign [of the truth] should come within their ken - until they behold the grievous suffering [that awaits them in the life to come].",
      "ms": "",
      "id": "",
      "ar": "وَلَوۡ جَاۤءَتۡهُمۡ كُلُّ ءَایَةٍ حَتَّىٰ یَرَوُا۟ ٱلۡعَذَابَ ٱلۡأَلِیمَ\n"
    }
  },
  {
    "id": 1462,
    "surahId": 10,
    "ayahNumber": 98,
    "arabicText": "فَلَوۡلَا كَانَتۡ قَرۡیَةٌ ءَامَنَتۡ فَنَفَعَهَاۤ إِیمَـٰنُهَاۤ إِلَّا قَوۡمَ یُونُسَ لَمَّاۤ ءَامَنُوا۟ كَشَفۡنَا عَنۡهُمۡ عَذَابَ ٱلۡخِزۡیِ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَمَتَّعۡنَـٰهُمۡ إِلَىٰ حِینࣲ\n",
    "translations": {
      "en": "For, alas, there has never yet been any community that attained to faith [in its entirety,] and thereupon benefited by its faith, except the people of Jonah. When they came to believe, We removed from them the suffering of disgrace [which otherwise would have befallen them even] in the life of this world, and allowed them to enjoy their life during the time allotted to them.",
      "ms": "",
      "id": "",
      "ar": "فَلَوۡلَا كَانَتۡ قَرۡیَةٌ ءَامَنَتۡ فَنَفَعَهَاۤ إِیمَـٰنُهَاۤ إِلَّا قَوۡمَ یُونُسَ لَمَّاۤ ءَامَنُوا۟ كَشَفۡنَا عَنۡهُمۡ عَذَابَ ٱلۡخِزۡیِ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَمَتَّعۡنَـٰهُمۡ إِلَىٰ حِینࣲ\n"
    }
  },
  {
    "id": 1463,
    "surahId": 10,
    "ayahNumber": 99,
    "arabicText": "وَلَوۡ شَاۤءَ رَبُّكَ لَـَٔامَنَ مَن فِی ٱلۡأَرۡضِ كُلُّهُمۡ جَمِیعًاۚ أَفَأَنتَ تُكۡرِهُ ٱلنَّاسَ حَتَّىٰ یَكُونُوا۟ مُؤۡمِنِینَ\n",
    "translations": {
      "en": "And [thus it is:] had thy Sustainer so willed, all those who live on earth would surely have attained to faith, all of them: dost thou, then, think that thou couldst compel people to believe,",
      "ms": "",
      "id": "",
      "ar": "وَلَوۡ شَاۤءَ رَبُّكَ لَـَٔامَنَ مَن فِی ٱلۡأَرۡضِ كُلُّهُمۡ جَمِیعًاۚ أَفَأَنتَ تُكۡرِهُ ٱلنَّاسَ حَتَّىٰ یَكُونُوا۟ مُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1464,
    "surahId": 10,
    "ayahNumber": 100,
    "arabicText": "وَمَا كَانَ لِنَفۡسٍ أَن تُؤۡمِنَ إِلَّا بِإِذۡنِ ٱللَّهِۚ وَیَجۡعَلُ ٱلرِّجۡسَ عَلَى ٱلَّذِینَ لَا یَعۡقِلُونَ\n",
    "translations": {
      "en": "notwithstanding that no human being can ever attain to faith otherwise than by God's leave, and [that] it is He who lays the loathsome evil [of disbelief] upon those who will not use -their reason?",
      "ms": "",
      "id": "",
      "ar": "وَمَا كَانَ لِنَفۡسٍ أَن تُؤۡمِنَ إِلَّا بِإِذۡنِ ٱللَّهِۚ وَیَجۡعَلُ ٱلرِّجۡسَ عَلَى ٱلَّذِینَ لَا یَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1465,
    "surahId": 10,
    "ayahNumber": 101,
    "arabicText": "قُلِ ٱنظُرُوا۟ مَاذَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَمَا تُغۡنِی ٱلۡـَٔایَـٰتُ وَٱلنُّذُرُ عَن قَوۡمࣲ لَّا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Say: \"Consider whatever there is in the heavens and on earth!\" But of what avail could all the messages and all the warnings be to people who will not believe?",
      "ms": "",
      "id": "",
      "ar": "قُلِ ٱنظُرُوا۟ مَاذَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَمَا تُغۡنِی ٱلۡـَٔایَـٰتُ وَٱلنُّذُرُ عَن قَوۡمࣲ لَّا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 1466,
    "surahId": 10,
    "ayahNumber": 102,
    "arabicText": "فَهَلۡ یَنتَظِرُونَ إِلَّا مِثۡلَ أَیَّامِ ٱلَّذِینَ خَلَوۡا۟ مِن قَبۡلِهِمۡۚ قُلۡ فَٱنتَظِرُوۤا۟ إِنِّی مَعَكُم مِّنَ ٱلۡمُنتَظِرِینَ\n",
    "translations": {
      "en": "Can such, then, expect anything else [to befall them] but the like of the days of [calamity which befell] those [deniers of the truth] who passed away before them? Say: \"Wait, then, [for what will happen) verily, I shall wait with you!\"",
      "ms": "",
      "id": "",
      "ar": "فَهَلۡ یَنتَظِرُونَ إِلَّا مِثۡلَ أَیَّامِ ٱلَّذِینَ خَلَوۡا۟ مِن قَبۡلِهِمۡۚ قُلۡ فَٱنتَظِرُوۤا۟ إِنِّی مَعَكُم مِّنَ ٱلۡمُنتَظِرِینَ\n"
    }
  },
  {
    "id": 1467,
    "surahId": 10,
    "ayahNumber": 103,
    "arabicText": "ثُمَّ نُنَجِّی رُسُلَنَا وَٱلَّذِینَ ءَامَنُوا۟ۚ كَذَ ٰ⁠لِكَ حَقًّا عَلَیۡنَا نُنجِ ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "[For thus it always happens: We seal the doom of all who deny the truth and give the lie to Our messages;] and thereupon We save Our apostles and those who have attained to faith. Thus have We willed it upon Ourselves: We save all who believe [in Us],",
      "ms": "",
      "id": "",
      "ar": "ثُمَّ نُنَجِّی رُسُلَنَا وَٱلَّذِینَ ءَامَنُوا۟ۚ كَذَ ٰ⁠لِكَ حَقًّا عَلَیۡنَا نُنجِ ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1468,
    "surahId": 10,
    "ayahNumber": 104,
    "arabicText": "قُلۡ یَـٰۤأَیُّهَا ٱلنَّاسُ إِن كُنتُمۡ فِی شَكࣲّ مِّن دِینِی فَلَاۤ أَعۡبُدُ ٱلَّذِینَ تَعۡبُدُونَ مِن دُونِ ٱللَّهِ وَلَـٰكِنۡ أَعۡبُدُ ٱللَّهَ ٱلَّذِی یَتَوَفَّىٰكُمۡۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "SAY [O Prophet]: \"O mankind! If you are in doubt as to what my faith is, then [know that] I do not worship those beings whom you worship beside God, but [that] I worship God alone, who shall cause you [all] to die: for I have been bidden to be among those who believe [in Him alone].\"",
      "ms": "",
      "id": "",
      "ar": "قُلۡ یَـٰۤأَیُّهَا ٱلنَّاسُ إِن كُنتُمۡ فِی شَكࣲّ مِّن دِینِی فَلَاۤ أَعۡبُدُ ٱلَّذِینَ تَعۡبُدُونَ مِن دُونِ ٱللَّهِ وَلَـٰكِنۡ أَعۡبُدُ ٱللَّهَ ٱلَّذِی یَتَوَفَّىٰكُمۡۖ وَأُمِرۡتُ أَنۡ أَكُونَ مِنَ ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1469,
    "surahId": 10,
    "ayahNumber": 105,
    "arabicText": "وَأَنۡ أَقِمۡ وَجۡهَكَ لِلدِّینِ حَنِیفࣰا وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِینَ\n",
    "translations": {
      "en": "Hence, [O man,] set thy face steadfastly towards the [true] faith, turning away from all that is false, and be not among those who ascribe divinity to aught beside God.",
      "ms": "",
      "id": "",
      "ar": "وَأَنۡ أَقِمۡ وَجۡهَكَ لِلدِّینِ حَنِیفࣰا وَلَا تَكُونَنَّ مِنَ ٱلۡمُشۡرِكِینَ\n"
    }
  },
  {
    "id": 1470,
    "surahId": 10,
    "ayahNumber": 106,
    "arabicText": "وَلَا تَدۡعُ مِن دُونِ ٱللَّهِ مَا لَا یَنفَعُكَ وَلَا یَضُرُّكَۖ فَإِن فَعَلۡتَ فَإِنَّكَ إِذࣰا مِّنَ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "Thus, do not invoke, side by side with God, anything that can neither benefit thee nor harm thee: for, behold, if thou do it, thou wilt surely be among the evildoers!",
      "ms": "",
      "id": "",
      "ar": "وَلَا تَدۡعُ مِن دُونِ ٱللَّهِ مَا لَا یَنفَعُكَ وَلَا یَضُرُّكَۖ فَإِن فَعَلۡتَ فَإِنَّكَ إِذࣰا مِّنَ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1471,
    "surahId": 10,
    "ayahNumber": 107,
    "arabicText": "وَإِن یَمۡسَسۡكَ ٱللَّهُ بِضُرࣲّ فَلَا كَاشِفَ لَهُۥۤ إِلَّا هُوَۖ وَإِن یُرِدۡكَ بِخَیۡرࣲ فَلَا رَاۤدَّ لِفَضۡلِهِۦۚ یُصِیبُ بِهِۦ مَن یَشَاۤءُ مِنۡ عِبَادِهِۦۚ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِیمُ\n",
    "translations": {
      "en": "And [know that] if God should touch thee with misfortune, there is none who could remove it save Him; and if He intends good for thee, there is none who could turn away His bounty: He causes it to alight upon whomsoever He wills of His servants. And He alone is truly forgiving, truly a dispenser of grace.",
      "ms": "",
      "id": "",
      "ar": "وَإِن یَمۡسَسۡكَ ٱللَّهُ بِضُرࣲّ فَلَا كَاشِفَ لَهُۥۤ إِلَّا هُوَۖ وَإِن یُرِدۡكَ بِخَیۡرࣲ فَلَا رَاۤدَّ لِفَضۡلِهِۦۚ یُصِیبُ بِهِۦ مَن یَشَاۤءُ مِنۡ عِبَادِهِۦۚ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِیمُ\n"
    }
  },
  {
    "id": 1472,
    "surahId": 10,
    "ayahNumber": 108,
    "arabicText": "قُلۡ یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَكُمُ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا یَهۡتَدِی لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا یَضِلُّ عَلَیۡهَاۖ وَمَاۤ أَنَا۠ عَلَیۡكُم بِوَكِیلࣲ\n",
    "translations": {
      "en": "SAY [O Prophet]: \"O mankind! The truth from your Sustainer has now come unto you. Whoever, therefore, chooses to follow the right path, follows it but for his own good; and whoever chooses to go astray, goes but astray to his own hurt. And I am not responsible for your conduct.\"",
      "ms": "",
      "id": "",
      "ar": "قُلۡ یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَكُمُ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَنِ ٱهۡتَدَىٰ فَإِنَّمَا یَهۡتَدِی لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا یَضِلُّ عَلَیۡهَاۖ وَمَاۤ أَنَا۠ عَلَیۡكُم بِوَكِیلࣲ\n"
    }
  },
  {
    "id": 1473,
    "surahId": 10,
    "ayahNumber": 109,
    "arabicText": "وَٱتَّبِعۡ مَا یُوحَىٰۤ إِلَیۡكَ وَٱصۡبِرۡ حَتَّىٰ یَحۡكُمَ ٱللَّهُۚ وَهُوَ خَیۡرُ ٱلۡحَـٰكِمِینَ\n",
    "translations": {
      "en": "And [as for thyself, O Muhammad,] follow but what is being revealed unto thee, and be patient in adversity, until God shall give His judgment: for He is the best of all judges.",
      "ms": "",
      "id": "",
      "ar": "وَٱتَّبِعۡ مَا یُوحَىٰۤ إِلَیۡكَ وَٱصۡبِرۡ حَتَّىٰ یَحۡكُمَ ٱللَّهُۚ وَهُوَ خَیۡرُ ٱلۡحَـٰكِمِینَ\n"
    }
  }
]