[
  {
    "id": 1803,
    "surahId": 15,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِ وَقُرۡءَانࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "Alif. Lam. Ra. THESE ARE MESSAGES of revelation -of a discourse clear in itself and clearly showing the truth.",
      "ms": "Alif, Laam, Raa'. Ini ialah ayat-ayat Kitab (yang lengkap sempurna) dan Al-Quran yang memberi penjelasan.",
      "id": "Alif, laam, raa. (Surat) ini adalah (sebagian dari) ayat-ayat Al-Kitab (yang sempurna), yaitu (ayat-ayat) Al Quran yang memberi penjelasan.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِ وَقُرۡءَانࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 1804,
    "surahId": 15,
    "ayahNumber": 2,
    "arabicText": "رُّبَمَا یَوَدُّ ٱلَّذِینَ كَفَرُوا۟ لَوۡ كَانُوا۟ مُسۡلِمِینَ\n",
    "translations": {
      "en": "And it will come to pass that those who are [now] bent on denying this truth will wish that they had surrendered themselves to God [in their life time].",
      "ms": "Ada masanya orang-orang yang kafir merasa ingin kalaulah mereka telah menjadi orang-orang Islam.",
      "id": "Orang-orang yang kafir itu seringkali (nanti di akhirat) menginginkan, kiranya mereka dahulu (di dunia) menjadi orang-orang muslim.",
      "ar": "رُّبَمَا یَوَدُّ ٱلَّذِینَ كَفَرُوا۟ لَوۡ كَانُوا۟ مُسۡلِمِینَ\n"
    }
  },
  {
    "id": 1805,
    "surahId": 15,
    "ayahNumber": 3,
    "arabicText": "ذَرۡهُمۡ یَأۡكُلُوا۟ وَیَتَمَتَّعُوا۟ وَیُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ یَعۡلَمُونَ\n",
    "translations": {
      "en": "Leave them alone; let them eat and enjoy themselves the while the hope [of vain delights] be guiles them: for in time they will come to know [the truth].",
      "ms": "Biarkanlah mereka makan dan bersenang-lenang dengan kemewahan dunia dan dilalaikan oleh angan-angan (daripada bertaubat dan insaf); kemudian mereka akan mengetahui kelak (bencana perbuatan mereka).",
      "id": "Biarkanlah mereka (di dunia ini) makan dan bersenang-senang dan dilalaikan oleh angan-angan (kosong), maka kelak mereka akan mengetahui (akibat perbuatan mereka).",
      "ar": "ذَرۡهُمۡ یَأۡكُلُوا۟ وَیَتَمَتَّعُوا۟ وَیُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1806,
    "surahId": 15,
    "ayahNumber": 4,
    "arabicText": "وَمَاۤ أَهۡلَكۡنَا مِن قَرۡیَةٍ إِلَّا وَلَهَا كِتَابࣱ مَّعۡلُومࣱ\n",
    "translations": {
      "en": "And never have We destroyed any community [for its wrongdoing] unless a divine writ had (previously] been made known to it;",
      "ms": "Dan tiadalah Kami binasakan (penduduk) sesebuah negeri melainkan ada baginya tempoh yang tertentu dan termaklum.",
      "id": "Dan Kami tiada membinasakan sesuatu negeripun, melainkan ada baginya ketentuan masa yang telah ditetapkan.",
      "ar": "وَمَاۤ أَهۡلَكۡنَا مِن قَرۡیَةٍ إِلَّا وَلَهَا كِتَابࣱ مَّعۡلُومࣱ\n"
    }
  },
  {
    "id": 1807,
    "surahId": 15,
    "ayahNumber": 5,
    "arabicText": "مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا یَسۡتَـٔۡخِرُونَ\n",
    "translations": {
      "en": "[but remember that] no community can ever forestall [the end of] its term - and neither can they delay [it].",
      "ms": "Sesuatu umat itu tidak dapat mendahului tempohnya yang telah ditentukan, dan mereka juga tidak dapat mengundurkannya.",
      "id": "Tidak ada suatu umatpun yang dapat mendahului ajalnya, dan tidak (pula) dapat mengundurkan(nya).",
      "ar": "مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا یَسۡتَـٔۡخِرُونَ\n"
    }
  },
  {
    "id": 1808,
    "surahId": 15,
    "ayahNumber": 6,
    "arabicText": "وَقَالُوا۟ یَـٰۤأَیُّهَا ٱلَّذِی نُزِّلَ عَلَیۡهِ ٱلذِّكۡرُ إِنَّكَ لَمَجۡنُونࣱ\n",
    "translations": {
      "en": "And yet, they [who deny the truth] say: \"O thou unto whom this reminder has [allegedly] been bestowed from on high: verily, thou art mad!",
      "ms": "Dan mereka yang ingkar berkata (kepada Nabi Muhammad): \"Wahai orang yang kepadanya diturunkan Al-Quran, sesungguhnya engkau adalah orang gila\".",
      "id": "Mereka berkata: \"Hai orang yang diturunkan Al Quran kepadanya, sesungguhnya kamu benar-benar orang yang gila.",
      "ar": "وَقَالُوا۟ یَـٰۤأَیُّهَا ٱلَّذِی نُزِّلَ عَلَیۡهِ ٱلذِّكۡرُ إِنَّكَ لَمَجۡنُونࣱ\n"
    }
  },
  {
    "id": 1809,
    "surahId": 15,
    "ayahNumber": 7,
    "arabicText": "لَّوۡ مَا تَأۡتِینَا بِٱلۡمَلَـٰۤىِٕكَةِ إِن كُنتَ مِنَ ٱلصَّـٰدِقِینَ\n",
    "translations": {
      "en": "Why dost thou not bring before us angels, if thou art a man of truth?",
      "ms": "\"Sepatutnya engkau membawakan malaikat kepada kami (untuk menjadi saksi tentang kerasulanmu), jika betul engkau dari orang-orang yang benar!\"",
      "id": "Mengapa kamu tidak mendatangkan malaikat kepada kami, jika kamu termasuk orang-orang yang benar?\"",
      "ar": "لَّوۡ مَا تَأۡتِینَا بِٱلۡمَلَـٰۤىِٕكَةِ إِن كُنتَ مِنَ ٱلصَّـٰدِقِینَ\n"
    }
  },
  {
    "id": 1810,
    "surahId": 15,
    "ayahNumber": 8,
    "arabicText": "مَا نُنَزِّلُ ٱلۡمَلَـٰۤىِٕكَةَ إِلَّا بِٱلۡحَقِّ وَمَا كَانُوۤا۟ إِذࣰا مُّنظَرِینَ\n",
    "translations": {
      "en": "[Yet] We never send down angels otherwise than in accordance with the [demands of] truth; and [were the angels to appear now,] lo! they [who reject this divine writ] would have no further respite!",
      "ms": "Tiadalah Kami menurunkan Malaikat melainkan dengan cara yang sungguh layak dan berhikmat, dan pada ketika itu mereka (yang ingkar) tidak akan diberi tempoh lagi.",
      "id": "Kami tidak menurunkan malaikat melainkan dengan benar (untuk membawa azab) dan tiadalah mereka ketika itu diberi tangguh.",
      "ar": "مَا نُنَزِّلُ ٱلۡمَلَـٰۤىِٕكَةَ إِلَّا بِٱلۡحَقِّ وَمَا كَانُوۤا۟ إِذࣰا مُّنظَرِینَ\n"
    }
  },
  {
    "id": 1811,
    "surahId": 15,
    "ayahNumber": 9,
    "arabicText": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَـٰفِظُونَ\n",
    "translations": {
      "en": "Behold, it is We Ourselves who have bestowed from on high, step by step, this reminder? and, behold, it is We who shall truly guard it [from all corruption].",
      "ms": "Sesungguhnya Kamilah yang menurunkan Al-Quran, dan Kamilah yang memelihara dan menjaganya.",
      "id": "Sesungguhnya Kami-lah yang menurunkan Al Quran, dan sesungguhnya Kami benar-benar memeliharanya.",
      "ar": "إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ وَإِنَّا لَهُۥ لَحَـٰفِظُونَ\n"
    }
  },
  {
    "id": 1812,
    "surahId": 15,
    "ayahNumber": 10,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِی شِیَعِ ٱلۡأَوَّلِینَ\n",
    "translations": {
      "en": "AND, INDEED, [O Prophet,] even before thy time did We send [Our apostles] unto communities of old -",
      "ms": "Dan demi sesungguhnya! Kami telah utuskan Rasul-rasul sebelummu (wahai Muhammad), dalam kalangan kaum-kaum yang telah lalu.",
      "id": "Dan sesungguhnya Kami telah mengutus (beberapa rasul) sebelum kamu kepada umat-umat yang terdahulu.",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِی شِیَعِ ٱلۡأَوَّلِینَ\n"
    }
  },
  {
    "id": 1813,
    "surahId": 15,
    "ayahNumber": 11,
    "arabicText": "وَمَا یَأۡتِیهِم مِّن رَّسُولٍ إِلَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n",
    "translations": {
      "en": "and never yet came an apostle to them without their deriding him.",
      "ms": "Dan tiadalah seseorang Rasul pun yang datang kepada mereka, melainkan mereka mempersenda dan mengejek-ejeknya.",
      "id": "Dan tidak datang seorang rasulpun kepada mereka, melainkan mereka selalu memperolok-olokkannya.",
      "ar": "وَمَا یَأۡتِیهِم مِّن رَّسُولٍ إِلَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n"
    }
  },
  {
    "id": 1814,
    "surahId": 15,
    "ayahNumber": 12,
    "arabicText": "كَذَ ٰ⁠لِكَ نَسۡلُكُهُۥ فِی قُلُوبِ ٱلۡمُجۡرِمِینَ\n",
    "translations": {
      "en": "Even so do We [now] cause this [scorn of Our message] to pervade the hearts of those who are lost in sin,",
      "ms": "(Sebagaimana hati kaum-kaum yang telah lalu dimasuki perasaan mempersendakan Rasul-rasul) demikianlah pula Kami masukkan perasaan yang seperti itu ke dalam hati orang-orang yang berdosa (yang menentangmu).",
      "id": "Demikianlah, Kami mamasukkan (rasa ingkar dan memperolok-olokkan itu) kedalam hati orang-orang yang berdosa (orang-orang kafir),",
      "ar": "كَذَ ٰ⁠لِكَ نَسۡلُكُهُۥ فِی قُلُوبِ ٱلۡمُجۡرِمِینَ\n"
    }
  },
  {
    "id": 1815,
    "surahId": 15,
    "ayahNumber": 13,
    "arabicText": "لَا یُؤۡمِنُونَ بِهِۦ وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِینَ\n",
    "translations": {
      "en": "who do not believe in it, although the way which those [evildoers] of olden times had to go has long been within their ken.",
      "ms": "Mereka tidak percaya kepada Al-Quran yang engkau bawa, padahal telahpun berlaku undang-undang membinasakan orang-orang yang telah lalu (yang mendustakan Rasul-rasulnya).",
      "id": "mereka tidak beriman kepadanya (Al Quran) dan sesungguhnya telah berlalu sunnatullah terhadap orang-orang dahulu.",
      "ar": "لَا یُؤۡمِنُونَ بِهِۦ وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِینَ\n"
    }
  },
  {
    "id": 1816,
    "surahId": 15,
    "ayahNumber": 14,
    "arabicText": "وَلَوۡ فَتَحۡنَا عَلَیۡهِم بَابࣰا مِّنَ ٱلسَّمَاۤءِ فَظَلُّوا۟ فِیهِ یَعۡرُجُونَ\n",
    "translations": {
      "en": "Yet even had We opened to them a gateway to heaven and they had ascended, on and on, up to it,",
      "ms": "Dan kalau Kami bukakan kepada mereka mana-mana pintu langit, kemudian mereka dapat naik melalui pintu itu (pada siang hari yang membolehkan mereka menyaksikan segala kenyataan yang ada):",
      "id": "Dan jika seandainya Kami membukakan kepada mereka salah satu dari (pintu-pintu) langit, lalu mereka terus menerus naik ke atasnya,",
      "ar": "وَلَوۡ فَتَحۡنَا عَلَیۡهِم بَابࣰا مِّنَ ٱلسَّمَاۤءِ فَظَلُّوا۟ فِیهِ یَعۡرُجُونَ\n"
    }
  },
  {
    "id": 1817,
    "surahId": 15,
    "ayahNumber": 15,
    "arabicText": "لَقَالُوۤا۟ إِنَّمَا سُكِّرَتۡ أَبۡصَـٰرُنَا بَلۡ نَحۡنُ قَوۡمࣱ مَّسۡحُورُونَ\n",
    "translations": {
      "en": "they would surely have said, \"It is only our eyes that are spellbound! Nay, we have been bewitched!,",
      "ms": "Tentulah mereka akan (mengingkari kenyataan yang benar itu dengan) berkata: \"Hanya mata kami telah disilapkan penglihatannya bahkan kami adalah kaum yang telah disihirkan (oleh Muhammad)\".",
      "id": "tentulah mereka berkata: \"Sesungguhnya pandangan kamilah yang dikaburkan, bahkan kami adalah orang orang yang kena sihir\".",
      "ar": "لَقَالُوۤا۟ إِنَّمَا سُكِّرَتۡ أَبۡصَـٰرُنَا بَلۡ نَحۡنُ قَوۡمࣱ مَّسۡحُورُونَ\n"
    }
  },
  {
    "id": 1818,
    "surahId": 15,
    "ayahNumber": 16,
    "arabicText": "وَلَقَدۡ جَعَلۡنَا فِی ٱلسَّمَاۤءِ بُرُوجࣰا وَزَیَّنَّـٰهَا لِلنَّـٰظِرِینَ\n",
    "translations": {
      "en": "AND, INDEED, We have set up in the heavens great constellations, and endowed them with beauty for all to behold;",
      "ms": "Dan demi sesungguhnya! Kami telah menjadikan di langit: bintang-bintang (yang berbagai bentuk dan keadaan) serta kami hiasi langit itu bagi orang-orang yang melihatnya.",
      "id": "Dan sesungguhnya Kami telah menciptakan gugusan bintang-bintang (di langit) dan Kami telah menghiasi langit itu bagi orang-orang yang memandang(nya),",
      "ar": "وَلَقَدۡ جَعَلۡنَا فِی ٱلسَّمَاۤءِ بُرُوجࣰا وَزَیَّنَّـٰهَا لِلنَّـٰظِرِینَ\n"
    }
  },
  {
    "id": 1819,
    "surahId": 15,
    "ayahNumber": 17,
    "arabicText": "وَحَفِظۡنَـٰهَا مِن كُلِّ شَیۡطَـٰنࣲ رَّجِیمٍ\n",
    "translations": {
      "en": "and We have made them secure against every satanic force accursed -",
      "ms": "Dan Kami pelihara (urusan) langit itu dari (masuk campur) tiap-tiap Syaitan yang kena rejam.",
      "id": "dan Kami menjaganya dari tiap-tiap syaitan yang terkutuk,",
      "ar": "وَحَفِظۡنَـٰهَا مِن كُلِّ شَیۡطَـٰنࣲ رَّجِیمٍ\n"
    }
  },
  {
    "id": 1820,
    "surahId": 15,
    "ayahNumber": 18,
    "arabicText": "إِلَّا مَنِ ٱسۡتَرَقَ ٱلسَّمۡعَ فَأَتۡبَعَهُۥ شِهَابࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "so that anyone who seeks to learn [the unknowable] by stealth is pursued by a flame clear to see.",
      "ms": "Kecuali Syaitan yang curi mendengar percakapan (malaikat di langit), maka ia diburu dan diikuti (dengan rejaman) api yang menyala, yang nyata kelihatan.",
      "id": "kecuali syaitan yang mencuri-curi (berita) yang dapat didengar (dari malaikat) lalu dia dikejar oleh semburan api yang terang.",
      "ar": "إِلَّا مَنِ ٱسۡتَرَقَ ٱلسَّمۡعَ فَأَتۡبَعَهُۥ شِهَابࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 1821,
    "surahId": 15,
    "ayahNumber": 19,
    "arabicText": "وَٱلۡأَرۡضَ مَدَدۡنَـٰهَا وَأَلۡقَیۡنَا فِیهَا رَوَ ٰ⁠سِیَ وَأَنۢبَتۡنَا فِیهَا مِن كُلِّ شَیۡءࣲ مَّوۡزُونࣲ\n",
    "translations": {
      "en": "And the earth -We have spread it out wide, and placed on it mountains firm, and caused [life] of every kind to grow on it in a balanced manner,",
      "ms": "Dan bumi ini Kami bentangkan, dan Kami letakkan padanya gunung-ganang yang kukuh terdiri, serta Kami tumbuhkan padanya tiap-tiap sesuatu yang tertentu timbangannya.",
      "id": "Dan Kami telah menghamparkan bumi dan menjadikan padanya gunung-gunung dan Kami tumbuhkan padanya segala sesuatu menurut ukuran.",
      "ar": "وَٱلۡأَرۡضَ مَدَدۡنَـٰهَا وَأَلۡقَیۡنَا فِیهَا رَوَ ٰ⁠سِیَ وَأَنۢبَتۡنَا فِیهَا مِن كُلِّ شَیۡءࣲ مَّوۡزُونࣲ\n"
    }
  },
  {
    "id": 1822,
    "surahId": 15,
    "ayahNumber": 20,
    "arabicText": "وَجَعَلۡنَا لَكُمۡ فِیهَا مَعَـٰیِشَ وَمَن لَّسۡتُمۡ لَهُۥ بِرَ ٰ⁠زِقِینَ\n",
    "translations": {
      "en": "and provided thereon means of livelihood for you [O men] as well as for all [living beings] whose sustenance does not depend on you.",
      "ms": "Dan Kami jadikan untuk kamu pada bumi ini segala keperluan hidup, juga Kami jadikan makhluk-makhluk yang kamu bukanlah orang yang sebenar menyediakan rezekinya.",
      "id": "Dan Kami telah menjadikan untukmu di bumi keperluan-keperluan hidup, dan (Kami menciptakan pula) makhluk-makhluk yang kamu sekali-kali bukan pemberi rezeki kepadanya.",
      "ar": "وَجَعَلۡنَا لَكُمۡ فِیهَا مَعَـٰیِشَ وَمَن لَّسۡتُمۡ لَهُۥ بِرَ ٰ⁠زِقِینَ\n"
    }
  },
  {
    "id": 1823,
    "surahId": 15,
    "ayahNumber": 21,
    "arabicText": "وَإِن مِّن شَیۡءٍ إِلَّا عِندَنَا خَزَاۤىِٕنُهُۥ وَمَا نُنَزِّلُهُۥۤ إِلَّا بِقَدَرࣲ مَّعۡلُومࣲ\n",
    "translations": {
      "en": "For, no single thing exists that does not have its source with Us; and nought do We bestow from on high unless it be in accordance with a measure well-defined.",
      "ms": "Dan tidak ada sesuatupun melainkan pada sisi Kami sahaja perbendaharaannya dan Kami tidak menurunkannya melainkan dengan menurut kadar dan masa yang tertentu.",
      "id": "Dan tidak ada sesuatupun melainkan pada sisi Kami-lah khazanahnya; dan Kami tidak menurunkannya melainkan dengan ukuran yang tertentu.",
      "ar": "وَإِن مِّن شَیۡءٍ إِلَّا عِندَنَا خَزَاۤىِٕنُهُۥ وَمَا نُنَزِّلُهُۥۤ إِلَّا بِقَدَرࣲ مَّعۡلُومࣲ\n"
    }
  },
  {
    "id": 1824,
    "surahId": 15,
    "ayahNumber": 22,
    "arabicText": "وَأَرۡسَلۡنَا ٱلرِّیَـٰحَ لَوَ ٰ⁠قِحَ فَأَنزَلۡنَا مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَسۡقَیۡنَـٰكُمُوهُ وَمَاۤ أَنتُمۡ لَهُۥ بِخَـٰزِنِینَ\n",
    "translations": {
      "en": "And We let loose the winds to fertilize [plants] and We send down water from the skies and let you drink thereof: and it is not you who dispose of its source-",
      "ms": "Dan Kami hantarkan angin sebagai pembawa air dan pemindah benih; maka dengan itu Kami menurunkan air (hujan) dari langit, kemudian Kami berikan kamu meminumnya; dan bukanlah kamu yang (berkuasa menurunkannya atau) menyimpannya.",
      "id": "Dan Kami telah meniupkan angin untuk mengawinkan (tumbuh-tumbuhan) dan Kami turunkan hujan dari langit, lalu Kami beri minum kamu dengan air itu, dan sekali-kali bukanlah kamu yang menyimpannya.",
      "ar": "وَأَرۡسَلۡنَا ٱلرِّیَـٰحَ لَوَ ٰ⁠قِحَ فَأَنزَلۡنَا مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَسۡقَیۡنَـٰكُمُوهُ وَمَاۤ أَنتُمۡ لَهُۥ بِخَـٰزِنِینَ\n"
    }
  },
  {
    "id": 1825,
    "surahId": 15,
    "ayahNumber": 23,
    "arabicText": "وَإِنَّا لَنَحۡنُ نُحۡیِۦ وَنُمِیتُ وَنَحۡنُ ٱلۡوَ ٰ⁠رِثُونَ\n",
    "translations": {
      "en": "for, behold, it is We-We alone -who grant life and deal death, and it is We alone who shall remain after all else will have passed away!",
      "ms": "Dan sesungguhnya Kamilah yang menghidupkan dan yang mematikan, dan Kamilah yang kekal memiliki segala-galanya.",
      "id": "Dan sesungguhnya benar-benar Kami-lah yang menghidupkan dan mematikan dan Kami (pulalah) yang mewarisi.",
      "ar": "وَإِنَّا لَنَحۡنُ نُحۡیِۦ وَنُمِیتُ وَنَحۡنُ ٱلۡوَ ٰ⁠رِثُونَ\n"
    }
  },
  {
    "id": 1826,
    "surahId": 15,
    "ayahNumber": 24,
    "arabicText": "وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَقۡدِمِینَ مِنكُمۡ وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَـٔۡخِرِینَ\n",
    "translations": {
      "en": "And well do We know [the hearts and deeds of all human beings - both] those who lived before you and those who will come after you;",
      "ms": "Dan sesungguhnya Kami telah mengetahui orang-orang yang segera (berbakti) di antara kamu, dan sesungguhnya Kami telah mengetahui orang-orang yang lambat.",
      "id": "Dan sesungguhnya Kami telah mengetahui orang-orang yang terdahulu daripada-mu dan sesungguhnya Kami mengetahui pula orang-orang yang terkemudian (daripadamu).",
      "ar": "وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَقۡدِمِینَ مِنكُمۡ وَلَقَدۡ عَلِمۡنَا ٱلۡمُسۡتَـٔۡخِرِینَ\n"
    }
  },
  {
    "id": 1827,
    "surahId": 15,
    "ayahNumber": 25,
    "arabicText": "وَإِنَّ رَبَّكَ هُوَ یَحۡشُرُهُمۡۚ إِنَّهُۥ حَكِیمٌ عَلِیمࣱ\n",
    "translations": {
      "en": "and, behold, it is thy Sustainer who will gather them all together [on Judgment Day]: verily, He is wise, all-knowing!",
      "ms": "Dan sesungguhnya Tuhanmu, Dia lah yang menghimpunkan mereka semuanya; sesungguhnya Ia Maha Bijaksana, lagi Maha Mengetahui.",
      "id": "Sesungguhnya Tuhanmu, Dialah yang akan menghimpunkan mereka. Sesungguhnya Dia adalah Maha Bijaksana lagi Maha Mengetahui.",
      "ar": "وَإِنَّ رَبَّكَ هُوَ یَحۡشُرُهُمۡۚ إِنَّهُۥ حَكِیمٌ عَلِیمࣱ\n"
    }
  },
  {
    "id": 1828,
    "surahId": 15,
    "ayahNumber": 26,
    "arabicText": "وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَـٰنَ مِن صَلۡصَـٰلࣲ مِّنۡ حَمَإࣲ مَّسۡنُونࣲ\n",
    "translations": {
      "en": "AND, INDEED, We have created man out of sounding clay, out of dark-slime transmuted",
      "ms": "Dan sesungguhnya Kami telah menciptakan manusia (Adam) dari tanah liat yang kering, yang berasal dari tanah kental yang berubah warna dan baunya.",
      "id": "Dan sesungguhnya Kami telah menciptakan manusia (Adam) dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk.",
      "ar": "وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَـٰنَ مِن صَلۡصَـٰلࣲ مِّنۡ حَمَإࣲ مَّسۡنُونࣲ\n"
    }
  },
  {
    "id": 1829,
    "surahId": 15,
    "ayahNumber": 27,
    "arabicText": "وَٱلۡجَاۤنَّ خَلَقۡنَـٰهُ مِن قَبۡلُ مِن نَّارِ ٱلسَّمُومِ\n",
    "translations": {
      "en": "whereas the invisible beings We had created, [long] before that, out of the fire of scorching winds.",
      "ms": "Dan jin pula, Kami jadikan dia sebelum itu, dari angin api yang panasnya menyerap ke liang bulu roma.",
      "id": "Dan Kami telah menciptakan jin sebelum (Adam) dari api yang sangat panas.",
      "ar": "وَٱلۡجَاۤنَّ خَلَقۡنَـٰهُ مِن قَبۡلُ مِن نَّارِ ٱلسَّمُومِ\n"
    }
  },
  {
    "id": 1830,
    "surahId": 15,
    "ayahNumber": 28,
    "arabicText": "وَإِذۡ قَالَ رَبُّكَ لِلۡمَلَـٰۤىِٕكَةِ إِنِّی خَـٰلِقُۢ بَشَرࣰا مِّن صَلۡصَـٰلࣲ مِّنۡ حَمَإࣲ مَّسۡنُونࣲ\n",
    "translations": {
      "en": "And lo! Thy Sustainer said unto the angels: \"Behold, I am about to create mortal man out of sounding clay, out of dark slime transmuted;",
      "ms": "Dan (ingatkanlah peristiwa) ketika Tuhanmu berfirman kepada malaikat: \"Sesungguhnya Aku hendak menciptakan manusia dari tanah liat yang kering, yang berasal dari tanah kental yang berubah warna dan baunya.",
      "id": "Dan (ingatlah), ketika Tuhanmu berfirman kepada para malaikat: \"Sesungguhnya Aku akan menciptakan seorang manusia dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk,",
      "ar": "وَإِذۡ قَالَ رَبُّكَ لِلۡمَلَـٰۤىِٕكَةِ إِنِّی خَـٰلِقُۢ بَشَرࣰا مِّن صَلۡصَـٰلࣲ مِّنۡ حَمَإࣲ مَّسۡنُونࣲ\n"
    }
  },
  {
    "id": 1831,
    "surahId": 15,
    "ayahNumber": 29,
    "arabicText": "فَإِذَا سَوَّیۡتُهُۥ وَنَفَخۡتُ فِیهِ مِن رُّوحِی فَقَعُوا۟ لَهُۥ سَـٰجِدِینَ\n",
    "translations": {
      "en": "and when I have formed him fully and breathed into him of My spirit, fall down before him in prostration!",
      "ms": "\"Kemudian apabila Aku sempurnakan kejadiannya, serta Aku tiupkan padanya roh dari (ciptaan) ku, maka hendaklah kamu sujud kepadanya.",
      "id": "Maka apabila Aku telah menyempurnakan kejadiannya, dan telah meniup kan kedalamnya ruh (ciptaan)-Ku, maka tunduklah kamu kepadanya dengan bersujud.",
      "ar": "فَإِذَا سَوَّیۡتُهُۥ وَنَفَخۡتُ فِیهِ مِن رُّوحِی فَقَعُوا۟ لَهُۥ سَـٰجِدِینَ\n"
    }
  },
  {
    "id": 1832,
    "surahId": 15,
    "ayahNumber": 30,
    "arabicText": "فَسَجَدَ ٱلۡمَلَـٰۤىِٕكَةُ كُلُّهُمۡ أَجۡمَعُونَ\n",
    "translations": {
      "en": "Thereupon the angels prostrated themselves, all of them together,",
      "ms": "(Setelah selesai kejadian Adam) maka sujudlah sekalian malaikat, semuanya sekali, -",
      "id": "Maka bersujudlah para malaikat itu semuanya bersama-sama,",
      "ar": "فَسَجَدَ ٱلۡمَلَـٰۤىِٕكَةُ كُلُّهُمۡ أَجۡمَعُونَ\n"
    }
  },
  {
    "id": 1833,
    "surahId": 15,
    "ayahNumber": 31,
    "arabicText": "إِلَّاۤ إِبۡلِیسَ أَبَىٰۤ أَن یَكُونَ مَعَ ٱلسَّـٰجِدِینَ\n",
    "translations": {
      "en": "save Iblis: he refused to be among those who prostrated themselves.",
      "ms": "Melainkan Iblis; ia enggan turut bersama mereka yang sujud.",
      "id": "kecuali iblis. Ia enggan ikut besama-sama (malaikat) yang sujud itu.",
      "ar": "إِلَّاۤ إِبۡلِیسَ أَبَىٰۤ أَن یَكُونَ مَعَ ٱلسَّـٰجِدِینَ\n"
    }
  },
  {
    "id": 1834,
    "surahId": 15,
    "ayahNumber": 32,
    "arabicText": "قَالَ یَـٰۤإِبۡلِیسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّـٰجِدِینَ\n",
    "translations": {
      "en": "Said He: \"O Iblis! What is thy reason for not being among those who have prostrated themselves?\"",
      "ms": "Allah berfirman: Hai Iblis, apa sebabnya engkau tidak turut bersama mereka yang sujud itu?\".",
      "id": "Allah berfirman: \"Hai iblis, apa sebabnya kamu tidak (ikut sujud) bersama-sama mereka yang sujud itu?\"",
      "ar": "قَالَ یَـٰۤإِبۡلِیسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّـٰجِدِینَ\n"
    }
  },
  {
    "id": 1835,
    "surahId": 15,
    "ayahNumber": 33,
    "arabicText": "قَالَ لَمۡ أَكُن لِّأَسۡجُدَ لِبَشَرٍ خَلَقۡتَهُۥ مِن صَلۡصَـٰلࣲ مِّنۡ حَمَإࣲ مَّسۡنُونࣲ\n",
    "translations": {
      "en": "[Iblis] replied: \"It is not for me to prostrate myself before mortal man whom Thou hast created out of sounding clay, out of dark slime transmuted!\"",
      "ms": "Iblis menjawab: \"Aku tidak patut sujud kepada manusia yang Engkau jadikan dia dari tanah liat yang kering, yang berasal dari tanah kental yang berubah warna dan baunya\".",
      "id": "Berkata Iblis: \"Aku sekali-kali tidak akan sujud kepada manusia yang Engkau telah menciptakannya dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk\"",
      "ar": "قَالَ لَمۡ أَكُن لِّأَسۡجُدَ لِبَشَرٍ خَلَقۡتَهُۥ مِن صَلۡصَـٰلࣲ مِّنۡ حَمَإࣲ مَّسۡنُونࣲ\n"
    }
  },
  {
    "id": 1836,
    "surahId": 15,
    "ayahNumber": 34,
    "arabicText": "قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِیمࣱ\n",
    "translations": {
      "en": "Said He: \"Go forth, then, from this [angelic state]: for, behold, thou art [henceforth] accursed,",
      "ms": "Allah berfirman: \"Kalau demikian, keluarlah engkau daripadanya, kerana sesungguhnya engkau dari sekarang ke masa depan adalah (satu makhluk yang) diusir.",
      "id": "Allah berfirman: \"Keluarlah dari surga, karena sesungguhnya kamu terkutuk,",
      "ar": "قَالَ فَٱخۡرُجۡ مِنۡهَا فَإِنَّكَ رَجِیمࣱ\n"
    }
  },
  {
    "id": 1837,
    "surahId": 15,
    "ayahNumber": 35,
    "arabicText": "وَإِنَّ عَلَیۡكَ ٱللَّعۡنَةَ إِلَىٰ یَوۡمِ ٱلدِّینِ\n",
    "translations": {
      "en": "and [My] rejection shall be thy due until the Day of Judgment!\"",
      "ms": "\"Dan sesungguhnya engkau ditimpa laknat terus-menerus hingga ke hari kiamat\".",
      "id": "dan sesungguhnya kutukan itu tetap menimpamu sampai hari kiamat\".",
      "ar": "وَإِنَّ عَلَیۡكَ ٱللَّعۡنَةَ إِلَىٰ یَوۡمِ ٱلدِّینِ\n"
    }
  },
  {
    "id": 1838,
    "surahId": 15,
    "ayahNumber": 36,
    "arabicText": "قَالَ رَبِّ فَأَنظِرۡنِیۤ إِلَىٰ یَوۡمِ یُبۡعَثُونَ\n",
    "translations": {
      "en": "Said [Iblis]: \"Then, O my Sustainer, grant me a respite till the Day when all shall be raised from the dead!\"",
      "ms": "Iblis berkata:\" Wahai Tuhanku! Jika demikian, berilah tempoh kepadaku hingga ke hari mereka dibangitkan (hari kiamat)\".",
      "id": "Berkata iblis: \"Ya Tuhanku, (kalau begitu) maka beri tangguhlah kepadaku sampai hari (manusia) dibangkitkan,",
      "ar": "قَالَ رَبِّ فَأَنظِرۡنِیۤ إِلَىٰ یَوۡمِ یُبۡعَثُونَ\n"
    }
  },
  {
    "id": 1839,
    "surahId": 15,
    "ayahNumber": 37,
    "arabicText": "قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِینَ\n",
    "translations": {
      "en": "Answered He: \"Verily, so be it: thou shalt be among those who are granted respite",
      "ms": "Allah berfirman: \"Dengan permohonanmu itu, maka sesungguhnya engkau dari golongan yang diberi tempoh.",
      "id": "Allah berfirman: \"(Kalau begitu) maka sesungguhnya kamu termasuk orang-orang yang diberi tangguh,",
      "ar": "قَالَ فَإِنَّكَ مِنَ ٱلۡمُنظَرِینَ\n"
    }
  },
  {
    "id": 1840,
    "surahId": 15,
    "ayahNumber": 38,
    "arabicText": "إِلَىٰ یَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ\n",
    "translations": {
      "en": "till the Day the time whereof is known [to Me alone].\"",
      "ms": "\"Hingga ke hari - masa yang termaklum\".",
      "id": "sampai hari (suatu) waktu yang telah ditentukan,",
      "ar": "إِلَىٰ یَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ\n"
    }
  },
  {
    "id": 1841,
    "surahId": 15,
    "ayahNumber": 39,
    "arabicText": "قَالَ رَبِّ بِمَاۤ أَغۡوَیۡتَنِی لَأُزَیِّنَنَّ لَهُمۡ فِی ٱلۡأَرۡضِ وَلَأُغۡوِیَنَّهُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "[Whereupon Iblis] said: \"O my Sustainer! Since Thou hast thwarted me, I shall indeed make [all that is evil] on earth seem goodly to them, and shall most certainly beguile them-into grievous error -",
      "ms": "Iblis berkata: \" Wahai Tuhanku! Kerana Engkau telah menjadikan daku sesat, (maka) demi sesungguhnya aku akan memperelokkan segala jenis maksiat kepada Adam dan zuriatnya di dunia ini, dan aku akan menyesatkan mereka semuanya,",
      "id": "Iblis berkata: \"Ya Tuhanku, oleh sebab Engkau telah memutuskan bahwa aku sesat, pasti aku akan menjadikan mereka memandang baik (perbuatan maksiat) di muka bumi, dan pasti aku akan menyesatkan mereka semuanya,",
      "ar": "قَالَ رَبِّ بِمَاۤ أَغۡوَیۡتَنِی لَأُزَیِّنَنَّ لَهُمۡ فِی ٱلۡأَرۡضِ وَلَأُغۡوِیَنَّهُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 1842,
    "surahId": 15,
    "ayahNumber": 40,
    "arabicText": "إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِینَ\n",
    "translations": {
      "en": "[all] save such of them as are truly Thy servants!\"",
      "ms": "\"Kecuali di antara zuriat-zuriat Adam itu hamba-hambaMu yang dibersihkan dari sebarang syirik\".",
      "id": "kecuali hamba-hamba Engkau yang mukhlis di antara mereka\".",
      "ar": "إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِینَ\n"
    }
  },
  {
    "id": 1843,
    "surahId": 15,
    "ayahNumber": 41,
    "arabicText": "قَالَ هَـٰذَا صِرَ ٰ⁠طٌ عَلَیَّ مُسۡتَقِیمٌ\n",
    "translations": {
      "en": "Said He: \"This is, with Me. a straight way:",
      "ms": "Allah berfirman: \"Inilah satu jalan yang lurus, yang tetap Aku memeliharanya.",
      "id": "Allah berfirman: \"Ini adalah jalan yang lurus, kewajiban Aku-lah (menjaganya).",
      "ar": "قَالَ هَـٰذَا صِرَ ٰ⁠طٌ عَلَیَّ مُسۡتَقِیمٌ\n"
    }
  },
  {
    "id": 1844,
    "surahId": 15,
    "ayahNumber": 42,
    "arabicText": "إِنَّ عِبَادِی لَیۡسَ لَكَ عَلَیۡهِمۡ سُلۡطَـٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلۡغَاوِینَ\n",
    "translations": {
      "en": "verily, thou shalt have no power over My creatures- unless it be such as are [already] lost in grievous error and follow thee [of their own will]:",
      "ms": "\"Sesungguhnya hamba-hambaKu, tidaklah ada bagimu sebarang kuasa untuk menyesatkan mereka, kecuali sesiapa yang menurutmu dari orang-orang yang sesat (dengan pilihannya sendiri).",
      "id": "Sesungguhnya hamba-hamba-Ku tidak ada kekuasaan bagimu terhadap mereka, kecuali orang-orang yang mengikut kamu, yaitu orang-orang yang sesat.",
      "ar": "إِنَّ عِبَادِی لَیۡسَ لَكَ عَلَیۡهِمۡ سُلۡطَـٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلۡغَاوِینَ\n"
    }
  },
  {
    "id": 1845,
    "surahId": 15,
    "ayahNumber": 43,
    "arabicText": "وَإِنَّ جَهَنَّمَ لَمَوۡعِدُهُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "and for all such, behold, hell is the promised goal.",
      "ms": "\"Dan sesungguhnya neraka Jahannam itu, tempat yang dijanjikan bagi sekalian mereka (yang menurutmu).",
      "id": "Dan sesungguhnya Jahannam itu benar-benar tempat yang telah diancamkan kepada mereka (pengikut-pengikut syaitan) semuanya.",
      "ar": "وَإِنَّ جَهَنَّمَ لَمَوۡعِدُهُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 1846,
    "surahId": 15,
    "ayahNumber": 44,
    "arabicText": "لَهَا سَبۡعَةُ أَبۡوَ ٰ⁠بࣲ لِّكُلِّ بَابࣲ مِّنۡهُمۡ جُزۡءࣱ مَّقۡسُومٌ\n",
    "translations": {
      "en": "with seven gates leading into it, each gate receiving its allotted share of sinners. -",
      "ms": "\"Ia mempunyai tujuh pintu; bagi tiap-tiap sebuah pintu ada bahagian yang tertentu dari mereka (yang sesat dan menyesatkan itu)\".",
      "id": "Jahannam itu mempunyai tujuh pintu. Tiap-tiap pintu (telah ditetapkan) untuk golongan yang tertentu dari mereka.",
      "ar": "لَهَا سَبۡعَةُ أَبۡوَ ٰ⁠بࣲ لِّكُلِّ بَابࣲ مِّنۡهُمۡ جُزۡءࣱ مَّقۡسُومٌ\n"
    }
  },
  {
    "id": 1847,
    "surahId": 15,
    "ayahNumber": 45,
    "arabicText": "إِنَّ ٱلۡمُتَّقِینَ فِی جَنَّـٰتࣲ وَعُیُونٍ\n",
    "translations": {
      "en": "VERILY, those who are conscious of God [shall find themselves in the hereafter] amidst gardens and springs,",
      "ms": "Sesungguhnya orang-orang yang bertaqwa adalah ditempatkan di dalam beberapa taman Syurga, dengan matair-matair terpancar padanya.",
      "id": "Sesungguhnya orang-orang yang bertakwa itu berada dalam surga (taman-taman) dan (di dekat) mata air-mata air (yang mengalir).",
      "ar": "إِنَّ ٱلۡمُتَّقِینَ فِی جَنَّـٰتࣲ وَعُیُونٍ\n"
    }
  },
  {
    "id": 1848,
    "surahId": 15,
    "ayahNumber": 46,
    "arabicText": "ٱدۡخُلُوهَا بِسَلَـٰمٍ ءَامِنِینَ\n",
    "translations": {
      "en": "[having been received with the greeting,] \"Enter here in peace, secure!\"",
      "ms": "(Mereka dipersilakan oleh malaikat dengan berkata): \"Masuklah kamu ke dalamnya dengan selamat sejahtera serta beroleh aman\".",
      "id": "(Dikatakan kepada mereka): \"Masuklah ke dalamnya dengan sejahtera lagi aman\"",
      "ar": "ٱدۡخُلُوهَا بِسَلَـٰمٍ ءَامِنِینَ\n"
    }
  },
  {
    "id": 1849,
    "surahId": 15,
    "ayahNumber": 47,
    "arabicText": "وَنَزَعۡنَا مَا فِی صُدُورِهِم مِّنۡ غِلٍّ إِخۡوَ ٰ⁠نًا عَلَىٰ سُرُرࣲ مُّتَقَـٰبِلِینَ\n",
    "translations": {
      "en": "And [by then] We shall have removed whatever unworthy thoughts or feelings may have been [lingering] in their breasts, [and they shall rest] as brethren, facing one another [in love] upon thrones of happiness.",
      "ms": "Dan Kami cabut akan apa yang ada dihati mereka dari perasaan hasad dengki sehingga menjadilah mereka bersaudara (dalam suasana kasih mesra), serta mereka duduk berhadap-hadapan di atas pelamin masing-masing.",
      "id": "Dan Kami lenyapkan segala rasa dendam yang berada dalam hati mereka, sedang mereka merasa bersaudara duduk berhadap-hadapan di atas dipan-dipan.",
      "ar": "وَنَزَعۡنَا مَا فِی صُدُورِهِم مِّنۡ غِلٍّ إِخۡوَ ٰ⁠نًا عَلَىٰ سُرُرࣲ مُّتَقَـٰبِلِینَ\n"
    }
  },
  {
    "id": 1850,
    "surahId": 15,
    "ayahNumber": 48,
    "arabicText": "لَا یَمَسُّهُمۡ فِیهَا نَصَبࣱ وَمَا هُم مِّنۡهَا بِمُخۡرَجِینَ\n",
    "translations": {
      "en": "No weariness shall ever touch them in this [state of bliss], and never shall they have to forgo it.",
      "ms": "Mereka tidak akan disentuh susah payah dalam Syurga itu, dan mereka pula tidak sekali-kali akan dikeluarkan daripadanya.",
      "id": "Mereka tidak merasa lelah di dalamnya dan mereka sekali-kali tidak akan dikeluarkan daripadanya.",
      "ar": "لَا یَمَسُّهُمۡ فِیهَا نَصَبࣱ وَمَا هُم مِّنۡهَا بِمُخۡرَجِینَ\n"
    }
  },
  {
    "id": 1851,
    "surahId": 15,
    "ayahNumber": 49,
    "arabicText": "۞ نَبِّئۡ عِبَادِیۤ أَنِّیۤ أَنَا ٱلۡغَفُورُ ٱلرَّحِیمُ\n",
    "translations": {
      "en": "Tell My servants that I - I alone - am truly forgiving, a true dispenser of grace;",
      "ms": "Khabarkanlah kepada hamba-hambaKu (wahai Muhammad), bahawa Akulah Yang Maha Pengampun lagi Maha Mengasihani (bagi mereka yang bertaubat dan beramal soleh).",
      "id": "Kabarkanlah kepada hamba-hamba-Ku, bahwa sesungguhnya Aku-lah Yang Maha Pengampun lagi Maha Penyayang,",
      "ar": "۞ نَبِّئۡ عِبَادِیۤ أَنِّیۤ أَنَا ٱلۡغَفُورُ ٱلرَّحِیمُ\n"
    }
  },
  {
    "id": 1852,
    "surahId": 15,
    "ayahNumber": 50,
    "arabicText": "وَأَنَّ عَذَابِی هُوَ ٱلۡعَذَابُ ٱلۡأَلِیمُ\n",
    "translations": {
      "en": "and [also,] that the suffering which I shall impose [on sinners] will indeed be a suffering most grievous.",
      "ms": "Dan bahawa azabKu, ialah azab yang tidak terperi sakitnya, (bagi mereka yang tetap dalam kederhakaannya).",
      "id": "dan bahwa sesungguhnya azab-Ku adalah azab yang sangat pedih.",
      "ar": "وَأَنَّ عَذَابِی هُوَ ٱلۡعَذَابُ ٱلۡأَلِیمُ\n"
    }
  },
  {
    "id": 1853,
    "surahId": 15,
    "ayahNumber": 51,
    "arabicText": "وَنَبِّئۡهُمۡ عَن ضَیۡفِ إِبۡرَ ٰ⁠هِیمَ\n",
    "translations": {
      "en": "AND TELL THEM [once again] about Abraham's guests -",
      "ms": "Dan khabarkanlah kepada mereka perihal tetamu Nabi Ibrahim.",
      "id": "Dan kabarkanlah kepada mereka tentang tamu-tamu Ibrahim.",
      "ar": "وَنَبِّئۡهُمۡ عَن ضَیۡفِ إِبۡرَ ٰ⁠هِیمَ\n"
    }
  },
  {
    "id": 1854,
    "surahId": 15,
    "ayahNumber": 52,
    "arabicText": "إِذۡ دَخَلُوا۟ عَلَیۡهِ فَقَالُوا۟ سَلَـٰمࣰا قَالَ إِنَّا مِنكُمۡ وَجِلُونَ\n",
    "translations": {
      "en": "[how,] when they presented themselves before him and bade him peace, he answered: \"Behold, we are afraid of you!\"",
      "ms": "Ketika mereka masuk mendapatkannya lalu memberi salam dengan berkata: \"Selamat sejahtera kepadamu!\" Ia berkata: \"Sesungguhnya kami berasa takut kepada kamu\".",
      "id": "Ketika mereka masuk ke tempatnya, lalu mereka mengucapkan: \"Salaam\". Berkata Ibrahim: \"Sesungguhnya kami merasa takut kepadamu\".",
      "ar": "إِذۡ دَخَلُوا۟ عَلَیۡهِ فَقَالُوا۟ سَلَـٰمࣰا قَالَ إِنَّا مِنكُمۡ وَجِلُونَ\n"
    }
  },
  {
    "id": 1855,
    "surahId": 15,
    "ayahNumber": 53,
    "arabicText": "قَالُوا۟ لَا تَوۡجَلۡ إِنَّا نُبَشِّرُكَ بِغُلَـٰمٍ عَلِیمࣲ\n",
    "translations": {
      "en": "Said they: \"Fear not! Behold, we bring thee the glad tiding of [the birth of] a son who will be endowed with deep knowledge.\"",
      "ms": "Mereka menjawab: \"Janganlah engkau takut, sebenarnya kami hendak mengembirakanmu dengan berita bahawa engkau akan beroleh seorang anak lelaki yang bakal menjadi seorang yang berilmu\".",
      "id": "Mereka berkata: \"Janganlah kamu merasa takut, sesungguhnya kami memberi kabar gembira kepadamu dengan (kelahiran seorang) anak laki-laki (yang akan menjadi) orang yang alim\".",
      "ar": "قَالُوا۟ لَا تَوۡجَلۡ إِنَّا نُبَشِّرُكَ بِغُلَـٰمٍ عَلِیمࣲ\n"
    }
  },
  {
    "id": 1856,
    "surahId": 15,
    "ayahNumber": 54,
    "arabicText": "قَالَ أَبَشَّرۡتُمُونِی عَلَىٰۤ أَن مَّسَّنِیَ ٱلۡكِبَرُ فَبِمَ تُبَشِّرُونَ\n",
    "translations": {
      "en": "Said he: \"Do you give me this glad tiding despite the fact that old age has overtaken me? Of what [strange thing], then, are you giving me a tiding!\"",
      "ms": "Nabi Ibrahim berkata: \"Betulkah kamu mengembirakan daku (dengan berita yang demikian), padahal aku telah tua; maka dengan jalan apakah kamu mengembirakan daku?\"",
      "id": "Berkata Ibrahim: \"Apakah kamu memberi kabar gembira kepadaku padahal usiaku telah lanjut, maka dengan cara bagaimanakah (terlaksananya) berita gembira yang kamu kabarkan ini?\"",
      "ar": "قَالَ أَبَشَّرۡتُمُونِی عَلَىٰۤ أَن مَّسَّنِیَ ٱلۡكِبَرُ فَبِمَ تُبَشِّرُونَ\n"
    }
  },
  {
    "id": 1857,
    "surahId": 15,
    "ayahNumber": 55,
    "arabicText": "قَالُوا۟ بَشَّرۡنَـٰكَ بِٱلۡحَقِّ فَلَا تَكُن مِّنَ ٱلۡقَـٰنِطِینَ\n",
    "translations": {
      "en": "They answered: \"We have given thee the glad tiding of something that is bound to come true. - so be not of those who abandon hope!\"",
      "ms": "Mereka menjawab: \"Kami mengembirakanmu dengan jalan yang sungguh benar; oleh itu janganlah engkau menjadi dari orang-orang yang berputus asa\".",
      "id": "Mereka menjawab: \"Kami menyampaikan kabar gembira kepadamu dengan benar, maka janganlah kamu termasuk orang-orang yang berputus asa\".",
      "ar": "قَالُوا۟ بَشَّرۡنَـٰكَ بِٱلۡحَقِّ فَلَا تَكُن مِّنَ ٱلۡقَـٰنِطِینَ\n"
    }
  },
  {
    "id": 1858,
    "surahId": 15,
    "ayahNumber": 56,
    "arabicText": "قَالَ وَمَن یَقۡنَطُ مِن رَّحۡمَةِ رَبِّهِۦۤ إِلَّا ٱلضَّاۤلُّونَ\n",
    "translations": {
      "en": "[Abraham] exclaimed: \"And who-other than those who have utterly lost their way-could ever abandon the hope of his Sustainer's grace?\"",
      "ms": "Nabi Ibrahim berkata: \"Dan tiadalah sesiapa yang berputus asa dari rahmat Tuhannya melainkan orang-orang yang sesat\".",
      "id": "Ibrahim berkata: \"Tidak ada orang yang berputus asa dari rahmat Tuhan-nya, kecuali orang-orang yang sesat\".",
      "ar": "قَالَ وَمَن یَقۡنَطُ مِن رَّحۡمَةِ رَبِّهِۦۤ إِلَّا ٱلضَّاۤلُّونَ\n"
    }
  },
  {
    "id": 1859,
    "surahId": 15,
    "ayahNumber": 57,
    "arabicText": "قَالَ فَمَا خَطۡبُكُمۡ أَیُّهَا ٱلۡمُرۡسَلُونَ\n",
    "translations": {
      "en": "He added: \"And what [else] may you have in view, O you [heavenly] messengers?\"",
      "ms": "Nabi Ibrahim bertanya pula: \"Apa hal kamu wahai Utusan Tuhan?\"",
      "id": "Berkata (pula) Ibrahim: \"Apakah urusanmu yang penting (selain itu), hai para utusan?\"",
      "ar": "قَالَ فَمَا خَطۡبُكُمۡ أَیُّهَا ٱلۡمُرۡسَلُونَ\n"
    }
  },
  {
    "id": 1860,
    "surahId": 15,
    "ayahNumber": 58,
    "arabicText": "قَالُوۤا۟ إِنَّاۤ أُرۡسِلۡنَاۤ إِلَىٰ قَوۡمࣲ مُّجۡرِمِینَ\n",
    "translations": {
      "en": "They answered: \"We are sent to people lost in sin [who are to be destroyed],",
      "ms": "Mereka menjawab: \"Kami diutus kepada suatu kaum yang berdosa (untuk membinasakan mereka)\".",
      "id": "Mereka menjawab: \"Kami sesungguhnya diutus kepada kaum yang berdosa,",
      "ar": "قَالُوۤا۟ إِنَّاۤ أُرۡسِلۡنَاۤ إِلَىٰ قَوۡمࣲ مُّجۡرِمِینَ\n"
    }
  },
  {
    "id": 1861,
    "surahId": 15,
    "ayahNumber": 59,
    "arabicText": "إِلَّاۤ ءَالَ لُوطٍ إِنَّا لَمُنَجُّوهُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "barring Lot's household, all of whom, behold, we shall save -",
      "ms": "\"Melainkan keluarga Nabi Lut; sesungguhnya kami akan menyelamatkan mereka semuanya, -",
      "id": "kecuali Luth beserta pengikut-pengikutnya. Sesungguhnya Kami akan menyelamatkan mereka semuanya,",
      "ar": "إِلَّاۤ ءَالَ لُوطٍ إِنَّا لَمُنَجُّوهُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 1862,
    "surahId": 15,
    "ayahNumber": 60,
    "arabicText": "إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَاۤ إِنَّهَا لَمِنَ ٱلۡغَـٰبِرِینَ\n",
    "translations": {
      "en": "excepting only his wife, [of whom God says,] `We have ordained [that], behold, she should be among those who stay behind!'",
      "ms": "\"Kecuali isterinya; kami telah tentukan (menurut keputusan Tuhan) sesungguhnya ia dari orang-orang yang tinggal (menerima kebinasaan)\".",
      "id": "kecuali istrinya. Kami telah menentukan, bahwa sesungguhnya ia itu termasuk orang-orang yang tertinggal (bersama-sama dengan orang kafir lainnya)\".",
      "ar": "إِلَّا ٱمۡرَأَتَهُۥ قَدَّرۡنَاۤ إِنَّهَا لَمِنَ ٱلۡغَـٰبِرِینَ\n"
    }
  },
  {
    "id": 1863,
    "surahId": 15,
    "ayahNumber": 61,
    "arabicText": "فَلَمَّا جَاۤءَ ءَالَ لُوطٍ ٱلۡمُرۡسَلُونَ\n",
    "translations": {
      "en": "AND WHEN the messengers [of God] came to the house of Lot,",
      "ms": "Maka apabila (malaikat-malaikat) utusan itu datang kepada kaum Nabi Lut,",
      "id": "Maka tatkala para utusan itu datang kepada kaum Luth, beserta pengikut pengikutnya,",
      "ar": "فَلَمَّا جَاۤءَ ءَالَ لُوطٍ ٱلۡمُرۡسَلُونَ\n"
    }
  },
  {
    "id": 1864,
    "surahId": 15,
    "ayahNumber": 62,
    "arabicText": "قَالَ إِنَّكُمۡ قَوۡمࣱ مُّنكَرُونَ\n",
    "translations": {
      "en": "he said: \"Behold, you are people unknown [here]!\"",
      "ms": "Nabi Lut berkata: \"Sesungguhnya kamu suatu kaum yang tidak dikenali (serta tidak diketahui baiknya kedatangan kamu)\".",
      "id": "ia berkata: \"Sesungguhnya kamu adalah orang-orang yang tidak dikenal\".",
      "ar": "قَالَ إِنَّكُمۡ قَوۡمࣱ مُّنكَرُونَ\n"
    }
  },
  {
    "id": 1865,
    "surahId": 15,
    "ayahNumber": 63,
    "arabicText": "قَالُوا۟ بَلۡ جِئۡنَـٰكَ بِمَا كَانُوا۟ فِیهِ یَمۡتَرُونَ\n",
    "translations": {
      "en": "They answered: \"Nay, but we have come unto thee with [the announcement of] something that they [who are given to evil] have always been wont to call in question,",
      "ms": "Mereka menjawab: \"(Kedatangan kami bukan untuk mendukacitakanmu) bahkan kami datang kepadamu untuk membawa azab yang mereka ragu-ragukan kebenarannya.",
      "id": "Para utusan menjawab: \"Sebenarnya kami ini datang kepadamu dengan membawa azab yang selalu mereka dustakan.",
      "ar": "قَالُوا۟ بَلۡ جِئۡنَـٰكَ بِمَا كَانُوا۟ فِیهِ یَمۡتَرُونَ\n"
    }
  },
  {
    "id": 1866,
    "surahId": 15,
    "ayahNumber": 64,
    "arabicText": "وَأَتَیۡنَـٰكَ بِٱلۡحَقِّ وَإِنَّا لَصَـٰدِقُونَ\n",
    "translations": {
      "en": "and we are bringing thee the certainty [of its fulfilment]: for, behold, we are speaking the truth indeed.",
      "ms": "\"Juga membawa kepadamu perkara yang benar (tentang kebinasaan mereka); dan sesungguhnya kami adalah orang-orang yang benar \".",
      "id": "Dan kami datang kepadamu membawa kebenaran dan sesungguhnya kami betul-betul orang-orang benar.",
      "ar": "وَأَتَیۡنَـٰكَ بِٱلۡحَقِّ وَإِنَّا لَصَـٰدِقُونَ\n"
    }
  },
  {
    "id": 1867,
    "surahId": 15,
    "ayahNumber": 65,
    "arabicText": "فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعࣲ مِّنَ ٱلَّیۡلِ وَٱتَّبِعۡ أَدۡبَـٰرَهُمۡ وَلَا یَلۡتَفِتۡ مِنكُمۡ أَحَدࣱ وَٱمۡضُوا۟ حَیۡثُ تُؤۡمَرُونَ\n",
    "translations": {
      "en": "Go, then., with thy household while it is yet night, with thyself following them in the rear; and let none of you look back, but proceed whither you are bidden.\"",
      "ms": "\"Oleh itu, bawalah pergi keluargamu pada waktu malam serta ikutlah di belakang mereka; dan janganlah seseorang pun di antara kamu berpaling (ke belakang); serta pergilah terus ke arah yang diperintahkan kamu menujunya\".",
      "id": "Maka pergilah kamu di akhir malam dengan membawa keluargamu, dan ikutlah mereka dari belakang dan janganlah seorangpun di antara kamu menoleh kebelakang dan teruskanlah perjalanan ke tempat yang di perintahkan kepadamu\".",
      "ar": "فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعࣲ مِّنَ ٱلَّیۡلِ وَٱتَّبِعۡ أَدۡبَـٰرَهُمۡ وَلَا یَلۡتَفِتۡ مِنكُمۡ أَحَدࣱ وَٱمۡضُوا۟ حَیۡثُ تُؤۡمَرُونَ\n"
    }
  },
  {
    "id": 1868,
    "surahId": 15,
    "ayahNumber": 66,
    "arabicText": "وَقَضَیۡنَاۤ إِلَیۡهِ ذَ ٰ⁠لِكَ ٱلۡأَمۡرَ أَنَّ دَابِرَ هَـٰۤؤُلَاۤءِ مَقۡطُوعࣱ مُّصۡبِحِینَ\n",
    "translations": {
      "en": "And [through Our messengers] We revealed unto him this decree: \"The last remnant of those [sinners] shall be wiped out\" in the morn.\"",
      "ms": "Dan Kami wahyukan kepadanya tentang kesudahan perkara itu; iaitu mereka akan dibinasakan pada waktu pagi, sehingga mereka punah ranah dan terputus keturunannya.",
      "id": "Dan telah Kami wahyukan kepadanya (Luth) perkara itu, yaitu bahwa mereka akan ditumpas habis di waktu subuh.",
      "ar": "وَقَضَیۡنَاۤ إِلَیۡهِ ذَ ٰ⁠لِكَ ٱلۡأَمۡرَ أَنَّ دَابِرَ هَـٰۤؤُلَاۤءِ مَقۡطُوعࣱ مُّصۡبِحِینَ\n"
    }
  },
  {
    "id": 1869,
    "surahId": 15,
    "ayahNumber": 67,
    "arabicText": "وَجَاۤءَ أَهۡلُ ٱلۡمَدِینَةِ یَسۡتَبۡشِرُونَ\n",
    "translations": {
      "en": "And the people of the city came [unto Lot], rejoicing at the glad tiding.",
      "ms": "Dan (semasa kedatangan mereka) datanglah penduduk bandar itu dengan gembira.",
      "id": "Dan datanglah penduduk kota itu (ke rumah Luth) dengan gembira (karena) kedatangan tamu-tamu itu.",
      "ar": "وَجَاۤءَ أَهۡلُ ٱلۡمَدِینَةِ یَسۡتَبۡشِرُونَ\n"
    }
  },
  {
    "id": 1870,
    "surahId": 15,
    "ayahNumber": 68,
    "arabicText": "قَالَ إِنَّ هَـٰۤؤُلَاۤءِ ضَیۡفِی فَلَا تَفۡضَحُونِ\n",
    "translations": {
      "en": "Exclaimed [Lot]: \"Behold, these are my guests: so put me not to shame,",
      "ms": "Nabi Lut berkata: \"Sesungguhnya mereka ini tetamuku, maka janganlah kamu memberi malu kepadaku\".",
      "id": "Luth berkata: \"Sesungguhnya mereka adalah tamuku; maka janganlah kamu memberi malu (kepadaku),",
      "ar": "قَالَ إِنَّ هَـٰۤؤُلَاۤءِ ضَیۡفِی فَلَا تَفۡضَحُونِ\n"
    }
  },
  {
    "id": 1871,
    "surahId": 15,
    "ayahNumber": 69,
    "arabicText": "وَٱتَّقُوا۟ ٱللَّهَ وَلَا تُخۡزُونِ\n",
    "translations": {
      "en": "but be conscious of God and disgrace me not!\"",
      "ms": "\"Dan takutlah kamu kepada Allah serta janganlah kamu menghinakan daku\".",
      "id": "dan bertakwalah kepada Allah dan janganlah kamu membuat aku terhina\".",
      "ar": "وَٱتَّقُوا۟ ٱللَّهَ وَلَا تُخۡزُونِ\n"
    }
  },
  {
    "id": 1872,
    "surahId": 15,
    "ayahNumber": 70,
    "arabicText": "قَالُوۤا۟ أَوَلَمۡ نَنۡهَكَ عَنِ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "They answered: \"Have we not forbidden thee [to offer protection] to any kind of people?\"",
      "ms": "Mereka menjawab: \"Bukankah kami telah melarangmu jangan menerima sebarang tetamu dari orang ramai (atau memberi perlindungan kepada mereka)?\"",
      "id": "Mereka berkata: \"Dan bukankah kami telah melarangmu dari (melindungi) manusia?\"",
      "ar": "قَالُوۤا۟ أَوَلَمۡ نَنۡهَكَ عَنِ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 1873,
    "surahId": 15,
    "ayahNumber": 71,
    "arabicText": "قَالَ هَـٰۤؤُلَاۤءِ بَنَاتِیۤ إِن كُنتُمۡ فَـٰعِلِینَ\n",
    "translations": {
      "en": "[Lot] said: \"[Take instead] these daughters of mine, if you must do [whatever you intend to do]!\"",
      "ms": "Nabi Lut berkata: \"Di sini ada anak-anak perempuanku, kalaulah kamu mahu melakukan (secara halal).",
      "id": "Luth berkata: \"Inilah puteri-puteriku (kawinlah dengan mereka), jika kamu hendak berbuat (secara yang halal)\".",
      "ar": "قَالَ هَـٰۤؤُلَاۤءِ بَنَاتِیۤ إِن كُنتُمۡ فَـٰعِلِینَ\n"
    }
  },
  {
    "id": 1874,
    "surahId": 15,
    "ayahNumber": 72,
    "arabicText": "لَعَمۡرُكَ إِنَّهُمۡ لَفِی سَكۡرَتِهِمۡ یَعۡمَهُونَ\n",
    "translations": {
      "en": "[But the angels spoke thus:] \"As thou livest, [O Lot, they will not listen to thee:] behold, in their delirium [of lust] they are but blindly stumbling to and fro!\"",
      "ms": "Demi umurmu (wahai Muhammad), sesungguhnya mereka membuta tuli dalam kemabukan maksiat mereka.",
      "id": "(Allah berfirman): \"Demi umurmu (Muhammad), sesungguhnya mereka terombang-ambing di dalam kemabukan (kesesatan)\".",
      "ar": "لَعَمۡرُكَ إِنَّهُمۡ لَفِی سَكۡرَتِهِمۡ یَعۡمَهُونَ\n"
    }
  },
  {
    "id": 1875,
    "surahId": 15,
    "ayahNumber": 73,
    "arabicText": "فَأَخَذَتۡهُمُ ٱلصَّیۡحَةُ مُشۡرِقِینَ\n",
    "translations": {
      "en": "And thereupon the blast [of Our punishment] overtook them at the time of sunrise,",
      "ms": "Akhirnya merekapun dibinasakan oleh letusan suara yang menggempakan bumi, ketika matahari terbit.",
      "id": "Maka mereka dibinasakan oleh suara keras yang mengguntur, ketika matahari akan terbit.",
      "ar": "فَأَخَذَتۡهُمُ ٱلصَّیۡحَةُ مُشۡرِقِینَ\n"
    }
  },
  {
    "id": 1876,
    "surahId": 15,
    "ayahNumber": 74,
    "arabicText": "فَجَعَلۡنَا عَـٰلِیَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَیۡهِمۡ حِجَارَةࣰ مِّن سِجِّیلٍ\n",
    "translations": {
      "en": "and We turned those [sinful towns} upside down, and rained down upon them stone-hard blows of chastisement pre-ordained.",
      "ms": "Maka Kami jadikan negeri kaum Lut itu tunggang-balik (tertimbus segala yang ada di muka buminya), dan kami hujani atasnya dengan batu dari tanah yang dibakar.",
      "id": "Maka Kami jadikan bahagian atas kota itu terbalik ke bawah dan Kami hujani mereka dengan batu dari tanah yang keras.",
      "ar": "فَجَعَلۡنَا عَـٰلِیَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَیۡهِمۡ حِجَارَةࣰ مِّن سِجِّیلٍ\n"
    }
  },
  {
    "id": 1877,
    "surahId": 15,
    "ayahNumber": 75,
    "arabicText": "إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّلۡمُتَوَسِّمِینَ\n",
    "translations": {
      "en": "Verily, in all this there are messages indeed for those who can read the signs:",
      "ms": "Sesungguhnya balasan azab yang demikian itu, mengandungi tanda-tanda bagi orang-orang yang kenalkan sesuatu serta memerhati dan memikirkannya.",
      "id": "Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang memperhatikan tanda-tanda.",
      "ar": "إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّلۡمُتَوَسِّمِینَ\n"
    }
  },
  {
    "id": 1878,
    "surahId": 15,
    "ayahNumber": 76,
    "arabicText": "وَإِنَّهَا لَبِسَبِیلࣲ مُّقِیمٍ\n",
    "translations": {
      "en": "for, behold, those [towns] stood by a road that still exists.",
      "ms": "Dan sesungguhnya negeri kaum Lut yang telah dibinasakan itu, terletak di jalan yang tetap (dilalui orang).",
      "id": "Dan sesungguhnya kota itu benar-benar terletak di jalan yang masih tetap (dilalui manusia).",
      "ar": "وَإِنَّهَا لَبِسَبِیلࣲ مُّقِیمٍ\n"
    }
  },
  {
    "id": 1879,
    "surahId": 15,
    "ayahNumber": 77,
    "arabicText": "إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "Verily, herein lies a message indeed for all who believe [in God].",
      "ms": "Sesungguhnya keadaan yang demikian, mengandungi satu tanda yang memberi kesedaran kepada orang-orang yang beriman.",
      "id": "Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang beriman.",
      "ar": "إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1880,
    "surahId": 15,
    "ayahNumber": 78,
    "arabicText": "وَإِن كَانَ أَصۡحَـٰبُ ٱلۡأَیۡكَةِ لَظَـٰلِمِینَ\n",
    "translations": {
      "en": "AND THE DWELLERS of the wooded dales [of Madyan, too,] were inveterate evildoers,",
      "ms": "Dan sebenarnya penduduk kampung \"Aikah\" adalah orang-orang yang berlaku zalim.",
      "id": "Dan sesungguhnya adalah penduduk Aikah itu benar-benar kaum yang zalim,",
      "ar": "وَإِن كَانَ أَصۡحَـٰبُ ٱلۡأَیۡكَةِ لَظَـٰلِمِینَ\n"
    }
  },
  {
    "id": 1881,
    "surahId": 15,
    "ayahNumber": 79,
    "arabicText": "فَٱنتَقَمۡنَا مِنۡهُمۡ وَإِنَّهُمَا لَبِإِمَامࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "and so We inflicted Our retribution on them. And, behold, both these [sinful communities] lived by a highway, [to this day] plain to see",
      "ms": "Maka Kami membalas kezaliman mereka itu dengan azab yang membinasakan; dan sesungguhnya kedua-duanya itu terletak di jalan yang terang (yang masih dilalui orang).",
      "id": "maka Kami membinasakan mereka. Dan sesungguhnya kedua kota itu benar-benar terletak di jalan umum yang terang.",
      "ar": "فَٱنتَقَمۡنَا مِنۡهُمۡ وَإِنَّهُمَا لَبِإِمَامࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 1882,
    "surahId": 15,
    "ayahNumber": 80,
    "arabicText": "وَلَقَدۡ كَذَّبَ أَصۡحَـٰبُ ٱلۡحِجۡرِ ٱلۡمُرۡسَلِینَ\n",
    "translations": {
      "en": "AND, [likewise,] indeed, the people of Al-Hijr gave the lie to [Our] message-bearers:",
      "ms": "Dan demi sesungguhnya penduduk \"Al-Hijr\" telah mendustakan Rasul-rasul.",
      "id": "Dan sesungguhnya penduduk-penduduk kota Al Hijr telah mendustakan rasul-rasul,",
      "ar": "وَلَقَدۡ كَذَّبَ أَصۡحَـٰبُ ٱلۡحِجۡرِ ٱلۡمُرۡسَلِینَ\n"
    }
  },
  {
    "id": 1883,
    "surahId": 15,
    "ayahNumber": 81,
    "arabicText": "وَءَاتَیۡنَـٰهُمۡ ءَایَـٰتِنَا فَكَانُوا۟ عَنۡهَا مُعۡرِضِینَ\n",
    "translations": {
      "en": "for We did vouchsafe them Our messages, but they obstinately turned their backs upon them-",
      "ms": "Dan Kami telah berikan kepada mereka tanda-tanda (yang membuktikan kebenaran ugama dan Rasul Kami); dalam pada itu, mereka terus juga berpaling (mengingkarinya).",
      "id": "dan Kami telah mendatangkan kepada mereka tanda-tanda (kekuasaan) Kami, tetapi mereka selalu berpaling daripadanya,",
      "ar": "وَءَاتَیۡنَـٰهُمۡ ءَایَـٰتِنَا فَكَانُوا۟ عَنۡهَا مُعۡرِضِینَ\n"
    }
  },
  {
    "id": 1884,
    "surahId": 15,
    "ayahNumber": 82,
    "arabicText": "وَكَانُوا۟ یَنۡحِتُونَ مِنَ ٱلۡجِبَالِ بُیُوتًا ءَامِنِینَ\n",
    "translations": {
      "en": "notwithstanding that they had been wont [to enjoy Our blessings and] to hew out dwellings from the mountains, [wherein they could live] in security",
      "ms": "Dan mereka memahat sebahagian dari gunung-ganang, sebagai tempat tinggal dengan keadaan aman (dari sesuatu bahaya).",
      "id": "dan mereka memahat rumah-rumah dari gunung-gunung batu (yang didiami) dengan aman.",
      "ar": "وَكَانُوا۟ یَنۡحِتُونَ مِنَ ٱلۡجِبَالِ بُیُوتًا ءَامِنِینَ\n"
    }
  },
  {
    "id": 1885,
    "surahId": 15,
    "ayahNumber": 83,
    "arabicText": "فَأَخَذَتۡهُمُ ٱلصَّیۡحَةُ مُصۡبِحِینَ\n",
    "translations": {
      "en": "and so the blast [of Our punishment] overtook them at early morn,",
      "ms": "Meskipun demikian, mereka dibinasakan juga oleh letusan suara yang menggempakan pada bumi waktu pagi.",
      "id": "Maka mereka dibinasakan oleh suara keras yang mengguntur di waktu pagi,",
      "ar": "فَأَخَذَتۡهُمُ ٱلصَّیۡحَةُ مُصۡبِحِینَ\n"
    }
  },
  {
    "id": 1886,
    "surahId": 15,
    "ayahNumber": 84,
    "arabicText": "فَمَاۤ أَغۡنَىٰ عَنۡهُم مَّا كَانُوا۟ یَكۡسِبُونَ\n",
    "translations": {
      "en": "and of no avail to them was all [the power] that they had acquired.",
      "ms": "Maka apa yang mereka telah usahakan itu, tidak dapat menolong mereka sedikit pun.",
      "id": "maka tak dapat menolong mereka, apa yang telah mereka usahakan.",
      "ar": "فَمَاۤ أَغۡنَىٰ عَنۡهُم مَّا كَانُوا۟ یَكۡسِبُونَ\n"
    }
  },
  {
    "id": 1887,
    "surahId": 15,
    "ayahNumber": 85,
    "arabicText": "وَمَا خَلَقۡنَا ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَمَا بَیۡنَهُمَاۤ إِلَّا بِٱلۡحَقِّۗ وَإِنَّ ٱلسَّاعَةَ لَـَٔاتِیَةࣱۖ فَٱصۡفَحِ ٱلصَّفۡحَ ٱلۡجَمِیلَ\n",
    "translations": {
      "en": "AND [remember:] We have not created the heavens and the earth and all that is between them without [an inner] truth; but, behold, the Hour [when this will become clear to all] is indeed yet to come. Hence, forgive [men's failings] with fair forbearance:",
      "ms": "Dan (ingatlah) tiadalah Kami mencipta langit dan bumi serta segala yang ada di antara keduanya itu, melainkan dengan cara yang sungguh layak dan berhikmat; dan sesungguhnya hari kiamat itu tetap akan datang; oleh itu biarkanlah (golongan kafir yang mendustakanmu itu wahai Muhammad) serta layanlah mereka dengan cara yang elok.",
      "id": "Dan tidaklah Kami ciptakan langit dan bumi dan apa yang ada di antara keduanya, melainkan dengan benar. Dan sesungguhnya saat (kiamat) itu pasti akan datang, maka maafkanlah (mereka) dengan cara yang baik.",
      "ar": "وَمَا خَلَقۡنَا ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَمَا بَیۡنَهُمَاۤ إِلَّا بِٱلۡحَقِّۗ وَإِنَّ ٱلسَّاعَةَ لَـَٔاتِیَةࣱۖ فَٱصۡفَحِ ٱلصَّفۡحَ ٱلۡجَمِیلَ\n"
    }
  },
  {
    "id": 1888,
    "surahId": 15,
    "ayahNumber": 86,
    "arabicText": "إِنَّ رَبَّكَ هُوَ ٱلۡخَلَّـٰقُ ٱلۡعَلِیمُ\n",
    "translations": {
      "en": "verily, thy Sustainer is the all-knowing Creator of all things!",
      "ms": "Sesungguhnya Tuhanmu, Dia lah yang menciptakan sekalian makhluk, lagi Yang Maha Mengetahui (akan hal mereka).",
      "id": "Sesungguhnya Tuhanmu, Dialah Yang Maha Pencipta lagi Maha Mengetahui.",
      "ar": "إِنَّ رَبَّكَ هُوَ ٱلۡخَلَّـٰقُ ٱلۡعَلِیمُ\n"
    }
  },
  {
    "id": 1889,
    "surahId": 15,
    "ayahNumber": 87,
    "arabicText": "وَلَقَدۡ ءَاتَیۡنَـٰكَ سَبۡعࣰا مِّنَ ٱلۡمَثَانِی وَٱلۡقُرۡءَانَ ٱلۡعَظِیمَ\n",
    "translations": {
      "en": "AND, INDEED, We have bestowed upon thee seven of the oft repeated [verses], and [have, thus, laid open before thee] this sublime Qur'an:",
      "ms": "Dan sesungguhnya Kami telah memberi kepadamu (wahai Muhammad) tujuh ayat yang diulang-ulang bacaannya dan seluruh Al-Quran yang amat besar kemuliaan dan faedahnya.",
      "id": "Dan sesungguhnya Kami telah berikan kepadamu tujuh ayat yang dibaca berulang-ulang dan Al Quran yang agung.",
      "ar": "وَلَقَدۡ ءَاتَیۡنَـٰكَ سَبۡعࣰا مِّنَ ٱلۡمَثَانِی وَٱلۡقُرۡءَانَ ٱلۡعَظِیمَ\n"
    }
  },
  {
    "id": 1890,
    "surahId": 15,
    "ayahNumber": 88,
    "arabicText": "لَا تَمُدَّنَّ عَیۡنَیۡكَ إِلَىٰ مَا مَتَّعۡنَا بِهِۦۤ أَزۡوَ ٰ⁠جࣰا مِّنۡهُمۡ وَلَا تَحۡزَنۡ عَلَیۡهِمۡ وَٱخۡفِضۡ جَنَاحَكَ لِلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "[so] turn, not thine eyes [longingly] towards the worldly benefits which We have granted unto some of those [that deny the truth]. And neither grieve over those [who refuse to heed thee], but spread the wings of thy tenderness over the believers,",
      "ms": "Janganlah engkau menujukan pandanganmu (serta menaruh hati) kepada nikmat kesenangan yang kami berikan kepada beberapa golongan di antara mereka (yang kafir itu) dan janganlah engkau merasa dukacita terhadap mereka (kerana mereka tidak beriman dan tidak dapat menguatkan Islam sebagaimana yang engkau harapkan); dan sebaliknya hendaklah engkau merendah diri kepada orang-orang yang beriman (sekalipun mereka dari golongan fakir miskin).",
      "id": "Janganlah sekali-kali kamu menunjukkan pandanganmu kepada kenikmatan hidup yang telah Kami berikan kepada beberapa golongan di antara mereka (orang-orang kafir itu), dan janganlah kamu bersedih hati terhadap mereka dan berendah dirilah kamu terhadap orang-orang yang beriman.",
      "ar": "لَا تَمُدَّنَّ عَیۡنَیۡكَ إِلَىٰ مَا مَتَّعۡنَا بِهِۦۤ أَزۡوَ ٰ⁠جࣰا مِّنۡهُمۡ وَلَا تَحۡزَنۡ عَلَیۡهِمۡ وَٱخۡفِضۡ جَنَاحَكَ لِلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1891,
    "surahId": 15,
    "ayahNumber": 89,
    "arabicText": "وَقُلۡ إِنِّیۤ أَنَا ٱلنَّذِیرُ ٱلۡمُبِینُ\n",
    "translations": {
      "en": "and say: \"Behold, I am indeed the plain warner [promised by God]!",
      "ms": "Dan katakanlah: \"Sesungguhnya aku ini, adalah seorang Rasul pemberi amaran dengan bukti-bukti yang nyata (tentang turunnya azab ke atas orang-orang yang ingkar)\".",
      "id": "Dan katakanlah: \"Sesungguhnya aku adalah pemberi peringatan yang menjelaskan\".",
      "ar": "وَقُلۡ إِنِّیۤ أَنَا ٱلنَّذِیرُ ٱلۡمُبِینُ\n"
    }
  },
  {
    "id": 1892,
    "surahId": 15,
    "ayahNumber": 90,
    "arabicText": "كَمَاۤ أَنزَلۡنَا عَلَى ٱلۡمُقۡتَسِمِینَ\n",
    "translations": {
      "en": "[For, thou art the bearer of a divine writ] such as We have bestowed from on high upon those who [afterwards] broke it up into parts,",
      "ms": "(Kami berikan kepadamu Al-Faatihah dan Al-Quran) samalah seperti Kami menurunkan (Kitab-kitab) kepada orang-orang yang membahagi-bahagi. -",
      "id": "Sebagaimana (Kami telah memberi peringatan), Kami telah menurunkan (azab) kepada orang-orang yang membagi-bagi (Kitab Allah),",
      "ar": "كَمَاۤ أَنزَلۡنَا عَلَى ٱلۡمُقۡتَسِمِینَ\n"
    }
  },
  {
    "id": 1893,
    "surahId": 15,
    "ayahNumber": 91,
    "arabicText": "ٱلَّذِینَ جَعَلُوا۟ ٱلۡقُرۡءَانَ عِضِینَ\n",
    "translations": {
      "en": "[and] who [now] declare this Qur'an to be [a tissue of] falsehoods!",
      "ms": "(Iaitu) mereka yang menjadikan Al-Quran terbahagi kepada beberapa bahagian (lalu mereka percaya kepada sebahagian dan menolak sebahagian yang lain).",
      "id": "(yaitu) orang-orang yang telah menjadikan Al Quran itu terbagi-bagi.",
      "ar": "ٱلَّذِینَ جَعَلُوا۟ ٱلۡقُرۡءَانَ عِضِینَ\n"
    }
  },
  {
    "id": 1894,
    "surahId": 15,
    "ayahNumber": 92,
    "arabicText": "فَوَرَبِّكَ لَنَسۡـَٔلَنَّهُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "But, by thy Sustainer! [On the Day of Judgment] We shall indeed call them to account, one and all,",
      "ms": "Demi Tuhanmu! Kami akan menyoal mereka (yang kafir itu) semuanya (pada hari kiamat kelak), -",
      "id": "Maka demi Tuhanmu, Kami pasti akan menanyai mereka semua,",
      "ar": "فَوَرَبِّكَ لَنَسۡـَٔلَنَّهُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 1895,
    "surahId": 15,
    "ayahNumber": 93,
    "arabicText": "عَمَّا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "for whatever they have done!",
      "ms": "Mengenai apa yang mereka telah lakukan.",
      "id": "tentang apa yang telah mereka kerjakan dahulu.",
      "ar": "عَمَّا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1896,
    "surahId": 15,
    "ayahNumber": 94,
    "arabicText": "فَٱصۡدَعۡ بِمَا تُؤۡمَرُ وَأَعۡرِضۡ عَنِ ٱلۡمُشۡرِكِینَ\n",
    "translations": {
      "en": "Hence, proclaim openly all that thou hast been bidden [to say], and leave alone all those who ascribe divinity to aught beside God:",
      "ms": "Oleh itu, sampaikanlah secara berterus-terang apa yang diperintahkan kepadamu (wahai Muhammad), dan janganlah engkau hiraukan bantahan dan tentangan kaum kafir musyrik itu.",
      "id": "Maka sampaikanlah olehmu secara terang-terangan segala apa yang diperintahkan (kepadamu) dan berpalinglah dari orang-orang yang musyrik.",
      "ar": "فَٱصۡدَعۡ بِمَا تُؤۡمَرُ وَأَعۡرِضۡ عَنِ ٱلۡمُشۡرِكِینَ\n"
    }
  },
  {
    "id": 1897,
    "surahId": 15,
    "ayahNumber": 95,
    "arabicText": "إِنَّا كَفَیۡنَـٰكَ ٱلۡمُسۡتَهۡزِءِینَ\n",
    "translations": {
      "en": "verily, We shall suffice thee against all who [now] deride [this message - all]",
      "ms": "Sesungguhnya Kami tetap memelihara dan mengawalmu dari kejahatan orang-orang yang mengejek-ejek dan mempersendakanmu, -",
      "id": "Sesungguhnya Kami memelihara kamu daripada (kejahatan) orang-orang yang memperolok-olokkan (kamu),",
      "ar": "إِنَّا كَفَیۡنَـٰكَ ٱلۡمُسۡتَهۡزِءِینَ\n"
    }
  },
  {
    "id": 1898,
    "surahId": 15,
    "ayahNumber": 96,
    "arabicText": "ٱلَّذِینَ یَجۡعَلُونَ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَۚ فَسَوۡفَ یَعۡلَمُونَ\n",
    "translations": {
      "en": "who assert that there are, side by side with God, other divine powers as well: for in time they will come to know [the truth].",
      "ms": "(Iaitu) mereka yang mengadakan tuhan yang lain bersama-sama Allah, maka mereka akan mengetahui kelak (akibatnya).",
      "id": "(Yaitu) orang-orang yang menganggap adanya tuhan yang lain di samping Allah; maka mereka kelak akan mengetahui (akibat-akibatnya).",
      "ar": "ٱلَّذِینَ یَجۡعَلُونَ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَۚ فَسَوۡفَ یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 1899,
    "surahId": 15,
    "ayahNumber": 97,
    "arabicText": "وَلَقَدۡ نَعۡلَمُ أَنَّكَ یَضِیقُ صَدۡرُكَ بِمَا یَقُولُونَ\n",
    "translations": {
      "en": "And well do We know that thy bosom is constricted by the [blasphemous] things that they say:",
      "ms": "Dan demi sesungguhnya Kami mengetahui, bahawa engkau bersusah hati dengan sebab apa yang mereka katakan.",
      "id": "Dan Kami sungguh-sungguh mengetahui, bahwa dadamu menjadi sempit disebabkan apa yang mereka ucapkan,",
      "ar": "وَلَقَدۡ نَعۡلَمُ أَنَّكَ یَضِیقُ صَدۡرُكَ بِمَا یَقُولُونَ\n"
    }
  },
  {
    "id": 1900,
    "surahId": 15,
    "ayahNumber": 98,
    "arabicText": "فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَكُن مِّنَ ٱلسَّـٰجِدِینَ\n",
    "translations": {
      "en": "but extol thou thy Sustainer's limitless glory and praise Him, and be of those who prostrate themselves [before Him] in adoration,",
      "ms": "Oleh itu, bertasbihlah engkau dengan memuji Tuhanmu, serta jadilah dari orang-orang yang sujud.",
      "id": "maka bertasbihlah dengan memuji Tuhanmu dan jadilah kamu di antara orang-orang yang bersujud (shalat),",
      "ar": "فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَكُن مِّنَ ٱلسَّـٰجِدِینَ\n"
    }
  },
  {
    "id": 1901,
    "surahId": 15,
    "ayahNumber": 99,
    "arabicText": "وَٱعۡبُدۡ رَبَّكَ حَتَّىٰ یَأۡتِیَكَ ٱلۡیَقِینُ\n",
    "translations": {
      "en": "and worship thy Sustainer till death comes to thee.",
      "ms": "Dan sembahlah Tuhanmu, sehingga datang kepadamu (perkara yang tetap) yakin.",
      "id": "dan sembahlah Tuhanmu sampai datang kepadamu yang diyakini (ajal).",
      "ar": "وَٱعۡبُدۡ رَبَّكَ حَتَّىٰ یَأۡتِیَكَ ٱلۡیَقِینُ\n"
    }
  }
]