[
  {
    "id": 1474,
    "surahId": 11,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ كِتَـٰبٌ أُحۡكِمَتۡ ءَایَـٰتُهُۥ ثُمَّ فُصِّلَتۡ مِن لَّدُنۡ حَكِیمٍ خَبِیرٍ\n",
    "translations": {
      "en": "Alif. Lam. Ra. A DIVINE WRIT [is this], with messages that have been made clear in and by themselves, and have been distinctly spelled out as well - [bestowed upon you] out of the grace of One who is wise, all-aware,",
      "ms": "",
      "id": "",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ كِتَـٰبٌ أُحۡكِمَتۡ ءَایَـٰتُهُۥ ثُمَّ فُصِّلَتۡ مِن لَّدُنۡ حَكِیمٍ خَبِیرٍ\n"
    }
  },
  {
    "id": 1475,
    "surahId": 11,
    "ayahNumber": 2,
    "arabicText": "أَلَّا تَعۡبُدُوۤا۟ إِلَّا ٱللَّهَۚ إِنَّنِی لَكُم مِّنۡهُ نَذِیرࣱ وَبَشِیرࣱ\n",
    "translations": {
      "en": "so that you may worship none but God. [Say, O Prophet:] \"Behold, I come unto you from Him [as] a warner and a bearer of glad tidings:",
      "ms": "",
      "id": "",
      "ar": "أَلَّا تَعۡبُدُوۤا۟ إِلَّا ٱللَّهَۚ إِنَّنِی لَكُم مِّنۡهُ نَذِیرࣱ وَبَشِیرࣱ\n"
    }
  },
  {
    "id": 1476,
    "surahId": 11,
    "ayahNumber": 3,
    "arabicText": "وَأَنِ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِ یُمَتِّعۡكُم مَّتَـٰعًا حَسَنًا إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى وَیُؤۡتِ كُلَّ ذِی فَضۡلࣲ فَضۡلَهُۥۖ وَإِن تَوَلَّوۡا۟ فَإِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمࣲ كَبِیرٍ\n",
    "translations": {
      "en": "Ask your Sustainer to forgive you your sins, and then turn towards Him in repentance - [whereupon] He will grant you a goodly enjoyment of life [in this world] until a term set [by Him is fulfilled]; and [in the life to come] He will bestow upon everyone possessed of merit [a full reward for] his merit. But if you turn away, then, verily, I dread for you the suffering [which is bound to befall you] on that awesome Day",
      "ms": "",
      "id": "",
      "ar": "وَأَنِ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِ یُمَتِّعۡكُم مَّتَـٰعًا حَسَنًا إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى وَیُؤۡتِ كُلَّ ذِی فَضۡلࣲ فَضۡلَهُۥۖ وَإِن تَوَلَّوۡا۟ فَإِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمࣲ كَبِیرٍ\n"
    }
  },
  {
    "id": 1477,
    "surahId": 11,
    "ayahNumber": 4,
    "arabicText": "إِلَى ٱللَّهِ مَرۡجِعُكُمۡۖ وَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرٌ\n",
    "translations": {
      "en": "Unto God you all must return: and He has the power to will anything.\"",
      "ms": "",
      "id": "",
      "ar": "إِلَى ٱللَّهِ مَرۡجِعُكُمۡۖ وَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرٌ\n"
    }
  },
  {
    "id": 1478,
    "surahId": 11,
    "ayahNumber": 5,
    "arabicText": "أَلَاۤ إِنَّهُمۡ یَثۡنُونَ صُدُورَهُمۡ لِیَسۡتَخۡفُوا۟ مِنۡهُۚ أَلَا حِینَ یَسۡتَغۡشُونَ ثِیَابَهُمۡ یَعۡلَمُ مَا یُسِرُّونَ وَمَا یُعۡلِنُونَۚ إِنَّهُۥ عَلِیمُۢ بِذَاتِ ٱلصُّدُورِ\n",
    "translations": {
      "en": "Oh, verily, they [who are bent on denying the truth of this divine writ] are enshrouding their hearts in order to hide from Him. Oh, verily, [even] when they cover themselves with their garments [in order not to see or hear], He knows all that they keep secret as well as all that they bring into the open - for, behold, He has full knowledge of what is in the hearts [of men].",
      "ms": "",
      "id": "",
      "ar": "أَلَاۤ إِنَّهُمۡ یَثۡنُونَ صُدُورَهُمۡ لِیَسۡتَخۡفُوا۟ مِنۡهُۚ أَلَا حِینَ یَسۡتَغۡشُونَ ثِیَابَهُمۡ یَعۡلَمُ مَا یُسِرُّونَ وَمَا یُعۡلِنُونَۚ إِنَّهُۥ عَلِیمُۢ بِذَاتِ ٱلصُّدُورِ\n"
    }
  },
  {
    "id": 1479,
    "surahId": 11,
    "ayahNumber": 6,
    "arabicText": "۞ وَمَا مِن دَاۤبَّةࣲ فِی ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا وَیَعۡلَمُ مُسۡتَقَرَّهَا وَمُسۡتَوۡدَعَهَاۚ كُلࣱّ فِی كِتَـٰبࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "And there is no living creature on earth but depends for its sustenance on God; and He knows its time-limit [on earth] and its resting-place [after death]: all [this] is laid down in [His] clear decree.",
      "ms": "",
      "id": "",
      "ar": "۞ وَمَا مِن دَاۤبَّةࣲ فِی ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا وَیَعۡلَمُ مُسۡتَقَرَّهَا وَمُسۡتَوۡدَعَهَاۚ كُلࣱّ فِی كِتَـٰبࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 1480,
    "surahId": 11,
    "ayahNumber": 7,
    "arabicText": "وَهُوَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ فِی سِتَّةِ أَیَّامࣲ وَكَانَ عَرۡشُهُۥ عَلَى ٱلۡمَاۤءِ لِیَبۡلُوَكُمۡ أَیُّكُمۡ أَحۡسَنُ عَمَلࣰاۗ وَلَىِٕن قُلۡتَ إِنَّكُم مَّبۡعُوثُونَ مِنۢ بَعۡدِ ٱلۡمَوۡتِ لَیَقُولَنَّ ٱلَّذِینَ كَفَرُوۤا۟ إِنۡ هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "And He it is who has created the heavens and the earth in six aeons; and [ever since He has willed to create life,] the throne of His almightiness has rested upon water. [God reminds you of your dependence on Him] in order to test you [and thus to make manifest] which of you is best in conduct. For thus it is: if thou sayest [unto men], \"Behold, you shall be raised again after death!\" - they who are bent on denying the truth are sure to answer, \"This is clearly nothing but an enchanting delusion\"",
      "ms": "",
      "id": "",
      "ar": "وَهُوَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ فِی سِتَّةِ أَیَّامࣲ وَكَانَ عَرۡشُهُۥ عَلَى ٱلۡمَاۤءِ لِیَبۡلُوَكُمۡ أَیُّكُمۡ أَحۡسَنُ عَمَلࣰاۗ وَلَىِٕن قُلۡتَ إِنَّكُم مَّبۡعُوثُونَ مِنۢ بَعۡدِ ٱلۡمَوۡتِ لَیَقُولَنَّ ٱلَّذِینَ كَفَرُوۤا۟ إِنۡ هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 1481,
    "surahId": 11,
    "ayahNumber": 8,
    "arabicText": "وَلَىِٕنۡ أَخَّرۡنَا عَنۡهُمُ ٱلۡعَذَابَ إِلَىٰۤ أُمَّةࣲ مَّعۡدُودَةࣲ لَّیَقُولُنَّ مَا یَحۡبِسُهُۥۤۗ أَلَا یَوۡمَ یَأۡتِیهِمۡ لَیۡسَ مَصۡرُوفًا عَنۡهُمۡ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n",
    "translations": {
      "en": "And thus it is: if We defer their suffering until a time-limit set [by Us], they are sure to say, \"What is preventing it [from coming now]?\" Oh, verily, on the Day when it befalls them there will be nothing to avert it from them; and they shall be overwhelmed by the very thing which they were wont to deride.",
      "ms": "",
      "id": "",
      "ar": "وَلَىِٕنۡ أَخَّرۡنَا عَنۡهُمُ ٱلۡعَذَابَ إِلَىٰۤ أُمَّةࣲ مَّعۡدُودَةࣲ لَّیَقُولُنَّ مَا یَحۡبِسُهُۥۤۗ أَلَا یَوۡمَ یَأۡتِیهِمۡ لَیۡسَ مَصۡرُوفًا عَنۡهُمۡ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n"
    }
  },
  {
    "id": 1482,
    "surahId": 11,
    "ayahNumber": 9,
    "arabicText": "وَلَىِٕنۡ أَذَقۡنَا ٱلۡإِنسَـٰنَ مِنَّا رَحۡمَةࣰ ثُمَّ نَزَعۡنَـٰهَا مِنۡهُ إِنَّهُۥ لَیَـُٔوسࣱ كَفُورࣱ\n",
    "translations": {
      "en": "And thus it is: if We let man taste some of Our grace, and then take it away from him -behold, he abandons all hope, forgetting all gratitude [for Our past favours].",
      "ms": "",
      "id": "",
      "ar": "وَلَىِٕنۡ أَذَقۡنَا ٱلۡإِنسَـٰنَ مِنَّا رَحۡمَةࣰ ثُمَّ نَزَعۡنَـٰهَا مِنۡهُ إِنَّهُۥ لَیَـُٔوسࣱ كَفُورࣱ\n"
    }
  },
  {
    "id": 1483,
    "surahId": 11,
    "ayahNumber": 10,
    "arabicText": "وَلَىِٕنۡ أَذَقۡنَـٰهُ نَعۡمَاۤءَ بَعۡدَ ضَرَّاۤءَ مَسَّتۡهُ لَیَقُولَنَّ ذَهَبَ ٱلسَّیِّـَٔاتُ عَنِّیۤۚ إِنَّهُۥ لَفَرِحࣱ فَخُورٌ\n",
    "translations": {
      "en": "And thus it is: if We let him taste ease and plenty after hardship has visited him, he is sure to say, \"Gone is all affliction from me!\"-for, behold, he is given to vain exultation, and glories only in himself.",
      "ms": "",
      "id": "",
      "ar": "وَلَىِٕنۡ أَذَقۡنَـٰهُ نَعۡمَاۤءَ بَعۡدَ ضَرَّاۤءَ مَسَّتۡهُ لَیَقُولَنَّ ذَهَبَ ٱلسَّیِّـَٔاتُ عَنِّیۤۚ إِنَّهُۥ لَفَرِحࣱ فَخُورٌ\n"
    }
  },
  {
    "id": 1484,
    "surahId": 11,
    "ayahNumber": 11,
    "arabicText": "إِلَّا ٱلَّذِینَ صَبَرُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أُو۟لَـٰۤىِٕكَ لَهُم مَّغۡفِرَةࣱ وَأَجۡرࣱ كَبِیرࣱ\n",
    "translations": {
      "en": "[And thus it is with most men-] save those who are patient in adversity and do righteous deeds: it is they whom forgiveness of sins awaits, and a great reward.",
      "ms": "",
      "id": "",
      "ar": "إِلَّا ٱلَّذِینَ صَبَرُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أُو۟لَـٰۤىِٕكَ لَهُم مَّغۡفِرَةࣱ وَأَجۡرࣱ كَبِیرࣱ\n"
    }
  },
  {
    "id": 1485,
    "surahId": 11,
    "ayahNumber": 12,
    "arabicText": "فَلَعَلَّكَ تَارِكُۢ بَعۡضَ مَا یُوحَىٰۤ إِلَیۡكَ وَضَاۤىِٕقُۢ بِهِۦ صَدۡرُكَ أَن یَقُولُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ كَنزٌ أَوۡ جَاۤءَ مَعَهُۥ مَلَكٌۚ إِنَّمَاۤ أَنتَ نَذِیرࣱۚ وَٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ وَكِیلٌ\n",
    "translations": {
      "en": "IS IT, then, conceivable [O Prophet] that thou couldst omit any part of what is being revealed unto thee [because the deniers of the truth dislike it,-and] because thy heart is distressed at their saying, \"Why has not a treasure been bestowed upon him from on high?\" -or, \"[Why has not] an angel come [visibly:: with him?\" [They fail to understand that] thou art only a warner, whereas God has everything in His care;",
      "ms": "",
      "id": "",
      "ar": "فَلَعَلَّكَ تَارِكُۢ بَعۡضَ مَا یُوحَىٰۤ إِلَیۡكَ وَضَاۤىِٕقُۢ بِهِۦ صَدۡرُكَ أَن یَقُولُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ كَنزٌ أَوۡ جَاۤءَ مَعَهُۥ مَلَكٌۚ إِنَّمَاۤ أَنتَ نَذِیرࣱۚ وَٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ وَكِیلٌ\n"
    }
  },
  {
    "id": 1486,
    "surahId": 11,
    "ayahNumber": 13,
    "arabicText": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُوا۟ بِعَشۡرِ سُوَرࣲ مِّثۡلِهِۦ مُفۡتَرَیَـٰتࣲ وَٱدۡعُوا۟ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "and so they assert, \"[Muhammad himself] has invented this [Qur'an)!\" Say [unto them]: \"Produce, then, ten surahs of similar merit, invented [by yourselves], and [to this end] call to your aid whomever you can, other than, God, if what you say is true!",
      "ms": "",
      "id": "",
      "ar": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُوا۟ بِعَشۡرِ سُوَرࣲ مِّثۡلِهِۦ مُفۡتَرَیَـٰتࣲ وَٱدۡعُوا۟ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 1487,
    "surahId": 11,
    "ayahNumber": 14,
    "arabicText": "فَإِلَّمۡ یَسۡتَجِیبُوا۟ لَكُمۡ فَٱعۡلَمُوۤا۟ أَنَّمَاۤ أُنزِلَ بِعِلۡمِ ٱللَّهِ وَأَن لَّاۤ إِلَـٰهَ إِلَّا هُوَۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ\n",
    "translations": {
      "en": "And if they [whom you have called to your aid] are not able to help you, then know that [this Qur'an] has been bestowed from on high out of God's wisdom alone, and that there is no deity save Him. Will you, then, surrender yourselves unto Him?\"",
      "ms": "",
      "id": "",
      "ar": "فَإِلَّمۡ یَسۡتَجِیبُوا۟ لَكُمۡ فَٱعۡلَمُوۤا۟ أَنَّمَاۤ أُنزِلَ بِعِلۡمِ ٱللَّهِ وَأَن لَّاۤ إِلَـٰهَ إِلَّا هُوَۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ\n"
    }
  },
  {
    "id": 1488,
    "surahId": 11,
    "ayahNumber": 15,
    "arabicText": "مَن كَانَ یُرِیدُ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا وَزِینَتَهَا نُوَفِّ إِلَیۡهِمۡ أَعۡمَـٰلَهُمۡ فِیهَا وَهُمۡ فِیهَا لَا یُبۡخَسُونَ\n",
    "translations": {
      "en": "AS FOR THOSE who care for [no more than] the life of this world and its bounties -We shall repay them in full for all that they did in this [life], and they, shall not be deprived of their just due therein:",
      "ms": "",
      "id": "",
      "ar": "مَن كَانَ یُرِیدُ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا وَزِینَتَهَا نُوَفِّ إِلَیۡهِمۡ أَعۡمَـٰلَهُمۡ فِیهَا وَهُمۡ فِیهَا لَا یُبۡخَسُونَ\n"
    }
  },
  {
    "id": 1489,
    "surahId": 11,
    "ayahNumber": 16,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ لَیۡسَ لَهُمۡ فِی ٱلۡـَٔاخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُوا۟ فِیهَا وَبَـٰطِلࣱ مَّا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "[yet] it is they who, in the life to come, shall have nothing but the fire -for in vain shall be all that they wrought in this [world], and worthless all that they ever did!",
      "ms": "",
      "id": "",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ لَیۡسَ لَهُمۡ فِی ٱلۡـَٔاخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُوا۟ فِیهَا وَبَـٰطِلࣱ مَّا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1490,
    "surahId": 11,
    "ayahNumber": 17,
    "arabicText": "أَفَمَن كَانَ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّهِۦ وَیَتۡلُوهُ شَاهِدࣱ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَـٰبُ مُوسَىٰۤ إِمَامࣰا وَرَحۡمَةًۚ أُو۟لَـٰۤىِٕكَ یُؤۡمِنُونَ بِهِۦۚ وَمَن یَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِی مِرۡیَةࣲ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Can, then, [he who cares for no more than the life of this world be compared with] one who takes his stand on a clear evidence from his Sustainer, conveyed through [this] testimony from Him, as was the revelation vouchsafed to Moses aforetime-[a divine writ ordained by Him] to be a guidance and grace [unto man]? They [who understand this message-it is they alone who truly] believe in it; whereas for any of those who, leagued together [in common hostility], deny its truth - the fire shall be their appointed state [in the life to come]. And so, be not in doubt about this [revelation]: behold, it is the truth from thy Sustainer, even though most people will not believe in it.",
      "ms": "",
      "id": "",
      "ar": "أَفَمَن كَانَ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّهِۦ وَیَتۡلُوهُ شَاهِدࣱ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَـٰبُ مُوسَىٰۤ إِمَامࣰا وَرَحۡمَةًۚ أُو۟لَـٰۤىِٕكَ یُؤۡمِنُونَ بِهِۦۚ وَمَن یَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِی مِرۡیَةࣲ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 1491,
    "surahId": 11,
    "ayahNumber": 18,
    "arabicText": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُو۟لَـٰۤىِٕكَ یُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَیَقُولُ ٱلۡأَشۡهَـٰدُ هَـٰۤؤُلَاۤءِ ٱلَّذِینَ كَذَبُوا۟ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "And who could be more wicked than they who attribute their own lying inventions to God? [On the Day of Judgment, such as] these shall be arraigned before their Sustainer, and those who are called upon to bear witness [against them] shall say, \"It is they who uttered lies about their Sustainer!\" Oh, verily, God's rejection is the due of all evildoers",
      "ms": "",
      "id": "",
      "ar": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُو۟لَـٰۤىِٕكَ یُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَیَقُولُ ٱلۡأَشۡهَـٰدُ هَـٰۤؤُلَاۤءِ ٱلَّذِینَ كَذَبُوا۟ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1492,
    "surahId": 11,
    "ayahNumber": 19,
    "arabicText": "ٱلَّذِینَ یَصُدُّونَ عَن سَبِیلِ ٱللَّهِ وَیَبۡغُونَهَا عِوَجࣰا وَهُم بِٱلۡـَٔاخِرَةِ هُمۡ كَـٰفِرُونَ\n",
    "translations": {
      "en": "who turn others away from the path of God and try to make it appear crooked -since it is they, they who refuse to acknowledge the truth of the life to come!",
      "ms": "",
      "id": "",
      "ar": "ٱلَّذِینَ یَصُدُّونَ عَن سَبِیلِ ٱللَّهِ وَیَبۡغُونَهَا عِوَجࣰا وَهُم بِٱلۡـَٔاخِرَةِ هُمۡ كَـٰفِرُونَ\n"
    }
  },
  {
    "id": 1493,
    "surahId": 11,
    "ayahNumber": 20,
    "arabicText": "أُو۟لَـٰۤىِٕكَ لَمۡ یَكُونُوا۟ مُعۡجِزِینَ فِی ٱلۡأَرۡضِ وَمَا كَانَ لَهُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِیَاۤءَۘ یُضَـٰعَفُ لَهُمُ ٱلۡعَذَابُۚ مَا كَانُوا۟ یَسۡتَطِیعُونَ ٱلسَّمۡعَ وَمَا كَانُوا۟ یُبۡصِرُونَ\n",
    "translations": {
      "en": "Never can they elude [their final reckoning, even if they remain unscathed] on earth: never will they find anyone who could protect them from God. [In the life to come] double suffering will be imposed on them for having lost the ability to hear [the truth] and having failed to see [it].",
      "ms": "",
      "id": "",
      "ar": "أُو۟لَـٰۤىِٕكَ لَمۡ یَكُونُوا۟ مُعۡجِزِینَ فِی ٱلۡأَرۡضِ وَمَا كَانَ لَهُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِیَاۤءَۘ یُضَـٰعَفُ لَهُمُ ٱلۡعَذَابُۚ مَا كَانُوا۟ یَسۡتَطِیعُونَ ٱلسَّمۡعَ وَمَا كَانُوا۟ یُبۡصِرُونَ\n"
    }
  },
  {
    "id": 1494,
    "surahId": 11,
    "ayahNumber": 21,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ خَسِرُوۤا۟ أَنفُسَهُمۡ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n",
    "translations": {
      "en": "It is they who have squandered their own selves-for [on the Day of Resurrection] all their false imagery will have forsaken them:",
      "ms": "",
      "id": "",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ خَسِرُوۤا۟ أَنفُسَهُمۡ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n"
    }
  },
  {
    "id": 1495,
    "surahId": 11,
    "ayahNumber": 22,
    "arabicText": "لَا جَرَمَ أَنَّهُمۡ فِی ٱلۡـَٔاخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ\n",
    "translations": {
      "en": "truly it is they, they who in the life to come shall be the losers!",
      "ms": "",
      "id": "",
      "ar": "لَا جَرَمَ أَنَّهُمۡ فِی ٱلۡـَٔاخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ\n"
    }
  },
  {
    "id": 1496,
    "surahId": 11,
    "ayahNumber": 23,
    "arabicText": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَأَخۡبَتُوۤا۟ إِلَىٰ رَبِّهِمۡ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلۡجَنَّةِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n",
    "translations": {
      "en": "Behold, [only] those who attain to faith and do righteous deeds and humble themselves before their Sustainer - [only] they are destined for paradise, and there shall they abide.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَأَخۡبَتُوۤا۟ إِلَىٰ رَبِّهِمۡ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلۡجَنَّةِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n"
    }
  },
  {
    "id": 1497,
    "surahId": 11,
    "ayahNumber": 24,
    "arabicText": "۞ مَثَلُ ٱلۡفَرِیقَیۡنِ كَٱلۡأَعۡمَىٰ وَٱلۡأَصَمِّ وَٱلۡبَصِیرِ وَٱلسَّمِیعِۚ هَلۡ یَسۡتَوِیَانِ مَثَلًاۚ أَفَلَا تَذَكَّرُونَ\n",
    "translations": {
      "en": "These two kinds of man may be likened to the blind and deaf and the seeing and hearing. Can these two be deemed alike in [their] nature? ` Will you not, then, keep this in mind?",
      "ms": "",
      "id": "",
      "ar": "۞ مَثَلُ ٱلۡفَرِیقَیۡنِ كَٱلۡأَعۡمَىٰ وَٱلۡأَصَمِّ وَٱلۡبَصِیرِ وَٱلسَّمِیعِۚ هَلۡ یَسۡتَوِیَانِ مَثَلًاۚ أَفَلَا تَذَكَّرُونَ\n"
    }
  },
  {
    "id": 1498,
    "surahId": 11,
    "ayahNumber": 25,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦۤ إِنِّی لَكُمۡ نَذِیرࣱ مُّبِینٌ\n",
    "translations": {
      "en": "AND INDEED, [it was with the same message that] We sent forth Noah unto his people: \"Behold, I come unto you with the plain warning",
      "ms": "",
      "id": "",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦۤ إِنِّی لَكُمۡ نَذِیرࣱ مُّبِینٌ\n"
    }
  },
  {
    "id": 1499,
    "surahId": 11,
    "ayahNumber": 26,
    "arabicText": "أَن لَّا تَعۡبُدُوۤا۟ إِلَّا ٱللَّهَۖ إِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمٍ أَلِیمࣲ\n",
    "translations": {
      "en": "that you may worship none but God-for, verily, I fear lest suffering befall you on a grievous Day!\"",
      "ms": "",
      "id": "",
      "ar": "أَن لَّا تَعۡبُدُوۤا۟ إِلَّا ٱللَّهَۖ إِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمٍ أَلِیمࣲ\n"
    }
  },
  {
    "id": 1500,
    "surahId": 11,
    "ayahNumber": 27,
    "arabicText": "فَقَالَ ٱلۡمَلَأُ ٱلَّذِینَ كَفَرُوا۟ مِن قَوۡمِهِۦ مَا نَرَىٰكَ إِلَّا بَشَرࣰا مِّثۡلَنَا وَمَا نَرَىٰكَ ٱتَّبَعَكَ إِلَّا ٱلَّذِینَ هُمۡ أَرَاذِلُنَا بَادِیَ ٱلرَّأۡیِ وَمَا نَرَىٰ لَكُمۡ عَلَیۡنَا مِن فَضۡلِۭ بَلۡ نَظُنُّكُمۡ كَـٰذِبِینَ\n",
    "translations": {
      "en": "But the great ones among his people, who refused to acknowledge the truth, answered: \"We do not see in thee anything but a mortal man like ourselves; and we do not see that any follow thee save those who are quite obviously the most abject among us; and we do not see that you could be in any way superior to us: on the contrary, we think that you are liars!\"",
      "ms": "",
      "id": "",
      "ar": "فَقَالَ ٱلۡمَلَأُ ٱلَّذِینَ كَفَرُوا۟ مِن قَوۡمِهِۦ مَا نَرَىٰكَ إِلَّا بَشَرࣰا مِّثۡلَنَا وَمَا نَرَىٰكَ ٱتَّبَعَكَ إِلَّا ٱلَّذِینَ هُمۡ أَرَاذِلُنَا بَادِیَ ٱلرَّأۡیِ وَمَا نَرَىٰ لَكُمۡ عَلَیۡنَا مِن فَضۡلِۭ بَلۡ نَظُنُّكُمۡ كَـٰذِبِینَ\n"
    }
  },
  {
    "id": 1501,
    "surahId": 11,
    "ayahNumber": 28,
    "arabicText": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَءَاتَىٰنِی رَحۡمَةࣰ مِّنۡ عِندِهِۦ فَعُمِّیَتۡ عَلَیۡكُمۡ أَنُلۡزِمُكُمُوهَا وَأَنتُمۡ لَهَا كَـٰرِهُونَ\n",
    "translations": {
      "en": "Said [Noah]: \"O my people! What do you think? If [it be true that I am taking my stand on a clear evidence from my~ Sustainer, who has vouchsafed unto me grace from Himself - [a revelation] to which you have remained blind-: [if this be true,] can we force it on you even though it be hateful to you?",
      "ms": "",
      "id": "",
      "ar": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَءَاتَىٰنِی رَحۡمَةࣰ مِّنۡ عِندِهِۦ فَعُمِّیَتۡ عَلَیۡكُمۡ أَنُلۡزِمُكُمُوهَا وَأَنتُمۡ لَهَا كَـٰرِهُونَ\n"
    }
  },
  {
    "id": 1502,
    "surahId": 11,
    "ayahNumber": 29,
    "arabicText": "وَیَـٰقَوۡمِ لَاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ مَالًاۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱللَّهِۚ وَمَاۤ أَنَا۠ بِطَارِدِ ٱلَّذِینَ ءَامَنُوۤا۟ۚ إِنَّهُم مُّلَـٰقُوا۟ رَبِّهِمۡ وَلَـٰكِنِّیۤ أَرَىٰكُمۡ قَوۡمࣰا تَجۡهَلُونَ\n",
    "translations": {
      "en": "\"And, O my people, no benefit do I ask of you for this [message]: my reward rests with none but God. And I shall not repulse [any of] those who have attained to faith. Verily, they [know that they] are destined to meet their Sustainer, whereas in you I see people without any awareness [of right and wrong]!",
      "ms": "",
      "id": "",
      "ar": "وَیَـٰقَوۡمِ لَاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ مَالًاۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱللَّهِۚ وَمَاۤ أَنَا۠ بِطَارِدِ ٱلَّذِینَ ءَامَنُوۤا۟ۚ إِنَّهُم مُّلَـٰقُوا۟ رَبِّهِمۡ وَلَـٰكِنِّیۤ أَرَىٰكُمۡ قَوۡمࣰا تَجۡهَلُونَ\n"
    }
  },
  {
    "id": 1503,
    "surahId": 11,
    "ayahNumber": 30,
    "arabicText": "وَیَـٰقَوۡمِ مَن یَنصُرُنِی مِنَ ٱللَّهِ إِن طَرَدتُّهُمۡۚ أَفَلَا تَذَكَّرُونَ\n",
    "translations": {
      "en": "And, O my people, who would shield me from God were I to repulse them? Will you not, then, keep this in mind?",
      "ms": "",
      "id": "",
      "ar": "وَیَـٰقَوۡمِ مَن یَنصُرُنِی مِنَ ٱللَّهِ إِن طَرَدتُّهُمۡۚ أَفَلَا تَذَكَّرُونَ\n"
    }
  },
  {
    "id": 1504,
    "surahId": 11,
    "ayahNumber": 31,
    "arabicText": "وَلَاۤ أَقُولُ لَكُمۡ عِندِی خَزَاۤىِٕنُ ٱللَّهِ وَلَاۤ أَعۡلَمُ ٱلۡغَیۡبَ وَلَاۤ أَقُولُ إِنِّی مَلَكࣱ وَلَاۤ أَقُولُ لِلَّذِینَ تَزۡدَرِیۤ أَعۡیُنُكُمۡ لَن یُؤۡتِیَهُمُ ٱللَّهُ خَیۡرًاۖ ٱللَّهُ أَعۡلَمُ بِمَا فِیۤ أَنفُسِهِمۡ إِنِّیۤ إِذࣰا لَّمِنَ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "\"And I do not say unto you, `God's treasures are with me'; nor [do I say], `I know the reality which is beyond the reach of human perception'; nor do I say, 'Behold, I am an angel'; nor do I say of those whom your eyes hold in contempt, `Never will God grant them any good'- for God is fully aware of what is in their hearts. [Were I to speak thus,] verily, I would indeed be among the evildoers.\"",
      "ms": "",
      "id": "",
      "ar": "وَلَاۤ أَقُولُ لَكُمۡ عِندِی خَزَاۤىِٕنُ ٱللَّهِ وَلَاۤ أَعۡلَمُ ٱلۡغَیۡبَ وَلَاۤ أَقُولُ إِنِّی مَلَكࣱ وَلَاۤ أَقُولُ لِلَّذِینَ تَزۡدَرِیۤ أَعۡیُنُكُمۡ لَن یُؤۡتِیَهُمُ ٱللَّهُ خَیۡرًاۖ ٱللَّهُ أَعۡلَمُ بِمَا فِیۤ أَنفُسِهِمۡ إِنِّیۤ إِذࣰا لَّمِنَ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1505,
    "surahId": 11,
    "ayahNumber": 32,
    "arabicText": "قَالُوا۟ یَـٰنُوحُ قَدۡ جَـٰدَلۡتَنَا فَأَكۡثَرۡتَ جِدَ ٰ⁠لَنَا فَأۡتِنَا بِمَا تَعِدُنَاۤ إِن كُنتَ مِنَ ٱلصَّـٰدِقِینَ\n",
    "translations": {
      "en": "[But the great ones] said: \"O Noah! Thou hast contended with us in argument, and hast [needlessly] prolonged our controversy: bring upon us, therefore, that with which thou dost threaten us, if thou art a man of truth!\"",
      "ms": "",
      "id": "",
      "ar": "قَالُوا۟ یَـٰنُوحُ قَدۡ جَـٰدَلۡتَنَا فَأَكۡثَرۡتَ جِدَ ٰ⁠لَنَا فَأۡتِنَا بِمَا تَعِدُنَاۤ إِن كُنتَ مِنَ ٱلصَّـٰدِقِینَ\n"
    }
  },
  {
    "id": 1506,
    "surahId": 11,
    "ayahNumber": 33,
    "arabicText": "قَالَ إِنَّمَا یَأۡتِیكُم بِهِ ٱللَّهُ إِن شَاۤءَ وَمَاۤ أَنتُم بِمُعۡجِزِینَ\n",
    "translations": {
      "en": "He answered: \"Only God can bring it upon you, if He so wills, and you shall not elude it:",
      "ms": "",
      "id": "",
      "ar": "قَالَ إِنَّمَا یَأۡتِیكُم بِهِ ٱللَّهُ إِن شَاۤءَ وَمَاۤ أَنتُم بِمُعۡجِزِینَ\n"
    }
  },
  {
    "id": 1507,
    "surahId": 11,
    "ayahNumber": 34,
    "arabicText": "وَلَا یَنفَعُكُمۡ نُصۡحِیۤ إِنۡ أَرَدتُّ أَنۡ أَنصَحَ لَكُمۡ إِن كَانَ ٱللَّهُ یُرِیدُ أَن یُغۡوِیَكُمۡۚ هُوَ رَبُّكُمۡ وَإِلَیۡهِ تُرۡجَعُونَ\n",
    "translations": {
      "en": "for, my advice will not benefit you -much as I desire to give you good advice - if it be God's will that you shall remain lost in grievous error. He is your Sustainer, and unto Him you must return.\"",
      "ms": "",
      "id": "",
      "ar": "وَلَا یَنفَعُكُمۡ نُصۡحِیۤ إِنۡ أَرَدتُّ أَنۡ أَنصَحَ لَكُمۡ إِن كَانَ ٱللَّهُ یُرِیدُ أَن یُغۡوِیَكُمۡۚ هُوَ رَبُّكُمۡ وَإِلَیۡهِ تُرۡجَعُونَ\n"
    }
  },
  {
    "id": 1508,
    "surahId": 11,
    "ayahNumber": 35,
    "arabicText": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَیۡتُهُۥ فَعَلَیَّ إِجۡرَامِی وَأَنَا۠ بَرِیۤءࣱ مِّمَّا تُجۡرِمُونَ\n",
    "translations": {
      "en": "DO SOME, perchance, assert, \"[Muhammad] has invented this [story]\"? Say [O Prophet]: \"If I have invented it, upon me be this sin; but far be it from me to commit the sin of which you are guilty.\"",
      "ms": "",
      "id": "",
      "ar": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَیۡتُهُۥ فَعَلَیَّ إِجۡرَامِی وَأَنَا۠ بَرِیۤءࣱ مِّمَّا تُجۡرِمُونَ\n"
    }
  },
  {
    "id": 1509,
    "surahId": 11,
    "ayahNumber": 36,
    "arabicText": "وَأُوحِیَ إِلَىٰ نُوحٍ أَنَّهُۥ لَن یُؤۡمِنَ مِن قَوۡمِكَ إِلَّا مَن قَدۡ ءَامَنَ فَلَا تَبۡتَىِٕسۡ بِمَا كَانُوا۟ یَفۡعَلُونَ\n",
    "translations": {
      "en": "AND THIS was revealed unto Noah: \"Never will any of thy people believe except those who have already attained to faith. Be not, then, distressed by anything that they may do,",
      "ms": "",
      "id": "",
      "ar": "وَأُوحِیَ إِلَىٰ نُوحٍ أَنَّهُۥ لَن یُؤۡمِنَ مِن قَوۡمِكَ إِلَّا مَن قَدۡ ءَامَنَ فَلَا تَبۡتَىِٕسۡ بِمَا كَانُوا۟ یَفۡعَلُونَ\n"
    }
  },
  {
    "id": 1510,
    "surahId": 11,
    "ayahNumber": 37,
    "arabicText": "وَٱصۡنَعِ ٱلۡفُلۡكَ بِأَعۡیُنِنَا وَوَحۡیِنَا وَلَا تُخَـٰطِبۡنِی فِی ٱلَّذِینَ ظَلَمُوۤا۟ إِنَّهُم مُّغۡرَقُونَ\n",
    "translations": {
      "en": "but build, under Our eyes and according to Our inspiration, the ark [that shall save thee and those who follow thee]; and do not appeal to Me in behalf of those who are bent on evildoing for, behold, they are destined to be drowned!\"",
      "ms": "",
      "id": "",
      "ar": "وَٱصۡنَعِ ٱلۡفُلۡكَ بِأَعۡیُنِنَا وَوَحۡیِنَا وَلَا تُخَـٰطِبۡنِی فِی ٱلَّذِینَ ظَلَمُوۤا۟ إِنَّهُم مُّغۡرَقُونَ\n"
    }
  },
  {
    "id": 1511,
    "surahId": 11,
    "ayahNumber": 38,
    "arabicText": "وَیَصۡنَعُ ٱلۡفُلۡكَ وَكُلَّمَا مَرَّ عَلَیۡهِ مَلَأࣱ مِّن قَوۡمِهِۦ سَخِرُوا۟ مِنۡهُۚ قَالَ إِن تَسۡخَرُوا۟ مِنَّا فَإِنَّا نَسۡخَرُ مِنكُمۡ كَمَا تَسۡخَرُونَ\n",
    "translations": {
      "en": "And [so Noah] set himself to building the ark; and every time the great ones of his people passed by him, they scoffed at him. [Thereupon] he said: \"If you are scoffing at us-behold, we are scoffing at you [and your ignorance], just as you are scoffing at us.",
      "ms": "",
      "id": "",
      "ar": "وَیَصۡنَعُ ٱلۡفُلۡكَ وَكُلَّمَا مَرَّ عَلَیۡهِ مَلَأࣱ مِّن قَوۡمِهِۦ سَخِرُوا۟ مِنۡهُۚ قَالَ إِن تَسۡخَرُوا۟ مِنَّا فَإِنَّا نَسۡخَرُ مِنكُمۡ كَمَا تَسۡخَرُونَ\n"
    }
  },
  {
    "id": 1512,
    "surahId": 11,
    "ayahNumber": 39,
    "arabicText": "فَسَوۡفَ تَعۡلَمُونَ مَن یَأۡتِیهِ عَذَابࣱ یُخۡزِیهِ وَیَحِلُّ عَلَیۡهِ عَذَابࣱ مُّقِیمٌ\n",
    "translations": {
      "en": "But in time you will come to know who it is that [in this world] shall be visited by suffering which will cover him with ignominy, and upon whom long lasting suffering shall alight [in the life to come]!\"",
      "ms": "",
      "id": "",
      "ar": "فَسَوۡفَ تَعۡلَمُونَ مَن یَأۡتِیهِ عَذَابࣱ یُخۡزِیهِ وَیَحِلُّ عَلَیۡهِ عَذَابࣱ مُّقِیمٌ\n"
    }
  },
  {
    "id": 1513,
    "surahId": 11,
    "ayahNumber": 40,
    "arabicText": "حَتَّىٰۤ إِذَا جَاۤءَ أَمۡرُنَا وَفَارَ ٱلتَّنُّورُ قُلۡنَا ٱحۡمِلۡ فِیهَا مِن كُلࣲّ زَوۡجَیۡنِ ٱثۡنَیۡنِ وَأَهۡلَكَ إِلَّا مَن سَبَقَ عَلَیۡهِ ٱلۡقَوۡلُ وَمَنۡ ءَامَنَۚ وَمَاۤ ءَامَنَ مَعَهُۥۤ إِلَّا قَلِیلࣱ\n",
    "translations": {
      "en": "[And so it went on] till, when Our judgment came to pass, and waters gushed forth in torrents over the face of the earth, We said [unto Noah]: \"Place on board of this [ark] one pair of each [kind of animal] of either sex, as well as thy family -except those on whom [Our] sentence has already been passed -and all [others] who have attained to faith!\"-for, only a few [of Noah's people] shared his faith.",
      "ms": "",
      "id": "",
      "ar": "حَتَّىٰۤ إِذَا جَاۤءَ أَمۡرُنَا وَفَارَ ٱلتَّنُّورُ قُلۡنَا ٱحۡمِلۡ فِیهَا مِن كُلࣲّ زَوۡجَیۡنِ ٱثۡنَیۡنِ وَأَهۡلَكَ إِلَّا مَن سَبَقَ عَلَیۡهِ ٱلۡقَوۡلُ وَمَنۡ ءَامَنَۚ وَمَاۤ ءَامَنَ مَعَهُۥۤ إِلَّا قَلِیلࣱ\n"
    }
  },
  {
    "id": 1514,
    "surahId": 11,
    "ayahNumber": 41,
    "arabicText": "۞ وَقَالَ ٱرۡكَبُوا۟ فِیهَا بِسۡمِ ٱللَّهِ مَجۡرٜىٰهَا وَمُرۡسَىٰهَاۤۚ إِنَّ رَبِّی لَغَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "So he said [unto his followers]: \"Embark in this [ship]! In the name of God be its run and its riding at anchor! Behold, my. Sustainer is indeed much-forgiving, a dispenser of grace!\"",
      "ms": "",
      "id": "",
      "ar": "۞ وَقَالَ ٱرۡكَبُوا۟ فِیهَا بِسۡمِ ٱللَّهِ مَجۡرٜىٰهَا وَمُرۡسَىٰهَاۤۚ إِنَّ رَبِّی لَغَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 1515,
    "surahId": 11,
    "ayahNumber": 42,
    "arabicText": "وَهِیَ تَجۡرِی بِهِمۡ فِی مَوۡجࣲ كَٱلۡجِبَالِ وَنَادَىٰ نُوحٌ ٱبۡنَهُۥ وَكَانَ فِی مَعۡزِلࣲ یَـٰبُنَیَّ ٱرۡكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلۡكَـٰفِرِینَ\n",
    "translations": {
      "en": "And it moved on with them into waves that were like mountains. At that [moment] Noah cried out to a son of his, who had kept himself aloof [from the others]: \"O my dear son! Embark with us, and remain not with those who deny the truth!\"",
      "ms": "",
      "id": "",
      "ar": "وَهِیَ تَجۡرِی بِهِمۡ فِی مَوۡجࣲ كَٱلۡجِبَالِ وَنَادَىٰ نُوحٌ ٱبۡنَهُۥ وَكَانَ فِی مَعۡزِلࣲ یَـٰبُنَیَّ ٱرۡكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلۡكَـٰفِرِینَ\n"
    }
  },
  {
    "id": 1516,
    "surahId": 11,
    "ayahNumber": 43,
    "arabicText": "قَالَ سَـَٔاوِیۤ إِلَىٰ جَبَلࣲ یَعۡصِمُنِی مِنَ ٱلۡمَاۤءِۚ قَالَ لَا عَاصِمَ ٱلۡیَوۡمَ مِنۡ أَمۡرِ ٱللَّهِ إِلَّا مَن رَّحِمَۚ وَحَالَ بَیۡنَهُمَا ٱلۡمَوۡجُ فَكَانَ مِنَ ٱلۡمُغۡرَقِینَ\n",
    "translations": {
      "en": "[But the son] answered: \"I shall betake myself to a mountain that will protect me from the waters.\" Said [Noah]: \"Today there is no protection [for anyone] from God's judgment, save [for] those who have earned [His] mercy!\" And a wave rose up between them, and [the son] was among those who were drowned.",
      "ms": "",
      "id": "",
      "ar": "قَالَ سَـَٔاوِیۤ إِلَىٰ جَبَلࣲ یَعۡصِمُنِی مِنَ ٱلۡمَاۤءِۚ قَالَ لَا عَاصِمَ ٱلۡیَوۡمَ مِنۡ أَمۡرِ ٱللَّهِ إِلَّا مَن رَّحِمَۚ وَحَالَ بَیۡنَهُمَا ٱلۡمَوۡجُ فَكَانَ مِنَ ٱلۡمُغۡرَقِینَ\n"
    }
  },
  {
    "id": 1517,
    "surahId": 11,
    "ayahNumber": 44,
    "arabicText": "وَقِیلَ یَـٰۤأَرۡضُ ٱبۡلَعِی مَاۤءَكِ وَیَـٰسَمَاۤءُ أَقۡلِعِی وَغِیضَ ٱلۡمَاۤءُ وَقُضِیَ ٱلۡأَمۡرُ وَٱسۡتَوَتۡ عَلَى ٱلۡجُودِیِّۖ وَقِیلَ بُعۡدࣰا لِّلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "And the word was spoken: \"O earth, swallow up thy waters! And, O sky, cease [thy rain]!\" And the waters sank into the earth, and the will [of God] was done, and the ark came to rest on Mount Judl And the word was spoken: \"Away with these evildoing folk!\"",
      "ms": "",
      "id": "",
      "ar": "وَقِیلَ یَـٰۤأَرۡضُ ٱبۡلَعِی مَاۤءَكِ وَیَـٰسَمَاۤءُ أَقۡلِعِی وَغِیضَ ٱلۡمَاۤءُ وَقُضِیَ ٱلۡأَمۡرُ وَٱسۡتَوَتۡ عَلَى ٱلۡجُودِیِّۖ وَقِیلَ بُعۡدࣰا لِّلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1518,
    "surahId": 11,
    "ayahNumber": 45,
    "arabicText": "وَنَادَىٰ نُوحࣱ رَّبَّهُۥ فَقَالَ رَبِّ إِنَّ ٱبۡنِی مِنۡ أَهۡلِی وَإِنَّ وَعۡدَكَ ٱلۡحَقُّ وَأَنتَ أَحۡكَمُ ٱلۡحَـٰكِمِینَ\n",
    "translations": {
      "en": "And Noah called out to his Sustainer, and said: \"O my Sustainer! Verily, my son was of my family; and, verily, Thy promise always comes true, and Thou art the most just of all judges!\"",
      "ms": "",
      "id": "",
      "ar": "وَنَادَىٰ نُوحࣱ رَّبَّهُۥ فَقَالَ رَبِّ إِنَّ ٱبۡنِی مِنۡ أَهۡلِی وَإِنَّ وَعۡدَكَ ٱلۡحَقُّ وَأَنتَ أَحۡكَمُ ٱلۡحَـٰكِمِینَ\n"
    }
  },
  {
    "id": 1519,
    "surahId": 11,
    "ayahNumber": 46,
    "arabicText": "قَالَ یَـٰنُوحُ إِنَّهُۥ لَیۡسَ مِنۡ أَهۡلِكَۖ إِنَّهُۥ عَمَلٌ غَیۡرُ صَـٰلِحࣲۖ فَلَا تَسۡـَٔلۡنِ مَا لَیۡسَ لَكَ بِهِۦ عِلۡمٌۖ إِنِّیۤ أَعِظُكَ أَن تَكُونَ مِنَ ٱلۡجَـٰهِلِینَ\n",
    "translations": {
      "en": "[God] answered: \"O Noah, behold, he was not of thy family, for, verily, he was unrighteous in his conduct. And thou shalt not ask of Me anything whereof thou canst not have any knowledge: thus, behold, do I admonish thee lest thou become one of those who are unaware [of what is right].\"",
      "ms": "",
      "id": "",
      "ar": "قَالَ یَـٰنُوحُ إِنَّهُۥ لَیۡسَ مِنۡ أَهۡلِكَۖ إِنَّهُۥ عَمَلٌ غَیۡرُ صَـٰلِحࣲۖ فَلَا تَسۡـَٔلۡنِ مَا لَیۡسَ لَكَ بِهِۦ عِلۡمٌۖ إِنِّیۤ أَعِظُكَ أَن تَكُونَ مِنَ ٱلۡجَـٰهِلِینَ\n"
    }
  },
  {
    "id": 1520,
    "surahId": 11,
    "ayahNumber": 47,
    "arabicText": "قَالَ رَبِّ إِنِّیۤ أَعُوذُ بِكَ أَنۡ أَسۡـَٔلَكَ مَا لَیۡسَ لِی بِهِۦ عِلۡمࣱۖ وَإِلَّا تَغۡفِرۡ لِی وَتَرۡحَمۡنِیۤ أَكُن مِّنَ ٱلۡخَـٰسِرِینَ\n",
    "translations": {
      "en": "Said [Noah]: \"O my Sustainer! Verily, I seek refuge with Thee from [ever again] asking of Thee anything whereof I cannot have any knowledge! For unless Thou grant me forgiveness and bestow Thy mercy upon me, I shall be among the lost!\"",
      "ms": "",
      "id": "",
      "ar": "قَالَ رَبِّ إِنِّیۤ أَعُوذُ بِكَ أَنۡ أَسۡـَٔلَكَ مَا لَیۡسَ لِی بِهِۦ عِلۡمࣱۖ وَإِلَّا تَغۡفِرۡ لِی وَتَرۡحَمۡنِیۤ أَكُن مِّنَ ٱلۡخَـٰسِرِینَ\n"
    }
  },
  {
    "id": 1521,
    "surahId": 11,
    "ayahNumber": 48,
    "arabicText": "قِیلَ یَـٰنُوحُ ٱهۡبِطۡ بِسَلَـٰمࣲ مِّنَّا وَبَرَكَـٰتٍ عَلَیۡكَ وَعَلَىٰۤ أُمَمࣲ مِّمَّن مَّعَكَۚ وَأُمَمࣱ سَنُمَتِّعُهُمۡ ثُمَّ یَمَسُّهُم مِّنَّا عَذَابٌ أَلِیمࣱ\n",
    "translations": {
      "en": "[Thereupon] the word was spoken: \"O Noah! Disembark in peace from Us, and with [Our] blessings upon thee as well as upon the people [who are with thee, and the righteous ones that will spring from thee and] from those who are with thee. But [as for the unrighteous] folk [that will spring from you] - We shall allow them to enjoy life [for a little while], and then there will befall them grievous suffering from Us.\"",
      "ms": "",
      "id": "",
      "ar": "قِیلَ یَـٰنُوحُ ٱهۡبِطۡ بِسَلَـٰمࣲ مِّنَّا وَبَرَكَـٰتٍ عَلَیۡكَ وَعَلَىٰۤ أُمَمࣲ مِّمَّن مَّعَكَۚ وَأُمَمࣱ سَنُمَتِّعُهُمۡ ثُمَّ یَمَسُّهُم مِّنَّا عَذَابٌ أَلِیمࣱ\n"
    }
  },
  {
    "id": 1522,
    "surahId": 11,
    "ayahNumber": 49,
    "arabicText": "تِلۡكَ مِنۡ أَنۢبَاۤءِ ٱلۡغَیۡبِ نُوحِیهَاۤ إِلَیۡكَۖ مَا كُنتَ تَعۡلَمُهَاۤ أَنتَ وَلَا قَوۡمُكَ مِن قَبۡلِ هَـٰذَاۖ فَٱصۡبِرۡۖ إِنَّ ٱلۡعَـٰقِبَةَ لِلۡمُتَّقِینَ\n",
    "translations": {
      "en": "THESE ACCOUNTS of something that was beyond the reach of thy perception We [now] reveal unto thee, [O Muhammad: for] neither thou nor thy people knew them [fully] ere this. Be, then, [like Noah,] patient in adversity - for, behold, the future belongs to the God-conscious!",
      "ms": "",
      "id": "",
      "ar": "تِلۡكَ مِنۡ أَنۢبَاۤءِ ٱلۡغَیۡبِ نُوحِیهَاۤ إِلَیۡكَۖ مَا كُنتَ تَعۡلَمُهَاۤ أَنتَ وَلَا قَوۡمُكَ مِن قَبۡلِ هَـٰذَاۖ فَٱصۡبِرۡۖ إِنَّ ٱلۡعَـٰقِبَةَ لِلۡمُتَّقِینَ\n"
    }
  },
  {
    "id": 1523,
    "surahId": 11,
    "ayahNumber": 50,
    "arabicText": "وَإِلَىٰ عَادٍ أَخَاهُمۡ هُودࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۤۖ إِنۡ أَنتُمۡ إِلَّا مُفۡتَرُونَ\n",
    "translations": {
      "en": "AND UNTO [the tribe of] `Ad [We sent] their brother Hud. He said: \"O my people! Worship God [alone]: you have no deity other than Him. [As it is,] you are but inventors of falsehood!",
      "ms": "",
      "id": "",
      "ar": "وَإِلَىٰ عَادٍ أَخَاهُمۡ هُودࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۤۖ إِنۡ أَنتُمۡ إِلَّا مُفۡتَرُونَ\n"
    }
  },
  {
    "id": 1524,
    "surahId": 11,
    "ayahNumber": 51,
    "arabicText": "یَـٰقَوۡمِ لَاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ أَجۡرًاۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱلَّذِی فَطَرَنِیۤۚ أَفَلَا تَعۡقِلُونَ\n",
    "translations": {
      "en": "\"O my people! No reward do I ask of you for this [message]: my reward rests with none but Him who brought me into being. Will you not, then, use your reason?",
      "ms": "",
      "id": "",
      "ar": "یَـٰقَوۡمِ لَاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ أَجۡرًاۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱلَّذِی فَطَرَنِیۤۚ أَفَلَا تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1525,
    "surahId": 11,
    "ayahNumber": 52,
    "arabicText": "وَیَـٰقَوۡمِ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِ یُرۡسِلِ ٱلسَّمَاۤءَ عَلَیۡكُم مِّدۡرَارࣰا وَیَزِدۡكُمۡ قُوَّةً إِلَىٰ قُوَّتِكُمۡ وَلَا تَتَوَلَّوۡا۟ مُجۡرِمِینَ\n",
    "translations": {
      "en": "\"Hence, O my people, ask your Sustainer to forgive you your sins, and then turn towards Him in repentance-[whereupon] He will shower upon you heavenly blessings abundant, and will add strength to your strength: only do not turn away [from me] as people lost in sin!\"",
      "ms": "",
      "id": "",
      "ar": "وَیَـٰقَوۡمِ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِ یُرۡسِلِ ٱلسَّمَاۤءَ عَلَیۡكُم مِّدۡرَارࣰا وَیَزِدۡكُمۡ قُوَّةً إِلَىٰ قُوَّتِكُمۡ وَلَا تَتَوَلَّوۡا۟ مُجۡرِمِینَ\n"
    }
  },
  {
    "id": 1526,
    "surahId": 11,
    "ayahNumber": 53,
    "arabicText": "قَالُوا۟ یَـٰهُودُ مَا جِئۡتَنَا بِبَیِّنَةࣲ وَمَا نَحۡنُ بِتَارِكِیۤ ءَالِهَتِنَا عَن قَوۡلِكَ وَمَا نَحۡنُ لَكَ بِمُؤۡمِنِینَ\n",
    "translations": {
      "en": "Said they: \"O Hud! Thou hast brought us no clear evidence [that thou art a prophet]; and we are not going to forsake our gods on thy mere word, the more so as we do not believe thee.",
      "ms": "",
      "id": "",
      "ar": "قَالُوا۟ یَـٰهُودُ مَا جِئۡتَنَا بِبَیِّنَةࣲ وَمَا نَحۡنُ بِتَارِكِیۤ ءَالِهَتِنَا عَن قَوۡلِكَ وَمَا نَحۡنُ لَكَ بِمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1527,
    "surahId": 11,
    "ayahNumber": 54,
    "arabicText": "إِن نَّقُولُ إِلَّا ٱعۡتَرَىٰكَ بَعۡضُ ءَالِهَتِنَا بِسُوۤءࣲۗ قَالَ إِنِّیۤ أُشۡهِدُ ٱللَّهَ وَٱشۡهَدُوۤا۟ أَنِّی بَرِیۤءࣱ مِّمَّا تُشۡرِكُونَ\n",
    "translations": {
      "en": "We can say no more than that one of our gods may have smitten thee with something evil!\" Answered [Hud]: \"Behold, I call God to witness - and you, too, be [my] witnesses - that, verily, it is not in me to ascribe divinity, as you do, to aught",
      "ms": "",
      "id": "",
      "ar": "إِن نَّقُولُ إِلَّا ٱعۡتَرَىٰكَ بَعۡضُ ءَالِهَتِنَا بِسُوۤءࣲۗ قَالَ إِنِّیۤ أُشۡهِدُ ٱللَّهَ وَٱشۡهَدُوۤا۟ أَنِّی بَرِیۤءࣱ مِّمَّا تُشۡرِكُونَ\n"
    }
  },
  {
    "id": 1528,
    "surahId": 11,
    "ayahNumber": 55,
    "arabicText": "مِن دُونِهِۦۖ فَكِیدُونِی جَمِیعࣰا ثُمَّ لَا تُنظِرُونِ\n",
    "translations": {
      "en": "beside Him! Contrive, then, [anything that you may wish] against me, all of you, and give me no respite!",
      "ms": "",
      "id": "",
      "ar": "مِن دُونِهِۦۖ فَكِیدُونِی جَمِیعࣰا ثُمَّ لَا تُنظِرُونِ\n"
    }
  },
  {
    "id": 1529,
    "surahId": 11,
    "ayahNumber": 56,
    "arabicText": "إِنِّی تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّی وَرَبِّكُمۚ مَّا مِن دَاۤبَّةٍ إِلَّا هُوَ ءَاخِذُۢ بِنَاصِیَتِهَاۤۚ إِنَّ رَبِّی عَلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "Behold, I have placed my trust in God, [who is] my Sustainer as well as your Sustainer: for there is no living creature which He does not hold by its forelock. Verily, straight is my Sustainer's way!",
      "ms": "",
      "id": "",
      "ar": "إِنِّی تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّی وَرَبِّكُمۚ مَّا مِن دَاۤبَّةٍ إِلَّا هُوَ ءَاخِذُۢ بِنَاصِیَتِهَاۤۚ إِنَّ رَبِّی عَلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 1530,
    "surahId": 11,
    "ayahNumber": 57,
    "arabicText": "فَإِن تَوَلَّوۡا۟ فَقَدۡ أَبۡلَغۡتُكُم مَّاۤ أُرۡسِلۡتُ بِهِۦۤ إِلَیۡكُمۡۚ وَیَسۡتَخۡلِفُ رَبِّی قَوۡمًا غَیۡرَكُمۡ وَلَا تَضُرُّونَهُۥ شَیۡـًٔاۚ إِنَّ رَبِّی عَلَىٰ كُلِّ شَیۡءٍ حَفِیظࣱ\n",
    "translations": {
      "en": "\"But if you choose to turn away, then [know that] I have delivered to you the message with which I was sent unto you, and [that] my Sustainer may cause another people to take your place, whereas you will in no wise harm Him. Verily, my Sustainer watches over all things!\"",
      "ms": "",
      "id": "",
      "ar": "فَإِن تَوَلَّوۡا۟ فَقَدۡ أَبۡلَغۡتُكُم مَّاۤ أُرۡسِلۡتُ بِهِۦۤ إِلَیۡكُمۡۚ وَیَسۡتَخۡلِفُ رَبِّی قَوۡمًا غَیۡرَكُمۡ وَلَا تَضُرُّونَهُۥ شَیۡـًٔاۚ إِنَّ رَبِّی عَلَىٰ كُلِّ شَیۡءٍ حَفِیظࣱ\n"
    }
  },
  {
    "id": 1531,
    "surahId": 11,
    "ayahNumber": 58,
    "arabicText": "وَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا هُودࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَنَجَّیۡنَـٰهُم مِّنۡ عَذَابٍ غَلِیظࣲ\n",
    "translations": {
      "en": "And so, when Our judgment came to pass, by Our grace We saved Hud and those who shared his faith; and We saved them [too] from suffering severe [in the life to come].",
      "ms": "",
      "id": "",
      "ar": "وَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا هُودࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَنَجَّیۡنَـٰهُم مِّنۡ عَذَابٍ غَلِیظࣲ\n"
    }
  },
  {
    "id": 1532,
    "surahId": 11,
    "ayahNumber": 59,
    "arabicText": "وَتِلۡكَ عَادࣱۖ جَحَدُوا۟ بِـَٔایَـٰتِ رَبِّهِمۡ وَعَصَوۡا۟ رُسُلَهُۥ وَٱتَّبَعُوۤا۟ أَمۡرَ كُلِّ جَبَّارٍ عَنِیدࣲ\n",
    "translations": {
      "en": "And that was [the end of the tribe of] `Ad, [who] had rejected their Sustainer's messages, and rebelled against His apostles, and followed the bidding of every arrogant enemy of the truth.",
      "ms": "",
      "id": "",
      "ar": "وَتِلۡكَ عَادࣱۖ جَحَدُوا۟ بِـَٔایَـٰتِ رَبِّهِمۡ وَعَصَوۡا۟ رُسُلَهُۥ وَٱتَّبَعُوۤا۟ أَمۡرَ كُلِّ جَبَّارٍ عَنِیدࣲ\n"
    }
  },
  {
    "id": 1533,
    "surahId": 11,
    "ayahNumber": 60,
    "arabicText": "وَأُتۡبِعُوا۟ فِی هَـٰذِهِ ٱلدُّنۡیَا لَعۡنَةࣰ وَیَوۡمَ ٱلۡقِیَـٰمَةِۗ أَلَاۤ إِنَّ عَادࣰا كَفَرُوا۟ رَبَّهُمۡۗ أَلَا بُعۡدࣰا لِّعَادࣲ قَوۡمِ هُودࣲ\n",
    "translations": {
      "en": "And they were pursued in this world by [God's] rejection, and [shall finally be overtaken by it] on the Day of Resurrection. Oh, verily, [the tribe of] `Ad denied their Sustainer! Oh, away with the `Ad, the people of Hud!",
      "ms": "",
      "id": "",
      "ar": "وَأُتۡبِعُوا۟ فِی هَـٰذِهِ ٱلدُّنۡیَا لَعۡنَةࣰ وَیَوۡمَ ٱلۡقِیَـٰمَةِۗ أَلَاۤ إِنَّ عَادࣰا كَفَرُوا۟ رَبَّهُمۡۗ أَلَا بُعۡدࣰا لِّعَادࣲ قَوۡمِ هُودࣲ\n"
    }
  },
  {
    "id": 1534,
    "surahId": 11,
    "ayahNumber": 61,
    "arabicText": "۞ وَإِلَىٰ ثَمُودَ أَخَاهُمۡ صَـٰلِحࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۖ هُوَ أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ وَٱسۡتَعۡمَرَكُمۡ فِیهَا فَٱسۡتَغۡفِرُوهُ ثُمَّ تُوبُوۤا۟ إِلَیۡهِۚ إِنَّ رَبِّی قَرِیبࣱ مُّجِیبࣱ\n",
    "translations": {
      "en": "AND UNTO [the tribe of] Thamud [We sent] their brother Salih. He said: \"O my people! Worship God [alone]: you have no deity other than Him. He brought you into being out of the earth, and made you thrive thereon. Ask Him, therefore, to forgive you your sins, and then turn towards Him in repentance-for, verily, my Sustainer is ever-near, responding [to the call of whoever calls unto Him]!\"",
      "ms": "",
      "id": "",
      "ar": "۞ وَإِلَىٰ ثَمُودَ أَخَاهُمۡ صَـٰلِحࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۖ هُوَ أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ وَٱسۡتَعۡمَرَكُمۡ فِیهَا فَٱسۡتَغۡفِرُوهُ ثُمَّ تُوبُوۤا۟ إِلَیۡهِۚ إِنَّ رَبِّی قَرِیبࣱ مُّجِیبࣱ\n"
    }
  },
  {
    "id": 1535,
    "surahId": 11,
    "ayahNumber": 62,
    "arabicText": "قَالُوا۟ یَـٰصَـٰلِحُ قَدۡ كُنتَ فِینَا مَرۡجُوࣰّا قَبۡلَ هَـٰذَاۤۖ أَتَنۡهَىٰنَاۤ أَن نَّعۡبُدَ مَا یَعۡبُدُ ءَابَاۤؤُنَا وَإِنَّنَا لَفِی شَكࣲّ مِّمَّا تَدۡعُونَاۤ إِلَیۡهِ مُرِیبࣲ\n",
    "translations": {
      "en": "They answered: \"O Salih! Great hopes did we place in thee ere this! Wouldst thou forbid us to worship what our forefathers were wont to worship? Because [of this], behold, we are in grave doubt, amounting to suspicion, about [the meaning of] thy call to us!\"",
      "ms": "",
      "id": "",
      "ar": "قَالُوا۟ یَـٰصَـٰلِحُ قَدۡ كُنتَ فِینَا مَرۡجُوࣰّا قَبۡلَ هَـٰذَاۤۖ أَتَنۡهَىٰنَاۤ أَن نَّعۡبُدَ مَا یَعۡبُدُ ءَابَاۤؤُنَا وَإِنَّنَا لَفِی شَكࣲّ مِّمَّا تَدۡعُونَاۤ إِلَیۡهِ مُرِیبࣲ\n"
    }
  },
  {
    "id": 1536,
    "surahId": 11,
    "ayahNumber": 63,
    "arabicText": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَءَاتَىٰنِی مِنۡهُ رَحۡمَةࣰ فَمَن یَنصُرُنِی مِنَ ٱللَّهِ إِنۡ عَصَیۡتُهُۥۖ فَمَا تَزِیدُونَنِی غَیۡرَ تَخۡسِیرࣲ\n",
    "translations": {
      "en": "He retorted: \"O my people! What do you think? If [it be true that] I am taking my stand on a cleat evidence from my Sustainer, who has vouchsafed unto me grace from Himself -[if this be true,] who would shield me from God were I to rebel against Him? Hence, what you are offering me is no more than perdition!\"",
      "ms": "",
      "id": "",
      "ar": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَءَاتَىٰنِی مِنۡهُ رَحۡمَةࣰ فَمَن یَنصُرُنِی مِنَ ٱللَّهِ إِنۡ عَصَیۡتُهُۥۖ فَمَا تَزِیدُونَنِی غَیۡرَ تَخۡسِیرࣲ\n"
    }
  },
  {
    "id": 1537,
    "surahId": 11,
    "ayahNumber": 64,
    "arabicText": "وَیَـٰقَوۡمِ هَـٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَایَةࣰۖ فَذَرُوهَا تَأۡكُلۡ فِیۤ أَرۡضِ ٱللَّهِۖ وَلَا تَمَسُّوهَا بِسُوۤءࣲ فَیَأۡخُذَكُمۡ عَذَابࣱ قَرِیبࣱ\n",
    "translations": {
      "en": "And [then he said]: \"O my people! This she-camel belonging to God shall be a token for you: so leave her alone to pasture on God's earth, and do her no harm, lest speedy chastisement befall you!\"",
      "ms": "",
      "id": "",
      "ar": "وَیَـٰقَوۡمِ هَـٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَایَةࣰۖ فَذَرُوهَا تَأۡكُلۡ فِیۤ أَرۡضِ ٱللَّهِۖ وَلَا تَمَسُّوهَا بِسُوۤءࣲ فَیَأۡخُذَكُمۡ عَذَابࣱ قَرِیبࣱ\n"
    }
  },
  {
    "id": 1538,
    "surahId": 11,
    "ayahNumber": 65,
    "arabicText": "فَعَقَرُوهَا فَقَالَ تَمَتَّعُوا۟ فِی دَارِكُمۡ ثَلَـٰثَةَ أَیَّامࣲۖ ذَ ٰ⁠لِكَ وَعۡدٌ غَیۡرُ مَكۡذُوبࣲ\n",
    "translations": {
      "en": "But they cruelly slaughtered her. And thereupon [Salih] said: \"[Only] for three days [more] shall you enjoy life in your homes: this is a judgment which will not be belied!\"",
      "ms": "",
      "id": "",
      "ar": "فَعَقَرُوهَا فَقَالَ تَمَتَّعُوا۟ فِی دَارِكُمۡ ثَلَـٰثَةَ أَیَّامࣲۖ ذَ ٰ⁠لِكَ وَعۡدٌ غَیۡرُ مَكۡذُوبࣲ\n"
    }
  },
  {
    "id": 1539,
    "surahId": 11,
    "ayahNumber": 66,
    "arabicText": "فَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا صَـٰلِحࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَمِنۡ خِزۡیِ یَوۡمِىِٕذٍۚ إِنَّ رَبَّكَ هُوَ ٱلۡقَوِیُّ ٱلۡعَزِیزُ\n",
    "translations": {
      "en": "And so, when Our judgment came to pass, by Our grace We saved Salih and those who shared his faith; and [We saved them, too,] from the ignominy of [Our rejection on] that Day [of Resurrection]. Verily, thy Sustainer alone is powerful, almighty!",
      "ms": "",
      "id": "",
      "ar": "فَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا صَـٰلِحࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَمِنۡ خِزۡیِ یَوۡمِىِٕذٍۚ إِنَّ رَبَّكَ هُوَ ٱلۡقَوِیُّ ٱلۡعَزِیزُ\n"
    }
  },
  {
    "id": 1540,
    "surahId": 11,
    "ayahNumber": 67,
    "arabicText": "وَأَخَذَ ٱلَّذِینَ ظَلَمُوا۟ ٱلصَّیۡحَةُ فَأَصۡبَحُوا۟ فِی دِیَـٰرِهِمۡ جَـٰثِمِینَ\n",
    "translations": {
      "en": "And the blast [of God's punishment] overtook those who had been bent on evildoing: and then they lay lifeless, in their very homes, on the ground,",
      "ms": "",
      "id": "",
      "ar": "وَأَخَذَ ٱلَّذِینَ ظَلَمُوا۟ ٱلصَّیۡحَةُ فَأَصۡبَحُوا۟ فِی دِیَـٰرِهِمۡ جَـٰثِمِینَ\n"
    }
  },
  {
    "id": 1541,
    "surahId": 11,
    "ayahNumber": 68,
    "arabicText": "كَأَن لَّمۡ یَغۡنَوۡا۟ فِیهَاۤۗ أَلَاۤ إِنَّ ثَمُودَا۟ كَفَرُوا۟ رَبَّهُمۡۗ أَلَا بُعۡدࣰا لِّثَمُودَ\n",
    "translations": {
      "en": "as though they had never lived there. Oh, verily, [the tribe of] Thamud denied their Sustainer! Oh, away with the Thamud!",
      "ms": "",
      "id": "",
      "ar": "كَأَن لَّمۡ یَغۡنَوۡا۟ فِیهَاۤۗ أَلَاۤ إِنَّ ثَمُودَا۟ كَفَرُوا۟ رَبَّهُمۡۗ أَلَا بُعۡدࣰا لِّثَمُودَ\n"
    }
  },
  {
    "id": 1542,
    "surahId": 11,
    "ayahNumber": 69,
    "arabicText": "وَلَقَدۡ جَاۤءَتۡ رُسُلُنَاۤ إِبۡرَ ٰ⁠هِیمَ بِٱلۡبُشۡرَىٰ قَالُوا۟ سَلَـٰمࣰاۖ قَالَ سَلَـٰمࣱۖ فَمَا لَبِثَ أَن جَاۤءَ بِعِجۡلٍ حَنِیذࣲ\n",
    "translations": {
      "en": "AND, INDEED, there came unto Abraham Our [heavenly] messengers, bearing a glad tiding. They bade him peace; [and] he answered, \"[And upon you be] peace!\"-and made haste to place before them a roasted calf.",
      "ms": "",
      "id": "",
      "ar": "وَلَقَدۡ جَاۤءَتۡ رُسُلُنَاۤ إِبۡرَ ٰ⁠هِیمَ بِٱلۡبُشۡرَىٰ قَالُوا۟ سَلَـٰمࣰاۖ قَالَ سَلَـٰمࣱۖ فَمَا لَبِثَ أَن جَاۤءَ بِعِجۡلٍ حَنِیذࣲ\n"
    }
  },
  {
    "id": 1543,
    "surahId": 11,
    "ayahNumber": 70,
    "arabicText": "فَلَمَّا رَءَاۤ أَیۡدِیَهُمۡ لَا تَصِلُ إِلَیۡهِ نَكِرَهُمۡ وَأَوۡجَسَ مِنۡهُمۡ خِیفَةࣰۚ قَالُوا۟ لَا تَخَفۡ إِنَّاۤ أُرۡسِلۡنَاۤ إِلَىٰ قَوۡمِ لُوطࣲ\n",
    "translations": {
      "en": "But when he saw that their hands did not reach out towards it, he deemed their conduct strange and became apprehensive of them. [But] they said: \"Fear not! Behold, we are sent to the people of Lot.",
      "ms": "",
      "id": "",
      "ar": "فَلَمَّا رَءَاۤ أَیۡدِیَهُمۡ لَا تَصِلُ إِلَیۡهِ نَكِرَهُمۡ وَأَوۡجَسَ مِنۡهُمۡ خِیفَةࣰۚ قَالُوا۟ لَا تَخَفۡ إِنَّاۤ أُرۡسِلۡنَاۤ إِلَىٰ قَوۡمِ لُوطࣲ\n"
    }
  },
  {
    "id": 1544,
    "surahId": 11,
    "ayahNumber": 71,
    "arabicText": "وَٱمۡرَأَتُهُۥ قَاۤىِٕمَةࣱ فَضَحِكَتۡ فَبَشَّرۡنَـٰهَا بِإِسۡحَـٰقَ وَمِن وَرَاۤءِ إِسۡحَـٰقَ یَعۡقُوبَ\n",
    "translations": {
      "en": "And his wife, standing [nearby], laughed [with happiness]; whereupon We gave her the glad tiding of [the birth of] Isaac and, after Isaac, of [his son] Jacob.",
      "ms": "",
      "id": "",
      "ar": "وَٱمۡرَأَتُهُۥ قَاۤىِٕمَةࣱ فَضَحِكَتۡ فَبَشَّرۡنَـٰهَا بِإِسۡحَـٰقَ وَمِن وَرَاۤءِ إِسۡحَـٰقَ یَعۡقُوبَ\n"
    }
  },
  {
    "id": 1545,
    "surahId": 11,
    "ayahNumber": 72,
    "arabicText": "قَالَتۡ یَـٰوَیۡلَتَىٰۤ ءَأَلِدُ وَأَنَا۠ عَجُوزࣱ وَهَـٰذَا بَعۡلِی شَیۡخًاۖ إِنَّ هَـٰذَا لَشَیۡءٌ عَجِیبࣱ\n",
    "translations": {
      "en": "Said she: \"Oh, woe is me! Shall I bear a child, now that I am an old woman and this husband of mine is an old man? Verily, that would be a strange thing indeed!\"",
      "ms": "",
      "id": "",
      "ar": "قَالَتۡ یَـٰوَیۡلَتَىٰۤ ءَأَلِدُ وَأَنَا۠ عَجُوزࣱ وَهَـٰذَا بَعۡلِی شَیۡخًاۖ إِنَّ هَـٰذَا لَشَیۡءٌ عَجِیبࣱ\n"
    }
  },
  {
    "id": 1546,
    "surahId": 11,
    "ayahNumber": 73,
    "arabicText": "قَالُوۤا۟ أَتَعۡجَبِینَ مِنۡ أَمۡرِ ٱللَّهِۖ رَحۡمَتُ ٱللَّهِ وَبَرَكَـٰتُهُۥ عَلَیۡكُمۡ أَهۡلَ ٱلۡبَیۡتِۚ إِنَّهُۥ حَمِیدࣱ مَّجِیدࣱ\n",
    "translations": {
      "en": "Answered [the messengers]: \"Dost thou deem it strange that God should decree what He wills? The grace of God and His blessings be upon you, O people of this house! Verily, ever to be praised, sublime is He!\"",
      "ms": "",
      "id": "",
      "ar": "قَالُوۤا۟ أَتَعۡجَبِینَ مِنۡ أَمۡرِ ٱللَّهِۖ رَحۡمَتُ ٱللَّهِ وَبَرَكَـٰتُهُۥ عَلَیۡكُمۡ أَهۡلَ ٱلۡبَیۡتِۚ إِنَّهُۥ حَمِیدࣱ مَّجِیدࣱ\n"
    }
  },
  {
    "id": 1547,
    "surahId": 11,
    "ayahNumber": 74,
    "arabicText": "فَلَمَّا ذَهَبَ عَنۡ إِبۡرَ ٰ⁠هِیمَ ٱلرَّوۡعُ وَجَاۤءَتۡهُ ٱلۡبُشۡرَىٰ یُجَـٰدِلُنَا فِی قَوۡمِ لُوطٍ\n",
    "translations": {
      "en": "And when the fear had left Abraham, and the glad tiding had been conveyed to him, he began to plead with Us for Lot's people:",
      "ms": "",
      "id": "",
      "ar": "فَلَمَّا ذَهَبَ عَنۡ إِبۡرَ ٰ⁠هِیمَ ٱلرَّوۡعُ وَجَاۤءَتۡهُ ٱلۡبُشۡرَىٰ یُجَـٰدِلُنَا فِی قَوۡمِ لُوطٍ\n"
    }
  },
  {
    "id": 1548,
    "surahId": 11,
    "ayahNumber": 75,
    "arabicText": "إِنَّ إِبۡرَ ٰ⁠هِیمَ لَحَلِیمٌ أَوَّ ٰ⁠هࣱ مُّنِیبࣱ\n",
    "translations": {
      "en": "for, behold, Abraham was most clement, most tender-hearted, intent upon turning to God again and again.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ إِبۡرَ ٰ⁠هِیمَ لَحَلِیمٌ أَوَّ ٰ⁠هࣱ مُّنِیبࣱ\n"
    }
  },
  {
    "id": 1549,
    "surahId": 11,
    "ayahNumber": 76,
    "arabicText": "یَـٰۤإِبۡرَ ٰ⁠هِیمُ أَعۡرِضۡ عَنۡ هَـٰذَاۤۖ إِنَّهُۥ قَدۡ جَاۤءَ أَمۡرُ رَبِّكَۖ وَإِنَّهُمۡ ءَاتِیهِمۡ عَذَابٌ غَیۡرُ مَرۡدُودࣲ\n",
    "translations": {
      "en": "[But God's messengers replied:] \"O Abraham! Desist from this [pleading]! Behold, thy Sustainer's judgment has already gone forth: and, verily, there shall fall upon them a chastisement which none can avert!\"",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤإِبۡرَ ٰ⁠هِیمُ أَعۡرِضۡ عَنۡ هَـٰذَاۤۖ إِنَّهُۥ قَدۡ جَاۤءَ أَمۡرُ رَبِّكَۖ وَإِنَّهُمۡ ءَاتِیهِمۡ عَذَابٌ غَیۡرُ مَرۡدُودࣲ\n"
    }
  },
  {
    "id": 1550,
    "surahId": 11,
    "ayahNumber": 77,
    "arabicText": "وَلَمَّا جَاۤءَتۡ رُسُلُنَا لُوطࣰا سِیۤءَ بِهِمۡ وَضَاقَ بِهِمۡ ذَرۡعࣰا وَقَالَ هَـٰذَا یَوۡمٌ عَصِیبࣱ\n",
    "translations": {
      "en": "AND WHEN Our messengers came unto Lot, he was sorely grieved on their account, seeing that it was beyond his power to shield them; and he exclaimed: \"This is a woeful day!\"",
      "ms": "",
      "id": "",
      "ar": "وَلَمَّا جَاۤءَتۡ رُسُلُنَا لُوطࣰا سِیۤءَ بِهِمۡ وَضَاقَ بِهِمۡ ذَرۡعࣰا وَقَالَ هَـٰذَا یَوۡمٌ عَصِیبࣱ\n"
    }
  },
  {
    "id": 1551,
    "surahId": 11,
    "ayahNumber": 78,
    "arabicText": "وَجَاۤءَهُۥ قَوۡمُهُۥ یُهۡرَعُونَ إِلَیۡهِ وَمِن قَبۡلُ كَانُوا۟ یَعۡمَلُونَ ٱلسَّیِّـَٔاتِۚ قَالَ یَـٰقَوۡمِ هَـٰۤؤُلَاۤءِ بَنَاتِی هُنَّ أَطۡهَرُ لَكُمۡۖ فَٱتَّقُوا۟ ٱللَّهَ وَلَا تُخۡزُونِ فِی ضَیۡفِیۤۖ أَلَیۡسَ مِنكُمۡ رَجُلࣱ رَّشِیدࣱ\n",
    "translations": {
      "en": "And his people came running to him, impelled towards his house [by their desire]: for they had ever been wont to commit [such], abominations. Said [Lot]: \"O my people! [Take instead] these daughters of mine: they are purer for you [than men]! Be, then, conscious of God, and disgrace me not by [assaulting] my guests. Is there not among you even one right-minded man?\"",
      "ms": "",
      "id": "",
      "ar": "وَجَاۤءَهُۥ قَوۡمُهُۥ یُهۡرَعُونَ إِلَیۡهِ وَمِن قَبۡلُ كَانُوا۟ یَعۡمَلُونَ ٱلسَّیِّـَٔاتِۚ قَالَ یَـٰقَوۡمِ هَـٰۤؤُلَاۤءِ بَنَاتِی هُنَّ أَطۡهَرُ لَكُمۡۖ فَٱتَّقُوا۟ ٱللَّهَ وَلَا تُخۡزُونِ فِی ضَیۡفِیۤۖ أَلَیۡسَ مِنكُمۡ رَجُلࣱ رَّشِیدࣱ\n"
    }
  },
  {
    "id": 1552,
    "surahId": 11,
    "ayahNumber": 79,
    "arabicText": "قَالُوا۟ لَقَدۡ عَلِمۡتَ مَا لَنَا فِی بَنَاتِكَ مِنۡ حَقࣲّ وَإِنَّكَ لَتَعۡلَمُ مَا نُرِیدُ\n",
    "translations": {
      "en": "They answered: \"Thou hast always known that we have no use whatever for thy daughters; and, verily, well dost thou know what we want!\"",
      "ms": "",
      "id": "",
      "ar": "قَالُوا۟ لَقَدۡ عَلِمۡتَ مَا لَنَا فِی بَنَاتِكَ مِنۡ حَقࣲّ وَإِنَّكَ لَتَعۡلَمُ مَا نُرِیدُ\n"
    }
  },
  {
    "id": 1553,
    "surahId": 11,
    "ayahNumber": 80,
    "arabicText": "قَالَ لَوۡ أَنَّ لِی بِكُمۡ قُوَّةً أَوۡ ءَاوِیۤ إِلَىٰ رُكۡنࣲ شَدِیدࣲ\n",
    "translations": {
      "en": "Exclaimed [Lot]: \"Would that I had the strength to defeat you, or that I could lean upon some mightier support!\"",
      "ms": "",
      "id": "",
      "ar": "قَالَ لَوۡ أَنَّ لِی بِكُمۡ قُوَّةً أَوۡ ءَاوِیۤ إِلَىٰ رُكۡنࣲ شَدِیدࣲ\n"
    }
  },
  {
    "id": 1554,
    "surahId": 11,
    "ayahNumber": 81,
    "arabicText": "قَالُوا۟ یَـٰلُوطُ إِنَّا رُسُلُ رَبِّكَ لَن یَصِلُوۤا۟ إِلَیۡكَۖ فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعࣲ مِّنَ ٱلَّیۡلِ وَلَا یَلۡتَفِتۡ مِنكُمۡ أَحَدٌ إِلَّا ٱمۡرَأَتَكَۖ إِنَّهُۥ مُصِیبُهَا مَاۤ أَصَابَهُمۡۚ إِنَّ مَوۡعِدَهُمُ ٱلصُّبۡحُۚ أَلَیۡسَ ٱلصُّبۡحُ بِقَرِیبࣲ\n",
    "translations": {
      "en": "[Whereupon the angels] said: \"O Lot! Behold, we are messengers from thy Sustainer! Never shall [thy enemies] attain to thee! Depart, then, with thy household while it is yet night, and let none of you look back; [and take with thee all thy family] with the exception of thy wife: for, behold, that which is to befall these [people of Sodom] shall befall her [as well]. Verily, their appointed time is the morning [and] is not the morning nigh?\"",
      "ms": "",
      "id": "",
      "ar": "قَالُوا۟ یَـٰلُوطُ إِنَّا رُسُلُ رَبِّكَ لَن یَصِلُوۤا۟ إِلَیۡكَۖ فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعࣲ مِّنَ ٱلَّیۡلِ وَلَا یَلۡتَفِتۡ مِنكُمۡ أَحَدٌ إِلَّا ٱمۡرَأَتَكَۖ إِنَّهُۥ مُصِیبُهَا مَاۤ أَصَابَهُمۡۚ إِنَّ مَوۡعِدَهُمُ ٱلصُّبۡحُۚ أَلَیۡسَ ٱلصُّبۡحُ بِقَرِیبࣲ\n"
    }
  },
  {
    "id": 1555,
    "surahId": 11,
    "ayahNumber": 82,
    "arabicText": "فَلَمَّا جَاۤءَ أَمۡرُنَا جَعَلۡنَا عَـٰلِیَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَیۡهَا حِجَارَةࣰ مِّن سِجِّیلࣲ مَّنضُودࣲ\n",
    "translations": {
      "en": "And so, when Our judgment came to pass, We turned those [sinful towns] upside down, and rained down upon them stone-hard blows of chastisement pre-ordained. one upon another,",
      "ms": "",
      "id": "",
      "ar": "فَلَمَّا جَاۤءَ أَمۡرُنَا جَعَلۡنَا عَـٰلِیَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَیۡهَا حِجَارَةࣰ مِّن سِجِّیلࣲ مَّنضُودࣲ\n"
    }
  },
  {
    "id": 1556,
    "surahId": 11,
    "ayahNumber": 83,
    "arabicText": "مُّسَوَّمَةً عِندَ رَبِّكَۖ وَمَا هِیَ مِنَ ٱلظَّـٰلِمِینَ بِبَعِیدࣲ\n",
    "translations": {
      "en": "marked out in thy Sustainer's sight [for the punishment of such as are lost in sin]. And these [blows of God-willed doom] are never far from evildoers",
      "ms": "",
      "id": "",
      "ar": "مُّسَوَّمَةً عِندَ رَبِّكَۖ وَمَا هِیَ مِنَ ٱلظَّـٰلِمِینَ بِبَعِیدࣲ\n"
    }
  },
  {
    "id": 1557,
    "surahId": 11,
    "ayahNumber": 84,
    "arabicText": "۞ وَإِلَىٰ مَدۡیَنَ أَخَاهُمۡ شُعَیۡبࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۖ وَلَا تَنقُصُوا۟ ٱلۡمِكۡیَالَ وَٱلۡمِیزَانَۖ إِنِّیۤ أَرَىٰكُم بِخَیۡرࣲ وَإِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمࣲ مُّحِیطࣲ\n",
    "translations": {
      "en": "AND UNTO [the people of] Madyan [We sent] their brother Shu'ayb. He said: \"O my people! Worship God [alone]: you have no deity other than Him; and do not give short measure and weight [in any of your dealings with men]. Behold, I see you [now] in a happy state; but, verily, I dread lest suffering befall you on a Day that will encompass [you with doom]!",
      "ms": "",
      "id": "",
      "ar": "۞ وَإِلَىٰ مَدۡیَنَ أَخَاهُمۡ شُعَیۡبࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۖ وَلَا تَنقُصُوا۟ ٱلۡمِكۡیَالَ وَٱلۡمِیزَانَۖ إِنِّیۤ أَرَىٰكُم بِخَیۡرࣲ وَإِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمࣲ مُّحِیطࣲ\n"
    }
  },
  {
    "id": 1558,
    "surahId": 11,
    "ayahNumber": 85,
    "arabicText": "وَیَـٰقَوۡمِ أَوۡفُوا۟ ٱلۡمِكۡیَالَ وَٱلۡمِیزَانَ بِٱلۡقِسۡطِۖ وَلَا تَبۡخَسُوا۟ ٱلنَّاسَ أَشۡیَاۤءَهُمۡ وَلَا تَعۡثَوۡا۟ فِی ٱلۡأَرۡضِ مُفۡسِدِینَ\n",
    "translations": {
      "en": "Hence, O my people, [always] give full measure and weight, with equity, and do not deprive people of what is rightfully theirs, and do not act wickedly on earth by spreading corruption.",
      "ms": "",
      "id": "",
      "ar": "وَیَـٰقَوۡمِ أَوۡفُوا۟ ٱلۡمِكۡیَالَ وَٱلۡمِیزَانَ بِٱلۡقِسۡطِۖ وَلَا تَبۡخَسُوا۟ ٱلنَّاسَ أَشۡیَاۤءَهُمۡ وَلَا تَعۡثَوۡا۟ فِی ٱلۡأَرۡضِ مُفۡسِدِینَ\n"
    }
  },
  {
    "id": 1559,
    "surahId": 11,
    "ayahNumber": 86,
    "arabicText": "بَقِیَّتُ ٱللَّهِ خَیۡرࣱ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِینَۚ وَمَاۤ أَنَا۠ عَلَیۡكُم بِحَفِیظࣲ\n",
    "translations": {
      "en": "That which rests with God is best for you, if you but believe [in Him]! However, I am not your keeper.\"",
      "ms": "",
      "id": "",
      "ar": "بَقِیَّتُ ٱللَّهِ خَیۡرࣱ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِینَۚ وَمَاۤ أَنَا۠ عَلَیۡكُم بِحَفِیظࣲ\n"
    }
  },
  {
    "id": 1560,
    "surahId": 11,
    "ayahNumber": 87,
    "arabicText": "قَالُوا۟ یَـٰشُعَیۡبُ أَصَلَوٰتُكَ تَأۡمُرُكَ أَن نَّتۡرُكَ مَا یَعۡبُدُ ءَابَاۤؤُنَاۤ أَوۡ أَن نَّفۡعَلَ فِیۤ أَمۡوَ ٰ⁠لِنَا مَا نَشَـٰۤؤُا۟ۖ إِنَّكَ لَأَنتَ ٱلۡحَلِیمُ ٱلرَّشِیدُ\n",
    "translations": {
      "en": "Said they: \"O Shu'ayb! Does thy [habit of] praying compel thee to demand of us that we give up all that our forefathers were wont to worship, or that we refrain from doing whatever we please with our possessions? Behold, [thou wouldst have us believe that] thou art indeed the only clement, the only right-minded man!\"",
      "ms": "",
      "id": "",
      "ar": "قَالُوا۟ یَـٰشُعَیۡبُ أَصَلَوٰتُكَ تَأۡمُرُكَ أَن نَّتۡرُكَ مَا یَعۡبُدُ ءَابَاۤؤُنَاۤ أَوۡ أَن نَّفۡعَلَ فِیۤ أَمۡوَ ٰ⁠لِنَا مَا نَشَـٰۤؤُا۟ۖ إِنَّكَ لَأَنتَ ٱلۡحَلِیمُ ٱلرَّشِیدُ\n"
    }
  },
  {
    "id": 1561,
    "surahId": 11,
    "ayahNumber": 88,
    "arabicText": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَرَزَقَنِی مِنۡهُ رِزۡقًا حَسَنࣰاۚ وَمَاۤ أُرِیدُ أَنۡ أُخَالِفَكُمۡ إِلَىٰ مَاۤ أَنۡهَىٰكُمۡ عَنۡهُۚ إِنۡ أُرِیدُ إِلَّا ٱلۡإِصۡلَـٰحَ مَا ٱسۡتَطَعۡتُۚ وَمَا تَوۡفِیقِیۤ إِلَّا بِٱللَّهِۚ عَلَیۡهِ تَوَكَّلۡتُ وَإِلَیۡهِ أُنِیبُ\n",
    "translations": {
      "en": "He answered: \"O my people! What do you think? If [it be true that] I am taking my stand on a clear evidence from my Sustainer, who has vouchsafed me goodly sustenance [as a gift] from Himself - [how could I speak to you otherwise than I do]? And yet, I have no desire to do, out of opposition to you, what I am asking you not to do: I desire no more than to set things to rights in so far as it lies within my power; but the achievement of my aim depends on God alone. In Him have I placed my trust, and unto Him do I always turn!",
      "ms": "",
      "id": "",
      "ar": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَرَزَقَنِی مِنۡهُ رِزۡقًا حَسَنࣰاۚ وَمَاۤ أُرِیدُ أَنۡ أُخَالِفَكُمۡ إِلَىٰ مَاۤ أَنۡهَىٰكُمۡ عَنۡهُۚ إِنۡ أُرِیدُ إِلَّا ٱلۡإِصۡلَـٰحَ مَا ٱسۡتَطَعۡتُۚ وَمَا تَوۡفِیقِیۤ إِلَّا بِٱللَّهِۚ عَلَیۡهِ تَوَكَّلۡتُ وَإِلَیۡهِ أُنِیبُ\n"
    }
  },
  {
    "id": 1562,
    "surahId": 11,
    "ayahNumber": 89,
    "arabicText": "وَیَـٰقَوۡمِ لَا یَجۡرِمَنَّكُمۡ شِقَاقِیۤ أَن یُصِیبَكُم مِّثۡلُ مَاۤ أَصَابَ قَوۡمَ نُوحٍ أَوۡ قَوۡمَ هُودٍ أَوۡ قَوۡمَ صَـٰلِحࣲۚ وَمَا قَوۡمُ لُوطࣲ مِّنكُم بِبَعِیدࣲ\n",
    "translations": {
      "en": "\"And, O my people, let not [your] dissent from me drive you into sin, lest there befall you the like of what befell the people of Noah, or the people of Hud. or the people of Salih: and [remember that] the people of Lot lived not very far from you!\"",
      "ms": "",
      "id": "",
      "ar": "وَیَـٰقَوۡمِ لَا یَجۡرِمَنَّكُمۡ شِقَاقِیۤ أَن یُصِیبَكُم مِّثۡلُ مَاۤ أَصَابَ قَوۡمَ نُوحٍ أَوۡ قَوۡمَ هُودٍ أَوۡ قَوۡمَ صَـٰلِحࣲۚ وَمَا قَوۡمُ لُوطࣲ مِّنكُم بِبَعِیدࣲ\n"
    }
  },
  {
    "id": 1563,
    "surahId": 11,
    "ayahNumber": 90,
    "arabicText": "وَٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِۚ إِنَّ رَبِّی رَحِیمࣱ وَدُودࣱ\n",
    "translations": {
      "en": "Hence, ask your Sustainer to forgive you your sins, and then turn towards Him in repentance - for, verily, my Sustainer is a dispenser of grace, a fount of love!\"",
      "ms": "",
      "id": "",
      "ar": "وَٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِۚ إِنَّ رَبِّی رَحِیمࣱ وَدُودࣱ\n"
    }
  },
  {
    "id": 1564,
    "surahId": 11,
    "ayahNumber": 91,
    "arabicText": "قَالُوا۟ یَـٰشُعَیۡبُ مَا نَفۡقَهُ كَثِیرࣰا مِّمَّا تَقُولُ وَإِنَّا لَنَرَىٰكَ فِینَا ضَعِیفࣰاۖ وَلَوۡلَا رَهۡطُكَ لَرَجَمۡنَـٰكَۖ وَمَاۤ أَنتَ عَلَیۡنَا بِعَزِیزࣲ\n",
    "translations": {
      "en": "[But his people] said: \"O Shu'ayb! We cannot grasp the purport of much of what thou sayest; on the other hand, behold, we do see clearly how- weak thou art in our midst:\" and were it not for thy family, we would have most certainly stoned thee to death, considering that thou hast no power over us!\"",
      "ms": "",
      "id": "",
      "ar": "قَالُوا۟ یَـٰشُعَیۡبُ مَا نَفۡقَهُ كَثِیرࣰا مِّمَّا تَقُولُ وَإِنَّا لَنَرَىٰكَ فِینَا ضَعِیفࣰاۖ وَلَوۡلَا رَهۡطُكَ لَرَجَمۡنَـٰكَۖ وَمَاۤ أَنتَ عَلَیۡنَا بِعَزِیزࣲ\n"
    }
  },
  {
    "id": 1565,
    "surahId": 11,
    "ayahNumber": 92,
    "arabicText": "قَالَ یَـٰقَوۡمِ أَرَهۡطِیۤ أَعَزُّ عَلَیۡكُم مِّنَ ٱللَّهِ وَٱتَّخَذۡتُمُوهُ وَرَاۤءَكُمۡ ظِهۡرِیًّاۖ إِنَّ رَبِّی بِمَا تَعۡمَلُونَ مُحِیطࣱ\n",
    "translations": {
      "en": "Said he: \"O my people! Do you hold my family in greater esteem than God? -for, Him you regard as something that may be cast behind you and be forgotten! Verily, my Sustainer encompasses [with His might] all that you do!",
      "ms": "",
      "id": "",
      "ar": "قَالَ یَـٰقَوۡمِ أَرَهۡطِیۤ أَعَزُّ عَلَیۡكُم مِّنَ ٱللَّهِ وَٱتَّخَذۡتُمُوهُ وَرَاۤءَكُمۡ ظِهۡرِیًّاۖ إِنَّ رَبِّی بِمَا تَعۡمَلُونَ مُحِیطࣱ\n"
    }
  },
  {
    "id": 1566,
    "surahId": 11,
    "ayahNumber": 93,
    "arabicText": "وَیَـٰقَوۡمِ ٱعۡمَلُوا۟ عَلَىٰ مَكَانَتِكُمۡ إِنِّی عَـٰمِلࣱۖ سَوۡفَ تَعۡلَمُونَ مَن یَأۡتِیهِ عَذَابࣱ یُخۡزِیهِ وَمَنۡ هُوَ كَـٰذِبࣱۖ وَٱرۡتَقِبُوۤا۟ إِنِّی مَعَكُمۡ رَقِیبࣱ\n",
    "translations": {
      "en": "Hence, O my people, do [to me] anything that may be within your power, [while] I, behold, shall labour [in God's way]; in time you will come to know which [of us] shall be visited by suffering that will cover him with ignominy, and which [of us] is a liar. Watch, then, [for what is coming:] behold, I shall watch with you!\"",
      "ms": "",
      "id": "",
      "ar": "وَیَـٰقَوۡمِ ٱعۡمَلُوا۟ عَلَىٰ مَكَانَتِكُمۡ إِنِّی عَـٰمِلࣱۖ سَوۡفَ تَعۡلَمُونَ مَن یَأۡتِیهِ عَذَابࣱ یُخۡزِیهِ وَمَنۡ هُوَ كَـٰذِبࣱۖ وَٱرۡتَقِبُوۤا۟ إِنِّی مَعَكُمۡ رَقِیبࣱ\n"
    }
  },
  {
    "id": 1567,
    "surahId": 11,
    "ayahNumber": 94,
    "arabicText": "وَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا شُعَیۡبࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَأَخَذَتِ ٱلَّذِینَ ظَلَمُوا۟ ٱلصَّیۡحَةُ فَأَصۡبَحُوا۟ فِی دِیَـٰرِهِمۡ جَـٰثِمِینَ\n",
    "translations": {
      "en": "And so, when Our judgment came to pass, by Our grace We saved Shu'ayb and those who shared his faith, whereas the blast [of Our punishment] overtook those who had been bent on evildoing: and then they lay lifeless, in their very homes, on the ground,",
      "ms": "",
      "id": "",
      "ar": "وَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا شُعَیۡبࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَأَخَذَتِ ٱلَّذِینَ ظَلَمُوا۟ ٱلصَّیۡحَةُ فَأَصۡبَحُوا۟ فِی دِیَـٰرِهِمۡ جَـٰثِمِینَ\n"
    }
  },
  {
    "id": 1568,
    "surahId": 11,
    "ayahNumber": 95,
    "arabicText": "كَأَن لَّمۡ یَغۡنَوۡا۟ فِیهَاۤۗ أَلَا بُعۡدࣰا لِّمَدۡیَنَ كَمَا بَعِدَتۡ ثَمُودُ\n",
    "translations": {
      "en": "as though they had never lived there. Oh, away with [the people of] Madyan, even as the Thamud have been done away with!",
      "ms": "",
      "id": "",
      "ar": "كَأَن لَّمۡ یَغۡنَوۡا۟ فِیهَاۤۗ أَلَا بُعۡدࣰا لِّمَدۡیَنَ كَمَا بَعِدَتۡ ثَمُودُ\n"
    }
  },
  {
    "id": 1569,
    "surahId": 11,
    "ayahNumber": 96,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔایَـٰتِنَا وَسُلۡطَـٰنࣲ مُّبِینٍ\n",
    "translations": {
      "en": "AND, INDEED, We sent Moses with Our messages and a manifest authority [from Us]",
      "ms": "",
      "id": "",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔایَـٰتِنَا وَسُلۡطَـٰنࣲ مُّبِینٍ\n"
    }
  },
  {
    "id": 1570,
    "surahId": 11,
    "ayahNumber": 97,
    "arabicText": "إِلَىٰ فِرۡعَوۡنَ وَمَلَإِی۟هِۦ فَٱتَّبَعُوۤا۟ أَمۡرَ فِرۡعَوۡنَۖ وَمَاۤ أَمۡرُ فِرۡعَوۡنَ بِرَشِیدࣲ\n",
    "translations": {
      "en": "unto Pharaoh and his great ones: but these followed [only] Pharaoh's bidding - and Pharaoh's bidding led by no means to what is right.",
      "ms": "",
      "id": "",
      "ar": "إِلَىٰ فِرۡعَوۡنَ وَمَلَإِی۟هِۦ فَٱتَّبَعُوۤا۟ أَمۡرَ فِرۡعَوۡنَۖ وَمَاۤ أَمۡرُ فِرۡعَوۡنَ بِرَشِیدࣲ\n"
    }
  },
  {
    "id": 1571,
    "surahId": 11,
    "ayahNumber": 98,
    "arabicText": "یَقۡدُمُ قَوۡمَهُۥ یَوۡمَ ٱلۡقِیَـٰمَةِ فَأَوۡرَدَهُمُ ٱلنَّارَۖ وَبِئۡسَ ٱلۡوِرۡدُ ٱلۡمَوۡرُودُ\n",
    "translations": {
      "en": "[And so] he shall go before his people on the Day of Resurrection, having led them [in this world] towards the fire [of the life to come]; and vile was the destination towards which they were led -",
      "ms": "",
      "id": "",
      "ar": "یَقۡدُمُ قَوۡمَهُۥ یَوۡمَ ٱلۡقِیَـٰمَةِ فَأَوۡرَدَهُمُ ٱلنَّارَۖ وَبِئۡسَ ٱلۡوِرۡدُ ٱلۡمَوۡرُودُ\n"
    }
  },
  {
    "id": 1572,
    "surahId": 11,
    "ayahNumber": 99,
    "arabicText": "وَأُتۡبِعُوا۟ فِی هَـٰذِهِۦ لَعۡنَةࣰ وَیَوۡمَ ٱلۡقِیَـٰمَةِۚ بِئۡسَ ٱلرِّفۡدُ ٱلۡمَرۡفُودُ\n",
    "translations": {
      "en": "seeing that they were pursued by [God's] rejection in this [world], and [shall be finally overtaken by it] on the Day of Resurrection; [and] vile was the gift which they were given!",
      "ms": "",
      "id": "",
      "ar": "وَأُتۡبِعُوا۟ فِی هَـٰذِهِۦ لَعۡنَةࣰ وَیَوۡمَ ٱلۡقِیَـٰمَةِۚ بِئۡسَ ٱلرِّفۡدُ ٱلۡمَرۡفُودُ\n"
    }
  },
  {
    "id": 1573,
    "surahId": 11,
    "ayahNumber": 100,
    "arabicText": "ذَ ٰ⁠لِكَ مِنۡ أَنۢبَاۤءِ ٱلۡقُرَىٰ نَقُصُّهُۥ عَلَیۡكَۖ مِنۡهَا قَاۤىِٕمࣱ وَحَصِیدࣱ\n",
    "translations": {
      "en": "THIS ACCOUNT of the [fate of those ancient] communities - some of them still remaining, and some [extinct like] a field mown-down - We convey unto thee [as a lesson for mankind]:",
      "ms": "",
      "id": "",
      "ar": "ذَ ٰ⁠لِكَ مِنۡ أَنۢبَاۤءِ ٱلۡقُرَىٰ نَقُصُّهُۥ عَلَیۡكَۖ مِنۡهَا قَاۤىِٕمࣱ وَحَصِیدࣱ\n"
    }
  },
  {
    "id": 1574,
    "surahId": 11,
    "ayahNumber": 101,
    "arabicText": "وَمَا ظَلَمۡنَـٰهُمۡ وَلَـٰكِن ظَلَمُوۤا۟ أَنفُسَهُمۡۖ فَمَاۤ أَغۡنَتۡ عَنۡهُمۡ ءَالِهَتُهُمُ ٱلَّتِی یَدۡعُونَ مِن دُونِ ٱللَّهِ مِن شَیۡءࣲ لَّمَّا جَاۤءَ أَمۡرُ رَبِّكَۖ وَمَا زَادُوهُمۡ غَیۡرَ تَتۡبِیبࣲ\n",
    "translations": {
      "en": "for, no wrong did We do to them, but it was they who wronged themselves. And when thy Sustainer's judgment came to pass, those deities of theirs which they had been wont to invoke instead of God proved of no avail whatever to them, and brought them no more than utter perdition.",
      "ms": "",
      "id": "",
      "ar": "وَمَا ظَلَمۡنَـٰهُمۡ وَلَـٰكِن ظَلَمُوۤا۟ أَنفُسَهُمۡۖ فَمَاۤ أَغۡنَتۡ عَنۡهُمۡ ءَالِهَتُهُمُ ٱلَّتِی یَدۡعُونَ مِن دُونِ ٱللَّهِ مِن شَیۡءࣲ لَّمَّا جَاۤءَ أَمۡرُ رَبِّكَۖ وَمَا زَادُوهُمۡ غَیۡرَ تَتۡبِیبࣲ\n"
    }
  },
  {
    "id": 1575,
    "surahId": 11,
    "ayahNumber": 102,
    "arabicText": "وَكَذَ ٰ⁠لِكَ أَخۡذُ رَبِّكَ إِذَاۤ أَخَذَ ٱلۡقُرَىٰ وَهِیَ ظَـٰلِمَةٌۚ إِنَّ أَخۡذَهُۥۤ أَلِیمࣱ شَدِیدٌ\n",
    "translations": {
      "en": "And such is thy Sustainer's punishing grasp whenever He takes to task any community that is given to evildoing: verily, His punishing grasp is grievous, severe!",
      "ms": "",
      "id": "",
      "ar": "وَكَذَ ٰ⁠لِكَ أَخۡذُ رَبِّكَ إِذَاۤ أَخَذَ ٱلۡقُرَىٰ وَهِیَ ظَـٰلِمَةٌۚ إِنَّ أَخۡذَهُۥۤ أَلِیمࣱ شَدِیدٌ\n"
    }
  },
  {
    "id": 1576,
    "surahId": 11,
    "ayahNumber": 103,
    "arabicText": "إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّمَنۡ خَافَ عَذَابَ ٱلۡـَٔاخِرَةِۚ ذَ ٰ⁠لِكَ یَوۡمࣱ مَّجۡمُوعࣱ لَّهُ ٱلنَّاسُ وَذَ ٰ⁠لِكَ یَوۡمࣱ مَّشۡهُودࣱ\n",
    "translations": {
      "en": "Herein, behold, lies a message indeed for all who fear the suffering [which may befall them] in the life to come, (and are conscious of the coming of] that Day on which all mankind shall be gathered together-that Day [of Judgment] which shall be witnessed [by all that ever lived],",
      "ms": "",
      "id": "",
      "ar": "إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّمَنۡ خَافَ عَذَابَ ٱلۡـَٔاخِرَةِۚ ذَ ٰ⁠لِكَ یَوۡمࣱ مَّجۡمُوعࣱ لَّهُ ٱلنَّاسُ وَذَ ٰ⁠لِكَ یَوۡمࣱ مَّشۡهُودࣱ\n"
    }
  },
  {
    "id": 1577,
    "surahId": 11,
    "ayahNumber": 104,
    "arabicText": "وَمَا نُؤَخِّرُهُۥۤ إِلَّا لِأَجَلࣲ مَّعۡدُودࣲ\n",
    "translations": {
      "en": "and which We shall not delay beyond a term set [by Us].",
      "ms": "",
      "id": "",
      "ar": "وَمَا نُؤَخِّرُهُۥۤ إِلَّا لِأَجَلࣲ مَّعۡدُودࣲ\n"
    }
  },
  {
    "id": 1578,
    "surahId": 11,
    "ayahNumber": 105,
    "arabicText": "یَوۡمَ یَأۡتِ لَا تَكَلَّمُ نَفۡسٌ إِلَّا بِإِذۡنِهِۦۚ فَمِنۡهُمۡ شَقِیࣱّ وَسَعِیدࣱ\n",
    "translations": {
      "en": "When that Day comes, not a soul will speak. unless it be by His leave; and of those [that are gathered together], some will be wretched and some, happy.",
      "ms": "",
      "id": "",
      "ar": "یَوۡمَ یَأۡتِ لَا تَكَلَّمُ نَفۡسٌ إِلَّا بِإِذۡنِهِۦۚ فَمِنۡهُمۡ شَقِیࣱّ وَسَعِیدࣱ\n"
    }
  },
  {
    "id": 1579,
    "surahId": 11,
    "ayahNumber": 106,
    "arabicText": "فَأَمَّا ٱلَّذِینَ شَقُوا۟ فَفِی ٱلنَّارِ لَهُمۡ فِیهَا زَفِیرࣱ وَشَهِیقٌ\n",
    "translations": {
      "en": "Now as for those who [by their deeds] will have brought wretchedness upon them-selves, [they shall live] in the fire, where they will have [nothing but] moans and sobs [to relieve their pain],",
      "ms": "",
      "id": "",
      "ar": "فَأَمَّا ٱلَّذِینَ شَقُوا۟ فَفِی ٱلنَّارِ لَهُمۡ فِیهَا زَفِیرࣱ وَشَهِیقٌ\n"
    }
  },
  {
    "id": 1580,
    "surahId": 11,
    "ayahNumber": 107,
    "arabicText": "خَـٰلِدِینَ فِیهَا مَا دَامَتِ ٱلسَّمَـٰوَ ٰ⁠تُ وَٱلۡأَرۡضُ إِلَّا مَا شَاۤءَ رَبُّكَۚ إِنَّ رَبَّكَ فَعَّالࣱ لِّمَا یُرِیدُ\n",
    "translations": {
      "en": "therein to abide as long as the heavens and the earth endure-unless thy Sustainer wills it otherwise: for, verily, thy Sustainer is a sovereign doer of whatever He wills.",
      "ms": "",
      "id": "",
      "ar": "خَـٰلِدِینَ فِیهَا مَا دَامَتِ ٱلسَّمَـٰوَ ٰ⁠تُ وَٱلۡأَرۡضُ إِلَّا مَا شَاۤءَ رَبُّكَۚ إِنَّ رَبَّكَ فَعَّالࣱ لِّمَا یُرِیدُ\n"
    }
  },
  {
    "id": 1581,
    "surahId": 11,
    "ayahNumber": 108,
    "arabicText": "۞ وَأَمَّا ٱلَّذِینَ سُعِدُوا۟ فَفِی ٱلۡجَنَّةِ خَـٰلِدِینَ فِیهَا مَا دَامَتِ ٱلسَّمَـٰوَ ٰ⁠تُ وَٱلۡأَرۡضُ إِلَّا مَا شَاۤءَ رَبُّكَۖ عَطَاۤءً غَیۡرَ مَجۡذُوذࣲ\n",
    "translations": {
      "en": "But as for those who [by virtue of their past deeds] will have been blest with happiness, [they shall live] in paradise, therein to abide as long as the heavens and the earth endure -unless thy Sustainer wills it otherwise -as a gift unceasing.",
      "ms": "",
      "id": "",
      "ar": "۞ وَأَمَّا ٱلَّذِینَ سُعِدُوا۟ فَفِی ٱلۡجَنَّةِ خَـٰلِدِینَ فِیهَا مَا دَامَتِ ٱلسَّمَـٰوَ ٰ⁠تُ وَٱلۡأَرۡضُ إِلَّا مَا شَاۤءَ رَبُّكَۖ عَطَاۤءً غَیۡرَ مَجۡذُوذࣲ\n"
    }
  },
  {
    "id": 1582,
    "surahId": 11,
    "ayahNumber": 109,
    "arabicText": "فَلَا تَكُ فِی مِرۡیَةࣲ مِّمَّا یَعۡبُدُ هَـٰۤؤُلَاۤءِۚ مَا یَعۡبُدُونَ إِلَّا كَمَا یَعۡبُدُ ءَابَاۤؤُهُم مِّن قَبۡلُۚ وَإِنَّا لَمُوَفُّوهُمۡ نَصِیبَهُمۡ غَیۡرَ مَنقُوصࣲ\n",
    "translations": {
      "en": "AND SO, [O Prophet,] be not in doubt about anything that those [misguided people] worship: they but [thoughtlessly] worship as their forefathers worshipped aforetime; and, behold, We shall most certainly give them their full due [for whatever good or evil they have earned], without diminishing aught thereof.",
      "ms": "",
      "id": "",
      "ar": "فَلَا تَكُ فِی مِرۡیَةࣲ مِّمَّا یَعۡبُدُ هَـٰۤؤُلَاۤءِۚ مَا یَعۡبُدُونَ إِلَّا كَمَا یَعۡبُدُ ءَابَاۤؤُهُم مِّن قَبۡلُۚ وَإِنَّا لَمُوَفُّوهُمۡ نَصِیبَهُمۡ غَیۡرَ مَنقُوصࣲ\n"
    }
  },
  {
    "id": 1583,
    "surahId": 11,
    "ayahNumber": 110,
    "arabicText": "وَلَقَدۡ ءَاتَیۡنَا مُوسَى ٱلۡكِتَـٰبَ فَٱخۡتُلِفَ فِیهِۚ وَلَوۡلَا كَلِمَةࣱ سَبَقَتۡ مِن رَّبِّكَ لَقُضِیَ بَیۡنَهُمۡۚ وَإِنَّهُمۡ لَفِی شَكࣲّ مِّنۡهُ مُرِیبࣲ\n",
    "translations": {
      "en": "And, indeed, [similar was the case when] We vouchsafed the divine writ unto Moses, and some of his people set their own views against it; and had it not been for a decree that had already gone forth from thy Sustainer, judgment would indeed have been passed on them [then and there]: for, behold, they were in grave doubt, amounting to suspicion, about him [who called them unto God].",
      "ms": "",
      "id": "",
      "ar": "وَلَقَدۡ ءَاتَیۡنَا مُوسَى ٱلۡكِتَـٰبَ فَٱخۡتُلِفَ فِیهِۚ وَلَوۡلَا كَلِمَةࣱ سَبَقَتۡ مِن رَّبِّكَ لَقُضِیَ بَیۡنَهُمۡۚ وَإِنَّهُمۡ لَفِی شَكࣲّ مِّنۡهُ مُرِیبࣲ\n"
    }
  },
  {
    "id": 1584,
    "surahId": 11,
    "ayahNumber": 111,
    "arabicText": "وَإِنَّ كُلࣰّا لَّمَّا لَیُوَفِّیَنَّهُمۡ رَبُّكَ أَعۡمَـٰلَهُمۡۚ إِنَّهُۥ بِمَا یَعۡمَلُونَ خَبِیرࣱ\n",
    "translations": {
      "en": "And, verily, unto each and all will thy Sustainer give their full due for whatever [good or evil] they may have done: behold, He is aware of all that they do!",
      "ms": "",
      "id": "",
      "ar": "وَإِنَّ كُلࣰّا لَّمَّا لَیُوَفِّیَنَّهُمۡ رَبُّكَ أَعۡمَـٰلَهُمۡۚ إِنَّهُۥ بِمَا یَعۡمَلُونَ خَبِیرࣱ\n"
    }
  },
  {
    "id": 1585,
    "surahId": 11,
    "ayahNumber": 112,
    "arabicText": "فَٱسۡتَقِمۡ كَمَاۤ أُمِرۡتَ وَمَن تَابَ مَعَكَ وَلَا تَطۡغَوۡا۟ۚ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِیرࣱ\n",
    "translations": {
      "en": "Pursue, then, the right course, as thou hast been bidden [by God], together with all who, with thee, have turned unto Him; and let none of you behave in an overweening manner: for, verily, He sees all that you do.",
      "ms": "",
      "id": "",
      "ar": "فَٱسۡتَقِمۡ كَمَاۤ أُمِرۡتَ وَمَن تَابَ مَعَكَ وَلَا تَطۡغَوۡا۟ۚ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِیرࣱ\n"
    }
  },
  {
    "id": 1586,
    "surahId": 11,
    "ayahNumber": 113,
    "arabicText": "وَلَا تَرۡكَنُوۤا۟ إِلَى ٱلَّذِینَ ظَلَمُوا۟ فَتَمَسَّكُمُ ٱلنَّارُ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِیَاۤءَ ثُمَّ لَا تُنصَرُونَ\n",
    "translations": {
      "en": "And do not incline towards, nor rely upon, those who are bent on evildoing lest the fire [of the hereafter] touch you: for [then] you would have none to protect you from God, nor would you ever be succoured [by Him].",
      "ms": "",
      "id": "",
      "ar": "وَلَا تَرۡكَنُوۤا۟ إِلَى ٱلَّذِینَ ظَلَمُوا۟ فَتَمَسَّكُمُ ٱلنَّارُ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِیَاۤءَ ثُمَّ لَا تُنصَرُونَ\n"
    }
  },
  {
    "id": 1587,
    "surahId": 11,
    "ayahNumber": 114,
    "arabicText": "وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَیِ ٱلنَّهَارِ وَزُلَفࣰا مِّنَ ٱلَّیۡلِۚ إِنَّ ٱلۡحَسَنَـٰتِ یُذۡهِبۡنَ ٱلسَّیِّـَٔاتِۚ ذَ ٰ⁠لِكَ ذِكۡرَىٰ لِلذَّ ٰ⁠كِرِینَ\n",
    "translations": {
      "en": "And be constant in praying at the beginning and the end of the day, as well as during the early watches of the night: for, verily, good deeds drive away evil deeds: this is a reminder to all who bear [God] in mind.",
      "ms": "",
      "id": "",
      "ar": "وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَیِ ٱلنَّهَارِ وَزُلَفࣰا مِّنَ ٱلَّیۡلِۚ إِنَّ ٱلۡحَسَنَـٰتِ یُذۡهِبۡنَ ٱلسَّیِّـَٔاتِۚ ذَ ٰ⁠لِكَ ذِكۡرَىٰ لِلذَّ ٰ⁠كِرِینَ\n"
    }
  },
  {
    "id": 1588,
    "surahId": 11,
    "ayahNumber": 115,
    "arabicText": "وَٱصۡبِرۡ فَإِنَّ ٱللَّهَ لَا یُضِیعُ أَجۡرَ ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "And be patient in adversity: for, verily,. God does not fail to requite the doers of good!",
      "ms": "",
      "id": "",
      "ar": "وَٱصۡبِرۡ فَإِنَّ ٱللَّهَ لَا یُضِیعُ أَجۡرَ ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 1589,
    "surahId": 11,
    "ayahNumber": 116,
    "arabicText": "فَلَوۡلَا كَانَ مِنَ ٱلۡقُرُونِ مِن قَبۡلِكُمۡ أُو۟لُوا۟ بَقِیَّةࣲ یَنۡهَوۡنَ عَنِ ٱلۡفَسَادِ فِی ٱلۡأَرۡضِ إِلَّا قَلِیلࣰا مِّمَّنۡ أَنجَیۡنَا مِنۡهُمۡۗ وَٱتَّبَعَ ٱلَّذِینَ ظَلَمُوا۟ مَاۤ أُتۡرِفُوا۟ فِیهِ وَكَانُوا۟ مُجۡرِمِینَ\n",
    "translations": {
      "en": "BUT, ALAS, among those generations [whom We destroyed] before your time there were no people endowed with any virtue - [people] who would speak out against the [spread of] corruption on earth -except the few of them whom We saved [because of their righteousness], whereas those who were bent on evildoing only pursued pleasures which corrupted their whole being, and so lost themselves in sinning.",
      "ms": "",
      "id": "",
      "ar": "فَلَوۡلَا كَانَ مِنَ ٱلۡقُرُونِ مِن قَبۡلِكُمۡ أُو۟لُوا۟ بَقِیَّةࣲ یَنۡهَوۡنَ عَنِ ٱلۡفَسَادِ فِی ٱلۡأَرۡضِ إِلَّا قَلِیلࣰا مِّمَّنۡ أَنجَیۡنَا مِنۡهُمۡۗ وَٱتَّبَعَ ٱلَّذِینَ ظَلَمُوا۟ مَاۤ أُتۡرِفُوا۟ فِیهِ وَكَانُوا۟ مُجۡرِمِینَ\n"
    }
  },
  {
    "id": 1590,
    "surahId": 11,
    "ayahNumber": 117,
    "arabicText": "وَمَا كَانَ رَبُّكَ لِیُهۡلِكَ ٱلۡقُرَىٰ بِظُلۡمࣲ وَأَهۡلُهَا مُصۡلِحُونَ\n",
    "translations": {
      "en": "For, never would thy Sustainer destroy a community for wrong [beliefs alone] so long as its people behave righteously [towards one another].",
      "ms": "",
      "id": "",
      "ar": "وَمَا كَانَ رَبُّكَ لِیُهۡلِكَ ٱلۡقُرَىٰ بِظُلۡمࣲ وَأَهۡلُهَا مُصۡلِحُونَ\n"
    }
  },
  {
    "id": 1591,
    "surahId": 11,
    "ayahNumber": 118,
    "arabicText": "وَلَوۡ شَاۤءَ رَبُّكَ لَجَعَلَ ٱلنَّاسَ أُمَّةࣰ وَ ٰ⁠حِدَةࣰۖ وَلَا یَزَالُونَ مُخۡتَلِفِینَ\n",
    "translations": {
      "en": "And had thy Sustainer so willed, He could surely have made all mankind one single community: but [He willed it otherwise, and so] they continue to hold divergent views'",
      "ms": "",
      "id": "",
      "ar": "وَلَوۡ شَاۤءَ رَبُّكَ لَجَعَلَ ٱلنَّاسَ أُمَّةࣰ وَ ٰ⁠حِدَةࣰۖ وَلَا یَزَالُونَ مُخۡتَلِفِینَ\n"
    }
  },
  {
    "id": 1592,
    "surahId": 11,
    "ayahNumber": 119,
    "arabicText": "إِلَّا مَن رَّحِمَ رَبُّكَۚ وَلِذَ ٰ⁠لِكَ خَلَقَهُمۡۗ وَتَمَّتۡ كَلِمَةُ رَبِّكَ لَأَمۡلَأَنَّ جَهَنَّمَ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ أَجۡمَعِینَ\n",
    "translations": {
      "en": "[all of them,] save those upon whom thy Sustainer has bestowed His grace. And to this end has He created them [all. But [as for those who refuse to avail themselves of divine guidance,] that word of thy Sustainer shall be fulfilled: \"Most certainly will I fill hell with invisible beings as well as with humans, all together!\"",
      "ms": "",
      "id": "",
      "ar": "إِلَّا مَن رَّحِمَ رَبُّكَۚ وَلِذَ ٰ⁠لِكَ خَلَقَهُمۡۗ وَتَمَّتۡ كَلِمَةُ رَبِّكَ لَأَمۡلَأَنَّ جَهَنَّمَ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 1593,
    "surahId": 11,
    "ayahNumber": 120,
    "arabicText": "وَكُلࣰّا نَّقُصُّ عَلَیۡكَ مِنۡ أَنۢبَاۤءِ ٱلرُّسُلِ مَا نُثَبِّتُ بِهِۦ فُؤَادَكَۚ وَجَاۤءَكَ فِی هَـٰذِهِ ٱلۡحَقُّ وَمَوۡعِظَةࣱ وَذِكۡرَىٰ لِلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "AND [remember:] out of all the accounts relating to the [earlier] apostles We convey unto thee [only] that wherewith We [aim to] make firm thy heart: for through these [accounts] comes the truth unto thee, as well as an admonition and a reminder unto all believers.",
      "ms": "",
      "id": "",
      "ar": "وَكُلࣰّا نَّقُصُّ عَلَیۡكَ مِنۡ أَنۢبَاۤءِ ٱلرُّسُلِ مَا نُثَبِّتُ بِهِۦ فُؤَادَكَۚ وَجَاۤءَكَ فِی هَـٰذِهِ ٱلۡحَقُّ وَمَوۡعِظَةࣱ وَذِكۡرَىٰ لِلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1594,
    "surahId": 11,
    "ayahNumber": 121,
    "arabicText": "وَقُل لِّلَّذِینَ لَا یُؤۡمِنُونَ ٱعۡمَلُوا۟ عَلَىٰ مَكَانَتِكُمۡ إِنَّا عَـٰمِلُونَ\n",
    "translations": {
      "en": "And say unto those who will not believe: \"Do anything that may be within your power, [while] we, behold, shall labour [in God's way];",
      "ms": "",
      "id": "",
      "ar": "وَقُل لِّلَّذِینَ لَا یُؤۡمِنُونَ ٱعۡمَلُوا۟ عَلَىٰ مَكَانَتِكُمۡ إِنَّا عَـٰمِلُونَ\n"
    }
  },
  {
    "id": 1595,
    "surahId": 11,
    "ayahNumber": 122,
    "arabicText": "وَٱنتَظِرُوۤا۟ إِنَّا مُنتَظِرُونَ\n",
    "translations": {
      "en": "and wait [for what is coming]: behold, we too are waiting!\"",
      "ms": "",
      "id": "",
      "ar": "وَٱنتَظِرُوۤا۟ إِنَّا مُنتَظِرُونَ\n"
    }
  },
  {
    "id": 1596,
    "surahId": 11,
    "ayahNumber": 123,
    "arabicText": "وَلِلَّهِ غَیۡبُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَإِلَیۡهِ یُرۡجَعُ ٱلۡأَمۡرُ كُلُّهُۥ فَٱعۡبُدۡهُ وَتَوَكَّلۡ عَلَیۡهِۚ وَمَا رَبُّكَ بِغَـٰفِلٍ عَمَّا تَعۡمَلُونَ\n",
    "translations": {
      "en": "And God alone comprehends the hidden reality of the heavens and the earth: for, all that exists goes back to Him [as its source]. Worship Him, then, and place thy trust in Him alone: for thy Sustainer is not unaware of what you do.",
      "ms": "",
      "id": "",
      "ar": "وَلِلَّهِ غَیۡبُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَإِلَیۡهِ یُرۡجَعُ ٱلۡأَمۡرُ كُلُّهُۥ فَٱعۡبُدۡهُ وَتَوَكَّلۡ عَلَیۡهِۚ وَمَا رَبُّكَ بِغَـٰفِلٍ عَمَّا تَعۡمَلُونَ\n"
    }
  }
]