[
  {
    "id": 2484,
    "surahId": 21,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱقۡتَرَبَ لِلنَّاسِ حِسَابُهُمۡ وَهُمۡ فِی غَفۡلَةࣲ مُّعۡرِضُونَ\n",
    "translations": {
      "en": "CLOSER DRAWS unto men their reckoning: and yet they remain stubbornly heedless [of its approach].",
      "ms": "Telah hampir datangnya kepada manusia hari perhitungan amalnya sedang mereka dalam kelalaian, tidak hiraukan persediaan baginya.",
      "id": "Telah dekat kepada manusia hari menghisab segala amalan mereka, sedang mereka berada dalam kelalaian lagi berpaling (daripadanya).",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱقۡتَرَبَ لِلنَّاسِ حِسَابُهُمۡ وَهُمۡ فِی غَفۡلَةࣲ مُّعۡرِضُونَ\n"
    }
  },
  {
    "id": 2485,
    "surahId": 21,
    "ayahNumber": 2,
    "arabicText": "مَا یَأۡتِیهِم مِّن ذِكۡرࣲ مِّن رَّبِّهِم مُّحۡدَثٍ إِلَّا ٱسۡتَمَعُوهُ وَهُمۡ یَلۡعَبُونَ\n",
    "translations": {
      "en": "Whenever there comes unto them any new re­minder from their Sustainer, they but listen to it with playful amusement,",
      "ms": "Tidak datang kepada mereka itu sebarang peringatan yang diturunkan dari Tuhan mereka lepas satu: satu, melainkan mereka memasang telinga mendengarnya sambil mereka mempermain-mainkannya -",
      "id": "Tidak datang kepada mereka suatu ayat Al Quran pun yang baru (di-turunkan) dari Tuhan mereka, melainkan mereka mendengarnya, sedang mereka bermain-main,",
      "ar": "مَا یَأۡتِیهِم مِّن ذِكۡرࣲ مِّن رَّبِّهِم مُّحۡدَثٍ إِلَّا ٱسۡتَمَعُوهُ وَهُمۡ یَلۡعَبُونَ\n"
    }
  },
  {
    "id": 2486,
    "surahId": 21,
    "ayahNumber": 3,
    "arabicText": "لَاهِیَةࣰ قُلُوبُهُمۡۗ وَأَسَرُّوا۟ ٱلنَّجۡوَى ٱلَّذِینَ ظَلَمُوا۟ هَلۡ هَـٰذَاۤ إِلَّا بَشَرࣱ مِّثۡلُكُمۡۖ أَفَتَأۡتُونَ ٱلسِّحۡرَ وَأَنتُمۡ تُبۡصِرُونَ\n",
    "translations": {
      "en": "their hearts set on passing ­delights; yet they who are [thus] bent on wrongdoing conceal their innermost thoughts [when they say to one another], “Is this [Muhammad] anything but a mortal like yourselves? Will you, then, yield to [his] spellbinding eloquence with your eyes open?”",
      "ms": "Dengan keadaan hati mereka leka daripada memahami dan mengamalkan maksudnya. Dan orang-orang yang zalim itu, berbisik-bisik sesama sendiri dengan berkata: \"Bukankah (Muhammad) ini hanyalah seorang manusia biasa seperti kamu? Maka patutkah kamu turut hadir mendengar sihir yang dibawanya itu sedang kamu nampak dan mengetahui karutnya?\"",
      "id": "(lagi) hati mereka dalam keadaan lalai. Dan mereka yang zalim itu merahasiakan pembicaraan mereka: \"Orang ini tidak lain hanyalah seorang manusia (jua) seperti kamu, maka apakah kamu menerima sihir itu, padahal kamu menyaksikannya?\"",
      "ar": "لَاهِیَةࣰ قُلُوبُهُمۡۗ وَأَسَرُّوا۟ ٱلنَّجۡوَى ٱلَّذِینَ ظَلَمُوا۟ هَلۡ هَـٰذَاۤ إِلَّا بَشَرࣱ مِّثۡلُكُمۡۖ أَفَتَأۡتُونَ ٱلسِّحۡرَ وَأَنتُمۡ تُبۡصِرُونَ\n"
    }
  },
  {
    "id": 2487,
    "surahId": 21,
    "ayahNumber": 4,
    "arabicText": "قَالَ رَبِّی یَعۡلَمُ ٱلۡقَوۡلَ فِی ٱلسَّمَاۤءِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n",
    "translations": {
      "en": "Say: “My Sustainer knows whatever is spoken in heaven and on earth; and He alone is all-hearing, all-knowing.”",
      "ms": "(Bagi menjawab mereka, Nabi Muhammad) berkata: \"Tuhanku mengetahui tiap-tiap perkataan (yang dilahirkan atau disembunyikan oleh makhluk-makhluk) di langit dan di bumi; dan Dia lah jua yang Maha Mendengar, lagi Maha Mengetahui\".",
      "id": "Berkatalah Muhammad (kepada mereka): \"Tuhanku mengetahui semua perkataan di langit dan di bumi dan Dialah Yang Maha Mendengar lagi Maha Mengetahui\".",
      "ar": "قَالَ رَبِّی یَعۡلَمُ ٱلۡقَوۡلَ فِی ٱلسَّمَاۤءِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلسَّمِیعُ ٱلۡعَلِیمُ\n"
    }
  },
  {
    "id": 2488,
    "surahId": 21,
    "ayahNumber": 5,
    "arabicText": "بَلۡ قَالُوۤا۟ أَضۡغَـٰثُ أَحۡلَـٰمِۭ بَلِ ٱفۡتَرَىٰهُ بَلۡ هُوَ شَاعِرࣱ فَلۡیَأۡتِنَا بِـَٔایَةࣲ كَمَاۤ أُرۡسِلَ ٱلۡأَوَّلُونَ\n",
    "translations": {
      "en": "“Nay,” they say, “[Muhammad propounds] the most involved and confusing of dreams!” “Nay, but he has invented [all] this!” - “Nay, but he is [only] a poet!” - [and,] “Let him, then, come unto us with a miracle, just as those [prophets] of old were sent [with miracles]?”",
      "ms": "(Mereka bukan sahaja menyifatkan Al-Quran itu sihir) bahkan mereka menuduh dengan berkata: \"Al-Quran itu perkara karut yang dimimpikan oleh Muhammad, bahkan perkara yang diada-adakan olehnya, bahkan Muhammad sendiri seorang penyair. (Kalaulah ia sebenarnya seorang Rasul) maka hendaklah ia membawa kepada kita satu mukjizat sebagaimana mukjizat-mukjizat yang dibawa oleh Rasul-rasul yang telah diutus dahulu\".",
      "id": "Bahkan mereka berkata (pula): \"(Al Quran itu adalah) mimpi-mimpi yang kalut, malah diada-adakannya, bahkan dia sendiri seorang penyair, maka hendaknya ia mendatangkan kepada kita suatu mukjizat, sebagai-mana rasul-rasul yang telah lalu di-utus\".",
      "ar": "بَلۡ قَالُوۤا۟ أَضۡغَـٰثُ أَحۡلَـٰمِۭ بَلِ ٱفۡتَرَىٰهُ بَلۡ هُوَ شَاعِرࣱ فَلۡیَأۡتِنَا بِـَٔایَةࣲ كَمَاۤ أُرۡسِلَ ٱلۡأَوَّلُونَ\n"
    }
  },
  {
    "id": 2489,
    "surahId": 21,
    "ayahNumber": 6,
    "arabicText": "مَاۤ ءَامَنَتۡ قَبۡلَهُم مِّن قَرۡیَةٍ أَهۡلَكۡنَـٰهَاۤۖ أَفَهُمۡ یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Not one of the communities that We destroyed in bygone times would ever believe [their prophets]: will these, then, [be more willing to] believe?",
      "ms": "Tidak ada penduduk sesebuah negeri pun yang Kami binasakan sebelum mereka, yang telah beriman kepada mukjizat yang diberi kepadanya; maka benarkah mereka yang meminta mukjizat itu mahu beriman?",
      "id": "Tidak ada (penduduk) suatu negeripun yang beriman yang Kami telah membinasakannya sebeIum mereka; maka apakah mereka akan beriman?",
      "ar": "مَاۤ ءَامَنَتۡ قَبۡلَهُم مِّن قَرۡیَةٍ أَهۡلَكۡنَـٰهَاۤۖ أَفَهُمۡ یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 2490,
    "surahId": 21,
    "ayahNumber": 7,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَا قَبۡلَكَ إِلَّا رِجَالࣰا نُّوحِیۤ إِلَیۡهِمۡۖ فَسۡـَٔلُوۤا۟ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ\n",
    "translations": {
      "en": "For [even] before thy time, [O Muhammad,] We never sent [as Our apostles] any but [mortal] men, whom We inspired - hence, [tell the deniers of the truth,] “If you do not know this, ask the followers of earlier revelation”",
      "ms": "Dan Kami tidak mengutus Rasul-rasul sebelummu (wahai Muhammad) melainkan orang-orang lelaki yang Kami wahyukan kepada mereka (bukan malaikat); maka bertanyalah kamu kepada AhluzZikri\" jika kamu tidak mengetahui.",
      "id": "Kami tiada mengutus rasul rasul sebelum kamu (Muhammad), melainkan beberapa orang-laki-laki yang Kami beri wahyu kepada mereka, maka tanyakanlah olehmu kepada orang-orang yang berilmu, jika kamu tiada mengetahui.",
      "ar": "وَمَاۤ أَرۡسَلۡنَا قَبۡلَكَ إِلَّا رِجَالࣰا نُّوحِیۤ إِلَیۡهِمۡۖ فَسۡـَٔلُوۤا۟ أَهۡلَ ٱلذِّكۡرِ إِن كُنتُمۡ لَا تَعۡلَمُونَ\n"
    }
  },
  {
    "id": 2491,
    "surahId": 21,
    "ayahNumber": 8,
    "arabicText": "وَمَا جَعَلۡنَـٰهُمۡ جَسَدࣰا لَّا یَأۡكُلُونَ ٱلطَّعَامَ وَمَا كَانُوا۟ خَـٰلِدِینَ\n",
    "translations": {
      "en": "and neither did We endow them with bodies that could dispense with food nor were they immortal.",
      "ms": "Dan Kami tidak menjadikan Rasul-rasul itu bertubuh badan yang tidak makan minum, dan mereka pula tidak akan kekal hidup selama-lamanya (di dunia).",
      "id": "Dan tidaklah Kami jadikan mereka tubuh-tubuh yang tiada memakan makanan, dan tidak (pula) mereka itu orang-orang yang kekal.",
      "ar": "وَمَا جَعَلۡنَـٰهُمۡ جَسَدࣰا لَّا یَأۡكُلُونَ ٱلطَّعَامَ وَمَا كَانُوا۟ خَـٰلِدِینَ\n"
    }
  },
  {
    "id": 2492,
    "surahId": 21,
    "ayahNumber": 9,
    "arabicText": "ثُمَّ صَدَقۡنَـٰهُمُ ٱلۡوَعۡدَ فَأَنجَیۡنَـٰهُمۡ وَمَن نَّشَاۤءُ وَأَهۡلَكۡنَا ٱلۡمُسۡرِفِینَ\n",
    "translations": {
      "en": "In the end, We made good unto them Our promise, and We saved them and all whom We willed [to save], and We destroyed those who had wasted their own selves.",
      "ms": "Kemudian Kami tepati janji Kami kepada mereka, lalu Kami selamatkan mereka dan sesiapa yang Kami kehendaki, dan (sebaliknya) Kami binasakan orang-orang yang melampaui batas.",
      "id": "Kemudian Kami tepati janji (yang telah Kami janjikan) kepada mereka. Maka Kami selamatkan mereka dan orang-orang yang Kami kehendaki dan Kami binasakan orang-orang yang melampaui batas.",
      "ar": "ثُمَّ صَدَقۡنَـٰهُمُ ٱلۡوَعۡدَ فَأَنجَیۡنَـٰهُمۡ وَمَن نَّشَاۤءُ وَأَهۡلَكۡنَا ٱلۡمُسۡرِفِینَ\n"
    }
  },
  {
    "id": 2493,
    "surahId": 21,
    "ayahNumber": 10,
    "arabicText": "لَقَدۡ أَنزَلۡنَاۤ إِلَیۡكُمۡ كِتَـٰبࣰا فِیهِ ذِكۡرُكُمۡۚ أَفَلَا تَعۡقِلُونَ\n",
    "translations": {
      "en": "[O MEN!] We have now bestowed upon you from on high a divine writ containing all that you ought to bear in mind will you not, then, use your reason?",
      "ms": "Sesungguhnya Kami telah menurunkan kepada kamu sebuah Kitab (Al-Quran) yang mengandungi perkara yang menimbulkan sebutan baik dan kelebihan untuk kamu, maka mengapa kamu tidak memahaminya (dan bersyukur akan nikmat yang besar itu)?",
      "id": "Sesungguhnya telah Kami turunkan kepada kamu sebuah kitab yang di dalamnya terdapat sebab-sebab kemuliaan bagimu. Maka apakah kamu tiada memahaminya?",
      "ar": "لَقَدۡ أَنزَلۡنَاۤ إِلَیۡكُمۡ كِتَـٰبࣰا فِیهِ ذِكۡرُكُمۡۚ أَفَلَا تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 2494,
    "surahId": 21,
    "ayahNumber": 11,
    "arabicText": "وَكَمۡ قَصَمۡنَا مِن قَرۡیَةࣲ كَانَتۡ ظَالِمَةࣰ وَأَنشَأۡنَا بَعۡدَهَا قَوۡمًا ءَاخَرِینَ\n",
    "translations": {
      "en": "For, how many a community that persisted in evildoing have We dashed into fragments, and raised another people in its stead!",
      "ms": "Dan berapa banyak Kami telah pecah-belahkan dan binasakan penduduk negeri yang melakukan kezaliman, dan Kami telah menjadikan sesudah mereka, kaum yang lain sebagai gantinya.",
      "id": "Dan berapa banyaknya (penduduk) negeri yang zalim yang teIah Kami binasakan, dan Kami adakan sesudah mereka itu kaum yang lain (sebagai penggantinya).",
      "ar": "وَكَمۡ قَصَمۡنَا مِن قَرۡیَةࣲ كَانَتۡ ظَالِمَةࣰ وَأَنشَأۡنَا بَعۡدَهَا قَوۡمًا ءَاخَرِینَ\n"
    }
  },
  {
    "id": 2495,
    "surahId": 21,
    "ayahNumber": 12,
    "arabicText": "فَلَمَّاۤ أَحَسُّوا۟ بَأۡسَنَاۤ إِذَا هُم مِّنۡهَا یَرۡكُضُونَ\n",
    "translations": {
      "en": "And [every time,] as soon as they began to feel Our punishing might, lo! they tried to flee from it",
      "ms": "Maka ketika mereka merasai (kedatangan) azab Kami, mereka dengan serta-merta lari keluar dari negeri itu.",
      "id": "Maka tatkala mereka merasakan azab Kami, tiba-tiba mereka melarikan diri dari negerinya.",
      "ar": "فَلَمَّاۤ أَحَسُّوا۟ بَأۡسَنَاۤ إِذَا هُم مِّنۡهَا یَرۡكُضُونَ\n"
    }
  },
  {
    "id": 2496,
    "surahId": 21,
    "ayahNumber": 13,
    "arabicText": "لَا تَرۡكُضُوا۟ وَٱرۡجِعُوۤا۟ إِلَىٰ مَاۤ أُتۡرِفۡتُمۡ فِیهِ وَمَسَـٰكِنِكُمۡ لَعَلَّكُمۡ تُسۡـَٔلُونَ\n",
    "translations": {
      "en": "[and at the same time they seemed to hear a scornful voice]: “Do not try to flee, but return to all that [once] gave you pleasure and corrupted your whole being. and [return] to your homes, so that you might be called to account [for what you have done]!”",
      "ms": "(Lalu dikatakan kepada mereka): \"Janganlah kamu lari, dan sebaliknya kembalilah kepada kemewahan hidup yang telah diberikan kepada kamu, dan ke tempat-tempat tinggal kamu, supaya kamu dapat ditanya mengenai apa yang berlaku\".",
      "id": "Janganlah kamu lari tergesa-gesa; kembalilah kamu kepada nikmat yang telah kamu rasakan dan kepada tempat-tempat kediamanmu (yang baik), supaya kamu ditanya.",
      "ar": "لَا تَرۡكُضُوا۟ وَٱرۡجِعُوۤا۟ إِلَىٰ مَاۤ أُتۡرِفۡتُمۡ فِیهِ وَمَسَـٰكِنِكُمۡ لَعَلَّكُمۡ تُسۡـَٔلُونَ\n"
    }
  },
  {
    "id": 2497,
    "surahId": 21,
    "ayahNumber": 14,
    "arabicText": "قَالُوا۟ یَـٰوَیۡلَنَاۤ إِنَّا كُنَّا ظَـٰلِمِینَ\n",
    "translations": {
      "en": "And they could only cry: “Oh, woe unto us! Verily, we were wrongdoers!”",
      "ms": "(Akhirnya) mereka berkata: \"Aduhai celakanya kami! Sesungguhnya kami adalah orang-orang yang berlaku zalim!\"",
      "id": "Mereka berkata: \"Aduhai, celaka kami, sesungguhnya kami adalah orang-orang yang zaIim\".",
      "ar": "قَالُوا۟ یَـٰوَیۡلَنَاۤ إِنَّا كُنَّا ظَـٰلِمِینَ\n"
    }
  },
  {
    "id": 2498,
    "surahId": 21,
    "ayahNumber": 15,
    "arabicText": "فَمَا زَالَت تِّلۡكَ دَعۡوَىٰهُمۡ حَتَّىٰ جَعَلۡنَـٰهُمۡ حَصِیدًا خَـٰمِدِینَ\n",
    "translations": {
      "en": "And that cry of theirs did not cease until We caused them to become [like] a field mown down, still and silent as ashes.",
      "ms": "Maka demikianlah seterusnya jeritan dan keluhan mereka, sehingga Kami jadikan mereka hancur lebur dan sunyi-sepi.",
      "id": "Maka tetaplah demikian keluhan mereka, sehingga Kami jadikan mereka sebagai tanaman yang telah dituai, yang tidak dapat hidup lagi.",
      "ar": "فَمَا زَالَت تِّلۡكَ دَعۡوَىٰهُمۡ حَتَّىٰ جَعَلۡنَـٰهُمۡ حَصِیدًا خَـٰمِدِینَ\n"
    }
  },
  {
    "id": 2499,
    "surahId": 21,
    "ayahNumber": 16,
    "arabicText": "وَمَا خَلَقۡنَا ٱلسَّمَاۤءَ وَٱلۡأَرۡضَ وَمَا بَیۡنَهُمَا لَـٰعِبِینَ\n",
    "translations": {
      "en": "AND [know that] We have not created the heavens and the earth and all that is between them in mere idle play:",
      "ms": "Dan (ingatlah) tidaklah Kami menciptakan langit dan bumi serta segala yang ada di antaranya, secara main-main.",
      "id": "Dan tidaklah Kami ciptakan Iangit dan bumi dan segala yang ada di antara keduanya dengan bermain-main.",
      "ar": "وَمَا خَلَقۡنَا ٱلسَّمَاۤءَ وَٱلۡأَرۡضَ وَمَا بَیۡنَهُمَا لَـٰعِبِینَ\n"
    }
  },
  {
    "id": 2500,
    "surahId": 21,
    "ayahNumber": 17,
    "arabicText": "لَوۡ أَرَدۡنَاۤ أَن نَّتَّخِذَ لَهۡوࣰا لَّٱتَّخَذۡنَـٰهُ مِن لَّدُنَّاۤ إِن كُنَّا فَـٰعِلِینَ\n",
    "translations": {
      "en": "[for,] had We willed to indulge in a pastime, We would indeed have produced it from within Ourselves - if such had been Our will at all!",
      "ms": "Sekiranya Kami hendak mengambil sesuatu untuk hiburan, tentulah Kami akan mengambilnya dari sisi Kami; Kami tidak melakukannya.",
      "id": "Sekiranya Kami hendak membuat sesuatu permainan, (isteri dan anak), tentulah Kami membuatnya dari sisi Kami. Jika Kami menghendaki berbuat demikian, (tentulah Kami telah melakukannya).",
      "ar": "لَوۡ أَرَدۡنَاۤ أَن نَّتَّخِذَ لَهۡوࣰا لَّٱتَّخَذۡنَـٰهُ مِن لَّدُنَّاۤ إِن كُنَّا فَـٰعِلِینَ\n"
    }
  },
  {
    "id": 2501,
    "surahId": 21,
    "ayahNumber": 18,
    "arabicText": "بَلۡ نَقۡذِفُ بِٱلۡحَقِّ عَلَى ٱلۡبَـٰطِلِ فَیَدۡمَغُهُۥ فَإِذَا هُوَ زَاهِقࣱۚ وَلَكُمُ ٱلۡوَیۡلُ مِمَّا تَصِفُونَ\n",
    "translations": {
      "en": "Nay, but [by the very act of creation] We hurl the truth against falsehood, and it crushes the latter: and lo! it withers away. But woe unto you for all your [attempts at] defining [God] –",
      "ms": "Bahkan Kami sentiasa mengarahkan yang benar menentang yang salah, lalu ia menghancurkannya, maka dengan serta-merta hilang lenyaplah dia. Dan (tetaplah) kecelakaan akan menimpa kamu disebabkan apa yang kamu sifatkan (terhadap Kami).",
      "id": "Sebenarya Kami melontarkan yang hak kepada yang batil lalu yang hak itu menghancurkannya, maka dengan serta merta yang batil itu lenyap. Dan kecelakaanlah bagimu disebabkan kamu mensifati (Allah dengan sifat-sifat yang tidak layak bagi-Nya).",
      "ar": "بَلۡ نَقۡذِفُ بِٱلۡحَقِّ عَلَى ٱلۡبَـٰطِلِ فَیَدۡمَغُهُۥ فَإِذَا هُوَ زَاهِقࣱۚ وَلَكُمُ ٱلۡوَیۡلُ مِمَّا تَصِفُونَ\n"
    }
  },
  {
    "id": 2502,
    "surahId": 21,
    "ayahNumber": 19,
    "arabicText": "وَلَهُۥ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَمَنۡ عِندَهُۥ لَا یَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِهِۦ وَلَا یَسۡتَحۡسِرُونَ\n",
    "translations": {
      "en": "for, unto Him belong all [beings] that are in the heavens and on earth; and those that are with Him are never too proud to worship Him and never grow weary [thereof]:",
      "ms": "Dan (ingatlah) segala yang ada di langit dan di bumi adalah milik kepunyaan Allah jua; dan malaikat-malaikat yang ada di sisiNya tidak membesarkan diri dan tidak enggan daripada beribadat kepadaNya, dan tidak pula mereka merasa penat dan letih.",
      "id": "Dan kepunyaan-Nya-lah segala yang di langit dan di bumi. Dan malaikat-malaikat yang di sisi-Nya, mereka tiada mempunyai rasa angkuh untuk menyembah-Nya dan tiada (pula) merasa letih.",
      "ar": "وَلَهُۥ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَمَنۡ عِندَهُۥ لَا یَسۡتَكۡبِرُونَ عَنۡ عِبَادَتِهِۦ وَلَا یَسۡتَحۡسِرُونَ\n"
    }
  },
  {
    "id": 2503,
    "surahId": 21,
    "ayahNumber": 20,
    "arabicText": "یُسَبِّحُونَ ٱلَّیۡلَ وَٱلنَّهَارَ لَا یَفۡتُرُونَ\n",
    "translations": {
      "en": "they extol His lim­itless glory by night and by day, never flagging [therein].",
      "ms": "Mereka beribadat malam dan siang, dengan tidak berhenti-henti.",
      "id": "Mereka selalu bertasbih malam dan siang tiada henti-hentinya.",
      "ar": "یُسَبِّحُونَ ٱلَّیۡلَ وَٱلنَّهَارَ لَا یَفۡتُرُونَ\n"
    }
  },
  {
    "id": 2504,
    "surahId": 21,
    "ayahNumber": 21,
    "arabicText": "أَمِ ٱتَّخَذُوۤا۟ ءَالِهَةࣰ مِّنَ ٱلۡأَرۡضِ هُمۡ یُنشِرُونَ\n",
    "translations": {
      "en": "And yet some people choose to worship certain earthly things or beings as deities that [are supposed to] resurrect [the dead; and they fail to realize that],",
      "ms": "Adakah benda-benda dari bumi yang mereka jadikan tuhan-tuhan itu, dapat menghidupkan semula sesuatu yang mati?",
      "id": "Apakah mereka mengambil tuhan-tuhan dari bumi, yang dapat menghidupkan (orang-orang mati)?",
      "ar": "أَمِ ٱتَّخَذُوۤا۟ ءَالِهَةࣰ مِّنَ ٱلۡأَرۡضِ هُمۡ یُنشِرُونَ\n"
    }
  },
  {
    "id": 2505,
    "surahId": 21,
    "ayahNumber": 22,
    "arabicText": "لَوۡ كَانَ فِیهِمَاۤ ءَالِهَةٌ إِلَّا ٱللَّهُ لَفَسَدَتَاۚ فَسُبۡحَـٰنَ ٱللَّهِ رَبِّ ٱلۡعَرۡشِ عَمَّا یَصِفُونَ\n",
    "translations": {
      "en": "had there been in heaven or on earth any deities other than God, both [those realms would surely have fallen into ruin! But limitless in His glory is God, enthroned in His awesome almightiness far] above anything that men may devise by way of definition!",
      "ms": "Kalau ada di langit dan di bumi tuhan-tuhan yang lain dari Allah, nescaya rosaklah pentadbiran kedua-duanya. Maka (bertauhidlah kamu kepada Allah dengan menegaskan): Maha Suci Allah, Tuhan yang mempunyai Arasy, dari apa yang mereka sifatkan.",
      "id": "Sekiranya ada di langit dan di bumi tuhan-tuhan selain Allah, tentulah keduanya itu telah rusak binasa. Maka Maha Suci Allah yang mempunyai 'Arsy daripada apa yang mereka sifatkan.",
      "ar": "لَوۡ كَانَ فِیهِمَاۤ ءَالِهَةٌ إِلَّا ٱللَّهُ لَفَسَدَتَاۚ فَسُبۡحَـٰنَ ٱللَّهِ رَبِّ ٱلۡعَرۡشِ عَمَّا یَصِفُونَ\n"
    }
  },
  {
    "id": 2506,
    "surahId": 21,
    "ayahNumber": 23,
    "arabicText": "لَا یُسۡـَٔلُ عَمَّا یَفۡعَلُ وَهُمۡ یُسۡـَٔلُونَ\n",
    "translations": {
      "en": "He cannot be called to account for whatever He does, whereas they will be called to account:",
      "ms": "Ia tidak boleh ditanya tentang apa yang Ia lakukan, sedang merekalah yang akan ditanya kelak.",
      "id": "Dia tidak ditanya tentang apa yang diperbuat-Nya dan merekalah yang akan ditanyai.",
      "ar": "لَا یُسۡـَٔلُ عَمَّا یَفۡعَلُ وَهُمۡ یُسۡـَٔلُونَ\n"
    }
  },
  {
    "id": 2507,
    "surahId": 21,
    "ayahNumber": 24,
    "arabicText": "أَمِ ٱتَّخَذُوا۟ مِن دُونِهِۦۤ ءَالِهَةࣰۖ قُلۡ هَاتُوا۟ بُرۡهَـٰنَكُمۡۖ هَـٰذَا ذِكۡرُ مَن مَّعِیَ وَذِكۡرُ مَن قَبۡلِیۚ بَلۡ أَكۡثَرُهُمۡ لَا یَعۡلَمُونَ ٱلۡحَقَّۖ فَهُم مُّعۡرِضُونَ\n",
    "translations": {
      "en": "and yet, they choose to worship [imaginary] deities instead of Him! Say [O Prophet]: “Produce an evidence for what you are claiming: this is a reminder [unceasingly voiced] by those who are with me, just as it was a reminder [voiced] by those who came before me.” But nay, most of them do not know the truth, and so they stubbornly turn away [from it]",
      "ms": "Patutkah mereka menyembah tuhan-tuhan yang lain dari Allah? Katakanlah (wahai Muhammad): \"Bawalah keterangan dan bukti kamu; kandungan Al-Quran ini menjadi peringatan dan bukti tauhid umatku, juga peringatan dan bukti tauhid umat-umat yang dahulu daripadaku\". (Kaum musyrik tidak mempunyai sebarang keterangan) bahkan kebanyakan mereka tidak mengetahui mana yang benar dan mana yang salah, dengan sebab itulah maka mereka berpaling ingkar.",
      "id": "Apakah mereka mengambil tuhan-tuhan selain-Nya? Katakanlah: \"Unjukkanlah hujjahmu! (Al Quran) ini adalah peringatan bagi orang-orang yang bersamaku, dan peringatan bagi orang-orang yang sebelumku\". Sebenarnya kebanyakan mereka tiada mengetahui yang hak, karena itu mereka berpaling.",
      "ar": "أَمِ ٱتَّخَذُوا۟ مِن دُونِهِۦۤ ءَالِهَةࣰۖ قُلۡ هَاتُوا۟ بُرۡهَـٰنَكُمۡۖ هَـٰذَا ذِكۡرُ مَن مَّعِیَ وَذِكۡرُ مَن قَبۡلِیۚ بَلۡ أَكۡثَرُهُمۡ لَا یَعۡلَمُونَ ٱلۡحَقَّۖ فَهُم مُّعۡرِضُونَ\n"
    }
  },
  {
    "id": 2508,
    "surahId": 21,
    "ayahNumber": 25,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَا مِن قَبۡلِكَ مِن رَّسُولٍ إِلَّا نُوحِیۤ إِلَیۡهِ أَنَّهُۥ لَاۤ إِلَـٰهَ إِلَّاۤ أَنَا۠ فَٱعۡبُدُونِ\n",
    "translations": {
      "en": "and [this despite the fact that even] before thy time We never sent any apostle without having revealed to him that there is no deity save Me, - [and that,] therefore, you shall worship Me [alone]!",
      "ms": "Dan Kami tidak mengutus sebelummu (wahai Muhammad) seseorang Rasul pun melainkan Kami wahyukan kepadanya: \"Bahawa sesungguhnya tiada Tuhan (yang berhak disembah) melainkan Aku; oleh itu, beribadatlah kamu kepadaKu\".",
      "id": "Dan Kami tidak mengutus seorang rasulpun sebelum kamu melainkan Kami wahyukan kepadanya: \"Bahwasanya tidak ada Tuhan (yang hak) melainkan Aku, maka sembahlah olehmu sekalian akan Aku\".",
      "ar": "وَمَاۤ أَرۡسَلۡنَا مِن قَبۡلِكَ مِن رَّسُولٍ إِلَّا نُوحِیۤ إِلَیۡهِ أَنَّهُۥ لَاۤ إِلَـٰهَ إِلَّاۤ أَنَا۠ فَٱعۡبُدُونِ\n"
    }
  },
  {
    "id": 2509,
    "surahId": 21,
    "ayahNumber": 26,
    "arabicText": "وَقَالُوا۟ ٱتَّخَذَ ٱلرَّحۡمَـٰنُ وَلَدࣰاۗ سُبۡحَـٰنَهُۥۚ بَلۡ عِبَادࣱ مُّكۡرَمُونَ\n",
    "translations": {
      "en": "And [yet,] some say, “The Most Gracious has taken unto Himself a son”! Limitless is He in His glory! Nay, [those whom they regard as God’s “offspring” are but His] honoured servants:",
      "ms": "Dan mereka (yang musyrik) berkata: \"(Allah) Ar-Rahman mempunyai anak\". Maha Sucilah Ia. Bahkan (mereka yang dikatakan menjadi anak Allah itu) ialah hamba-hambaNya yang dimuliakan.",
      "id": "Dan mereka berkata: \"Tuhan Yang Maha Pemurah telah mengambil (mempunyai) anak\", Maha Suci Allah. Sebenarnya (malaikat-malaikat itu), adalah hamba-hamba yang dimuliakan,",
      "ar": "وَقَالُوا۟ ٱتَّخَذَ ٱلرَّحۡمَـٰنُ وَلَدࣰاۗ سُبۡحَـٰنَهُۥۚ بَلۡ عِبَادࣱ مُّكۡرَمُونَ\n"
    }
  },
  {
    "id": 2510,
    "surahId": 21,
    "ayahNumber": 27,
    "arabicText": "لَا یَسۡبِقُونَهُۥ بِٱلۡقَوۡلِ وَهُم بِأَمۡرِهِۦ یَعۡمَلُونَ\n",
    "translations": {
      "en": "they speak not until He has spoken unto them, and [whenever they act,] they act at His behest.",
      "ms": "Mereka tidak mendahuluiNya dengan perkataan dan mereka pula mengerjakan apa yang diperintahkanNya.",
      "id": "mereka itu tidak mendahului-Nya dengan perkataan dan mereka mengerjakan perintah-perintah-Nya.",
      "ar": "لَا یَسۡبِقُونَهُۥ بِٱلۡقَوۡلِ وَهُم بِأَمۡرِهِۦ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 2511,
    "surahId": 21,
    "ayahNumber": 28,
    "arabicText": "یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡ وَلَا یَشۡفَعُونَ إِلَّا لِمَنِ ٱرۡتَضَىٰ وَهُم مِّنۡ خَشۡیَتِهِۦ مُشۡفِقُونَ\n",
    "translations": {
      "en": "He knows all that lies open before them and all that is hidden from them: hence, they cannot intercede for any but those whom He has [already] graced with His goodly acceptance, since they themselves stand in reverent awe of Him.",
      "ms": "Allah mengetahui apa yang di hadapan mereka (yang telah mereka lakukan), dan apa yang di belakang mereka (yang akan mereka lakukan); dan mereka tidak memohon syafaat melainkan bagi sesiapa yang diredhai Allah; dan mereka pula sentiasa cemas takut daripada ditimpa azabNya.",
      "id": "Allah mengetahui segala sesuatu yang dihadapan mereka (malaikat) dan yang di belakang mereka, dan mereka tiada memberi syafa'at melainkan kepada orang yang diridhai Allah, dan mereka itu selalu berhati-hati karena takut kepada-Nya.",
      "ar": "یَعۡلَمُ مَا بَیۡنَ أَیۡدِیهِمۡ وَمَا خَلۡفَهُمۡ وَلَا یَشۡفَعُونَ إِلَّا لِمَنِ ٱرۡتَضَىٰ وَهُم مِّنۡ خَشۡیَتِهِۦ مُشۡفِقُونَ\n"
    }
  },
  {
    "id": 2512,
    "surahId": 21,
    "ayahNumber": 29,
    "arabicText": "۞ وَمَن یَقُلۡ مِنۡهُمۡ إِنِّیۤ إِلَـٰهࣱ مِّن دُونِهِۦ فَذَ ٰ⁠لِكَ نَجۡزِیهِ جَهَنَّمَۚ كَذَ ٰ⁠لِكَ نَجۡزِی ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "And if any of them were to say, “Behold, I am deity beside Him” - that one We should requite with hell: thus do We requite all [such] evildoers.",
      "ms": "Dan (jika ada) sesiapa di antara mereka berkata: \"Sesungguhnya aku ialah tuhan selain dari Allah\", maka yang berkata sedemikian itu, Kami akan membalasnya dengan (azab) neraka jahannam; demikianlah Kami membalas golongan yang zalim.",
      "id": "Dan barangsiapa di antara mereka, mengatakan: \"Sesungguhnya Aku adalah tuhan selain daripada Allah\", maka orang itu Kami beri balasan dengan Jahannam, demikian Kami memberikan pembalasan kepada orang-orang zalim.",
      "ar": "۞ وَمَن یَقُلۡ مِنۡهُمۡ إِنِّیۤ إِلَـٰهࣱ مِّن دُونِهِۦ فَذَ ٰ⁠لِكَ نَجۡزِیهِ جَهَنَّمَۚ كَذَ ٰ⁠لِكَ نَجۡزِی ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 2513,
    "surahId": 21,
    "ayahNumber": 30,
    "arabicText": "أَوَلَمۡ یَرَ ٱلَّذِینَ كَفَرُوۤا۟ أَنَّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقࣰا فَفَتَقۡنَـٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَاۤءِ كُلَّ شَیۡءٍ حَیٍّۚ أَفَلَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "ARE, THEN, they who are bent on denying the truth not aware that the heavens and the earth were [once] one single entity, which We then parted asunder? – and [that] We made out of water every living thing? Will they not, then, [begin to] believe?",
      "ms": "Dan tidakkah orang-orang kafir itu memikirkan dan mempercayai bahawa sesungguhnya langit dan bumi itu pada asal mulanya bercantum (sebagai benda yang satu), lalu Kami pisahkan antara keduanya? Dan Kami jadikan dari air, tiap-tiap benda yang hidup? Maka mengapa mereka tidak mahu beriman?",
      "id": "Dan apakah orang-orang yang kafir tidak mengetahui bahwasanya langit dan bumi itu keduanya dahulu adalah suatu yang padu, kemudian Kami pisahkan antara keduanya. Dan dari air Kami jadikan segala sesuatu yang hidup. Maka mengapakah mereka tiada juga beriman?",
      "ar": "أَوَلَمۡ یَرَ ٱلَّذِینَ كَفَرُوۤا۟ أَنَّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقࣰا فَفَتَقۡنَـٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَاۤءِ كُلَّ شَیۡءٍ حَیٍّۚ أَفَلَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 2514,
    "surahId": 21,
    "ayahNumber": 31,
    "arabicText": "وَجَعَلۡنَا فِی ٱلۡأَرۡضِ رَوَ ٰ⁠سِیَ أَن تَمِیدَ بِهِمۡ وَجَعَلۡنَا فِیهَا فِجَاجࣰا سُبُلࣰا لَّعَلَّهُمۡ یَهۡتَدُونَ\n",
    "translations": {
      "en": "And [are they not aware that] We have set up firm mountains on earth, lest it sway with them, and [that] We have appointed thereon broad paths, so that they might find their way,",
      "ms": "Dan Kami telah menjadikan di bumi gunung-ganang yang menetapnya, supaya bumi itu tidak menggegar mereka; dan Kami jadikan padanya celah-celah sebagai jalan-jalan lalu-lalang, supaya mereka dapat sampai kepada mencapai keperluan rohani dan jasmani.",
      "id": "Dan telah Kami jadikan di bumi ini gunung-gunung yang kokoh supaya bumi itu (tidak) goncang bersama mereka dan telah Kami jadikan (pula) di bumi itu jalan-jalan yang luas, agar mereka mendapat petunjuk.",
      "ar": "وَجَعَلۡنَا فِی ٱلۡأَرۡضِ رَوَ ٰ⁠سِیَ أَن تَمِیدَ بِهِمۡ وَجَعَلۡنَا فِیهَا فِجَاجࣰا سُبُلࣰا لَّعَلَّهُمۡ یَهۡتَدُونَ\n"
    }
  },
  {
    "id": 2515,
    "surahId": 21,
    "ayahNumber": 32,
    "arabicText": "وَجَعَلۡنَا ٱلسَّمَاۤءَ سَقۡفࣰا مَّحۡفُوظࣰاۖ وَهُمۡ عَنۡ ءَایَـٰتِهَا مُعۡرِضُونَ\n",
    "translations": {
      "en": "and [that] We have set up the sky as a canopy well-secured? And yet, they stubbornly turn away from [all] the signs of this [creation],",
      "ms": "Dan Kami telah menjadikan langit sebagai bumbung yang terpelihara dan terkawal, sedang mereka (yang kafir itu) berpaling tidak memerhatikan tanda-tanda (kekuasaan Kami) yang ada padanya.",
      "id": "Dan Kami menjadikan langit itu sebagai atap yang terpelihara, sedang mereka berpaling dari segala tanda-tanda (kekuasaan Allah) yang terdapat padanya.",
      "ar": "وَجَعَلۡنَا ٱلسَّمَاۤءَ سَقۡفࣰا مَّحۡفُوظࣰاۖ وَهُمۡ عَنۡ ءَایَـٰتِهَا مُعۡرِضُونَ\n"
    }
  },
  {
    "id": 2516,
    "surahId": 21,
    "ayahNumber": 33,
    "arabicText": "وَهُوَ ٱلَّذِی خَلَقَ ٱلَّیۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلࣱّ فِی فَلَكࣲ یَسۡبَحُونَ\n",
    "translations": {
      "en": "and [fail to see that] it is He who has created the night and the day and the sun and the moon - all of them floating through space!",
      "ms": "Dan Dia lah (Tuhan) yang telah menjadikan malam dan siang, serta matahari dan bulan; tiap-tiap satunya beredar terapung-apung di tempat edaran masing-masing (di angkasa lepas).",
      "id": "Dan Dialah yang telah menciptakan malam dan siang, matahari dan bulan. Masing-masing dari keduanya itu beredar di dalam garis edarnya.",
      "ar": "وَهُوَ ٱلَّذِی خَلَقَ ٱلَّیۡلَ وَٱلنَّهَارَ وَٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلࣱّ فِی فَلَكࣲ یَسۡبَحُونَ\n"
    }
  },
  {
    "id": 2517,
    "surahId": 21,
    "ayahNumber": 34,
    "arabicText": "وَمَا جَعَلۡنَا لِبَشَرࣲ مِّن قَبۡلِكَ ٱلۡخُلۡدَۖ أَفَإِی۟ن مِّتَّ فَهُمُ ٱلۡخَـٰلِدُونَ\n",
    "translations": {
      "en": "AND [remind those who deny thee, O Prophet, that] never have We granted life everlasting to any mortal before thee: but do they, perchance, hope that al­though thou must die, they will live forever?”",
      "ms": "Dan Kami tidak menjadikan seseorang manusia sebelummu dapat hidup kekal (di dunia ini). Maka kalau engkau meninggal dunia (wahai Muhammad), adakah mereka akan hidup selama-lamanya?",
      "id": "Kami tidak menjadikan hidup abadi bagi seorang manusiapun sebelum kamu (Muhammad); maka jikalau kamu mati, apakah mereka akan kekal?",
      "ar": "وَمَا جَعَلۡنَا لِبَشَرࣲ مِّن قَبۡلِكَ ٱلۡخُلۡدَۖ أَفَإِی۟ن مِّتَّ فَهُمُ ٱلۡخَـٰلِدُونَ\n"
    }
  },
  {
    "id": 2518,
    "surahId": 21,
    "ayahNumber": 35,
    "arabicText": "كُلُّ نَفۡسࣲ ذَاۤىِٕقَةُ ٱلۡمَوۡتِۗ وَنَبۡلُوكُم بِٱلشَّرِّ وَٱلۡخَیۡرِ فِتۡنَةࣰۖ وَإِلَیۡنَا تُرۡجَعُونَ\n",
    "translations": {
      "en": "Every human being is bound to taste death; and We test you [all] through the bad and the good [things of life] by way of trial: and unto Us you all must return.",
      "ms": "Tiap-tiap diri akan merasai mati, dan Kami menguji kamu dengan kesusahan dan kesenangan sebagai cubaan; dan kepada Kamilah kamu semua akan dikembalikan.",
      "id": "Tiap-tiap yang berjiwa akan merasakan mati. Kami akan menguji kamu dengan keburukan dan kebaikan sebagai cobaan (yang sebenar-benarnya). Dan hanya kepada Kamilah kamu dikembalikan.",
      "ar": "كُلُّ نَفۡسࣲ ذَاۤىِٕقَةُ ٱلۡمَوۡتِۗ وَنَبۡلُوكُم بِٱلشَّرِّ وَٱلۡخَیۡرِ فِتۡنَةࣰۖ وَإِلَیۡنَا تُرۡجَعُونَ\n"
    }
  },
  {
    "id": 2519,
    "surahId": 21,
    "ayahNumber": 36,
    "arabicText": "وَإِذَا رَءَاكَ ٱلَّذِینَ كَفَرُوۤا۟ إِن یَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَـٰذَا ٱلَّذِی یَذۡكُرُ ءَالِهَتَكُمۡ وَهُم بِذِكۡرِ ٱلرَّحۡمَـٰنِ هُمۡ كَـٰفِرُونَ\n",
    "translations": {
      "en": "But [thus it is:] whenever they who are bent on denying the truth consider thee, they make thee but a target of their mockery, [saying to one another,] “Is this the one who speaks [so contemptuously] of your gods?” and yet, it is they themselves who, at [every] mention of the Most Gracious, are wont to deny the truth!",
      "ms": "Dan apabila orang-orang kafir itu melihatmu, mereka hanyalah menjadikan perkara yang engkau sampaikan itu sebagai ejek-ejekan sahaja, sambil berkata sesama sendiri: \"Inikah dia orangnya yang mencaci tuhan-tuhan kamu?\" (Mereka berkata demikian) sedang mereka sendiri kufur ingkar kepada Al-Quran yang mengandungi peringatan Allah yang melimpah-limpah rahmatNya.",
      "id": "Dan apahila orang-orang kafir itu melihat kamu, mereka hanya membuat kamu menjadi olok-olok. (Mereka mengatakan): \"Apakah ini orang yang mencela tuhan-tuhan-mu?\", padahal mereka adaIah orang-orang yang ingkar mengingat Allah Yang Maha Pemurah.",
      "ar": "وَإِذَا رَءَاكَ ٱلَّذِینَ كَفَرُوۤا۟ إِن یَتَّخِذُونَكَ إِلَّا هُزُوًا أَهَـٰذَا ٱلَّذِی یَذۡكُرُ ءَالِهَتَكُمۡ وَهُم بِذِكۡرِ ٱلرَّحۡمَـٰنِ هُمۡ كَـٰفِرُونَ\n"
    }
  },
  {
    "id": 2520,
    "surahId": 21,
    "ayahNumber": 37,
    "arabicText": "خُلِقَ ٱلۡإِنسَـٰنُ مِنۡ عَجَلࣲۚ سَأُو۟رِیكُمۡ ءَایَـٰتِی فَلَا تَسۡتَعۡجِلُونِ\n",
    "translations": {
      "en": "Man is a creature of haste; [but in time] I shall make obvious to you [the truth of] My mes­sages: do not, then, ask Me to hasten [it]!",
      "ms": "Jenis manusia dijadikan bertabiat terburu-buru dalam segala halya; Aku (Allah) akan perlihatkan kepada kamu tanda-tanda kekuasaanKu; maka janganlah kamu meminta disegerakan (kedatangannya).",
      "id": "Manusia telah dijadikan (bertabiat) tergesa-gesa. Kelak akan Aku perIihatkan kepadamu tanda-tanda azab-Ku. Maka janganlah kamu minta kepada-Ku mendatangkannya dengan segera.",
      "ar": "خُلِقَ ٱلۡإِنسَـٰنُ مِنۡ عَجَلࣲۚ سَأُو۟رِیكُمۡ ءَایَـٰتِی فَلَا تَسۡتَعۡجِلُونِ\n"
    }
  },
  {
    "id": 2521,
    "surahId": 21,
    "ayahNumber": 38,
    "arabicText": "وَیَقُولُونَ مَتَىٰ هَـٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "But they [who reject My messages are wont to] ask, “When is that promise [of God’s judgment] to be fulfilled? [Answer this, O you who believe in it,] if you are men of truth!”",
      "ms": "Dan (kerana tabiat terburu-burunya) mereka berkata: \"Bilakah berlakunya janji azab itu, jika betul kamu orang-orang yang berkata benar?\".",
      "id": "Mereka berkata: \"Kapankah janji itu akan datang, jika kamu sekaIian adalah orang-orang yang benar?\"",
      "ar": "وَیَقُولُونَ مَتَىٰ هَـٰذَا ٱلۡوَعۡدُ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 2522,
    "surahId": 21,
    "ayahNumber": 39,
    "arabicText": "لَوۡ یَعۡلَمُ ٱلَّذِینَ كَفَرُوا۟ حِینَ لَا یَكُفُّونَ عَن وُجُوهِهِمُ ٱلنَّارَ وَلَا عَن ظُهُورِهِمۡ وَلَا هُمۡ یُنصَرُونَ\n",
    "translations": {
      "en": "If they but knew - they who are bent on deny­ing the truth - [that there will come] a time when they will not be able to ward off the fire from their faces, nor from their backs, and will not find any succour!",
      "ms": "Kalaulah orang-orang kafir itu mengetahui apa yang akan menimpa mereka ketika mereka tidak dapat menahan atau mengelakkan api neraka dari muka dan belakang mereka, dan mereka pula tidak diberi pertolongan, (tentulah mereka segera beriman, dan tidak berkata demikian).",
      "id": "Andaikata orang-orang kafir itu mengetahui, waktu (di mana) mereka itu tidak mampu mengelakkan api neraka dari muka mereka dan (tidak pula) dari punggung mereka, sedang mereka (tidak pula) mendapat pertolongan, (tentulah mereka tiada meminta disegerakan).",
      "ar": "لَوۡ یَعۡلَمُ ٱلَّذِینَ كَفَرُوا۟ حِینَ لَا یَكُفُّونَ عَن وُجُوهِهِمُ ٱلنَّارَ وَلَا عَن ظُهُورِهِمۡ وَلَا هُمۡ یُنصَرُونَ\n"
    }
  },
  {
    "id": 2523,
    "surahId": 21,
    "ayahNumber": 40,
    "arabicText": "بَلۡ تَأۡتِیهِم بَغۡتَةࣰ فَتَبۡهَتُهُمۡ فَلَا یَسۡتَطِیعُونَ رَدَّهَا وَلَا هُمۡ یُنظَرُونَ\n",
    "translations": {
      "en": "Nay, but [the Last Hour] will come upon them of a sudden, and will stupefy them: and they will be unable to avert it, and neither wilt they be allowed any respite.",
      "ms": "(Mereka tidak diberitahu akan masa itu) bahkan (yang dijanjikan) itu akan datang kepada mereka secara mengejut, serta terus membingungkan mereka; maka mereka tidak akan terdaya menolaknya, dan tidak akan diberi tempoh bertaubat.",
      "id": "Sebenarnya (azab) itu akan datang kepada mereka dengan sekonyong-konyong lalu membuat mereka menjadi panik, maka mereka tidak sanggup menolaknya dan tidak (pula) mereka diberi tangguh.",
      "ar": "بَلۡ تَأۡتِیهِم بَغۡتَةࣰ فَتَبۡهَتُهُمۡ فَلَا یَسۡتَطِیعُونَ رَدَّهَا وَلَا هُمۡ یُنظَرُونَ\n"
    }
  },
  {
    "id": 2524,
    "surahId": 21,
    "ayahNumber": 41,
    "arabicText": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلࣲ مِّن قَبۡلِكَ فَحَاقَ بِٱلَّذِینَ سَخِرُوا۟ مِنۡهُم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n",
    "translations": {
      "en": "And, indeed, [O Muhammad, even] before thy time have [God’s] apostles been derided - but those who scoffed at them were [in the end] overwhelmed by the very thing which they had been wont to deride.",
      "ms": "Dan demi sesungguhnya, telah diperolok-olokkan beberapa Rasul sebelummu, lalu orang-orang yang mengejek-ejek di antara mereka, ditimpakan balasan azab bagi apa yang mereka telah perolok-olokkan itu.",
      "id": "Dan sungguh telah diperolok-olokkan beberapa orang rasul sebelum kamu maka turunlah kepada orang yang mencemoohkan rasul-rasul itu azab yang selalu mereka perolok-olokkan.",
      "ar": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلࣲ مِّن قَبۡلِكَ فَحَاقَ بِٱلَّذِینَ سَخِرُوا۟ مِنۡهُم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n"
    }
  },
  {
    "id": 2525,
    "surahId": 21,
    "ayahNumber": 42,
    "arabicText": "قُلۡ مَن یَكۡلَؤُكُم بِٱلَّیۡلِ وَٱلنَّهَارِ مِنَ ٱلرَّحۡمَـٰنِۚ بَلۡ هُمۡ عَن ذِكۡرِ رَبِّهِم مُّعۡرِضُونَ\n",
    "translations": {
      "en": "Say: “Who could protect you, by night or by day, from the Most Gracious?” And yet, from a remembrance of their Sustainer do they stubbornly turn away!",
      "ms": "Katakanlah (wahai Muhammad): \"Siapakah yang dapat menjaga keselamatan kamu pada malam dan siang daripada azab Tuhan yang bersifat Maha Pemurah?\" (Mereka tidak memikirkan yang demikian) bahkan mereka tetap berpaling ingkar dari pengajaran Tuhan mereka.",
      "id": "Katakanlah: \"Siapakah yang dapat memelihara kamu di waktu malam dan siang hari dari (azab Allah) Yang Maha Pemurah?\" Sebenarnya mereka adalah orang-orang yang berpaling dari mengingati Tuhan mereka.",
      "ar": "قُلۡ مَن یَكۡلَؤُكُم بِٱلَّیۡلِ وَٱلنَّهَارِ مِنَ ٱلرَّحۡمَـٰنِۚ بَلۡ هُمۡ عَن ذِكۡرِ رَبِّهِم مُّعۡرِضُونَ\n"
    }
  },
  {
    "id": 2526,
    "surahId": 21,
    "ayahNumber": 43,
    "arabicText": "أَمۡ لَهُمۡ ءَالِهَةࣱ تَمۡنَعُهُم مِّن دُونِنَاۚ لَا یَسۡتَطِیعُونَ نَصۡرَ أَنفُسِهِمۡ وَلَا هُم مِّنَّا یُصۡحَبُونَ\n",
    "translations": {
      "en": "Do they [really think that they] have deities that could shield them from Us? Those [alleged dei­ties] are not [even] able to succour themselves: hence, neither can they [who worship them hope to] be aided [by them] against Us.",
      "ms": "Tidak ada bagi mereka tuhan-tuhan yang dapat melindungi mereka dari azab Kami. Mereka yang dipertuhankan itu tidak dapat menolong dirinya sendiri, dan tidak pula mereka dibantu dengan pertolongan dari pihak Kami.",
      "id": "Atau adakah mereka mempunyai tuhan-tuhan yang dapat memelihara mereka dari (azab) Kami. Tuhan-tuhan itu tidak sanggup menolong diri mereka sendiri dan tidak (pula) mereka dilindungi dari (azab) Kami itu?",
      "ar": "أَمۡ لَهُمۡ ءَالِهَةࣱ تَمۡنَعُهُم مِّن دُونِنَاۚ لَا یَسۡتَطِیعُونَ نَصۡرَ أَنفُسِهِمۡ وَلَا هُم مِّنَّا یُصۡحَبُونَ\n"
    }
  },
  {
    "id": 2527,
    "surahId": 21,
    "ayahNumber": 44,
    "arabicText": "بَلۡ مَتَّعۡنَا هَـٰۤؤُلَاۤءِ وَءَابَاۤءَهُمۡ حَتَّىٰ طَالَ عَلَیۡهِمُ ٱلۡعُمُرُۗ أَفَلَا یَرَوۡنَ أَنَّا نَأۡتِی ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۤۚ أَفَهُمُ ٱلۡغَـٰلِبُونَ\n",
    "translations": {
      "en": "Nay, We have allowed these [sinners] – as [We allowed] their forebears – to enjoy the good things of life for a great length of time: but then – have they never yet seen how We visit the earth [with Our punishment], gradually depriving it of all that is best thereon? Can they, then, [hope to] be the winners?",
      "ms": "(Bukan benda-benda yang dipertuhankan itu yang memberi kesenangan kepada mereka) bahkan Kami biarkan mereka dan datuk-nenek mereka menikmati (kesenangan hidup) hingga berlanjutanlah umur mereka (dalam keadaan yang menyebabkan berlaku perkara yang tidak diingini mereka). Maka tidakkah mereka melihat bahawa kami datangi daerah bumi yang mereka kuasai dengan menguranginya sedikit demi sedikit dari sempadan-sempadannya? Jika demikian halnya, maka adakah mereka yang akan menang?",
      "id": "Sebenarnya Kami telah memberi mereka dan bapak-bapak mereka kenikmatan (hidup di dunia) hingga panjanglah umur mereka. Maka apakah mereka tidak melihat bahwasanya Kami mendatangi negeri (orang kafir), lalu Kami kurangi luasnya dari segala penjurunya. Maka apakah mereka yang menang?",
      "ar": "بَلۡ مَتَّعۡنَا هَـٰۤؤُلَاۤءِ وَءَابَاۤءَهُمۡ حَتَّىٰ طَالَ عَلَیۡهِمُ ٱلۡعُمُرُۗ أَفَلَا یَرَوۡنَ أَنَّا نَأۡتِی ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۤۚ أَفَهُمُ ٱلۡغَـٰلِبُونَ\n"
    }
  },
  {
    "id": 2528,
    "surahId": 21,
    "ayahNumber": 45,
    "arabicText": "قُلۡ إِنَّمَاۤ أُنذِرُكُم بِٱلۡوَحۡیِۚ وَلَا یَسۡمَعُ ٱلصُّمُّ ٱلدُّعَاۤءَ إِذَا مَا یُنذَرُونَ\n",
    "translations": {
      "en": "SAY [unto all men]: “I but warn you on the strength of divine revelation!” But the deaf [of heart] will not hearken to this call, however often they are warned.",
      "ms": "Katakanlah (wahai Muhammad): \"Sesungguhnya aku hanyalah memberi amaran kepada kamu dengan wahyu (Al-Quran yang diturunkan Allah kepadaku); dan sudah tentu orang-orang yang pekak tidak dapat mendengar seruan apabila mereka diberi amaran, (maka janganlah kamu menjadi pekak kerana azab Tuhan amatlah berat).",
      "id": "Katakanlah (hai Muhammad): \"Sesungguhnya aku hanya memberi peringatan kepada kamu sekalian dengan wahyu dan tiadalah orang-orang yang tuli mendengar seruan, apabila mereka diberi peringatan\"",
      "ar": "قُلۡ إِنَّمَاۤ أُنذِرُكُم بِٱلۡوَحۡیِۚ وَلَا یَسۡمَعُ ٱلصُّمُّ ٱلدُّعَاۤءَ إِذَا مَا یُنذَرُونَ\n"
    }
  },
  {
    "id": 2529,
    "surahId": 21,
    "ayahNumber": 46,
    "arabicText": "وَلَىِٕن مَّسَّتۡهُمۡ نَفۡحَةࣱ مِّنۡ عَذَابِ رَبِّكَ لَیَقُولُنَّ یَـٰوَیۡلَنَاۤ إِنَّا كُنَّا ظَـٰلِمِینَ\n",
    "translations": {
      "en": "And yet, if but a breath of thy Sustainer’s chastisement touches them, they are sure to cry, “Oh, woe unto us! Verily, we were evildoers!”",
      "ms": "Dan demi sesungguhnya, jika mereka disentuh oleh sedikit sahaja dari azab Tuhanmu, sudah tentu mereka akan berkata: \"Aduhai celakanya kami! Sebenarnya kami adalah orang-orang yang zalim (terhadap diri sendiri)!\"",
      "id": "Dan sesungguhnya, jika mereka ditimpa sedikit saja dari azab Tuhan-mu, pastilah mereka berkata: \"Aduhai, celakalah kami, bahwasanya kami adalah orang yang menganiaya diri sendiri\".",
      "ar": "وَلَىِٕن مَّسَّتۡهُمۡ نَفۡحَةࣱ مِّنۡ عَذَابِ رَبِّكَ لَیَقُولُنَّ یَـٰوَیۡلَنَاۤ إِنَّا كُنَّا ظَـٰلِمِینَ\n"
    }
  },
  {
    "id": 2530,
    "surahId": 21,
    "ayahNumber": 47,
    "arabicText": "وَنَضَعُ ٱلۡمَوَ ٰ⁠زِینَ ٱلۡقِسۡطَ لِیَوۡمِ ٱلۡقِیَـٰمَةِ فَلَا تُظۡلَمُ نَفۡسࣱ شَیۡـࣰٔاۖ وَإِن كَانَ مِثۡقَالَ حَبَّةࣲ مِّنۡ خَرۡدَلٍ أَتَیۡنَا بِهَاۗ وَكَفَىٰ بِنَا حَـٰسِبِینَ\n",
    "translations": {
      "en": "But We shall set up just balance-scales on Resurrection Day, and no human being shall be wrong­ed in the least: for though there be [in him but] the weight of a mustard-seed [of good or evil], We shall bring it forth; and none can take count as We do!",
      "ms": "Dan (ingatlah) Kami akan mengadakan neraca timbangan yang adil untuk (menimbang amal makhluk-makhluk pada) hari kiamat; maka tidak ada diri sesiapa akan teraniaya sedikitpun; dan jika (amalnya) itu seberat biji sawi (sekalipun), nescaya Kami akan mendatangkannya (untuk ditimbang dan dihitung); dan cukuplah Kami sebagai Penghitung.",
      "id": "Kami akan memasang timbangan yang tepat pada hari kiamat, maka tiadalah dirugikan seseorang barang sedikitpun. Dan jika (amalan itu) hanya seberat biji sawipun pasti Kami mendatangkan (pahala)nya. Dan cukuplah Kami sebagai pembuat perhitungan.",
      "ar": "وَنَضَعُ ٱلۡمَوَ ٰ⁠زِینَ ٱلۡقِسۡطَ لِیَوۡمِ ٱلۡقِیَـٰمَةِ فَلَا تُظۡلَمُ نَفۡسࣱ شَیۡـࣰٔاۖ وَإِن كَانَ مِثۡقَالَ حَبَّةࣲ مِّنۡ خَرۡدَلٍ أَتَیۡنَا بِهَاۗ وَكَفَىٰ بِنَا حَـٰسِبِینَ\n"
    }
  },
  {
    "id": 2531,
    "surahId": 21,
    "ayahNumber": 48,
    "arabicText": "وَلَقَدۡ ءَاتَیۡنَا مُوسَىٰ وَهَـٰرُونَ ٱلۡفُرۡقَانَ وَضِیَاۤءࣰ وَذِكۡرࣰا لِّلۡمُتَّقِینَ\n",
    "translations": {
      "en": "AND, INDEED, We vouchsafed unto Moses and Aaron [Our revelation as] the standard by which to discern the true from the false, and as a [guiding] light and a reminder for the God-conscious",
      "ms": "Dan demi sesungguhnya, Kami telah memberi kepada Nabi Musa dan Nabi Harun Kitab (Taurat) yang membezakan antara yang benar dengan yang salah, dan yang menjadi cahaya yang menerangi, serta yang mengandungi pengajaran, bagi orang-orang yang mahu bertaqwa.",
      "id": "Dan sesungguhnya telah Kami berikan kepada Musa dan Harun Kitab Taurat dan penerangan serta pengajaran bagi orang-orang yang bertakwa.",
      "ar": "وَلَقَدۡ ءَاتَیۡنَا مُوسَىٰ وَهَـٰرُونَ ٱلۡفُرۡقَانَ وَضِیَاۤءࣰ وَذِكۡرࣰا لِّلۡمُتَّقِینَ\n"
    }
  },
  {
    "id": 2532,
    "surahId": 21,
    "ayahNumber": 49,
    "arabicText": "ٱلَّذِینَ یَخۡشَوۡنَ رَبَّهُم بِٱلۡغَیۡبِ وَهُم مِّنَ ٱلسَّاعَةِ مُشۡفِقُونَ\n",
    "translations": {
      "en": "who stand in awe of their Sustainer although He is beyond the reach of human perception, and who tremble at the thought of the Last Hour.",
      "ms": "Iaitu mereka yang takut (melanggar hukum-hukum) Tuhannya semasa mereka tidak dilihat orang, dan mereka pula gerun cemas akan (peristiwa-peristiwa yang mengerikan pada) hari kiamat.",
      "id": "(yaitu) orang-orang yang takut akan (azab) Tuhan mereka, sedang mereka tidak melihat-Nya, dan mereka merasa takut akan (tibanya) hari kiamat.",
      "ar": "ٱلَّذِینَ یَخۡشَوۡنَ رَبَّهُم بِٱلۡغَیۡبِ وَهُم مِّنَ ٱلسَّاعَةِ مُشۡفِقُونَ\n"
    }
  },
  {
    "id": 2533,
    "surahId": 21,
    "ayahNumber": 50,
    "arabicText": "وَهَـٰذَا ذِكۡرࣱ مُّبَارَكٌ أَنزَلۡنَـٰهُۚ أَفَأَنتُمۡ لَهُۥ مُنكِرُونَ\n",
    "translations": {
      "en": "And [like those earlier revelations,] this one, too, is a blessed reminder which We have bestowed from on high: will you, then, disavow it?",
      "ms": "Dan Al-Quran ini juga pengajaran yang berkat, yang Kami turunkan (kepada Nabi Muhammad); dengan keadaan yang demikian maka patutkah kamu mengingkarinya?",
      "id": "Dan Al Quran ini adalah suatu kitab (peringatan) yang mempunyai berkah yang telah Kami turunkan. Maka mengapakah kamu mengingkarinya?",
      "ar": "وَهَـٰذَا ذِكۡرࣱ مُّبَارَكٌ أَنزَلۡنَـٰهُۚ أَفَأَنتُمۡ لَهُۥ مُنكِرُونَ\n"
    }
  },
  {
    "id": 2534,
    "surahId": 21,
    "ayahNumber": 51,
    "arabicText": "۞ وَلَقَدۡ ءَاتَیۡنَاۤ إِبۡرَ ٰ⁠هِیمَ رُشۡدَهُۥ مِن قَبۡلُ وَكُنَّا بِهِۦ عَـٰلِمِینَ\n",
    "translations": {
      "en": "AND, INDEED, long before [the time of Moses] We vouchsafed unto Abraham his consciousness of what is right; and We were aware of [what moved] him",
      "ms": "Dan demi sesungguhnya, Kami telah memberi kepada Nabi Ibrahim sebelum itu jalan yang benar dalam bertauhid, dan Kami adalah mengetahui akan halnya.",
      "id": "Dan sesungguhnya telah Kami anugerahkan kepada Ibrahim hidayah kebenaran sebelum (Musa dan Harun), dan adalah Kami mengetahui (keadaan)nya.",
      "ar": "۞ وَلَقَدۡ ءَاتَیۡنَاۤ إِبۡرَ ٰ⁠هِیمَ رُشۡدَهُۥ مِن قَبۡلُ وَكُنَّا بِهِۦ عَـٰلِمِینَ\n"
    }
  },
  {
    "id": 2535,
    "surahId": 21,
    "ayahNumber": 52,
    "arabicText": "إِذۡ قَالَ لِأَبِیهِ وَقَوۡمِهِۦ مَا هَـٰذِهِ ٱلتَّمَاثِیلُ ٱلَّتِیۤ أَنتُمۡ لَهَا عَـٰكِفُونَ\n",
    "translations": {
      "en": "when he said unto his father and his people, “What are these images to which you are so intensely devoted?”",
      "ms": "Ketika ia berkata kepada bapanya dan kaumnya: \"Apakah hakikatnya patung-patung ini yang kamu bersungguh-sungguh memujanya?\"",
      "id": "(Ingatlah), ketika Ibrahim berkata kepada bapaknya dan kaumnya: \"Patung-patung apakah ini yang kamu tekun beribadat kepadanya?\"",
      "ar": "إِذۡ قَالَ لِأَبِیهِ وَقَوۡمِهِۦ مَا هَـٰذِهِ ٱلتَّمَاثِیلُ ٱلَّتِیۤ أَنتُمۡ لَهَا عَـٰكِفُونَ\n"
    }
  },
  {
    "id": 2536,
    "surahId": 21,
    "ayahNumber": 53,
    "arabicText": "قَالُوا۟ وَجَدۡنَاۤ ءَابَاۤءَنَا لَهَا عَـٰبِدِینَ\n",
    "translations": {
      "en": "They answered: “We found our forefathers worshipping them.”",
      "ms": "Mereka menjawab: \"Kami dapati datuk nenek kami selalu menyembahnya\".",
      "id": "Mereka menjawab: \"Kami mendapati bapak-bapak kami menyembahnya\".",
      "ar": "قَالُوا۟ وَجَدۡنَاۤ ءَابَاۤءَنَا لَهَا عَـٰبِدِینَ\n"
    }
  },
  {
    "id": 2537,
    "surahId": 21,
    "ayahNumber": 54,
    "arabicText": "قَالَ لَقَدۡ كُنتُمۡ أَنتُمۡ وَءَابَاۤؤُكُمۡ فِی ضَلَـٰلࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "Said he: “Indeed, you and your forefathers have obviously gone astray!”",
      "ms": "Ia berkata: \"Sesungguhnya kamu dan datuk-nenek kamu adalah dalam kesesatan yang nyata\".",
      "id": "Ibrahim berkata: \"Sesungguhnya kamu dan bapak-bapakmu berada dalam kesesatan yang nyata\".",
      "ar": "قَالَ لَقَدۡ كُنتُمۡ أَنتُمۡ وَءَابَاۤؤُكُمۡ فِی ضَلَـٰلࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 2538,
    "surahId": 21,
    "ayahNumber": 55,
    "arabicText": "قَالُوۤا۟ أَجِئۡتَنَا بِٱلۡحَقِّ أَمۡ أَنتَ مِنَ ٱللَّـٰعِبِینَ\n",
    "translations": {
      "en": "They asked: “Hast thou come unto us [with this claim] in all earnest - or art thou one of those jesters?”",
      "ms": "Mereka bertanya: \"Adakah engkau membawa kepada kami sesuatu yang benar (sebagai seorang Rasul), atau engkau dari orang-orang yang bermain-main sahaja?\"",
      "id": "Mereka menjawab: \"Apakah kamu datang kepada kami dengan sungguh-sungguh ataukah kamu termasuk orang-orang yang bermain-main?\"",
      "ar": "قَالُوۤا۟ أَجِئۡتَنَا بِٱلۡحَقِّ أَمۡ أَنتَ مِنَ ٱللَّـٰعِبِینَ\n"
    }
  },
  {
    "id": 2539,
    "surahId": 21,
    "ayahNumber": 56,
    "arabicText": "قَالَ بَل رَّبُّكُمۡ رَبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ ٱلَّذِی فَطَرَهُنَّ وَأَنَا۠ عَلَىٰ ذَ ٰ⁠لِكُم مِّنَ ٱلشَّـٰهِدِینَ\n",
    "translations": {
      "en": "He answered: “Nay, but your [true] Sustainer is the Sustainer of the heavens and the earth - He who has brought them into being: and I am one of those who bear witness to this [truth]!”",
      "ms": "Ia menjawab: \"(Bukan bermain-main) bahkan (untuk menegaskan bahawa) Tuhan kamu ialah Tuhan yang mentadbirkan langit dan bumi, Dia lah yang menciptanya; dan aku adalah dari orang-orang yang boleh memberi keterangan mengesahkan yang demikian itu.",
      "id": "Ibrahim berkata: \"Sebenarnya Tuhan kamu ialah Tuhan langit dan bumi yang telah menciptakannya: dan aku termasuk orang-orang yang dapat memberikan bukti atas yang demikian itu\".",
      "ar": "قَالَ بَل رَّبُّكُمۡ رَبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ ٱلَّذِی فَطَرَهُنَّ وَأَنَا۠ عَلَىٰ ذَ ٰ⁠لِكُم مِّنَ ٱلشَّـٰهِدِینَ\n"
    }
  },
  {
    "id": 2540,
    "surahId": 21,
    "ayahNumber": 57,
    "arabicText": "وَتَٱللَّهِ لَأَكِیدَنَّ أَصۡنَـٰمَكُم بَعۡدَ أَن تُوَلُّوا۟ مُدۡبِرِینَ\n",
    "translations": {
      "en": "And [he added to himself.] “By God, I shall most certainly bring about the downfall of your idols as soon as you have turned your backs and gone away!”",
      "ms": "\"Dan demi Allah, aku akan jalankan rancangan terhadap berhala-berhala kamu, sesudah kamu pergi meninggalkan (rumah berhala ini)\".",
      "id": "Demi Allah, sesungguhnya aku akan melakukan tipu daya terhadap berhala-berhalamu sesudah kamu pergi meninggalkannya.",
      "ar": "وَتَٱللَّهِ لَأَكِیدَنَّ أَصۡنَـٰمَكُم بَعۡدَ أَن تُوَلُّوا۟ مُدۡبِرِینَ\n"
    }
  },
  {
    "id": 2541,
    "surahId": 21,
    "ayahNumber": 58,
    "arabicText": "فَجَعَلَهُمۡ جُذَ ٰ⁠ذًا إِلَّا كَبِیرࣰا لَّهُمۡ لَعَلَّهُمۡ إِلَیۡهِ یَرۡجِعُونَ\n",
    "translations": {
      "en": "And then he broke those [idols] to pieces, [all] save the biggest of them, so that they might [be able to] turn to it.",
      "ms": "Lalu ia memecahkan semuanya berketul-ketul, kecuali sebuah berhala mereka yang besar (dibiarkannya), supaya mereka kembali kepadanya.",
      "id": "Maka Ibrahim membuat berhala-berhala itu hancur berpotong-potong, kecuali yang terbesar (induk) dari patung-patung yang lain; agar mereka kembali (untuk bertanya) kepadanya.",
      "ar": "فَجَعَلَهُمۡ جُذَ ٰ⁠ذًا إِلَّا كَبِیرࣰا لَّهُمۡ لَعَلَّهُمۡ إِلَیۡهِ یَرۡجِعُونَ\n"
    }
  },
  {
    "id": 2542,
    "surahId": 21,
    "ayahNumber": 59,
    "arabicText": "قَالُوا۟ مَن فَعَلَ هَـٰذَا بِـَٔالِهَتِنَاۤ إِنَّهُۥ لَمِنَ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "[When they saw what had happened,] they said: “Who has done this to our gods? Verily, one of the worst wrongdoers is he!”",
      "ms": "(Setelah melihat kejadian itu) mereka bertanya: \"Siapakah yang melakukan perbuatan yang demikian terhadap tuhan-tuhan kami? Sesungguhnya adalah ia dari orang-orang yang zalim\".",
      "id": "Mereka berkata: \"Siapakah yang melakukan perbuatan ini terhadap tuhan-tuhan kami, sesungguhnya dia termasuk orang-orang yang zalim\".",
      "ar": "قَالُوا۟ مَن فَعَلَ هَـٰذَا بِـَٔالِهَتِنَاۤ إِنَّهُۥ لَمِنَ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 2543,
    "surahId": 21,
    "ayahNumber": 60,
    "arabicText": "قَالُوا۟ سَمِعۡنَا فَتࣰى یَذۡكُرُهُمۡ یُقَالُ لَهُۥۤ إِبۡرَ ٰ⁠هِیمُ\n",
    "translations": {
      "en": "Said some [of them]: “We heard a youth speak of these [gods with scorn]: he is called Abraham.”",
      "ms": "(Setengah dari) mereka berkata: \"Kami ada mendengar seorang anak muda bernama Ibrahim, mencacinya\".",
      "id": "Mereka berkata: \"Kami dengar ada seorang pemuda yang mencela berhala-berhala ini yang bernama Ibrahim\".",
      "ar": "قَالُوا۟ سَمِعۡنَا فَتࣰى یَذۡكُرُهُمۡ یُقَالُ لَهُۥۤ إِبۡرَ ٰ⁠هِیمُ\n"
    }
  },
  {
    "id": 2544,
    "surahId": 21,
    "ayahNumber": 61,
    "arabicText": "قَالُوا۟ فَأۡتُوا۟ بِهِۦ عَلَىٰۤ أَعۡیُنِ ٱلنَّاسِ لَعَلَّهُمۡ یَشۡهَدُونَ\n",
    "translations": {
      "en": "[The others] said: “Then bring him before the peoples eyes, so that they might bear witness [against him]!”",
      "ms": "(Ketua-ketua) mereka berkata: \"Jika demikian, bawalah dia di hadapan orang ramai supaya mereka menyaksikan (tindakan mengenainya).",
      "id": "Mereka berkata: \"(Kalau demikian) bawalah dia dengan cara yang dapat dilihat orang banyak, agar mereka menyaksikan\".",
      "ar": "قَالُوا۟ فَأۡتُوا۟ بِهِۦ عَلَىٰۤ أَعۡیُنِ ٱلنَّاسِ لَعَلَّهُمۡ یَشۡهَدُونَ\n"
    }
  },
  {
    "id": 2545,
    "surahId": 21,
    "ayahNumber": 62,
    "arabicText": "قَالُوۤا۟ ءَأَنتَ فَعَلۡتَ هَـٰذَا بِـَٔالِهَتِنَا یَـٰۤإِبۡرَ ٰ⁠هِیمُ\n",
    "translations": {
      "en": "[And when he came.] they asked: “Hast thou done this to our gods, O Abraham?”",
      "ms": "(Setelah ia dibawa ke situ) mereka bertanya: \"Engkaukah yang melakukan demikian kepada tuhan-tuhan kami, hai Ibrahim?\"",
      "id": "Mereka bertanya: \"Apakah kamu, yang melakukan perbuatan ini terhadap tuhan-tuhan kami, hai Ibrahim?\"",
      "ar": "قَالُوۤا۟ ءَأَنتَ فَعَلۡتَ هَـٰذَا بِـَٔالِهَتِنَا یَـٰۤإِبۡرَ ٰ⁠هِیمُ\n"
    }
  },
  {
    "id": 2546,
    "surahId": 21,
    "ayahNumber": 63,
    "arabicText": "قَالَ بَلۡ فَعَلَهُۥ كَبِیرُهُمۡ هَـٰذَا فَسۡـَٔلُوهُمۡ إِن كَانُوا۟ یَنطِقُونَ\n",
    "translations": {
      "en": "He answered: “Nay, it was this one, the big­gest of them, that did it: but ask them [yourselves] - provided they can speak!”",
      "ms": "Ia menjawab: \"(Tidak) bahkan yang melakukannya ialah (berhala) yang besar di antara mereka ini! Maka bertanyalah kamu kepada mereka kalau-kalau mereka dapat berkata-kata\".",
      "id": "Ibrahim menjawab: \"Sebenarnya patung yang besar itulah yang melakukannya, maka tanyakanlah kepada berhala itu, jika mereka dapat berbicara\".",
      "ar": "قَالَ بَلۡ فَعَلَهُۥ كَبِیرُهُمۡ هَـٰذَا فَسۡـَٔلُوهُمۡ إِن كَانُوا۟ یَنطِقُونَ\n"
    }
  },
  {
    "id": 2547,
    "surahId": 21,
    "ayahNumber": 64,
    "arabicText": "فَرَجَعُوۤا۟ إِلَىٰۤ أَنفُسِهِمۡ فَقَالُوۤا۟ إِنَّكُمۡ أَنتُمُ ٱلظَّـٰلِمُونَ\n",
    "translations": {
      "en": "And so they turned upon one another, saying, “Behold, it is you who are doing wrong.”",
      "ms": "Maka mereka (penyembah berhala) kembali kepada diri mereka (memikirkan hal itu) lalu berkata (sesama sendiri): \"Sesungguhnya kamulah sendiri orang-orang yang zalim\".",
      "id": "Maka mereka telah kembali kepada kesadaran dan lalu berkata: \"Sesungguhnya kamu sekalian adalah orang-orang yang menganiaya (diri sendiri)\",",
      "ar": "فَرَجَعُوۤا۟ إِلَىٰۤ أَنفُسِهِمۡ فَقَالُوۤا۟ إِنَّكُمۡ أَنتُمُ ٱلظَّـٰلِمُونَ\n"
    }
  },
  {
    "id": 2548,
    "surahId": 21,
    "ayahNumber": 65,
    "arabicText": "ثُمَّ نُكِسُوا۟ عَلَىٰ رُءُوسِهِمۡ لَقَدۡ عَلِمۡتَ مَا هَـٰۤؤُلَاۤءِ یَنطِقُونَ\n",
    "translations": {
      "en": "But then they relapsed into their former way of thinking and said: “Thou knowest very well that these [idols] cannot speak!”",
      "ms": "Kemudian mereka terbalik fikirannya kepada kesesatan, lalu berkata: \"Sesungguhnya engkau (hai Ibrahim), telah sedia mengetahui bahawa berhala-berhala itu tidak dapat berkata-kata (maka betapa engkau menyuruh kami bertanya kepadanya)?\"",
      "id": "kemudian kepala mereka jadi tertunduk (lalu berkata): \"Sesungguhnya kamu (hai Ibrahim) telah mengetahui bahwa berhala-berhala itu tidak dapat berbicara\".",
      "ar": "ثُمَّ نُكِسُوا۟ عَلَىٰ رُءُوسِهِمۡ لَقَدۡ عَلِمۡتَ مَا هَـٰۤؤُلَاۤءِ یَنطِقُونَ\n"
    }
  },
  {
    "id": 2549,
    "surahId": 21,
    "ayahNumber": 66,
    "arabicText": "قَالَ أَفَتَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا یَنفَعُكُمۡ شَیۡـࣰٔا وَلَا یَضُرُّكُمۡ\n",
    "translations": {
      "en": "Said [Abraham]: “Do you then worship, instead of God, something that cannot benefit you in any way, nor harm you?",
      "ms": "Nabi Ibrahim berkata: \"Jika demikian, patutkah kamu menyembah yang lain dari Allah sesuatu yang tidak dapat mendatangkan faedah sedikitpun kepada kamu, dan juga tidak dapat mendatangkan mudarat kepada kamu?",
      "id": "Ibrahim berkata: Maka mengapakah kamu menyembah selain Allah sesuatu yang tidak dapat memberi manfaat sedikitpun dan tidak (pula) memberi mudharat kepada kamu?\"",
      "ar": "قَالَ أَفَتَعۡبُدُونَ مِن دُونِ ٱللَّهِ مَا لَا یَنفَعُكُمۡ شَیۡـࣰٔا وَلَا یَضُرُّكُمۡ\n"
    }
  },
  {
    "id": 2550,
    "surahId": 21,
    "ayahNumber": 67,
    "arabicText": "أُفࣲّ لَّكُمۡ وَلِمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِۚ أَفَلَا تَعۡقِلُونَ\n",
    "translations": {
      "en": "Fie upon you and upon all that you worship instead of God! Will you not, then, use your reason?”",
      "ms": "\"Jijik perasaanku terhadap kamu dan apa yang kamu sembah selain Allah! Maka mengapa kamu tidak mahu menggunakan akal fikiran kamu?\"",
      "id": "Ah (celakalah) kamu dan apa yang kamu sembah selain Allah. Maka apakah kamu tidak memahami?",
      "ar": "أُفࣲّ لَّكُمۡ وَلِمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِۚ أَفَلَا تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 2551,
    "surahId": 21,
    "ayahNumber": 68,
    "arabicText": "قَالُوا۟ حَرِّقُوهُ وَٱنصُرُوۤا۟ ءَالِهَتَكُمۡ إِن كُنتُمۡ فَـٰعِلِینَ\n",
    "translations": {
      "en": "They exclaimed: “Burn him, and [thereby] succour your gods, if you are going to do [anything]!”",
      "ms": "(Setelah tidak dapat berhujah lagi, ketua-ketua) mereka berkata: \"Bakarlah dia dan belalah tuhan-tuhan kamu, jika betul kamu mahu bertindak membelanya!\"",
      "id": "Mereka berkata: \"Bakarlah dia dan bantulah tuhan-tuhan kamu, jika kamu benar-benar hendak bertindak\".",
      "ar": "قَالُوا۟ حَرِّقُوهُ وَٱنصُرُوۤا۟ ءَالِهَتَكُمۡ إِن كُنتُمۡ فَـٰعِلِینَ\n"
    }
  },
  {
    "id": 2552,
    "surahId": 21,
    "ayahNumber": 69,
    "arabicText": "قُلۡنَا یَـٰنَارُ كُونِی بَرۡدࣰا وَسَلَـٰمًا عَلَىٰۤ إِبۡرَ ٰ⁠هِیمَ\n",
    "translations": {
      "en": "[But] We said: O fire! Be thou cool, and [a source of] inner peace for Abraham!”",
      "ms": "Kami berfirman: \"Hai api, jadilah engkau sejuk serta selamat sejahtera kepada Ibrahim! \".",
      "id": "Kami berfirman: \"Hai api menjadi dinginlah, dan menjadi keselamatanlah bagi Ibrahim\",",
      "ar": "قُلۡنَا یَـٰنَارُ كُونِی بَرۡدࣰا وَسَلَـٰمًا عَلَىٰۤ إِبۡرَ ٰ⁠هِیمَ\n"
    }
  },
  {
    "id": 2553,
    "surahId": 21,
    "ayahNumber": 70,
    "arabicText": "وَأَرَادُوا۟ بِهِۦ كَیۡدࣰا فَجَعَلۡنَـٰهُمُ ٱلۡأَخۡسَرِینَ\n",
    "translations": {
      "en": "and whereas they sought to do evil unto him, We caused them to suffer the greatest loss:",
      "ms": "Dan mereka (dengan perbuatan membakarnya itu) hendak melakukan angkara yang menyakitinya, lalu Kami jadikan mereka orang-orang yang amat rugi, (kalah dengan hinanya).",
      "id": "mereka hendak berbuat makar terhadap Ibrahim, maka Kami menjadikan mereka itu orang-orang yang paling merugi.",
      "ar": "وَأَرَادُوا۟ بِهِۦ كَیۡدࣰا فَجَعَلۡنَـٰهُمُ ٱلۡأَخۡسَرِینَ\n"
    }
  },
  {
    "id": 2554,
    "surahId": 21,
    "ayahNumber": 71,
    "arabicText": "وَنَجَّیۡنَـٰهُ وَلُوطًا إِلَى ٱلۡأَرۡضِ ٱلَّتِی بَـٰرَكۡنَا فِیهَا لِلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "for We saved him and Lot, [his brother’s son, by guiding them] to the land which We have blessed for all times to come.",
      "ms": "Dan Kami selamatkan dia dan (sepupunya) Nabi Lut ke negeri yang Kami limpahkan berkat padanya untuk umat manusia.",
      "id": "Dan Kami seIamatkan Ibrahim dan Luth ke sebuah negeri yang Kami telah memberkahinya untuk sekalian manusia.",
      "ar": "وَنَجَّیۡنَـٰهُ وَلُوطًا إِلَى ٱلۡأَرۡضِ ٱلَّتِی بَـٰرَكۡنَا فِیهَا لِلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 2555,
    "surahId": 21,
    "ayahNumber": 72,
    "arabicText": "وَوَهَبۡنَا لَهُۥۤ إِسۡحَـٰقَ وَیَعۡقُوبَ نَافِلَةࣰۖ وَكُلࣰّا جَعَلۡنَا صَـٰلِحِینَ\n",
    "translations": {
      "en": "And We bestowed upon him Isaac and [Isaacs son] Jacob as an additional gift and caused all of them to be righteous men,",
      "ms": "Dan Kami kurniakan kepadanya: Ishak (anaknya), dan Yaakub (cucunya) sebagai tambahan; dan tiap-tiap seorang (dari mereka) Kami jadikan orang yang soleh.",
      "id": "Dan Kami telah memberikan kepada-nya (Ibrahim) lshak dan Ya'qub, sebagai suatu anugerah (daripada Kami). Dan masing-masingnya Kami jadikan orang-orang yang saleh",
      "ar": "وَوَهَبۡنَا لَهُۥۤ إِسۡحَـٰقَ وَیَعۡقُوبَ نَافِلَةࣰۖ وَكُلࣰّا جَعَلۡنَا صَـٰلِحِینَ\n"
    }
  },
  {
    "id": 2556,
    "surahId": 21,
    "ayahNumber": 73,
    "arabicText": "وَجَعَلۡنَـٰهُمۡ أَىِٕمَّةࣰ یَهۡدُونَ بِأَمۡرِنَا وَأَوۡحَیۡنَاۤ إِلَیۡهِمۡ فِعۡلَ ٱلۡخَیۡرَ ٰ⁠تِ وَإِقَامَ ٱلصَّلَوٰةِ وَإِیتَاۤءَ ٱلزَّكَوٰةِۖ وَكَانُوا۟ لَنَا عَـٰبِدِینَ\n",
    "translations": {
      "en": "and made them leaders who would guide [others] in accordance with Our behest: for We inspired them [with a will] to do good works, and to be constant in prayer, and to dispense charity: and Us [alone] did they worship.",
      "ms": "Dan Kami jadikan mereka ketua-ketua ikutan, yang memimpin (manusia ke jalan yang benar) dengan perintah Kami, dan Kami wahyukan kepada mereka mengerjakan kebaikan, dan mendirikan sembahyang, serta memberi zakat; dan mereka pula sentiasa beribadat kepada Kami.",
      "id": "Kami telah menjadikan mereka itu sebagai pemimpin-pemimpin yang memberi petunjuk dengan perintah Kami dan telah Kami wahyukan kepada, mereka mengerjakan kebajikan, mendirikan sembahyang, menunaikan zakat, dan hanya kepada Kamilah mereka selalu menyembah,",
      "ar": "وَجَعَلۡنَـٰهُمۡ أَىِٕمَّةࣰ یَهۡدُونَ بِأَمۡرِنَا وَأَوۡحَیۡنَاۤ إِلَیۡهِمۡ فِعۡلَ ٱلۡخَیۡرَ ٰ⁠تِ وَإِقَامَ ٱلصَّلَوٰةِ وَإِیتَاۤءَ ٱلزَّكَوٰةِۖ وَكَانُوا۟ لَنَا عَـٰبِدِینَ\n"
    }
  },
  {
    "id": 2557,
    "surahId": 21,
    "ayahNumber": 74,
    "arabicText": "وَلُوطًا ءَاتَیۡنَـٰهُ حُكۡمࣰا وَعِلۡمࣰا وَنَجَّیۡنَـٰهُ مِنَ ٱلۡقَرۡیَةِ ٱلَّتِی كَانَت تَّعۡمَلُ ٱلۡخَبَـٰۤىِٕثَۚ إِنَّهُمۡ كَانُوا۟ قَوۡمَ سَوۡءࣲ فَـٰسِقِینَ\n",
    "translations": {
      "en": "AND UNTO Lot, too, We vouchsafed sound judg­ment and knowledge [of right and wrong], and saved him from that community which was given to deeds of abomination. [We destroyed those people - forr,] verily, they were people lost in evil, depraved –",
      "ms": "Dan kepada Nabi Lut, Kami berikan hikmat kebijaksanaan dan ilmu; dan Kami selamatkan dia dari bandar yang penduduknya selalu melakukan perkara-perkara yang keji; sesungguhnya mereka itu adalah kaum jahat, yang fasik, derhaka.",
      "id": "dan kepada Luth, Kami telah berikan hikmah dan ilmu, dan telah Kami selamatkan dia dari (azab yang telah menimpa penduduk) kota yang mengerjakan perbuatan keji. Sesungguhnya mereka adalah kaum yang jahat lagi fasik,",
      "ar": "وَلُوطًا ءَاتَیۡنَـٰهُ حُكۡمࣰا وَعِلۡمࣰا وَنَجَّیۡنَـٰهُ مِنَ ٱلۡقَرۡیَةِ ٱلَّتِی كَانَت تَّعۡمَلُ ٱلۡخَبَـٰۤىِٕثَۚ إِنَّهُمۡ كَانُوا۟ قَوۡمَ سَوۡءࣲ فَـٰسِقِینَ\n"
    }
  },
  {
    "id": 2558,
    "surahId": 21,
    "ayahNumber": 75,
    "arabicText": "وَأَدۡخَلۡنَـٰهُ فِی رَحۡمَتِنَاۤۖ إِنَّهُۥ مِنَ ٱلصَّـٰلِحِینَ\n",
    "translations": {
      "en": "whereas him We admitted unto Our grace: for, behold, he was among the righteous.",
      "ms": "Dan Kami masukkan Nabi Lut dalam (kumpulan mereka yang dilimpahi) rahmat Kami; sesungguhnya dia dari orang-orang yang soleh.",
      "id": "dan Kami masukkan dia ke dalam rahmat Kami; karena sesungguhnya dia termasuk orang-orang yang saleh.",
      "ar": "وَأَدۡخَلۡنَـٰهُ فِی رَحۡمَتِنَاۤۖ إِنَّهُۥ مِنَ ٱلصَّـٰلِحِینَ\n"
    }
  },
  {
    "id": 2559,
    "surahId": 21,
    "ayahNumber": 76,
    "arabicText": "وَنُوحًا إِذۡ نَادَىٰ مِن قَبۡلُ فَٱسۡتَجَبۡنَا لَهُۥ فَنَجَّیۡنَـٰهُ وَأَهۡلَهُۥ مِنَ ٱلۡكَرۡبِ ٱلۡعَظِیمِ\n",
    "translations": {
      "en": "AND [remember] Noah - [how,] when He called out [unto Us], long before [the time of Abraham and Lot], We responded to him and saved him and his house­hold from that awesome calamity;",
      "ms": "Dan (sebutkanlah peristiwa) Nabi Nuh, ketika ia menyeru (berdoa kepada Kami) sebelum (Nabi-nabi yang tersebut) itu, lalu Kami perkenankan doanya serta Kami selamatkan dia dan pengikut-pengikutnya dari kesusahan yang besar.",
      "id": "Dan (ingatlah kisah) Nuh, sebelum itu ketika dia berdoa, dan Kami memperkenankan doanya, lalu Kami selamatkan dia beserta keluarganya dari bencana yang besar.",
      "ar": "وَنُوحًا إِذۡ نَادَىٰ مِن قَبۡلُ فَٱسۡتَجَبۡنَا لَهُۥ فَنَجَّیۡنَـٰهُ وَأَهۡلَهُۥ مِنَ ٱلۡكَرۡبِ ٱلۡعَظِیمِ\n"
    }
  },
  {
    "id": 2560,
    "surahId": 21,
    "ayahNumber": 77,
    "arabicText": "وَنَصَرۡنَـٰهُ مِنَ ٱلۡقَوۡمِ ٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِنَاۤۚ إِنَّهُمۡ كَانُوا۟ قَوۡمَ سَوۡءࣲ فَأَغۡرَقۡنَـٰهُمۡ أَجۡمَعِینَ\n",
    "translations": {
      "en": "and [how] We succoured him against the people who had given the lie to Our messages: verily, they were people lost in evil - and [so] We caused them all to drown.",
      "ms": "Dan Kami membelanya dari angkara kaum yang mendustakan ayat-ayat Kami; sesungguhnya adalah mereka kaum yang jahat; lalu Kami tenggelamkan mereka semuanya (sehingga mati lemas dengan taufan).",
      "id": "Dan Kami telah menolongnya dari kaum yang telah mendustakan ayat-ayat Kami. Sesungguhnya mereka adalah kaum yang jahat, maka Kami tenggelamkan mereka semuanya.",
      "ar": "وَنَصَرۡنَـٰهُ مِنَ ٱلۡقَوۡمِ ٱلَّذِینَ كَذَّبُوا۟ بِـَٔایَـٰتِنَاۤۚ إِنَّهُمۡ كَانُوا۟ قَوۡمَ سَوۡءࣲ فَأَغۡرَقۡنَـٰهُمۡ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 2561,
    "surahId": 21,
    "ayahNumber": 78,
    "arabicText": "وَدَاوُۥدَ وَسُلَیۡمَـٰنَ إِذۡ یَحۡكُمَانِ فِی ٱلۡحَرۡثِ إِذۡ نَفَشَتۡ فِیهِ غَنَمُ ٱلۡقَوۡمِ وَكُنَّا لِحُكۡمِهِمۡ شَـٰهِدِینَ\n",
    "translations": {
      "en": "AND [remember] David and Solomon - [how it was] when both of them gave judgment concerning the field into which some people’s sheep had strayed by night and pastured therein, and [how] We bore witness to their judgment:",
      "ms": "Dan (sebutkanlah peristiwa) Nabi Daud dengan Nabi Sulaiman, ketika mereka berdua menghukum mengenai tanaman-tanaman semasa ia dirosakkan oleh kambing kaumnya pada waktu malam; dan sememangnya Kamilah yang memerhati dan mengesahkan hukuman mereka.",
      "id": "Dan (ingatlah kisah) Daud dan Sulaiman, di waktu keduanya memberikan keputusan mengenai tanaman, karena tanaman itu dirusak oleh kambing-kambing kepunyaan kaumnya. Dan adalah Kami menyaksikan keputusan yang diberikan oleh mereka itu,",
      "ar": "وَدَاوُۥدَ وَسُلَیۡمَـٰنَ إِذۡ یَحۡكُمَانِ فِی ٱلۡحَرۡثِ إِذۡ نَفَشَتۡ فِیهِ غَنَمُ ٱلۡقَوۡمِ وَكُنَّا لِحُكۡمِهِمۡ شَـٰهِدِینَ\n"
    }
  },
  {
    "id": 2562,
    "surahId": 21,
    "ayahNumber": 79,
    "arabicText": "فَفَهَّمۡنَـٰهَا سُلَیۡمَـٰنَۚ وَكُلًّا ءَاتَیۡنَا حُكۡمࣰا وَعِلۡمࣰاۚ وَسَخَّرۡنَا مَعَ دَاوُۥدَ ٱلۡجِبَالَ یُسَبِّحۡنَ وَٱلطَّیۡرَۚ وَكُنَّا فَـٰعِلِینَ\n",
    "translations": {
      "en": "for, [though] We made Solomon understand the case [more profoundly] yet We vouchsafed unto both of them sound judgment and knowledge [of right and wrong]. And We caused the mountains to join David in extolling Our limitless glory, and likewise the birds: for We are able to do [all things].",
      "ms": "Maka Kami beri Nabi Sulaiman memahami hukum yang lebih tepat bagi masalah itu; dan masing-masing (dari mereka berdua) Kami berikan hikmat kebijaksanaan dan ilmu (yang banyak); dan Kami mudahkan gunung-ganang dan unggas memuji Kami bersama-sama dengan Nabi Daud; dan adalah Kami berkuasa melakukan semuanya itu.",
      "id": "maka Kami telah memberikan pengertian kepada Sulaiman tentang hukum (yang lebih tepat); dan kepada masing-masing mereka telah Kami berikan hikmah dan ilmu dan telah Kami tundukkan gunung-gunung dan burung-burung, semua bertasbih bersama Daud. Dan kamilah yang melakukannya.",
      "ar": "فَفَهَّمۡنَـٰهَا سُلَیۡمَـٰنَۚ وَكُلًّا ءَاتَیۡنَا حُكۡمࣰا وَعِلۡمࣰاۚ وَسَخَّرۡنَا مَعَ دَاوُۥدَ ٱلۡجِبَالَ یُسَبِّحۡنَ وَٱلطَّیۡرَۚ وَكُنَّا فَـٰعِلِینَ\n"
    }
  },
  {
    "id": 2563,
    "surahId": 21,
    "ayahNumber": 80,
    "arabicText": "وَعَلَّمۡنَـٰهُ صَنۡعَةَ لَبُوسࣲ لَّكُمۡ لِتُحۡصِنَكُم مِّنۢ بَأۡسِكُمۡۖ فَهَلۡ أَنتُمۡ شَـٰكِرُونَ\n",
    "translations": {
      "en": "And We taught him how to make garments [of God- consciousness] for you, [O men,] so that they might fortify you against all that may cause you fear: but are you grateful [for this boon]?",
      "ms": "Dan Kami mengajar Nabi Daud membuat baju-baju besi untuk kamu, untuk menjaga keselamatan kamu dalam mana-mana peperangan kamu, maka adakah kamu sentiasa bersyukur?",
      "id": "Dan telah Kami ajarkan kepada Daud membuat baju besi untuk kamu, guna memelihara kamu dalam peperanganmu; Maka hendaklah kamu bersyukur (kepada Allah).",
      "ar": "وَعَلَّمۡنَـٰهُ صَنۡعَةَ لَبُوسࣲ لَّكُمۡ لِتُحۡصِنَكُم مِّنۢ بَأۡسِكُمۡۖ فَهَلۡ أَنتُمۡ شَـٰكِرُونَ\n"
    }
  },
  {
    "id": 2564,
    "surahId": 21,
    "ayahNumber": 81,
    "arabicText": "وَلِسُلَیۡمَـٰنَ ٱلرِّیحَ عَاصِفَةࣰ تَجۡرِی بِأَمۡرِهِۦۤ إِلَى ٱلۡأَرۡضِ ٱلَّتِی بَـٰرَكۡنَا فِیهَاۚ وَكُنَّا بِكُلِّ شَیۡءٍ عَـٰلِمِینَ\n",
    "translations": {
      "en": "And unto Solomon [We made subservient] the stormy wind, so that it sped at his behest towards the land which We had blessed: for it is We who have knowledge of everything.",
      "ms": "Dan (Kami mudahkan) bagi Nabi Sulaiman angin yang kencang tiupannya, bertiup menurut kehendaknya ke negeri yang Kami limpahi berkat padanya; dan adalah Kami mengetahui akan tiap-tiap sesuatu.",
      "id": "Dan (telah Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang kami telah memberkatinya. Dan adalah Kami Maha Mengetahui segala sesuatu.",
      "ar": "وَلِسُلَیۡمَـٰنَ ٱلرِّیحَ عَاصِفَةࣰ تَجۡرِی بِأَمۡرِهِۦۤ إِلَى ٱلۡأَرۡضِ ٱلَّتِی بَـٰرَكۡنَا فِیهَاۚ وَكُنَّا بِكُلِّ شَیۡءٍ عَـٰلِمِینَ\n"
    }
  },
  {
    "id": 2565,
    "surahId": 21,
    "ayahNumber": 82,
    "arabicText": "وَمِنَ ٱلشَّیَـٰطِینِ مَن یَغُوصُونَ لَهُۥ وَیَعۡمَلُونَ عَمَلࣰا دُونَ ذَ ٰ⁠لِكَۖ وَكُنَّا لَهُمۡ حَـٰفِظِینَ\n",
    "translations": {
      "en": "And among the rebel­lious forces [which We made subservient to him] there were some that dived for him [into the sea] and performed other works, besides: but it was We who kept watch over them.",
      "ms": "Dan (Kami mudahkan) sebahagian dari Syaitan-syaitan untuk menyelam baginya, serta melakukan kerja-kerja yang lain dari itu; dan adalah Kami mengawal mereka (daripada melanggar perintahnya).",
      "id": "Dan Kami telah tundukkan (pula kepada Sulaiman) segolongan syaitan-syaitan yang menyelam (ke dalam laut) untuknya dan mengerjakan pekerjaan selain daripada itu, dan adalah Kami memelihara mereka itu,",
      "ar": "وَمِنَ ٱلشَّیَـٰطِینِ مَن یَغُوصُونَ لَهُۥ وَیَعۡمَلُونَ عَمَلࣰا دُونَ ذَ ٰ⁠لِكَۖ وَكُنَّا لَهُمۡ حَـٰفِظِینَ\n"
    }
  },
  {
    "id": 2566,
    "surahId": 21,
    "ayahNumber": 83,
    "arabicText": "۞ وَأَیُّوبَ إِذۡ نَادَىٰ رَبَّهُۥۤ أَنِّی مَسَّنِیَ ٱلضُّرُّ وَأَنتَ أَرۡحَمُ ٱلرَّ ٰ⁠حِمِینَ\n",
    "translations": {
      "en": "AND [remember] Job, when he cried out to his Sus­tainer, “Affliction has befallen me: but Thou art the most merciful of the merciful!”",
      "ms": "Dan (sebutkanlah peristiwa) Nabi Ayub, ketika ia berdoa merayu kepada Tuhannya dengan berkata: \"Sesungguhnya aku ditimpa penyakit, sedang Engkaulah sahaja yang lebih mengasihani daripada segala (yang lain) yang mengasihani\".",
      "id": "dan (ingatlah kisah) Ayub, ketika ia menyeru Tuhannya: \"(Ya Tuhanku), sesungguhnya aku telah ditimpa penyakit dan Engkau adalah Tuhan Yang Maha Penyayang di antara semua penyayang\".",
      "ar": "۞ وَأَیُّوبَ إِذۡ نَادَىٰ رَبَّهُۥۤ أَنِّی مَسَّنِیَ ٱلضُّرُّ وَأَنتَ أَرۡحَمُ ٱلرَّ ٰ⁠حِمِینَ\n"
    }
  },
  {
    "id": 2567,
    "surahId": 21,
    "ayahNumber": 84,
    "arabicText": "فَٱسۡتَجَبۡنَا لَهُۥ فَكَشَفۡنَا مَا بِهِۦ مِن ضُرࣲّۖ وَءَاتَیۡنَـٰهُ أَهۡلَهُۥ وَمِثۡلَهُم مَّعَهُمۡ رَحۡمَةࣰ مِّنۡ عِندِنَا وَذِكۡرَىٰ لِلۡعَـٰبِدِینَ\n",
    "translations": {
      "en": "whereupon We responded unto him and removed all the affliction from which he suffered; and We gave him new offspring, doubling their number as an act of grace from Us, and as a reminder unto all who worship Us.",
      "ms": "Maka Kami perkenankan doa permohonannya, lalu Kami hapuskan penyakit yang menimpanya, serta Kami kurniakan kepadanya: keluarganya, dengan seganda lagi ramainya, sebagai satu rahmat dari Kami dan sebagai satu peringatan bagi orang-orang yang taat kepada Kami (supaya bersabar dan mendapat balasan baik).",
      "id": "Maka Kamipun memperkenankan seruannya itu, lalu Kami lenyapkan penyakit yang ada padanya dan Kami kembalikan keluarganya kepadanya, dan Kami lipat gandakan bilangan mereka, sebagai suatu rahmat dari sisi Kami dan untuk menjadi peringatan bagi semua yang menyembah Allah.",
      "ar": "فَٱسۡتَجَبۡنَا لَهُۥ فَكَشَفۡنَا مَا بِهِۦ مِن ضُرࣲّۖ وَءَاتَیۡنَـٰهُ أَهۡلَهُۥ وَمِثۡلَهُم مَّعَهُمۡ رَحۡمَةࣰ مِّنۡ عِندِنَا وَذِكۡرَىٰ لِلۡعَـٰبِدِینَ\n"
    }
  },
  {
    "id": 2568,
    "surahId": 21,
    "ayahNumber": 85,
    "arabicText": "وَإِسۡمَـٰعِیلَ وَإِدۡرِیسَ وَذَا ٱلۡكِفۡلِۖ كُلࣱّ مِّنَ ٱلصَّـٰبِرِینَ\n",
    "translations": {
      "en": "AND [remember] Ishmael and Idris and every one who [like them] has pledged himself [unto God]: they all were among those who are patient in adver­sity,",
      "ms": "Dan (demikianlah pula) Nabi-nabi Ismail dan Idris serta Zul-Kifli; semuanya adalah dari orang-orang yang sabar.",
      "id": "Dan (ingatlah kisah) Ismail, Idris dan Dzulkifli. Semua mereka termasuk orang-orang yang sabar.",
      "ar": "وَإِسۡمَـٰعِیلَ وَإِدۡرِیسَ وَذَا ٱلۡكِفۡلِۖ كُلࣱّ مِّنَ ٱلصَّـٰبِرِینَ\n"
    }
  },
  {
    "id": 2569,
    "surahId": 21,
    "ayahNumber": 86,
    "arabicText": "وَأَدۡخَلۡنَـٰهُمۡ فِی رَحۡمَتِنَاۤۖ إِنَّهُم مِّنَ ٱلصَّـٰلِحِینَ\n",
    "translations": {
      "en": "and so We admitted them unto Our grace: behold, they were among the righteous!",
      "ms": "Dan Kami masukkan mereka dalam (kumpulan yang dilimpahi) rahmat Kami: sesungguhnya mereka adalah dari orang-orang yang soleh.",
      "id": "Kami telah memasukkan mereka kedalam rahmat Kami. Sesungguhnya mereka termasuk orang-orang yang saleh.",
      "ar": "وَأَدۡخَلۡنَـٰهُمۡ فِی رَحۡمَتِنَاۤۖ إِنَّهُم مِّنَ ٱلصَّـٰلِحِینَ\n"
    }
  },
  {
    "id": 2570,
    "surahId": 21,
    "ayahNumber": 87,
    "arabicText": "وَذَا ٱلنُّونِ إِذ ذَّهَبَ مُغَـٰضِبࣰا فَظَنَّ أَن لَّن نَّقۡدِرَ عَلَیۡهِ فَنَادَىٰ فِی ٱلظُّلُمَـٰتِ أَن لَّاۤ إِلَـٰهَ إِلَّاۤ أَنتَ سُبۡحَـٰنَكَ إِنِّی كُنتُ مِنَ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "AND [remember] him of the great fish when he went off in wrath, thinking that We had no power over him! But then heeded out in the deep darkness [of his distress]: “There is no deity save Thee! Limit­less art Thou in Thy glory! Verily, I have done wrong!”",
      "ms": "Dan (sebutkanlah peristiwa) Zun-Nun, ketika ia pergi (meninggalkan kaumnya) dalam keadaan marah, yang menyebabkan ia menyangka bahawa Kami tidak akan mengenakannya kesusahan atau cubaan; (setelah berlaku kepadanya apa yang berlaku) maka ia pun menyeru dalam keadaan yang gelap-gelita dengan berkata: \"Sesungguhnya tiada Tuhan (yang dapat menolong) melainkan Engkau (ya Allah)! Maha Suci Engkau (daripada melakukan aniaya, tolongkanlah daku)! Sesungguhnya aku adalah dari orang-orang yang menganiaya diri sendiri\".",
      "id": "Dan (ingatlah kisah) Dzun Nun (Yunus), ketika ia pergi dalam keadaan marah, lalu ia menyangka bahwa Kami tidak akan mempersempitnya (menyulitkannya), maka ia menyeru dalam keadaan yang sangat gelap: \"Bahwa tidak ada Tuhan selain Engkau. Maha Suci Engkau, sesungguhnya aku adalah termasuk orang-orang yang zalim\".",
      "ar": "وَذَا ٱلنُّونِ إِذ ذَّهَبَ مُغَـٰضِبࣰا فَظَنَّ أَن لَّن نَّقۡدِرَ عَلَیۡهِ فَنَادَىٰ فِی ٱلظُّلُمَـٰتِ أَن لَّاۤ إِلَـٰهَ إِلَّاۤ أَنتَ سُبۡحَـٰنَكَ إِنِّی كُنتُ مِنَ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 2571,
    "surahId": 21,
    "ayahNumber": 88,
    "arabicText": "فَٱسۡتَجَبۡنَا لَهُۥ وَنَجَّیۡنَـٰهُ مِنَ ٱلۡغَمِّۚ وَكَذَ ٰ⁠لِكَ نُـۨجِی ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "And so We responded unto him and delivered him from [his] distress: for thus do We deliver all who have faith.",
      "ms": "Maka Kami kabulkan permohonan doanya, dan Kami selamatkan dia dari kesusahan yang menyelubunginya; dan sebagaimana Kami menyelamatkannya Kami akan selamatkan orang-orang yang beriman (ketika mereka merayu kepada Kami).",
      "id": "Maka Kami telah memperkenankan doanya dan menyelamatkannya dari pada kedukaan. Dan demikianlah Kami selamatkan orang-orang yang beriman.",
      "ar": "فَٱسۡتَجَبۡنَا لَهُۥ وَنَجَّیۡنَـٰهُ مِنَ ٱلۡغَمِّۚ وَكَذَ ٰ⁠لِكَ نُـۨجِی ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 2572,
    "surahId": 21,
    "ayahNumber": 89,
    "arabicText": "وَزَكَرِیَّاۤ إِذۡ نَادَىٰ رَبَّهُۥ رَبِّ لَا تَذَرۡنِی فَرۡدࣰا وَأَنتَ خَیۡرُ ٱلۡوَ ٰ⁠رِثِینَ\n",
    "translations": {
      "en": "AND [thus did We deliver] Zachariah when he cried out unto his Sustainer: “O my Sustainer! Leave me not childless! But [even if Thou grant me no bodily heir, I know that] Thou wilt remain when all else has ceased to be!”",
      "ms": "Dan (sebutkanlah peristiwa) Nabi Zakaria, ketika ia merayu kepada Tuhannya dengan berkata: \"Wahai Tuhanku! Janganlah Engkau biarkan daku seorang diri (dengan tidak meninggalkan zuriat); dan Engkaulah jua sebaik-baik yang mewarisi\".",
      "id": "Dan (ingatlah kisah) Zakaria, tatkala ia menyeru Tuhannya: \"Ya Tuhanku janganlah Engkau membiarkan aku hidup seorang diri dan Engkaulah Waris Yang Paling Baik.",
      "ar": "وَزَكَرِیَّاۤ إِذۡ نَادَىٰ رَبَّهُۥ رَبِّ لَا تَذَرۡنِی فَرۡدࣰا وَأَنتَ خَیۡرُ ٱلۡوَ ٰ⁠رِثِینَ\n"
    }
  },
  {
    "id": 2573,
    "surahId": 21,
    "ayahNumber": 90,
    "arabicText": "فَٱسۡتَجَبۡنَا لَهُۥ وَوَهَبۡنَا لَهُۥ یَحۡیَىٰ وَأَصۡلَحۡنَا لَهُۥ زَوۡجَهُۥۤۚ إِنَّهُمۡ كَانُوا۟ یُسَـٰرِعُونَ فِی ٱلۡخَیۡرَ ٰ⁠تِ وَیَدۡعُونَنَا رَغَبࣰا وَرَهَبࣰاۖ وَكَانُوا۟ لَنَا خَـٰشِعِینَ\n",
    "translations": {
      "en": "And so We responded unto him, and bestowed upon him the gift of John, having made his wife fit to bear him a child: [and,] verily, these [three] would vie with one another in doing good works, and would call unto Us in yearning and awe; and they were always humble before Us.",
      "ms": "Maka Kami perkenankan doanya, dan Kami kurniakan kepadanya (anaknya) Yahya, dan Kami perelokkan keadaan isterinya yang mandul, (untuk melahirkan anak) baginya. (Kami limpahkan berbagai ihsan kepada Rasul-rasul itu ialah kerana) sesungguhnya mereka sentiasa berlumba-lumba dalam mengerjakan kebaikan, dan sentiasa berdoa kepada kami dengan penuh harapan serta gerun takut; dan mereka pula sentiasa khusyuk (dan taat) kepada Kami.",
      "id": "Maka Kami memperkenankan doanya, dan Kami anugerahkan kepada nya Yahya dan Kami jadikan isterinya dapat mengandung. Sesungguhnya mereka adalah orang-orang yang selalu bersegera dalam (mengerjakan) perbuatan-perbuatan yang baik dan mereka berdoa kepada Kami dengan harap dan cemas. Dan mereka adalah orang-orang yang khusyu' kepada Kami.",
      "ar": "فَٱسۡتَجَبۡنَا لَهُۥ وَوَهَبۡنَا لَهُۥ یَحۡیَىٰ وَأَصۡلَحۡنَا لَهُۥ زَوۡجَهُۥۤۚ إِنَّهُمۡ كَانُوا۟ یُسَـٰرِعُونَ فِی ٱلۡخَیۡرَ ٰ⁠تِ وَیَدۡعُونَنَا رَغَبࣰا وَرَهَبࣰاۖ وَكَانُوا۟ لَنَا خَـٰشِعِینَ\n"
    }
  },
  {
    "id": 2574,
    "surahId": 21,
    "ayahNumber": 91,
    "arabicText": "وَٱلَّتِیۤ أَحۡصَنَتۡ فَرۡجَهَا فَنَفَخۡنَا فِیهَا مِن رُّوحِنَا وَجَعَلۡنَـٰهَا وَٱبۡنَهَاۤ ءَایَةࣰ لِّلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "AND [remember] her who guarded her chastity, whereupon We breathed into her of Our spirit and caused her, together with her son, to become a symbol [of Our grace] unto all people.",
      "ms": "Dan (sebutkanlah peristiwa) perempuan yang telah menjaga kehormatan dan kesuciannya; lalu Kami tiupkan padanya dari Roh (ciptaan) Kami, dan Kami jadikan dia dan anaknya sebagai satu tanda (yang menunjukkan kekuasaan Kami) bagi umat manusia.",
      "id": "Dan (ingatlah kisah) Maryam yang telah memelihara kehormatannya, lalu Kami tiupkan ke dalam (tubuh)nya ruh dari Kami dan Kami jadikan dia dan anaknya tanda (kekuasaan Allah) yang besar bagi semesta alam.",
      "ar": "وَٱلَّتِیۤ أَحۡصَنَتۡ فَرۡجَهَا فَنَفَخۡنَا فِیهَا مِن رُّوحِنَا وَجَعَلۡنَـٰهَا وَٱبۡنَهَاۤ ءَایَةࣰ لِّلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 2575,
    "surahId": 21,
    "ayahNumber": 92,
    "arabicText": "إِنَّ هَـٰذِهِۦۤ أُمَّتُكُمۡ أُمَّةࣰ وَ ٰ⁠حِدَةࣰ وَأَنَا۠ رَبُّكُمۡ فَٱعۡبُدُونِ\n",
    "translations": {
      "en": "VERILY, [O you who believe in Me,] this community of yours is one single community, since I am the Sustainer of you all: worship, then, Me [alone]!",
      "ms": "Sesungguhnya ugama Islam inilah ugama kamu, ugama yang satu asas pokoknya, dan Akulah Tuhan kamu; maka sembahlah kamu akan Daku.",
      "id": "Sesungguhnya (agama Tauhid) ini adalah agama kamu semua; agama yang satu dan Aku adalah Tuhanmu, maka sembahlah Aku.",
      "ar": "إِنَّ هَـٰذِهِۦۤ أُمَّتُكُمۡ أُمَّةࣰ وَ ٰ⁠حِدَةࣰ وَأَنَا۠ رَبُّكُمۡ فَٱعۡبُدُونِ\n"
    }
  },
  {
    "id": 2576,
    "surahId": 21,
    "ayahNumber": 93,
    "arabicText": "وَتَقَطَّعُوۤا۟ أَمۡرَهُم بَیۡنَهُمۡۖ كُلٌّ إِلَیۡنَا رَ ٰ⁠جِعُونَ\n",
    "translations": {
      "en": "But men have torn their unity wide asunder, [forgetting that] unto Us they all are bound to return.",
      "ms": "(Kebanyakan manusia masih berselisihan) dan berpecah-belah dalam urusan ugama mereka; (ingatlah) mereka semuanya akan kembali kepada kami (untuk menerima balasan).",
      "id": "Dan mereka telah memotong-motong urusan (agama) mereka di antara mereka. Kepada Kamilah masing-masing golongan itu akan kembali.",
      "ar": "وَتَقَطَّعُوۤا۟ أَمۡرَهُم بَیۡنَهُمۡۖ كُلٌّ إِلَیۡنَا رَ ٰ⁠جِعُونَ\n"
    }
  },
  {
    "id": 2577,
    "surahId": 21,
    "ayahNumber": 94,
    "arabicText": "فَمَن یَعۡمَلۡ مِنَ ٱلصَّـٰلِحَـٰتِ وَهُوَ مُؤۡمِنࣱ فَلَا كُفۡرَانَ لِسَعۡیِهِۦ وَإِنَّا لَهُۥ كَـٰتِبُونَ\n",
    "translations": {
      "en": "And yet, whoever does [the least] of righteous deeds and is a believer withal, his endeavour shall not be disowned: for, behold, We shall record it in his favour.",
      "ms": "Dengan yang demikian, sesiapa yang mengerjakan sesuatu amal kebaikan, sedang ia beriman, maka tidaklah disia-siakan amal usahanya; dan sesungguhnya Kami tetap menulisnya.",
      "id": "Maka barang siapa yang mengerjakan amal saleh, sedang ia beriman, maka tidak ada pengingkaran terhadap amalannya itu dan sesungguhnya Kami menuliskan amalannya itu untuknya.",
      "ar": "فَمَن یَعۡمَلۡ مِنَ ٱلصَّـٰلِحَـٰتِ وَهُوَ مُؤۡمِنࣱ فَلَا كُفۡرَانَ لِسَعۡیِهِۦ وَإِنَّا لَهُۥ كَـٰتِبُونَ\n"
    }
  },
  {
    "id": 2578,
    "surahId": 21,
    "ayahNumber": 95,
    "arabicText": "وَحَرَ ٰ⁠مٌ عَلَىٰ قَرۡیَةٍ أَهۡلَكۡنَـٰهَاۤ أَنَّهُمۡ لَا یَرۡجِعُونَ\n",
    "translations": {
      "en": "Hence, it has been unfailingly true of any community whom We have ever destroyed that they [were people who] would never turn back [from their sinful ways]",
      "ms": "Dan mustahil kepada penduduk sesebuah negeri yang Kami binasakan, bahawa mereka tidak akan kembali (kepada Kami untuk menerima balasan di akhirat kelak).",
      "id": "Sungguh tidak mungkin atas (penduduk) suatu negeri yang telah Kami binasakan, bahwa mereka tidak akan kembali (kepada Kami).",
      "ar": "وَحَرَ ٰ⁠مٌ عَلَىٰ قَرۡیَةٍ أَهۡلَكۡنَـٰهَاۤ أَنَّهُمۡ لَا یَرۡجِعُونَ\n"
    }
  },
  {
    "id": 2579,
    "surahId": 21,
    "ayahNumber": 96,
    "arabicText": "حَتَّىٰۤ إِذَا فُتِحَتۡ یَأۡجُوجُ وَمَأۡجُوجُ وَهُم مِّن كُلِّ حَدَبࣲ یَنسِلُونَ\n",
    "translations": {
      "en": "until such a time as Gog and Magog are let loose [upon the world] and swarm down from every corner [of the earth],",
      "ms": "(Demikianlah keadaan mereka) hingga apabila terbuka tembok yang menyekat Yakjuj dan Makjuj, serta mereka meluru turun dari tiap-tiap tempat yang tinggi.",
      "id": "Hingga apabila dibukakan (tembok) Ya'juj dan Ma'juj, dan mereka turun dengan cepat dari seluruh tempat yang tinggi.",
      "ar": "حَتَّىٰۤ إِذَا فُتِحَتۡ یَأۡجُوجُ وَمَأۡجُوجُ وَهُم مِّن كُلِّ حَدَبࣲ یَنسِلُونَ\n"
    }
  },
  {
    "id": 2580,
    "surahId": 21,
    "ayahNumber": 97,
    "arabicText": "وَٱقۡتَرَبَ ٱلۡوَعۡدُ ٱلۡحَقُّ فَإِذَا هِیَ شَـٰخِصَةٌ أَبۡصَـٰرُ ٱلَّذِینَ كَفَرُوا۟ یَـٰوَیۡلَنَا قَدۡ كُنَّا فِی غَفۡلَةࣲ مِّنۡ هَـٰذَا بَلۡ كُنَّا ظَـٰلِمِینَ\n",
    "translations": {
      "en": "the while the true promise [of resurrection] draws close [to its fulfillment]. But then, lo! the eyes of those who [in their lifetime] were bent on denying the truth will stare in horror, [and they will exclaim:] “Oh, woe unto us! We were indeed heedless of this [promise of resur­rection]! - nay, we were [bent on] doing evil!”",
      "ms": "Dan hampirlah datangnya janji hari kiamat yang benar, maka dengan serta-merta pandangan mata orang-orang yang kufur ingkar terbeliak (sambil berkata dengan cemas): \"Aduhai celakanya Kami. Sesungguhnya kami telah tinggal dalam keadaan yang melalaikan kami daripada memikirkan perkara ini, bahkan kami telah menjadi orang-orang yang menganiaya diri sendiri\".",
      "id": "Dan telah dekatlah kedatangan janji yang benar (hari berbangkit), maka tiba-tiba terbelalaklah mata orang-orang yang kafir. (Mereka berkata): \"Aduhai, celakalah kami, sesungguhnya kami adalah dalam kelalaian tentang ini, bahkan kami adalah orang-orang yang zalim\".",
      "ar": "وَٱقۡتَرَبَ ٱلۡوَعۡدُ ٱلۡحَقُّ فَإِذَا هِیَ شَـٰخِصَةٌ أَبۡصَـٰرُ ٱلَّذِینَ كَفَرُوا۟ یَـٰوَیۡلَنَا قَدۡ كُنَّا فِی غَفۡلَةࣲ مِّنۡ هَـٰذَا بَلۡ كُنَّا ظَـٰلِمِینَ\n"
    }
  },
  {
    "id": 2581,
    "surahId": 21,
    "ayahNumber": 98,
    "arabicText": "إِنَّكُمۡ وَمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ حَصَبُ جَهَنَّمَ أَنتُمۡ لَهَا وَ ٰ⁠رِدُونَ\n",
    "translations": {
      "en": "[Then they will be told:] “Verily, you and all that you [were wont to] worship instead of God are but the fuel of hell: that is what you are destined for.",
      "ms": "Sesungguhnya kamu dan apa yang kamu sembah, yang lain dari Allah, menjadi bahan-bahan bakaran yang dilimparkan ke dalam neraka Jahannam; kamu (sudah tetap) akan memasukinya.",
      "id": "Sesungguhnya kamu dan apa yang kamu sembah selain Allah, adalah umpan Jahannam, kamu pasti masuk ke dalamnya.",
      "ar": "إِنَّكُمۡ وَمَا تَعۡبُدُونَ مِن دُونِ ٱللَّهِ حَصَبُ جَهَنَّمَ أَنتُمۡ لَهَا وَ ٰ⁠رِدُونَ\n"
    }
  },
  {
    "id": 2582,
    "surahId": 21,
    "ayahNumber": 99,
    "arabicText": "لَوۡ كَانَ هَـٰۤؤُلَاۤءِ ءَالِهَةࣰ مَّا وَرَدُوهَاۖ وَكُلࣱّ فِیهَا خَـٰلِدُونَ\n",
    "translations": {
      "en": "If those [false objects of your worship] had truly been divine, they would not have been destined for it: but [as it is, you] all shall abide therein!”",
      "ms": "Kalaulah mereka (yang kamu sembah) itu tuhan-tuhan, tentulah mereka tidak masuk ke dalam neraka; dan (ketahuilah), semuanya (yang menyembah dan yang disembah) akan kekal dalam neraka selama-lamanya.",
      "id": "Andaikata berhala-berhala itu Tuhan, tentulah mereka tidak masuk neraka. Dan semuanya akan kekal di dalamnya.",
      "ar": "لَوۡ كَانَ هَـٰۤؤُلَاۤءِ ءَالِهَةࣰ مَّا وَرَدُوهَاۖ وَكُلࣱّ فِیهَا خَـٰلِدُونَ\n"
    }
  },
  {
    "id": 2583,
    "surahId": 21,
    "ayahNumber": 100,
    "arabicText": "لَهُمۡ فِیهَا زَفِیرࣱ وَهُمۡ فِیهَا لَا یَسۡمَعُونَ\n",
    "translations": {
      "en": "Moaning will be their lot therein, and nothing [else] will they hear therein.",
      "ms": "Mereka mendayu-dayu (kesakitan) di dalam neraka, dan mereka pula di situ tidak dapat mendengar sesuatu yang menyenangkan.",
      "id": "Mereka merintih di dalam api dan mereka di dalamnya tidak bisa mendengar.",
      "ar": "لَهُمۡ فِیهَا زَفِیرࣱ وَهُمۡ فِیهَا لَا یَسۡمَعُونَ\n"
    }
  },
  {
    "id": 2584,
    "surahId": 21,
    "ayahNumber": 101,
    "arabicText": "إِنَّ ٱلَّذِینَ سَبَقَتۡ لَهُم مِّنَّا ٱلۡحُسۡنَىٰۤ أُو۟لَـٰۤىِٕكَ عَنۡهَا مُبۡعَدُونَ\n",
    "translations": {
      "en": "[But,] behold, as for those for whom [the decree of] ultimate good has already gone forth from Us these will be kept far away from that [hell]:",
      "ms": "Sesungguhnya orang-orang yang telah tetap dari dahulu lagi memperoleh kebaikan dari Kami, mereka dijauhkan dari neraka itu.",
      "id": "Bahwasanya orang-orang yang telah ada untuk mereka ketetapan yang baik dari Kami, mereka itu dijauhkan dari neraka,",
      "ar": "إِنَّ ٱلَّذِینَ سَبَقَتۡ لَهُم مِّنَّا ٱلۡحُسۡنَىٰۤ أُو۟لَـٰۤىِٕكَ عَنۡهَا مُبۡعَدُونَ\n"
    }
  },
  {
    "id": 2585,
    "surahId": 21,
    "ayahNumber": 102,
    "arabicText": "لَا یَسۡمَعُونَ حَسِیسَهَاۖ وَهُمۡ فِی مَا ٱشۡتَهَتۡ أَنفُسُهُمۡ خَـٰلِدُونَ\n",
    "translations": {
      "en": "no sound thereof will they hear; and they will abide in all that their souls have ever desired.",
      "ms": "Mereka tidak mendengar suara (julangan) api neraka itu, dan mereka akan kekal selama-lamanya di dalam (nikmat-nikmat Syurga) yang diingini oleh jiwa mereka.",
      "id": "mereka tidak mendengar sedikitpun suara api neraka, dan mereka kekal dalam menikmati apa yang diingini oleh mereka.",
      "ar": "لَا یَسۡمَعُونَ حَسِیسَهَاۖ وَهُمۡ فِی مَا ٱشۡتَهَتۡ أَنفُسُهُمۡ خَـٰلِدُونَ\n"
    }
  },
  {
    "id": 2586,
    "surahId": 21,
    "ayahNumber": 103,
    "arabicText": "لَا یَحۡزُنُهُمُ ٱلۡفَزَعُ ٱلۡأَكۡبَرُ وَتَتَلَقَّىٰهُمُ ٱلۡمَلَـٰۤىِٕكَةُ هَـٰذَا یَوۡمُكُمُ ٱلَّذِی كُنتُمۡ تُوعَدُونَ\n",
    "translations": {
      "en": "The supreme awesomeness [of the Day of Resurrection] will cause them no grief, since the angels will receive them with the greeting. “This is your Day [of triumph - the Day] which you were promised!”",
      "ms": "Huru-hara besar yang amat mengerikan (pada hari kiamat) itu tidak merunsingkan mereka, dan (sebaliknya) mereka disambut oleh malaikat-malaikat dengan berkata: \"Inilah hari kamu (beroleh kebahagiaan), yang telah dijanjikan kepada kamu (di dunia) dahulu\".",
      "id": "Mereka tidak disusahkan oleh kedahsyatan yang besar (pada hari kiamat), dan mereka disambut oleh para malaikat. (Malaikat berkata): \"Inilah harimu yang telah dijanjikan kepadamu\".",
      "ar": "لَا یَحۡزُنُهُمُ ٱلۡفَزَعُ ٱلۡأَكۡبَرُ وَتَتَلَقَّىٰهُمُ ٱلۡمَلَـٰۤىِٕكَةُ هَـٰذَا یَوۡمُكُمُ ٱلَّذِی كُنتُمۡ تُوعَدُونَ\n"
    }
  },
  {
    "id": 2587,
    "surahId": 21,
    "ayahNumber": 104,
    "arabicText": "یَوۡمَ نَطۡوِی ٱلسَّمَاۤءَ كَطَیِّ ٱلسِّجِلِّ لِلۡكُتُبِۚ كَمَا بَدَأۡنَاۤ أَوَّلَ خَلۡقࣲ نُّعِیدُهُۥۚ وَعۡدًا عَلَیۡنَاۤۚ إِنَّا كُنَّا فَـٰعِلِینَ\n",
    "translations": {
      "en": "On that Day We shall roll up the skies as written scrolls are rolled up; [and] as We brought into being the first creation, so We shall bring it forth anew a promise which We have willed upon Our­selves: for, behold, We are able to do [all things]!",
      "ms": "(Ingatlah) hari Kami menggulung langit seperti menggulung lembaran surat catitan; sebagaimana kami mulakan wujudnya sesuatu kejadian, Kami ulangi wujudnya lagi; sebagai satu janji yang ditanggung oleh Kami; sesungguhnya Kami tetap melaksanakannya.",
      "id": "(Yaitu) pada hari Kami gulung langit sebagai menggulung lembaran-lembaran kertas. Sebagaimana Kami telah memulai panciptaan pertama begitulah Kami akan mengulanginya. Itulah suatu janji yang pasti Kami tepati; sesungguhnya Kamilah yang akan melaksanakannya.",
      "ar": "یَوۡمَ نَطۡوِی ٱلسَّمَاۤءَ كَطَیِّ ٱلسِّجِلِّ لِلۡكُتُبِۚ كَمَا بَدَأۡنَاۤ أَوَّلَ خَلۡقࣲ نُّعِیدُهُۥۚ وَعۡدًا عَلَیۡنَاۤۚ إِنَّا كُنَّا فَـٰعِلِینَ\n"
    }
  },
  {
    "id": 2588,
    "surahId": 21,
    "ayahNumber": 105,
    "arabicText": "وَلَقَدۡ كَتَبۡنَا فِی ٱلزَّبُورِ مِنۢ بَعۡدِ ٱلذِّكۡرِ أَنَّ ٱلۡأَرۡضَ یَرِثُهَا عِبَادِیَ ٱلصَّـٰلِحُونَ\n",
    "translations": {
      "en": "AND, INDEED, after having exhorted [man], We laid it down in all the books of divine wisdom that My righteous servants shall inherit the earth:",
      "ms": "Dan demi sesungguhnya, Kami telah tulis di dalam Kitab-kitab yang Kami turunkan sesudah ada tulisannya pada Lauh Mahfuz: \"Bahawasanya bumi itu akan diwarisi oleh hamba-hambaKu yang soleh\".",
      "id": "Dan sungguh telah Kami tulis didalam Zabur sesudah (Kami tulis dalam) Lauh Mahfuzh, bahwasanya bumi ini dipusakai hamba-hamba-Ku yang saleh.",
      "ar": "وَلَقَدۡ كَتَبۡنَا فِی ٱلزَّبُورِ مِنۢ بَعۡدِ ٱلذِّكۡرِ أَنَّ ٱلۡأَرۡضَ یَرِثُهَا عِبَادِیَ ٱلصَّـٰلِحُونَ\n"
    }
  },
  {
    "id": 2589,
    "surahId": 21,
    "ayahNumber": 106,
    "arabicText": "إِنَّ فِی هَـٰذَا لَبَلَـٰغࣰا لِّقَوۡمٍ عَـٰبِدِینَ\n",
    "translations": {
      "en": "herein, behold, there is a message for people who [truly] worship God.",
      "ms": "Sesungguhnya Al-Quran ini mengandungi keterangan-keterangan yang cukup bagi orang-orang yang (cita-citanya) mengerjakan ibadat (kepada Allah dengan berilmu).",
      "id": "Sesungguhnya (apa yang disebutkan) dalam (surat) ini, benar-benar menjadi peringatan bagi kaum yang menyembah (Allah).",
      "ar": "إِنَّ فِی هَـٰذَا لَبَلَـٰغࣰا لِّقَوۡمٍ عَـٰبِدِینَ\n"
    }
  },
  {
    "id": 2590,
    "surahId": 21,
    "ayahNumber": 107,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَـٰكَ إِلَّا رَحۡمَةࣰ لِّلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "And [thus, O Prophet,] We have sent thee as [an evidence of Our] grace towards all the worlds.",
      "ms": "Dan tiadalah Kami mengutuskan engkau (wahai Muhammad), melainkan untuk menjadi rahmat bagi sekalian alam.",
      "id": "Dan tiadalah Kami mengutus kamu, melainkan untuk (menjadi) rahmat bagi semesta alam.",
      "ar": "وَمَاۤ أَرۡسَلۡنَـٰكَ إِلَّا رَحۡمَةࣰ لِّلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 2591,
    "surahId": 21,
    "ayahNumber": 108,
    "arabicText": "قُلۡ إِنَّمَا یُوحَىٰۤ إِلَیَّ أَنَّمَاۤ إِلَـٰهُكُمۡ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ\n",
    "translations": {
      "en": "Say: “It has but been revealed unto me that your God is the One and Only God: will you, then, surrender yourselves unto Him?”",
      "ms": "Katakanlah: \"Sesungguhnya yang diwahyukan kepadaku (mengenai ketuhanan ialah) bahawa Tuhan kamu hanyalah Tuhan yang bersifat Esa, maka adakah kamu mahu menurut apa yang diwahyukan kepadaku?\"",
      "id": "Katakanlah: \"Sesungguhnya yang diwahyukan kepadaku adalah: \"Bahwasanya Tuhanmu adalah Tuhan Yang Esa. maka hendaklah kamu berserah diri (kepada-Nya)\".",
      "ar": "قُلۡ إِنَّمَا یُوحَىٰۤ إِلَیَّ أَنَّمَاۤ إِلَـٰهُكُمۡ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ\n"
    }
  },
  {
    "id": 2592,
    "surahId": 21,
    "ayahNumber": 109,
    "arabicText": "فَإِن تَوَلَّوۡا۟ فَقُلۡ ءَاذَنتُكُمۡ عَلَىٰ سَوَاۤءࣲۖ وَإِنۡ أَدۡرِیۤ أَقَرِیبٌ أَم بَعِیدࣱ مَّا تُوعَدُونَ\n",
    "translations": {
      "en": "But if they turn away, say: “I have proclaimed this in equity unto all of you alike; but I do not know whether that [judgment] which you are promised [by God] is near or far [in time].",
      "ms": "Sekiranya mereka berpaling ingkar maka katakanlah: \"Aku telah memberitahu kepada kamu (apa yang diwahyukan kepadaku) dengan keterangan yang jelas untuk kita bersama; dan aku tidak mengetahui sama ada (balasan buruk) yang dijanjikan kerana keingkaran kamu itu, sudah dekat atau masih jauh.",
      "id": "Jika mereka berpaling, maka katakanlah: \"Aku telah menyampaikan kepada kamu sekalian (ajaran) yang sama (antara kita) dan aku tidak mengetahui apakah yang diancamkan kepadamu itu sudah dekat atau masih jauh?\".",
      "ar": "فَإِن تَوَلَّوۡا۟ فَقُلۡ ءَاذَنتُكُمۡ عَلَىٰ سَوَاۤءࣲۖ وَإِنۡ أَدۡرِیۤ أَقَرِیبٌ أَم بَعِیدࣱ مَّا تُوعَدُونَ\n"
    }
  },
  {
    "id": 2593,
    "surahId": 21,
    "ayahNumber": 110,
    "arabicText": "إِنَّهُۥ یَعۡلَمُ ٱلۡجَهۡرَ مِنَ ٱلۡقَوۡلِ وَیَعۡلَمُ مَا تَكۡتُمُونَ\n",
    "translations": {
      "en": "“Verily, He knows all that is said openly, just as He [alone] knows all that you would conceal.",
      "ms": "Sesungguhnya Allah mengetahui akan perkataan yang kamu sebutkan dengan terus terang, dan juga Ia mengetahui apa yang kamu sembunyikan (di dalam hati).",
      "id": "Sesungguhnya Dia mengetahui perkataan (yang kamu ucapkan) dengan terang-terangan dan Dia mengetahui apa yang kamu rahasiakan.",
      "ar": "إِنَّهُۥ یَعۡلَمُ ٱلۡجَهۡرَ مِنَ ٱلۡقَوۡلِ وَیَعۡلَمُ مَا تَكۡتُمُونَ\n"
    }
  },
  {
    "id": 2594,
    "surahId": 21,
    "ayahNumber": 111,
    "arabicText": "وَإِنۡ أَدۡرِی لَعَلَّهُۥ فِتۡنَةࣱ لَّكُمۡ وَمَتَـٰعٌ إِلَىٰ حِینࣲ\n",
    "translations": {
      "en": "But [as for me,] I do not know whether, perchance, this [delay in God’s judgment] is but a trial for you, and a [merciful] respite for a while.”",
      "ms": "\"Dan aku tidak mengetahui (mengapa dilambatkan balasan buruk yang dijanjikan kepada kamu itu) jangan-jangan lambatnya menjadi satu sebab yang menambahkan azab kamu, dan di samping itu memberi kamu kesenangan hidup hingga ke suatu masa yang tertentu\".",
      "id": "Dan aku tiada mengetahui, boleh jadi hal itu cobaan bagi kamu dan kesenangan sampai kepada suatu waktu.",
      "ar": "وَإِنۡ أَدۡرِی لَعَلَّهُۥ فِتۡنَةࣱ لَّكُمۡ وَمَتَـٰعٌ إِلَىٰ حِینࣲ\n"
    }
  },
  {
    "id": 2595,
    "surahId": 21,
    "ayahNumber": 112,
    "arabicText": "قَـٰلَ رَبِّ ٱحۡكُم بِٱلۡحَقِّۗ وَرَبُّنَا ٱلرَّحۡمَـٰنُ ٱلۡمُسۡتَعَانُ عَلَىٰ مَا تَصِفُونَ\n",
    "translations": {
      "en": "Say: “O my Sustainer! Judge Thou in truth!” - and [say]: “Our Sustainer is the Most Gracious, the One whose aid is ever to be sought against all your [attempts at] defining [Him]!”",
      "ms": "(Nabi Muhammad merayu dengan) berkata: \"Wahai Tuhanku, hukumkanlah (di antara kami dengan mereka) dengan yang benar; dan Tuhan kami ialah Yang Melimpah-limpah rahmatNya yang dipohonkan pertolonganNya terhadap apa yang kamu sifatkan itu\".",
      "id": "(Muhammad) berkata: \"Ya Tuhanku, berilah keputusan dengan adil. Dan Tuhan kami ialah Tuhan Yang Maha Pemurah lagi Yang dimohonkan pertolongan-Nya terhadap apa yang kamu katakan\".",
      "ar": "قَـٰلَ رَبِّ ٱحۡكُم بِٱلۡحَقِّۗ وَرَبُّنَا ٱلرَّحۡمَـٰنُ ٱلۡمُسۡتَعَانُ عَلَىٰ مَا تَصِفُونَ\n"
    }
  }
]