[
  {
    "id": 2030,
    "surahId": 17,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ سُبۡحَـٰنَ ٱلَّذِیۤ أَسۡرَىٰ بِعَبۡدِهِۦ لَیۡلࣰا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِی بَـٰرَكۡنَا حَوۡلَهُۥ لِنُرِیَهُۥ مِنۡ ءَایَـٰتِنَاۤۚ إِنَّهُۥ هُوَ ٱلسَّمِیعُ ٱلۡبَصِیرُ\n",
    "translations": {
      "en": "LIMITLESS in His glory is He who transported His servant by night from the Inviolable House of Worship [at Mecca] to the Remote House of Worship [, at Jerusalem] - the environs of which We had blessed -so that We might show him some of Our symbols: for, verily, He alone is all-hearing, all-seeing.",
      "ms": "Maha Suci Allah yang telah menjalankan hambaNya (Muhammad) pada malam hari dari Masjid Al-Haraam (di Makkah) ke Masjid Al-Aqsa (di Palestin), yang Kami berkati sekelilingnya, untuk memperlihatkan kepadanya tanda-tanda (kekuasaan dan kebesaran) Kami. Sesungguhnya Allah jualah yang Maha Mendengar, lagi Maha Mengetahui.",
      "id": "Maha Suci Allah, yang telah memperjalankan hamba-Nya pada suatu malam dari Al Masjidil Haram ke Al Masjidil Aqsha yang telah Kami berkahi sekelilingnya agar Kami perlihatkan kepadanya sebagian dari tanda-tanda (kebesaran) Kami. Sesungguhnya Dia adalah Maha Mendengar lagi Maha Mengetahui.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ سُبۡحَـٰنَ ٱلَّذِیۤ أَسۡرَىٰ بِعَبۡدِهِۦ لَیۡلࣰا مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِی بَـٰرَكۡنَا حَوۡلَهُۥ لِنُرِیَهُۥ مِنۡ ءَایَـٰتِنَاۤۚ إِنَّهُۥ هُوَ ٱلسَّمِیعُ ٱلۡبَصِیرُ\n"
    }
  },
  {
    "id": 2031,
    "surahId": 17,
    "ayahNumber": 2,
    "arabicText": "وَءَاتَیۡنَا مُوسَى ٱلۡكِتَـٰبَ وَجَعَلۡنَـٰهُ هُدࣰى لِّبَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ أَلَّا تَتَّخِذُوا۟ مِن دُونِی وَكِیلࣰا\n",
    "translations": {
      "en": "And [thus, too,] We vouchsafed revelation unto Moses, and made it a [source of] guidance for the children of Israel, [commanding them:] \"Do not ascribe to any but Me the power to determine your fate,",
      "ms": "Dan Kami telah memberikan Nabi Musa Kitab Taurat, dan Kami jadikan Kitab itu petunjuk bagi Bani Israil (serta Kami perintahkan mereka): \"Janganlah kamu jadikan yang lain daripadaKu sebagai Tuhan (untuk menyerahkan urusan kamu kepadanya)\".",
      "id": "Dan Kami berikan kepada Musa kitab (Taurat) dan Kami jadikan kitab Taurat itu petunjuk bagi Bani Israil (dengan firman): \"Janganlah kamu mengambil penolong selain Aku,",
      "ar": "وَءَاتَیۡنَا مُوسَى ٱلۡكِتَـٰبَ وَجَعَلۡنَـٰهُ هُدࣰى لِّبَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ أَلَّا تَتَّخِذُوا۟ مِن دُونِی وَكِیلࣰا\n"
    }
  },
  {
    "id": 2032,
    "surahId": 17,
    "ayahNumber": 3,
    "arabicText": "ذُرِّیَّةَ مَنۡ حَمَلۡنَا مَعَ نُوحٍۚ إِنَّهُۥ كَانَ عَبۡدࣰا شَكُورࣰا\n",
    "translations": {
      "en": "O you descendants of those whom We caused to be borne (in the ark] with Noah! Behold, he was a most grateful servant (of Ours]!\"",
      "ms": "(Wahai) keturunan orang-orang yang telah Kami bawa bersama-sama dengan Nabi Nuh (di dalam bahtera)! Sesungguhnya ia adalah seorang hamba yang bersyukur.",
      "id": "(yaitu) anak cucu dari orang-orang yang Kami bawa bersama-sama Nuh. Sesungguhnya dia adalah hamba (Allah) yang banyak bersyukur.",
      "ar": "ذُرِّیَّةَ مَنۡ حَمَلۡنَا مَعَ نُوحٍۚ إِنَّهُۥ كَانَ عَبۡدࣰا شَكُورࣰا\n"
    }
  },
  {
    "id": 2033,
    "surahId": 17,
    "ayahNumber": 4,
    "arabicText": "وَقَضَیۡنَاۤ إِلَىٰ بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ فِی ٱلۡكِتَـٰبِ لَتُفۡسِدُنَّ فِی ٱلۡأَرۡضِ مَرَّتَیۡنِ وَلَتَعۡلُنَّ عُلُوࣰّا كَبِیرࣰا\n",
    "translations": {
      "en": "And we made [this] known to the children of Israel through revelation: Twice, indeed, will you spread corruption on earth and will indeed become grossly overbearing!",
      "ms": "Dan Kami menyatakan kepada Bani Israil dalam Kitab itu: \"Sesungguhnya kamu akan melakukan kerosakan di bumi (Palestin) dua kali, dan sesungguhnya kamu akan berlaku sombong angkuh dengan melampau.",
      "id": "Dan telah Kami tetapkan terhadap Bani Israil dalam Kitab itu: \"Sesungguhnya kamu akan membuat kerusakan di muka bumi ini dua kali dan pasti kamu akan menyombongkan diri dengan kesombongan yang besar\".",
      "ar": "وَقَضَیۡنَاۤ إِلَىٰ بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ فِی ٱلۡكِتَـٰبِ لَتُفۡسِدُنَّ فِی ٱلۡأَرۡضِ مَرَّتَیۡنِ وَلَتَعۡلُنَّ عُلُوࣰّا كَبِیرࣰا\n"
    }
  },
  {
    "id": 2034,
    "surahId": 17,
    "ayahNumber": 5,
    "arabicText": "فَإِذَا جَاۤءَ وَعۡدُ أُولَىٰهُمَا بَعَثۡنَا عَلَیۡكُمۡ عِبَادࣰا لَّنَاۤ أُو۟لِی بَأۡسࣲ شَدِیدࣲ فَجَاسُوا۟ خِلَـٰلَ ٱلدِّیَارِۚ وَكَانَ وَعۡدࣰا مَّفۡعُولࣰا\n",
    "translations": {
      "en": "Hence, when the prediction of the first of those two [periods of iniquity] came true, We sent against you some of Our bondmen of terrible prowess in war, and they wrought havoc throughout the land: and so the prediction was fulfilled.",
      "ms": "Maka apabila sampai masa janji (membalas kederhakaan kamu) kali yang pertama dari dua (kederhakaan) itu, Kami datangkan kepada kamu hamba-hamba Kami yang kuat gagah dan amat ganas serangannya lalu mereka menjelajah di segala ceruk rantau (membunuh dan membinasakan kamu); dan (sebenarnya peristiwa itu) adalah satu janji yang tetap berlaku.",
      "id": "Maka apabila datang saat hukuman bagi (kejahatan) pertama dari kedua (kejahatan) itu, Kami datangkan kepadamu hamba-hamba Kami yang mempunyai kekuatan yang besar, lalu mereka merajalela di kampung-kampung, dan itulah ketetapan yang pasti terlaksana.",
      "ar": "فَإِذَا جَاۤءَ وَعۡدُ أُولَىٰهُمَا بَعَثۡنَا عَلَیۡكُمۡ عِبَادࣰا لَّنَاۤ أُو۟لِی بَأۡسࣲ شَدِیدࣲ فَجَاسُوا۟ خِلَـٰلَ ٱلدِّیَارِۚ وَكَانَ وَعۡدࣰا مَّفۡعُولࣰا\n"
    }
  },
  {
    "id": 2035,
    "surahId": 17,
    "ayahNumber": 6,
    "arabicText": "ثُمَّ رَدَدۡنَا لَكُمُ ٱلۡكَرَّةَ عَلَیۡهِمۡ وَأَمۡدَدۡنَـٰكُم بِأَمۡوَ ٰ⁠لࣲ وَبَنِینَ وَجَعَلۡنَـٰكُمۡ أَكۡثَرَ نَفِیرًا\n",
    "translations": {
      "en": "And after a time We allowed you to prevail against them once again, and aided you with wealth and offspring, and made you more numerous [than ever].",
      "ms": "Kemudian (setelah kamu bertaubat), Kami kembalikan kepada kamu kekuasaan untuk mengalahkan mereka, dan Kami beri kepada kamu dengan banyaknya harta kekayaan dan anak pinak, serta Kami jadikan kamu kaum yang lebih ramai pasukannya.",
      "id": "Kemudian Kami berikan kepadamu giliran untuk mengalahkan mereka kembali dan Kami membantumu dengan harta kekayaan dan anak-anak dan Kami jadikan kamu kelompok yang lebih besar.",
      "ar": "ثُمَّ رَدَدۡنَا لَكُمُ ٱلۡكَرَّةَ عَلَیۡهِمۡ وَأَمۡدَدۡنَـٰكُم بِأَمۡوَ ٰ⁠لࣲ وَبَنِینَ وَجَعَلۡنَـٰكُمۡ أَكۡثَرَ نَفِیرًا\n"
    }
  },
  {
    "id": 2036,
    "surahId": 17,
    "ayahNumber": 7,
    "arabicText": "إِنۡ أَحۡسَنتُمۡ أَحۡسَنتُمۡ لِأَنفُسِكُمۡۖ وَإِنۡ أَسَأۡتُمۡ فَلَهَاۚ فَإِذَا جَاۤءَ وَعۡدُ ٱلۡـَٔاخِرَةِ لِیَسُـࣳۤـُٔوا۟ وُجُوهَكُمۡ وَلِیَدۡخُلُوا۟ ٱلۡمَسۡجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةࣲ وَلِیُتَبِّرُوا۟ مَا عَلَوۡا۟ تَتۡبِیرًا\n",
    "translations": {
      "en": "[And We said:] \"If you persevere in doing good, you will but be doing good to yourselves; and if you do evil, it will be [done] to yourselves.\" And so, when the prediction of the second [period of your iniquity] came true, [We raised new enemies against you, and allowed them] to disgrace you utterly, and to enter the Temple as [their forerunners] had entered it once before, and to destroy with utter destruction all that they had conquered.",
      "ms": "Jika kamu berbuat kebaikan, (maka faedah) kebaikan yang kamu lakukan adalah untuk diri kamu; dan jika kamu berbuat kejahatan, maka (kesannya yang buruk) berbalik kepada diri kamu juga. Oleh itu, apabila sampai masa janji (membalas perbuatan derhaka kamu) kali kedua, (Kami datangkan musuh-musuh kamu) untuk memuramkan muka kamu (dengan penghinaan dan keganasannya); dan untuk memasuki masjid (BaitulMaqdis) sebagaimana mereka telah memasukinya pada kali yang pertama; dan untuk menghancurkan apa sahaja yang mereka telah kuasai, dengan sehancur-hancurnya.",
      "id": "Jika kamu berbuat baik (berarti) kamu berbuat baik bagi dirimu sendiri dan jika kamu berbuat jahat, maka (kejahatan) itu bagi dirimu sendiri, dan apabila datang saat hukuman bagi (kejahatan) yang kedua, (Kami datangkan orang-orang lain) untuk menyuramkan muka-muka kamu dan mereka masuk ke dalam mesjid, sebagaimana musuh-musuhmu memasukinya pada kali pertama dan untuk membinasakan sehabis-habisnya apa saja yang mereka kuasai.",
      "ar": "إِنۡ أَحۡسَنتُمۡ أَحۡسَنتُمۡ لِأَنفُسِكُمۡۖ وَإِنۡ أَسَأۡتُمۡ فَلَهَاۚ فَإِذَا جَاۤءَ وَعۡدُ ٱلۡـَٔاخِرَةِ لِیَسُـࣳۤـُٔوا۟ وُجُوهَكُمۡ وَلِیَدۡخُلُوا۟ ٱلۡمَسۡجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةࣲ وَلِیُتَبِّرُوا۟ مَا عَلَوۡا۟ تَتۡبِیرًا\n"
    }
  },
  {
    "id": 2037,
    "surahId": 17,
    "ayahNumber": 8,
    "arabicText": "عَسَىٰ رَبُّكُمۡ أَن یَرۡحَمَكُمۡۚ وَإِنۡ عُدتُّمۡ عُدۡنَاۚ وَجَعَلۡنَا جَهَنَّمَ لِلۡكَـٰفِرِینَ حَصِیرًا\n",
    "translations": {
      "en": "Your Sustainer may well show mercy unto you; but if you revert [to sinning], We shall revert [to chastising you]. And [remember this:] We have ordained that [in the hereafter] hell shall close upon all who deny the truth.",
      "ms": "Mudah-mudahan Tuhan kamu akan mengasihani kamu (kalau kamu bertaubat); dan jika kamu kembali (menderhaka), maka Kami pula akan kembali (menyeksa kamu di dunia); dan kami telah jadikan neraka: penjara bagi orang-orang kafir (pada hari akhirat).",
      "id": "Mudah-mudahan Tuhanmu akan melimpahkan rahmat(Nya) kepadamu; dan sekiranya kamu kembali kepada (kedurhakaan) niscaya Kami kembali (mengazabmu) dan Kami jadikan neraka Jahannam penjara bagi orang-orang yang tidak beriman.",
      "ar": "عَسَىٰ رَبُّكُمۡ أَن یَرۡحَمَكُمۡۚ وَإِنۡ عُدتُّمۡ عُدۡنَاۚ وَجَعَلۡنَا جَهَنَّمَ لِلۡكَـٰفِرِینَ حَصِیرًا\n"
    }
  },
  {
    "id": 2038,
    "surahId": 17,
    "ayahNumber": 9,
    "arabicText": "إِنَّ هَـٰذَا ٱلۡقُرۡءَانَ یَهۡدِی لِلَّتِی هِیَ أَقۡوَمُ وَیُبَشِّرُ ٱلۡمُؤۡمِنِینَ ٱلَّذِینَ یَعۡمَلُونَ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمۡ أَجۡرࣰا كَبِیرࣰا\n",
    "translations": {
      "en": "VERILY, this Qur'an shows the way to all that is most upright, and gives the believers who do good deeds the glad tiding that theirs will be a great reward;",
      "ms": "Sesungguhnya Al-Quran ini memberi petunjuk ke jalan yang amat betul (ugama Islam), dan memberikan berita yang mengembirakan orang-orang yang beriman yang mengerjakan amal-amal soleh, bahawa mereka beroleh pahala yang besar.",
      "id": "Sesungguhnya Al Quran ini memberikan petunjuk kepada (jalan) yang lebih lurus dan memberi khabar gembira kepada orang-orang Mu'min yang mengerjakan amal saleh bahwa bagi mereka ada pahala yang besar,",
      "ar": "إِنَّ هَـٰذَا ٱلۡقُرۡءَانَ یَهۡدِی لِلَّتِی هِیَ أَقۡوَمُ وَیُبَشِّرُ ٱلۡمُؤۡمِنِینَ ٱلَّذِینَ یَعۡمَلُونَ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمۡ أَجۡرࣰا كَبِیرࣰا\n"
    }
  },
  {
    "id": 2039,
    "surahId": 17,
    "ayahNumber": 10,
    "arabicText": "وَأَنَّ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِیمࣰا\n",
    "translations": {
      "en": "and [it announces, too,] that We have readied grievous suffering for those who will not believe in the life to come.",
      "ms": "Dan bahawa orang-orang yang tidak beriman kepada hari akhirat, Kami sediakan bagi mereka azab seksa yang tidak terperi sakitnya.",
      "id": "dan sesungguhnya orang-orang yang tidak beriman kepada kehidupan akhirat, Kami sediakan bagi mereka azab yang pedih.",
      "ar": "وَأَنَّ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِیمࣰا\n"
    }
  },
  {
    "id": 2040,
    "surahId": 17,
    "ayahNumber": 11,
    "arabicText": "وَیَدۡعُ ٱلۡإِنسَـٰنُ بِٱلشَّرِّ دُعَاۤءَهُۥ بِٱلۡخَیۡرِۖ وَكَانَ ٱلۡإِنسَـٰنُ عَجُولࣰا\n",
    "translations": {
      "en": "As it is, man [often] prays for things that are bad as if he were praying for something that is good: for man is prone to be hasty [in his judgments].",
      "ms": "Dan manusia berdoa dengan (memohon supaya ia ditimpa) kejahatan sebagaimana ia berdoa dengan memohon kebaikan, dan sememangnya manusia itu (bertabiat) terburu-buru.",
      "id": "Dan manusia mendoa untuk kejahatan sebagaimana ia mendoa untuk kebaikan. Dan adalah manusia bersifat tergesa-gesa.",
      "ar": "وَیَدۡعُ ٱلۡإِنسَـٰنُ بِٱلشَّرِّ دُعَاۤءَهُۥ بِٱلۡخَیۡرِۖ وَكَانَ ٱلۡإِنسَـٰنُ عَجُولࣰا\n"
    }
  },
  {
    "id": 2041,
    "surahId": 17,
    "ayahNumber": 12,
    "arabicText": "وَجَعَلۡنَا ٱلَّیۡلَ وَٱلنَّهَارَ ءَایَتَیۡنِۖ فَمَحَوۡنَاۤ ءَایَةَ ٱلَّیۡلِ وَجَعَلۡنَاۤ ءَایَةَ ٱلنَّهَارِ مُبۡصِرَةࣰ لِّتَبۡتَغُوا۟ فَضۡلࣰا مِّن رَّبِّكُمۡ وَلِتَعۡلَمُوا۟ عَدَدَ ٱلسِّنِینَ وَٱلۡحِسَابَۚ وَكُلَّ شَیۡءࣲ فَصَّلۡنَـٰهُ تَفۡصِیلࣰا\n",
    "translations": {
      "en": "And We have established the night and the day as two symbols; and thereupon We have effaced the symbol of night and set up [in its place] the light giving symbol of day, so that you might seek to obtain your Sustainer's bounty and be aware of the passing years and of the reckoning [that is bound to come]. For clearly, most clearly, have We spelt out everything!",
      "ms": "Dan Kami jadikan malam dan siang itu dua tanda (yang membuktikan kekuasaan kami), maka Kami hapuskan tanda malam itu (sehingga menjadi gelap-gelita), dan Kami jadikan tanda siang itu terang-benderang supaya kamu mudah mencari rezeki dari limpah kurnia Tuhan kamu, dan supaya kamu mengetahui bilangan tahun dan hitungan hisab (bulan dan hari); dan (ingatlah) tiap-tiap sesuatu (yang kamu perlukan untuk dunia dan ugama kamu), Kami telah menerangkannya satu persatu (dalam Al-Quran) dengan sejelas-jelasnya.",
      "id": "Dan Kami jadikan malam dan siang sebagai dua tanda, lalu Kami hapuskan tanda malam dan Kami jadikan tanda siang itu terang, agar kamu mencari kurnia dari Tuhanmu, dan supaya kamu mengetahui bilangan tahun-tahun dan perhitungan. Dan segala sesuatu telah Kami terangkan dengan jelas.",
      "ar": "وَجَعَلۡنَا ٱلَّیۡلَ وَٱلنَّهَارَ ءَایَتَیۡنِۖ فَمَحَوۡنَاۤ ءَایَةَ ٱلَّیۡلِ وَجَعَلۡنَاۤ ءَایَةَ ٱلنَّهَارِ مُبۡصِرَةࣰ لِّتَبۡتَغُوا۟ فَضۡلࣰا مِّن رَّبِّكُمۡ وَلِتَعۡلَمُوا۟ عَدَدَ ٱلسِّنِینَ وَٱلۡحِسَابَۚ وَكُلَّ شَیۡءࣲ فَصَّلۡنَـٰهُ تَفۡصِیلࣰا\n"
    }
  },
  {
    "id": 2042,
    "surahId": 17,
    "ayahNumber": 13,
    "arabicText": "وَكُلَّ إِنسَـٰنٍ أَلۡزَمۡنَـٰهُ طَـٰۤىِٕرَهُۥ فِی عُنُقِهِۦۖ وَنُخۡرِجُ لَهُۥ یَوۡمَ ٱلۡقِیَـٰمَةِ كِتَـٰبࣰا یَلۡقَىٰهُ مَنشُورًا\n",
    "translations": {
      "en": "And every human being's destiny have We tied to his neck; and on the Day of Resurrection We shall bring forth for him a record which he will find wide open;",
      "ms": "Dan tiap-tiap seorang manusia Kami kalongkan bahagian nasibnya di lehernya, dan pada hari kiamat kelak Kami akan keluarkan kepadanya kitab (suratan amalnya) yang akan didapatinya terbuka (untuk di tatapnya).",
      "id": "Dan tiap-tiap manusia itu telah Kami tetapkan amal perbuatannya (sebagaimana tetapnya kalung) pada lehernya. Dan Kami keluarkan baginya pada hari kiamat sebuah kitab yang dijumpainya terbuka.",
      "ar": "وَكُلَّ إِنسَـٰنٍ أَلۡزَمۡنَـٰهُ طَـٰۤىِٕرَهُۥ فِی عُنُقِهِۦۖ وَنُخۡرِجُ لَهُۥ یَوۡمَ ٱلۡقِیَـٰمَةِ كِتَـٰبࣰا یَلۡقَىٰهُ مَنشُورًا\n"
    }
  },
  {
    "id": 2043,
    "surahId": 17,
    "ayahNumber": 14,
    "arabicText": "ٱقۡرَأۡ كِتَـٰبَكَ كَفَىٰ بِنَفۡسِكَ ٱلۡیَوۡمَ عَلَیۡكَ حَسِیبࣰا\n",
    "translations": {
      "en": "[and he will be told:] \"Read this thy record,! Sufficient is thine own self today to make out thine account!\"",
      "ms": "(Lalu Kami perintahkan kepadanya): \"Bacalah Kitab (suratan amalmu), cukuplah engkau sendiri pada hari ini menjadi penghitung terhadap dirimu (tentang segala yang telah engkau lakukan)\".",
      "id": "\"Bacalah kitabmu, cukuplah dirimu sendiri pada waktu ini sebagai penghisab terhadapmu\".",
      "ar": "ٱقۡرَأۡ كِتَـٰبَكَ كَفَىٰ بِنَفۡسِكَ ٱلۡیَوۡمَ عَلَیۡكَ حَسِیبࣰا\n"
    }
  },
  {
    "id": 2044,
    "surahId": 17,
    "ayahNumber": 15,
    "arabicText": "مَّنِ ٱهۡتَدَىٰ فَإِنَّمَا یَهۡتَدِی لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا یَضِلُّ عَلَیۡهَاۚ وَلَا تَزِرُ وَازِرَةࣱ وِزۡرَ أُخۡرَىٰۗ وَمَا كُنَّا مُعَذِّبِینَ حَتَّىٰ نَبۡعَثَ رَسُولࣰا\n",
    "translations": {
      "en": "Whoever chooses to follow the right path, follows it but for his own good; and whoever goes astray, goes but astray to his own hurt; and no bearer of burdens shall be made to bear another\" burden. Moreover. We would never chastise [any community for the wrong they may do] ere We have sent an apostle [to them].",
      "ms": "Sesiapa yang beroleh hidayah petunjuk (menurut panduan Al-Quran), maka sesungguhnya faedah petunjuk yang didapatinya itu hanya terpulang kepada dirinya sendiri, dan sesiapa yang sesat maka sesungguhnya kesan buruk kesesatannya hanya ditanggung oleh dirinya juga. Dan seseorang yang boleh memikul, tidak akan memikul dosa perbuatan orang lain (bahkan dosa usahanya sahaja). Dan tiadalah Kami mengazabkan sesiapapun sebelum Kami mengutuskan seorang Rasul (untuk menerangkan yang benar dan yang salah).",
      "id": "Barangsiapa yang berbuat sesuai dengan hidayah (Allah), maka sesungguhnya dia berbuat itu untuk (keselamatan) dirinya sendiri; dan barangsiapa yang sesat maka sesungguhnya dia tersesat bagi (kerugian) dirinya sendiri. Dan seorang yang berdosa tidak dapat memikul dosa orang lain, dan Kami tidak akan mengazab sebelum Kami mengutus seorang rasul.",
      "ar": "مَّنِ ٱهۡتَدَىٰ فَإِنَّمَا یَهۡتَدِی لِنَفۡسِهِۦۖ وَمَن ضَلَّ فَإِنَّمَا یَضِلُّ عَلَیۡهَاۚ وَلَا تَزِرُ وَازِرَةࣱ وِزۡرَ أُخۡرَىٰۗ وَمَا كُنَّا مُعَذِّبِینَ حَتَّىٰ نَبۡعَثَ رَسُولࣰا\n"
    }
  },
  {
    "id": 2045,
    "surahId": 17,
    "ayahNumber": 16,
    "arabicText": "وَإِذَاۤ أَرَدۡنَاۤ أَن نُّهۡلِكَ قَرۡیَةً أَمَرۡنَا مُتۡرَفِیهَا فَفَسَقُوا۟ فِیهَا فَحَقَّ عَلَیۡهَا ٱلۡقَوۡلُ فَدَمَّرۡنَـٰهَا تَدۡمِیرࣰا\n",
    "translations": {
      "en": "But when [this has been done, and] it is Our will to destroy a community, We convey Our last warning to those of its people who have lost themselves entirely in the pursuit of pleasures; and [if] they [continue to] act sinfully, the sentence [of doom] passed on the community takes effect, and We break it to smithereens.",
      "ms": "Dan apabila sampai tempoh Kami hendak membinasakan penduduk sesebuah negeri, Kami perintahkan (lebih dahulu) orang-orang yang melampau dengan kemewahan di antara mereka (supaya taat), lalu mereka menderhaka dan melakukan maksiat padanya; maka berhaklah negeri itu dibinasakan, lalu kami menghancurkannya sehancur-hancurnya.",
      "id": "Dan jika Kami hendak membinasakan suatu negeri, maka Kami perintahkan kepada orang-orang yang hidup mewah di negeri itu (supaya mentaati Allah) tetapi mereka melakukan kedurhakaan dalam negeri itu, maka sudah sepantasnya berlaku terhadapnya perkataan (ketentuan Kami), kemudian Kami hancurkan negeri itu sehancur-hancurnya.",
      "ar": "وَإِذَاۤ أَرَدۡنَاۤ أَن نُّهۡلِكَ قَرۡیَةً أَمَرۡنَا مُتۡرَفِیهَا فَفَسَقُوا۟ فِیهَا فَحَقَّ عَلَیۡهَا ٱلۡقَوۡلُ فَدَمَّرۡنَـٰهَا تَدۡمِیرࣰا\n"
    }
  },
  {
    "id": 2046,
    "surahId": 17,
    "ayahNumber": 17,
    "arabicText": "وَكَمۡ أَهۡلَكۡنَا مِنَ ٱلۡقُرُونِ مِنۢ بَعۡدِ نُوحࣲۗ وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِۦ خَبِیرَۢا بَصِیرࣰا\n",
    "translations": {
      "en": "And how many a generation have We [thus] destroyed after [the time of] Noah! For, none has the like of thy Sustainer's awareness and insight into His creatures' sins.",
      "ms": "Dan berapa banyak umat-umat yang kami telah binasakan sesudah zaman Nabi Nuh; dan cukuplah Tuhanmu (wahai Muhammad) mengetahui lagi melihat akan dosa-dosa hambaNya.",
      "id": "Dan berapa banyaknya kaum sesudah Nuh telah Kami binasakan. Dan cukuplah Tuhanmu Maha Mengetahui lagi Maha Melihat dosa hamba-hamba-Nya.",
      "ar": "وَكَمۡ أَهۡلَكۡنَا مِنَ ٱلۡقُرُونِ مِنۢ بَعۡدِ نُوحࣲۗ وَكَفَىٰ بِرَبِّكَ بِذُنُوبِ عِبَادِهِۦ خَبِیرَۢا بَصِیرࣰا\n"
    }
  },
  {
    "id": 2047,
    "surahId": 17,
    "ayahNumber": 18,
    "arabicText": "مَّن كَانَ یُرِیدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِیهَا مَا نَشَاۤءُ لِمَن نُّرِیدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ یَصۡلَىٰهَا مَذۡمُومࣰا مَّدۡحُورࣰا\n",
    "translations": {
      "en": "Unto him who cares for [no more than the enjoyment of] this fleeting life We readily grant thereof as much as We please, [giving] to whomever it is Our will [to give]; but in the end We consign him to [the suffering of] hell; which he will have to endure disgraced and disowned!",
      "ms": "Sesiapa yang menghendaki (kesenangan hidup) dunia, Kami akan segerakan kepadanya dalam dunia apa yang Kami kehendaki, bagi sesiapa yang Kami kehendaki; kemudian Kami sediakan baginya neraka Jahannam (di akhirat kelak), untuk membakarnya dalam keadaan yang hina lagi tersingkir dari rahmat Allah.",
      "id": "Barangsiapa menghendaki kehidupan sekarang (duniawi), maka Kami segerakan baginya di dunia itu apa yang kami kehendaki bagi orang yang kami kehendaki dan Kami tentukan baginya neraka jahannam; ia akan memasukinya dalam keadaan tercela dan terusir.",
      "ar": "مَّن كَانَ یُرِیدُ ٱلۡعَاجِلَةَ عَجَّلۡنَا لَهُۥ فِیهَا مَا نَشَاۤءُ لِمَن نُّرِیدُ ثُمَّ جَعَلۡنَا لَهُۥ جَهَنَّمَ یَصۡلَىٰهَا مَذۡمُومࣰا مَّدۡحُورࣰا\n"
    }
  },
  {
    "id": 2048,
    "surahId": 17,
    "ayahNumber": 19,
    "arabicText": "وَمَنۡ أَرَادَ ٱلۡـَٔاخِرَةَ وَسَعَىٰ لَهَا سَعۡیَهَا وَهُوَ مُؤۡمِنࣱ فَأُو۟لَـٰۤىِٕكَ كَانَ سَعۡیُهُم مَّشۡكُورࣰا\n",
    "translations": {
      "en": "But as for those who care for the [good of the] life to come, and strive for it as it ought to be striven for, and are [true] believers withal -they are the ones whose striving finds favour [with God]!",
      "ms": "Dan sesiapa yang menghendaki akhirat dan berusaha mengerjakan amal-amal yang baik untuk akhirat dengan usaha yang layak baginya, sedang ia beriman, maka mereka yang demikian keadaannya, diberi pahala akan amal usahanya.",
      "id": "Dan barangsiapa yang menghendaki kehidupan akhirat dan berusaha ke arah itu dengan sungguh-sungguh sedang ia adalah mukmin, maka mereka itu adalah orang-orang yang usahanya dibalasi dengan baik.",
      "ar": "وَمَنۡ أَرَادَ ٱلۡـَٔاخِرَةَ وَسَعَىٰ لَهَا سَعۡیَهَا وَهُوَ مُؤۡمِنࣱ فَأُو۟لَـٰۤىِٕكَ كَانَ سَعۡیُهُم مَّشۡكُورࣰا\n"
    }
  },
  {
    "id": 2049,
    "surahId": 17,
    "ayahNumber": 20,
    "arabicText": "كُلࣰّا نُّمِدُّ هَـٰۤؤُلَاۤءِ وَهَـٰۤؤُلَاۤءِ مِنۡ عَطَاۤءِ رَبِّكَۚ وَمَا كَانَ عَطَاۤءُ رَبِّكَ مَحۡظُورًا\n",
    "translations": {
      "en": "All [of them] -these as well as those -do We freely endow with some of thy Sustainer's gifts, since thy Sustainer's giving is never confined [to one kind of man].",
      "ms": "Tiap-tiap golongan dari keduanya, golongan dunia dan golongan akhirat Kami hulurkan kepada mereka dari pemberian Tuhanmu (wahai Muhammad); dan tiadalah pemberian Tuhanmu itu tersekat (dari sesiapapun).",
      "id": "Kepada masing-masing golongan baik golongan ini maupun golongan itu Kami berikan bantuan dari kemurahan Tuhanmu. Dan kemurahan Tuhanmu tidak dapat dihalangi.",
      "ar": "كُلࣰّا نُّمِدُّ هَـٰۤؤُلَاۤءِ وَهَـٰۤؤُلَاۤءِ مِنۡ عَطَاۤءِ رَبِّكَۚ وَمَا كَانَ عَطَاۤءُ رَبِّكَ مَحۡظُورًا\n"
    }
  },
  {
    "id": 2050,
    "surahId": 17,
    "ayahNumber": 21,
    "arabicText": "ٱنظُرۡ كَیۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضࣲۚ وَلَلۡـَٔاخِرَةُ أَكۡبَرُ دَرَجَـٰتࣲ وَأَكۡبَرُ تَفۡضِیلࣰا\n",
    "translations": {
      "en": "Behold how We bestow [on earth) more bounty on some of them than on others: but [remember that] the life to come will be far higher in degree and far greater in merit and bounty.",
      "ms": "Lihatlah bagaimana Kami lebihkan sebahagian dari mereka atas sebahagian yang lain (dalam rezeki pemberian Kami itu) dan sesungguhnya pemberian di akhirat lebih besar tingkatan-tingkatan perbezaannya dan lebih besar tambahan-tambahan kelebihannya.",
      "id": "Perhatikanlah bagaimana Kami lebihkan sebagian dari mereka atas sebagian (yang lain). Dan pasti kehidupan akhirat lebih tinggi tingkatnya dan lebih besar keutamaannya.",
      "ar": "ٱنظُرۡ كَیۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَعۡضࣲۚ وَلَلۡـَٔاخِرَةُ أَكۡبَرُ دَرَجَـٰتࣲ وَأَكۡبَرُ تَفۡضِیلࣰا\n"
    }
  },
  {
    "id": 2051,
    "surahId": 17,
    "ayahNumber": 22,
    "arabicText": "لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومࣰا مَّخۡذُولࣰا\n",
    "translations": {
      "en": "DO NOT set up any other deity side by side with God, lest thou find thyself disgraced and forsaken:",
      "ms": "Janganlah engkau adakan tuhan yang lain bersama Allah (dalam ibadatmu), kerana akibatnya engkau akan tinggal dalam keadaan tercela dan kecewa dari mendapat pertolongan.",
      "id": "Janganlah kamu adakan tuhan yang lain di samping Allah, agar kamu tidak menjadi tercela dan tidak ditinggalkan (Allah).",
      "ar": "لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ فَتَقۡعُدَ مَذۡمُومࣰا مَّخۡذُولࣰا\n"
    }
  },
  {
    "id": 2052,
    "surahId": 17,
    "ayahNumber": 23,
    "arabicText": "۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوۤا۟ إِلَّاۤ إِیَّاهُ وَبِٱلۡوَ ٰ⁠لِدَیۡنِ إِحۡسَـٰنًاۚ إِمَّا یَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَاۤ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَاۤ أُفࣲّ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلࣰا كَرِیمࣰا\n",
    "translations": {
      "en": "for thy Sustainer has ordained that you shall worship none but Him. And do good unto [thy] parents. Should one of them, or both, attain to old age in thy care, never say \"Ugh\" to them or scold them, but [always] speak unto them with reverent speech,",
      "ms": "Dan Tuhanmu telah perintahkan, supaya engkau tidak menyembah melainkan kepadaNya semata-mata, dan hendaklah engkau berbuat baik kepada ibu bapa. Jika salah seorang dari keduanya, atau kedua-duanya sekali, sampai kepada umur tua dalam jagaan dan peliharaanmu, maka janganlah engkau berkata kepada mereka (sebarang perkataan kasar) sekalipun perkataan \"Ha\", dan janganlah engkau menengking menyergah mereka, tetapi katakanlah kepada mereka perkataan yang mulia (yang bersopan santun).",
      "id": "Dan Tuhanmu telah memerintahkan supaya kamu jangan menyembah selain Dia dan hendaklah kamu berbuat baik pada ibu bapakmu dengan sebaik-baiknya. Jika salah seorang di antara keduanya atau kedua-duanya sampai berumur lanjut dalam pemeliharaanmu, maka sekali-kali janganlah kamu mengatakan kepada keduanya perkataan \"ah\" dan janganlah kamu membentak mereka dan ucapkanlah kepada mereka perkataan yang mulia.",
      "ar": "۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوۤا۟ إِلَّاۤ إِیَّاهُ وَبِٱلۡوَ ٰ⁠لِدَیۡنِ إِحۡسَـٰنًاۚ إِمَّا یَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَاۤ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَاۤ أُفࣲّ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلࣰا كَرِیمࣰا\n"
    }
  },
  {
    "id": 2053,
    "surahId": 17,
    "ayahNumber": 24,
    "arabicText": "وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّیَانِی صَغِیرࣰا\n",
    "translations": {
      "en": "and spread over them humbly the wings of thy tenderness, and say: \"O my Sustainer! Bestow Thy grace upon them, even as they cherished and reared me when I was a child!\"",
      "ms": "Dan hendaklah engkau merendah diri kepada keduanya kerana belas kasihan dan kasih sayangmu, dan doakanlah (untuk mereka, dengan berkata): \"Wahai Tuhanku! Cucurilah rahmat kepada mereka berdua sebagaimana mereka telah mencurahkan kasih sayangnya memelihara dan mendidikku semasa kecil.\"",
      "id": "Dan rendahkanlah dirimu terhadap mereka berdua dengan penuh kesayangan dan ucapkanlah: \"Wahai Tuhanku, kasihilah mereka keduanya, sebagaimana mereka berdua telah mendidik aku waktu kecil\".",
      "ar": "وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّحۡمَةِ وَقُل رَّبِّ ٱرۡحَمۡهُمَا كَمَا رَبَّیَانِی صَغِیرࣰا\n"
    }
  },
  {
    "id": 2054,
    "surahId": 17,
    "ayahNumber": 25,
    "arabicText": "رَّبُّكُمۡ أَعۡلَمُ بِمَا فِی نُفُوسِكُمۡۚ إِن تَكُونُوا۟ صَـٰلِحِینَ فَإِنَّهُۥ كَانَ لِلۡأَوَّ ٰ⁠بِینَ غَفُورࣰا\n",
    "translations": {
      "en": "Your Sustainer is fully aware of what is in your hearts. If you are righteous, [He will forgive you your errors]: for, behold, He is much-forgiving to those who turn unto Him again and again.",
      "ms": "Tuhan kamu lebih mengetahui akan apa yang ada pada hati kamu; kalaulah kamu orang-orang yang bertujuan baik mematuhi perintahNya, maka sesungguhnya dia adalah Maha Pengampun bagi orang-orang yang bertaubat.",
      "id": "Tuhanmu lebih mengetahui apa yang ada dalam hatimu; jika kamu orang-orang yang baik, maka sesungguhnya Dia Maha Pengampun bagi orang-orang yang bertaubat.",
      "ar": "رَّبُّكُمۡ أَعۡلَمُ بِمَا فِی نُفُوسِكُمۡۚ إِن تَكُونُوا۟ صَـٰلِحِینَ فَإِنَّهُۥ كَانَ لِلۡأَوَّ ٰ⁠بِینَ غَفُورࣰا\n"
    }
  },
  {
    "id": 2055,
    "surahId": 17,
    "ayahNumber": 26,
    "arabicText": "وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِینَ وَٱبۡنَ ٱلسَّبِیلِ وَلَا تُبَذِّرۡ تَبۡذِیرًا\n",
    "translations": {
      "en": "And give his due to the near of kin, as well as to the needy and the wayfarer, but do not squander [thy substance] senselessly.",
      "ms": "Dan berikanlah kepada kerabatmu, dan orang miskin serta orang musafir akan haknya masing-masing; dan janganlah engkau membelanjakan hartamu dengan boros yang melampau.",
      "id": "Dan berikanlah kepada keluarga-keluarga yang dekat akan haknya, kepada orang miskin dan orang yang dalam perjalanan dan janganlah kamu menghambur-hamburkan (hartamu) secara boros.",
      "ar": "وَءَاتِ ذَا ٱلۡقُرۡبَىٰ حَقَّهُۥ وَٱلۡمِسۡكِینَ وَٱبۡنَ ٱلسَّبِیلِ وَلَا تُبَذِّرۡ تَبۡذِیرًا\n"
    }
  },
  {
    "id": 2056,
    "surahId": 17,
    "ayahNumber": 27,
    "arabicText": "إِنَّ ٱلۡمُبَذِّرِینَ كَانُوۤا۟ إِخۡوَ ٰ⁠نَ ٱلشَّیَـٰطِینِۖ وَكَانَ ٱلشَّیۡطَـٰنُ لِرَبِّهِۦ كَفُورࣰا\n",
    "translations": {
      "en": "Behold, the squanderers are, indeed, of the ilk of the satans - inasmuch as Satan has indeed proved most ungrateful to his Sustainer.",
      "ms": "Sesungguhnya orang-orang yang boros itu adalah saudara-saudara Syaitan, sedang Syaitan itu pula adalah makhluk yang sangat kufur kepada Tuhannya.",
      "id": "Sesungguhnya pemboros-pemboros itu adalah saudara-saudara syaitan dan syaitan itu adalah sangat ingkar kepada Tuhannya.",
      "ar": "إِنَّ ٱلۡمُبَذِّرِینَ كَانُوۤا۟ إِخۡوَ ٰ⁠نَ ٱلشَّیَـٰطِینِۖ وَكَانَ ٱلشَّیۡطَـٰنُ لِرَبِّهِۦ كَفُورࣰا\n"
    }
  },
  {
    "id": 2057,
    "surahId": 17,
    "ayahNumber": 28,
    "arabicText": "وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَاۤءَ رَحۡمَةࣲ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلࣰا مَّیۡسُورࣰا\n",
    "translations": {
      "en": "And if thou [must] turn aside from those [that are in want, because thou thyself art] seeking to obtain thy Sustainer's grace and hoping for it, at least speak unto them with gentle speech.",
      "ms": "Dan jika engkau terpaksa berpaling tidak melayani mereka, kerana menunggu rezeki dari Tuhanmu yang engkau harapkan, maka katakanlah kepada mereka kata-kata yang menyenangkan hati.",
      "id": "Dan jika kamu berpaling dari mereka untuk memperoleh rahmat dari Tuhanmu yang kamu harapkan, maka katakanlah kepada mereka ucapan yang pantas.",
      "ar": "وَإِمَّا تُعۡرِضَنَّ عَنۡهُمُ ٱبۡتِغَاۤءَ رَحۡمَةࣲ مِّن رَّبِّكَ تَرۡجُوهَا فَقُل لَّهُمۡ قَوۡلࣰا مَّیۡسُورࣰا\n"
    }
  },
  {
    "id": 2058,
    "surahId": 17,
    "ayahNumber": 29,
    "arabicText": "وَلَا تَجۡعَلۡ یَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومࣰا مَّحۡسُورًا\n",
    "translations": {
      "en": "And neither allow thy hand to remain shackled to thy neck, nor stretch it forth to the utmost limit [of thy capacity], lest thou find thyself blamed [by thy dependants], or even destitute.",
      "ms": "Dan janganlah engkau jadikan tanganmu terbelenggu di lehermu, dan janganlah pula engkau menghulurkannya dengan sehabis-habisnya, kerana akibatnya akan tinggalah engkau dengan keadaan yang tercela serta kering keputusan.",
      "id": "Dan janganlah kamu jadikan tanganmu terbelenggu pada lehermu dan janganlah kamu terlalu mengulurkannya karena itu kamu menjadi tercela dan menyesal.",
      "ar": "وَلَا تَجۡعَلۡ یَدَكَ مَغۡلُولَةً إِلَىٰ عُنُقِكَ وَلَا تَبۡسُطۡهَا كُلَّ ٱلۡبَسۡطِ فَتَقۡعُدَ مَلُومࣰا مَّحۡسُورًا\n"
    }
  },
  {
    "id": 2059,
    "surahId": 17,
    "ayahNumber": 30,
    "arabicText": "إِنَّ رَبَّكَ یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ وَیَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِیرَۢا بَصِیرࣰا\n",
    "translations": {
      "en": "Behold, thy Sustainer grants abundant sustenance, or gives it in scant measure, unto whomever He wills: verily, fully aware is He of [the needs of] His creatures, and sees them all.",
      "ms": "Sesungguhnya Tuhanmu lah yang meluaskan rezeki bagi sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya), dan Ia juga yang menyempitkannya (menurut yang demikian). Sesungguhnya Ia Maha Mendalam pengetahuanNya, lagi Maha Melihat akan hamba-hambaNya.",
      "id": "Sesungguhnya Tuhanmu melapangkan rezeki kepada siapa yang Dia kehendaki dan menyempitkannya; sesungguhnya Dia Maha Mengetahui lagi Maha Melihat akan hamba-hamba-Nya.",
      "ar": "إِنَّ رَبَّكَ یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ وَیَقۡدِرُۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِیرَۢا بَصِیرࣰا\n"
    }
  },
  {
    "id": 2060,
    "surahId": 17,
    "ayahNumber": 31,
    "arabicText": "وَلَا تَقۡتُلُوۤا۟ أَوۡلَـٰدَكُمۡ خَشۡیَةَ إِمۡلَـٰقࣲۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِیَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡـࣰٔا كَبِیرࣰا\n",
    "translations": {
      "en": "Hence, do not kill your children for fear of poverty: it is We who shall provide sustenance for them as well as for you. Verily, killing them is a great sin.",
      "ms": "Dan janganlah kamu membunuh anak-anak kamu kerana takutkan kepapaan; Kamilah yang memberi rezeki kepada mereka dan kepada kamu. Sesungguhnya perbuatan membunuh mereka adalah satu kesalahan yang besar.",
      "id": "Dan janganlah kamu membunuh anak-anakmu karena takut kemiskinan. Kamilah yang akan memberi rezeki kepada mereka dan juga kepadamu. Sesungguhnya membunuh mereka adalah suatu dosa yang besar.",
      "ar": "وَلَا تَقۡتُلُوۤا۟ أَوۡلَـٰدَكُمۡ خَشۡیَةَ إِمۡلَـٰقࣲۖ نَّحۡنُ نَرۡزُقُهُمۡ وَإِیَّاكُمۡۚ إِنَّ قَتۡلَهُمۡ كَانَ خِطۡـࣰٔا كَبِیرࣰا\n"
    }
  },
  {
    "id": 2061,
    "surahId": 17,
    "ayahNumber": 32,
    "arabicText": "وَلَا تَقۡرَبُوا۟ ٱلزِّنَىٰۤۖ إِنَّهُۥ كَانَ فَـٰحِشَةࣰ وَسَاۤءَ سَبِیلࣰا\n",
    "translations": {
      "en": "And do not commit adultery -for, behold, it is an abomination and an evil way.",
      "ms": "Dan janganlah kamu menghampiri zina, sesungguhnya zina itu adalah satu perbuatan yang keji dan satu jalan yang jahat (yang membawa kerosakan).",
      "id": "Dan janganlah kamu mendekati zina; sesungguhnya zina itu adalah suatu perbuatan yang keji. Dan suatu jalan yang buruk.",
      "ar": "وَلَا تَقۡرَبُوا۟ ٱلزِّنَىٰۤۖ إِنَّهُۥ كَانَ فَـٰحِشَةࣰ وَسَاۤءَ سَبِیلࣰا\n"
    }
  },
  {
    "id": 2062,
    "surahId": 17,
    "ayahNumber": 33,
    "arabicText": "وَلَا تَقۡتُلُوا۟ ٱلنَّفۡسَ ٱلَّتِی حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومࣰا فَقَدۡ جَعَلۡنَا لِوَلِیِّهِۦ سُلۡطَـٰنࣰا فَلَا یُسۡرِف فِّی ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورࣰا\n",
    "translations": {
      "en": "And do not take any human being's life -[the life] which God has willed to be, sacred-otherwise than in [the pursuit of] justice. Hence, if anyone has been slain wrongfully, We have empowered the defender of his rights [to exact a just retribution]; but even so, let him not exceed the bounds of equity in [retributive] killing. [And as for him who has been slain wrongfully -] behold, he is indeed succoured [by God]!",
      "ms": "Dan janganlah kamu membunuh diri seseorang manusia yang diharamkan oleh Allah membunuhnya kecuali dengan alasan yang benar. Dan sesiapa yang dibunuh secara zalim, maka sesungguhnya Kami telah menjadikan warisannya berkuasa menuntut balas. Dalam pada itu, janganlah ia melampau dalam menuntut balas bunuh itu, kerana sesungguhnya ia adalah mendapat sepenuh-penuh pertolongan (menurut hukum Syarak).",
      "id": "Dan janganlah kamu membunuh jiwa yang diharamkan Allah (membunuhnya), melainkan dengan suatu (alasan) yang benar. Dan barangsiapa dibunuh secara zalim, maka sesungguhnya Kami telah memberi kekuasaan kepada ahli warisnya, tetapi janganlah ahli waris itu melampaui batas dalam membunuh. Sesungguhnya ia adalah orang yang mendapat pertolongan.",
      "ar": "وَلَا تَقۡتُلُوا۟ ٱلنَّفۡسَ ٱلَّتِی حَرَّمَ ٱللَّهُ إِلَّا بِٱلۡحَقِّۗ وَمَن قُتِلَ مَظۡلُومࣰا فَقَدۡ جَعَلۡنَا لِوَلِیِّهِۦ سُلۡطَـٰنࣰا فَلَا یُسۡرِف فِّی ٱلۡقَتۡلِۖ إِنَّهُۥ كَانَ مَنصُورࣰا\n"
    }
  },
  {
    "id": 2063,
    "surahId": 17,
    "ayahNumber": 34,
    "arabicText": "وَلَا تَقۡرَبُوا۟ مَالَ ٱلۡیَتِیمِ إِلَّا بِٱلَّتِی هِیَ أَحۡسَنُ حَتَّىٰ یَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُوا۟ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡـُٔولࣰا\n",
    "translations": {
      "en": "And do not touch the substance of an orphan, save to improve it, before he comes of age. And be true to every promise - for, verily, [on Judgment Day] you will be called to account for every promise which you have made!",
      "ms": "Dan janganlah kamu menghampiri harta anak yatim melainkan dengan cara yang baik (untuk mengawal dan mengembangkannya), sehingga ia baligh (dewasa, serta layak mengurus hartanya dengan sendiri); dan sempurnakanlah perjanjian (dengan Allah dan dengan manusia), sesungguhnya perjanjian itu akan ditanya.",
      "id": "Dan janganlah kamu mendekati harta anak yatim, kecuali dengan cara yang lebih baik (bermanfaat) sampai ia dewasa dan penuhilah janji; sesungguhnya janji itu pasti diminta pertanggungan jawabnya.",
      "ar": "وَلَا تَقۡرَبُوا۟ مَالَ ٱلۡیَتِیمِ إِلَّا بِٱلَّتِی هِیَ أَحۡسَنُ حَتَّىٰ یَبۡلُغَ أَشُدَّهُۥۚ وَأَوۡفُوا۟ بِٱلۡعَهۡدِۖ إِنَّ ٱلۡعَهۡدَ كَانَ مَسۡـُٔولࣰا\n"
    }
  },
  {
    "id": 2064,
    "surahId": 17,
    "ayahNumber": 35,
    "arabicText": "وَأَوۡفُوا۟ ٱلۡكَیۡلَ إِذَا كِلۡتُمۡ وَزِنُوا۟ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِیمِۚ ذَ ٰ⁠لِكَ خَیۡرࣱ وَأَحۡسَنُ تَأۡوِیلࣰا\n",
    "translations": {
      "en": "And give full measure whenever you measure, and weigh with a balance that is true: this will be [for your own] good, and best in the end.",
      "ms": "Dan sempurnakanlah sukatan apabila kamu menyukat, dan timbanglah dengan timbangan yang adil. Yang demikian itu baik (kesannya bagi kamu di dunia) dan sebaik baik kesudahan (yang mendatangkan pahala di akhirat kelak).",
      "id": "Dan sempurnakanlah takaran apabila kamu menakar, dan timbanglah dengan neraca yang benar. Itulah yang lebih utama (bagimu) dan lebih baik akibatnya.",
      "ar": "وَأَوۡفُوا۟ ٱلۡكَیۡلَ إِذَا كِلۡتُمۡ وَزِنُوا۟ بِٱلۡقِسۡطَاسِ ٱلۡمُسۡتَقِیمِۚ ذَ ٰ⁠لِكَ خَیۡرࣱ وَأَحۡسَنُ تَأۡوِیلࣰا\n"
    }
  },
  {
    "id": 2065,
    "surahId": 17,
    "ayahNumber": 36,
    "arabicText": "وَلَا تَقۡفُ مَا لَیۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُو۟لَـٰۤىِٕكَ كَانَ عَنۡهُ مَسۡـُٔولࣰا\n",
    "translations": {
      "en": "And never concern thyself with anything of which thou hast no knowledge: verily, [thy] hearing and sight and heart - all of them - will be called to account for it [on Judgment Day]!",
      "ms": "Dan janganlah engkau mengikut apa yang engkau tidak mempunyai pengetahuan mengenainya; sesungguhnya pendengaran dan penglihatan serta hati, semua anggota-anggota itu tetap akan ditanya tentang apa yang dilakukannya.",
      "id": "Dan janganlah kamu mengikuti apa yang kamu tidak mempunyai pengetahuan tentangnya. Sesungguhnya pendengaran, penglihatan dan hati, semuanya itu akan diminta pertanggungan jawabnya.",
      "ar": "وَلَا تَقۡفُ مَا لَیۡسَ لَكَ بِهِۦ عِلۡمٌۚ إِنَّ ٱلسَّمۡعَ وَٱلۡبَصَرَ وَٱلۡفُؤَادَ كُلُّ أُو۟لَـٰۤىِٕكَ كَانَ عَنۡهُ مَسۡـُٔولࣰا\n"
    }
  },
  {
    "id": 2066,
    "surahId": 17,
    "ayahNumber": 37,
    "arabicText": "وَلَا تَمۡشِ فِی ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولࣰا\n",
    "translations": {
      "en": "And walk not on earth with haughty self-conceit: for, verily, thou canst never rend the earth asunder, nor canst thou ever grow as tall as the mountains!",
      "ms": "Dan janganlah engkau berjalan di bumi dengan berlagak sombong, kerana sesungguhnya engkau tidak akan dapat menembusi bumi, dan engkau tidak akan dapat menyamai setinggi gunung-ganang.",
      "id": "Dan janganlah kamu berjalan di muka bumi ini dengan sombong, karena sesungguhnya kamu sekali-kali tidak dapat menembus bumi dan sekali-kali kamu tidak akan sampai setinggi gunung.",
      "ar": "وَلَا تَمۡشِ فِی ٱلۡأَرۡضِ مَرَحًاۖ إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولࣰا\n"
    }
  },
  {
    "id": 2067,
    "surahId": 17,
    "ayahNumber": 38,
    "arabicText": "كُلُّ ذَ ٰ⁠لِكَ كَانَ سَیِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهࣰا\n",
    "translations": {
      "en": "The evil of all this is odious in thy Sustainer's sight:",
      "ms": "Tiap-tiap satu perintah itu, menyalahinya adalah kejahatan yang dibenci di sisi Tuhanmu.",
      "id": "Semua itu kejahatannya amat dibenci di sisi Tuhanmu.",
      "ar": "كُلُّ ذَ ٰ⁠لِكَ كَانَ سَیِّئُهُۥ عِندَ رَبِّكَ مَكۡرُوهࣰا\n"
    }
  },
  {
    "id": 2068,
    "surahId": 17,
    "ayahNumber": 39,
    "arabicText": "ذَ ٰ⁠لِكَ مِمَّاۤ أَوۡحَىٰۤ إِلَیۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ فَتُلۡقَىٰ فِی جَهَنَّمَ مَلُومࣰا مَّدۡحُورًا\n",
    "translations": {
      "en": "this is part of that knowledge of right and wrong with which thy Sustainer has inspired thee. Hence, do not set up any other deity side by side with God, lest thou be cast into hell, blamed [by thyself] and rejected [by Him]!",
      "ms": "Perintah yang demikian itu ialah sebahagian dari hikmat yang telah diwahyukan kepadamu (wahai Muhammad) oleh Tuhanmu. Dan (ingatlah) janganlah engkau jadikan bersama-sama Allah sesuatu yang lain yang disembah, kerana akibatnya engkau akan dicampakkan ke dalam neraka Jahannam dengan keadaan tercela dan tersingkir (dari rahmat Allah).",
      "id": "Itulah sebagian hikmah yang diwahyukan Tuhanmu kepadamu. Dan janganlah kamu mengadakan tuhan yang lain di samping Allah, yang menyebabkan kamu dilemparkan ke dalam neraka dalam keadaan tercela lagi dijauhkan (dari rahmat Allah).",
      "ar": "ذَ ٰ⁠لِكَ مِمَّاۤ أَوۡحَىٰۤ إِلَیۡكَ رَبُّكَ مِنَ ٱلۡحِكۡمَةِۗ وَلَا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَـٰهًا ءَاخَرَ فَتُلۡقَىٰ فِی جَهَنَّمَ مَلُومࣰا مَّدۡحُورًا\n"
    }
  },
  {
    "id": 2069,
    "surahId": 17,
    "ayahNumber": 40,
    "arabicText": "أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِینَ وَٱتَّخَذَ مِنَ ٱلۡمَلَـٰۤىِٕكَةِ إِنَـٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِیمࣰا\n",
    "translations": {
      "en": "HAS, THEN, your Sustainer distinguished you by [giving you] sons, and taken unto Himself daughters in the guise of angels? Verily, you are uttering a dreadful saying!",
      "ms": "(Jika demikian wajibnya mengesakan Allah, maka patutkah kamu mendakwa bahawa Tuhan mempunyai anak, dan anak itu pula dari jenis yang kamu tidak sukai?). Adakah Tuhan kamu telah memilih anak-anak lelaki untuk kamu dan Ia mengambil untuk diriNya anak-anak perempuan dari kalangan malaikat? Sesungguhnya kamu adalah memperkatakan dusta yang amat besar.",
      "id": "Maka apakah patut Tuhan memilihkan bagimu anak-anak laki-laki sedang Dia sendiri mengambil anak-anak perempuan di antara para malaikat? Sesungguhnya kamu benar-benar mengucapkan kata-kata yang besar (dosanya).",
      "ar": "أَفَأَصۡفَىٰكُمۡ رَبُّكُم بِٱلۡبَنِینَ وَٱتَّخَذَ مِنَ ٱلۡمَلَـٰۤىِٕكَةِ إِنَـٰثًاۚ إِنَّكُمۡ لَتَقُولُونَ قَوۡلًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 2070,
    "surahId": 17,
    "ayahNumber": 41,
    "arabicText": "وَلَقَدۡ صَرَّفۡنَا فِی هَـٰذَا ٱلۡقُرۡءَانِ لِیَذَّكَّرُوا۟ وَمَا یَزِیدُهُمۡ إِلَّا نُفُورࣰا\n",
    "translations": {
      "en": "And, indeed, many facets have We given [to Our message] in this Qur'an, so that they [who deny the truth] might take it to heart: but all this only increases their aversion.",
      "ms": "Dan sesungguhnya Kami telah menerangkan jalan-jalan menetapkan iktiqad dan tauhid dengan berbagai cara di dalam Al-Quran ini supaya mereka beringat (memahami dan mematuhi kebenaran); dalam pada itu, penerangan yang berbagai cara itu tidak menjadikan mereka melainkan bertambah liar.",
      "id": "Dan sesungguhnya dalam Al Quran ini Kami telah ulang-ulangi (peringatan-peringatan), agar mereka selalu ingat. Dan ulangan peringatan itu tidak lain hanyalah menambah mereka lari (dari kebenaran).",
      "ar": "وَلَقَدۡ صَرَّفۡنَا فِی هَـٰذَا ٱلۡقُرۡءَانِ لِیَذَّكَّرُوا۟ وَمَا یَزِیدُهُمۡ إِلَّا نُفُورࣰا\n"
    }
  },
  {
    "id": 2071,
    "surahId": 17,
    "ayahNumber": 42,
    "arabicText": "قُل لَّوۡ كَانَ مَعَهُۥۤ ءَالِهَةࣱ كَمَا یَقُولُونَ إِذࣰا لَّٱبۡتَغَوۡا۟ إِلَىٰ ذِی ٱلۡعَرۡشِ سَبِیلࣰا\n",
    "translations": {
      "en": "Say: \"If there were-as some people assert [other] deities side by side with Him, surely [even] they would have to strive to find a way unto Him who is enthroned on His almightiness?\"",
      "ms": "Katakanlah (wahai Muhammad): \"Kalaulah ada tuhan-tuhan yang lain bersama-sama Allah, sebagaimana yang mereka katakan itu, tentulah tuhan-tuhan itu akan mencari jalan kepada Allah yang mempunyai Arasy (dan kekuasaan yang mutlak).",
      "id": "Katakanlah: \"Jikalau ada tuhan-tuhan di samping-Nya, sebagaimana yang mereka katakan, niscaya tuhan-tuhan itu mencari jalan kepada Tuhan yang mempunyai 'Arsy\".",
      "ar": "قُل لَّوۡ كَانَ مَعَهُۥۤ ءَالِهَةࣱ كَمَا یَقُولُونَ إِذࣰا لَّٱبۡتَغَوۡا۟ إِلَىٰ ذِی ٱلۡعَرۡشِ سَبِیلࣰا\n"
    }
  },
  {
    "id": 2072,
    "surahId": 17,
    "ayahNumber": 43,
    "arabicText": "سُبۡحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا یَقُولُونَ عُلُوࣰّا كَبِیرࣰا\n",
    "translations": {
      "en": "Limitless is He in His glory, and sublimely, immeasurably exalted above anything that men may say [about Him]",
      "ms": "Maha Sucilah Allah dan tertinggilah Ia setinggi-tingginya, jauh dari apa yang mereka katakan itu.",
      "id": "Maha Suci dan Maha Tinggi Dia dari apa yang mereka katakan dengan ketinggian yang sebesar-besarnya.",
      "ar": "سُبۡحَـٰنَهُۥ وَتَعَـٰلَىٰ عَمَّا یَقُولُونَ عُلُوࣰّا كَبِیرࣰا\n"
    }
  },
  {
    "id": 2073,
    "surahId": 17,
    "ayahNumber": 44,
    "arabicText": "تُسَبِّحُ لَهُ ٱلسَّمَـٰوَ ٰ⁠تُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِیهِنَّۚ وَإِن مِّن شَیۡءٍ إِلَّا یُسَبِّحُ بِحَمۡدِهِۦ وَلَـٰكِن لَّا تَفۡقَهُونَ تَسۡبِیحَهُمۡۚ إِنَّهُۥ كَانَ حَلِیمًا غَفُورࣰا\n",
    "translations": {
      "en": "The seven heavens extol His limitless glory, and the earth, and all that they contain; and there is not a single thing but extols His limitless glory and praise: but you [O men] fail to grasp the manner of their glorifying Him! Verily, He is forbearing, much-forgiving!",
      "ms": "Langit yang tujuh dan bumi serta sekalian makhluk yang ada padanya, sentiasa mengucap tasbih bagi Allah; dan tiada sesuatupun melainkan bertasbih dengan memujiNya; akan tetapi kamu tidak faham akan tasbih mereka. Sesungguhnya Ia adalah Maha Penyabar, lagi Maha Pengampun.",
      "id": "Langit yang tujuh, bumi dan semua yang ada di dalamnya bertasbih kepada Allah. Dan tak ada suatupun melainkan bertasbih dengan memuji-Nya, tetapi kamu sekalian tidak mengerti tasbih mereka. Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun.",
      "ar": "تُسَبِّحُ لَهُ ٱلسَّمَـٰوَ ٰ⁠تُ ٱلسَّبۡعُ وَٱلۡأَرۡضُ وَمَن فِیهِنَّۚ وَإِن مِّن شَیۡءٍ إِلَّا یُسَبِّحُ بِحَمۡدِهِۦ وَلَـٰكِن لَّا تَفۡقَهُونَ تَسۡبِیحَهُمۡۚ إِنَّهُۥ كَانَ حَلِیمًا غَفُورࣰا\n"
    }
  },
  {
    "id": 2074,
    "surahId": 17,
    "ayahNumber": 45,
    "arabicText": "وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَیۡنَكَ وَبَیۡنَ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ حِجَابࣰا مَّسۡتُورࣰا\n",
    "translations": {
      "en": "But [thus it is:] whenever thou recitest the Qur'an, We place an invisible barrier between thee and those who will not believe in the life to come: -",
      "ms": "Dan apabila engkau membaca Al-Quran (wahai Muhammad), Kami jadikan perasaan ingkar dan hasad dengki orang-orang yang tidak beriman kepada hari akhirat itu sebagai dinding yang tidak dapat dilihat, yang menyekat mereka daripada memahami bacaanmu.",
      "id": "Dan apabila kamu membaca Al Quran niscaya Kami adakan antara kamu dan orang-orang yang tidak beriman kepada kehidupan akhirat, suatu dinding yang tertutup,",
      "ar": "وَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ جَعَلۡنَا بَیۡنَكَ وَبَیۡنَ ٱلَّذِینَ لَا یُؤۡمِنُونَ بِٱلۡـَٔاخِرَةِ حِجَابࣰا مَّسۡتُورࣰا\n"
    }
  },
  {
    "id": 2075,
    "surahId": 17,
    "ayahNumber": 46,
    "arabicText": "وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن یَفۡقَهُوهُ وَفِیۤ ءَاذَانِهِمۡ وَقۡرࣰاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِی ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡا۟ عَلَىٰۤ أَدۡبَـٰرِهِمۡ نُفُورࣰا\n",
    "translations": {
      "en": "for, over their hearts We have laid veils which prevent them from grasping its purport, and into their ears, deafness. And so, whenever thou dost mention, while reciting the Qur'an, thy Sustainer as the one and only Divine Being, they turn their backs [upon thee] in aversion.",
      "ms": "Dan Kami jadikan (perasaan itu sebagai) tutupan yang berlapis-lapis atas hati mereka, juga sebagai penyumbat pada telinga mereka, yang menghalang mereka dari memahami dan mendengar kebenaran Al-Quran; dan sebab itulah apabila engkau menyebut nama Tuhanmu sahaja di dalam Al-Quran, mereka berpaling undur melarikan diri.",
      "id": "dan Kami adakan tutupan di atas hati mereka dan sumbatan di telinga mereka, agar mereka tidak dapat memahaminya. Dan apabila kamu menyebut Tuhanmu saja dalam Al Quran, niscaya mereka berpaling ke belakang karena bencinya,",
      "ar": "وَجَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن یَفۡقَهُوهُ وَفِیۤ ءَاذَانِهِمۡ وَقۡرࣰاۚ وَإِذَا ذَكَرۡتَ رَبَّكَ فِی ٱلۡقُرۡءَانِ وَحۡدَهُۥ وَلَّوۡا۟ عَلَىٰۤ أَدۡبَـٰرِهِمۡ نُفُورࣰا\n"
    }
  },
  {
    "id": 2076,
    "surahId": 17,
    "ayahNumber": 47,
    "arabicText": "نَّحۡنُ أَعۡلَمُ بِمَا یَسۡتَمِعُونَ بِهِۦۤ إِذۡ یَسۡتَمِعُونَ إِلَیۡكَ وَإِذۡ هُمۡ نَجۡوَىٰۤ إِذۡ یَقُولُ ٱلظَّـٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلࣰا مَّسۡحُورًا\n",
    "translations": {
      "en": "We are fully aware of what they are listening for when they listen to thee: for when they are secluded among themselves, lo! these wrongdoers say [unto one another], \"If you were to follow [Muhammad, you would follow] only a man bewitched!\"",
      "ms": "Kami lebih mengetahui akan tujuan mereka mendengar Al-Quran semasa mereka mendengar bacaanmu (wahai Muhammad), dan semasa mereka berbisik-bisik iaitu ketika orang-orang yang zalim itu berkata (sesama sendiri): \"Kamu tidak menurut melainkan seorang yang kena sihir\".",
      "id": "Kami lebih mengetahui dalam keadaan bagaimana mereka mendengarkan sewaktu mereka mendengarkan kamu, dan sewaktu mereka berbisik-bisik (yaitu) ketika orang-orang zalim itu berkata: \"Kamu tidak lain hanyalah mengikuti seorang laki-laki yang kena sihir\".",
      "ar": "نَّحۡنُ أَعۡلَمُ بِمَا یَسۡتَمِعُونَ بِهِۦۤ إِذۡ یَسۡتَمِعُونَ إِلَیۡكَ وَإِذۡ هُمۡ نَجۡوَىٰۤ إِذۡ یَقُولُ ٱلظَّـٰلِمُونَ إِن تَتَّبِعُونَ إِلَّا رَجُلࣰا مَّسۡحُورًا\n"
    }
  },
  {
    "id": 2077,
    "surahId": 17,
    "ayahNumber": 48,
    "arabicText": "ٱنظُرۡ كَیۡفَ ضَرَبُوا۟ لَكَ ٱلۡأَمۡثَالَ فَضَلُّوا۟ فَلَا یَسۡتَطِیعُونَ سَبِیلࣰا\n",
    "translations": {
      "en": "See to what they liken thee, [O Prophet simply] because they have gone astray and are now unable to find a way [to the truth]!",
      "ms": "Lihatlah (wahai Muhammad) bagaimana mereka menyifatkan engkau dengan yang bukan-bukan, maka dengan sebab itu mereka sesat, sehingga mereka tidak dapat mencari jalan kebenaran.",
      "id": "Lihatlah bagaimana mereka membuat perumpamaan-perumpamaan terhadapmu; karena itu mereka menjadi sesat dan tidak dapat lagi menemukan jalan (yang benar).",
      "ar": "ٱنظُرۡ كَیۡفَ ضَرَبُوا۟ لَكَ ٱلۡأَمۡثَالَ فَضَلُّوا۟ فَلَا یَسۡتَطِیعُونَ سَبِیلࣰا\n"
    }
  },
  {
    "id": 2078,
    "surahId": 17,
    "ayahNumber": 49,
    "arabicText": "وَقَالُوۤا۟ أَءِذَا كُنَّا عِظَـٰمࣰا وَرُفَـٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقࣰا جَدِیدࣰا\n",
    "translations": {
      "en": "And [thus, too,] they say, \"After we will have become bones and dust, shall we, forsooth, be raised from the dead in a new act of creation?\"",
      "ms": "Dan mereka berkata: \"Adakah sesudah kita menjadi tulang dan benda yang reput, adakah kita akan dibangkitkan semula dengan kejadian yang baharu?\"",
      "id": "Dan mereka berkata: \"Apakah bila kami telah menjadi tulang belulang dan benda-benda yang hancur, apa benar-benarkah kami akan dibangkitkan kembali sebagai makhluk yang baru?\"",
      "ar": "وَقَالُوۤا۟ أَءِذَا كُنَّا عِظَـٰمࣰا وَرُفَـٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقࣰا جَدِیدࣰا\n"
    }
  },
  {
    "id": 2079,
    "surahId": 17,
    "ayahNumber": 50,
    "arabicText": "۞ قُلۡ كُونُوا۟ حِجَارَةً أَوۡ حَدِیدًا\n",
    "translations": {
      "en": "Say: \"[You will be raised from the dead even though] you be stones or iron",
      "ms": "Katakanlah (wahai Muhammad):\" Jadilah kamu batu atau besi -",
      "id": "Katakanlah: \"Jadilah kamu sekalian batu atau besi,",
      "ar": "۞ قُلۡ كُونُوا۟ حِجَارَةً أَوۡ حَدِیدًا\n"
    }
  },
  {
    "id": 2080,
    "surahId": 17,
    "ayahNumber": 51,
    "arabicText": "أَوۡ خَلۡقࣰا مِّمَّا یَكۡبُرُ فِی صُدُورِكُمۡۚ فَسَیَقُولُونَ مَن یُعِیدُنَاۖ قُلِ ٱلَّذِی فَطَرَكُمۡ أَوَّلَ مَرَّةࣲۚ فَسَیُنۡغِضُونَ إِلَیۡكَ رُءُوسَهُمۡ وَیَقُولُونَ مَتَىٰ هُوَۖ قُلۡ عَسَىٰۤ أَن یَكُونَ قَرِیبࣰا\n",
    "translations": {
      "en": "or any [other] substance which, to your minds, appears yet farther removed [from life]!\" And [if] thereupon they ask, \"Who is it that will' bring us back [to life]?\"-say thou: \"He who has brought you into being in the first instance.\" And [if] thereupon they shake their heads at thee [in disbelief] and ask, \"When shall this be?\"-say thou: \"It may well be soon,",
      "ms": "Atau lain-lain makhluk yang terlintas di hati kamu sukar hidupnya, (maka Allah berkuasa menghidupkannya)!\" Mereka pula akan bertanya: \"Siapakah yang akan mengembalikan kita hidup semula?\" Katakanlah: \"Ialah Allah yang menjadikan kamu pada mulanya!\" Maka mereka akan menganggukkan kepala mereka kepadamu sambil bertanya secara mengejek: Bila berlakunya?\" Katakanlah: \"Dipercayai akan berlaku tidak lama lagi!\"",
      "id": "atau suatu makhluk dari makhluk yang tidak mungkin (hidup) menurut pikiranmu\". Maka mereka akan bertanya: \"Siapa yang akan menghidupkan kami kembali?\" Katakanlah: \"Yang telah menciptakan kamu pada kali yang pertama\". Lalu mereka akan menggeleng-gelengkan kepala mereka kepadamu dan berkata: \"Kapan itu (akan terjadi)?\" Katakanlah: \"Mudah-mudahan waktu berbangkit itu dekat\",",
      "ar": "أَوۡ خَلۡقࣰا مِّمَّا یَكۡبُرُ فِی صُدُورِكُمۡۚ فَسَیَقُولُونَ مَن یُعِیدُنَاۖ قُلِ ٱلَّذِی فَطَرَكُمۡ أَوَّلَ مَرَّةࣲۚ فَسَیُنۡغِضُونَ إِلَیۡكَ رُءُوسَهُمۡ وَیَقُولُونَ مَتَىٰ هُوَۖ قُلۡ عَسَىٰۤ أَن یَكُونَ قَرِیبࣰا\n"
    }
  },
  {
    "id": 2081,
    "surahId": 17,
    "ayahNumber": 52,
    "arabicText": "یَوۡمَ یَدۡعُوكُمۡ فَتَسۡتَجِیبُونَ بِحَمۡدِهِۦ وَتَظُنُّونَ إِن لَّبِثۡتُمۡ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "on a Day when He will call you, and you will answer by praising Him, thinking all the while that you have tarried [on earth] but a little while.\"",
      "ms": "(Ingatlah akan) hari Ia menyeru kamu lalu kamu menyahut sambil memuji kekuasaanNya, dan kamu menyangka, bahawa kamu tinggal (dalam kubur) hanya sebentar.",
      "id": "yaitu pada hari Dia memanggil kamu, lalu kamu mematuhi-Nya sambil memuji-Nya dan kamu mengira, bahwa kamu tidak berdiam (di dalam kubur) kecuali sebentar saja.",
      "ar": "یَوۡمَ یَدۡعُوكُمۡ فَتَسۡتَجِیبُونَ بِحَمۡدِهِۦ وَتَظُنُّونَ إِن لَّبِثۡتُمۡ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 2082,
    "surahId": 17,
    "ayahNumber": 53,
    "arabicText": "وَقُل لِّعِبَادِی یَقُولُوا۟ ٱلَّتِی هِیَ أَحۡسَنُۚ إِنَّ ٱلشَّیۡطَـٰنَ یَنزَغُ بَیۡنَهُمۡۚ إِنَّ ٱلشَّیۡطَـٰنَ كَانَ لِلۡإِنسَـٰنِ عَدُوࣰّا مُّبِینࣰا\n",
    "translations": {
      "en": "AND TELL My servants that they should speak in the most kindly manner [unto those who do not share their beliefs]: verily, Satan is always ready to stir up discord between men - for, verily, Satan is man's open foe!",
      "ms": "Dan katakanlah (wahai Muhammad) kepada hamba-hambaKu (yang beriman), supaya mereka berkata dengan kata-kata yang amat baik (kepada orang-orang yang menentang kebenaran); sesungguhnya Syaitan itu sentiasa menghasut di antara mereka (yang mukmin dan yang menentang); sesungguhnya Syaitan itu adalah musuh yang amat nyata bagi manusia.",
      "id": "Dan katakanlah kepada hamha-hamba-Ku: \"Hendaklah mereka mengucapkan perkataan yang lebih baik (benar). Sesungguhnya syaitan itu menimbulkan perselisihan di antara mereka. Sesungguhnya syaitan itu adalah musuh yang nyata bagi manusia.",
      "ar": "وَقُل لِّعِبَادِی یَقُولُوا۟ ٱلَّتِی هِیَ أَحۡسَنُۚ إِنَّ ٱلشَّیۡطَـٰنَ یَنزَغُ بَیۡنَهُمۡۚ إِنَّ ٱلشَّیۡطَـٰنَ كَانَ لِلۡإِنسَـٰنِ عَدُوࣰّا مُّبِینࣰا\n"
    }
  },
  {
    "id": 2083,
    "surahId": 17,
    "ayahNumber": 54,
    "arabicText": "رَّبُّكُمۡ أَعۡلَمُ بِكُمۡۖ إِن یَشَأۡ یَرۡحَمۡكُمۡ أَوۡ إِن یَشَأۡ یُعَذِّبۡكُمۡۚ وَمَاۤ أَرۡسَلۡنَـٰكَ عَلَیۡهِمۡ وَكِیلࣰا\n",
    "translations": {
      "en": "Your Sustainer is fully aware of what you are [and what you deserve]: if He so wills, he will bestow [His] grace upon you; and if He so wills, He will chastise you. Hence, We have not sent thee [unto men, O Prophet,] with the power to determine their fate,",
      "ms": "Tuhan kamu lebih mengetahui akan keadaan kamu; jika Ia kehendaki, Ia akan memberi rahmat kepada kamu; atau jika Ia kehendaki, Ia akan menyeksa kamu. Dan Kami tidak mengutusmu kepada mereka (wahai Muhammad), sebagai wakil yang menguasai urusan mereka.",
      "id": "Tuhanmu lebih mengetahui tentang kamu. Dia akan memberi rahmat kepadamu jika Dia menghendaki dan Dia akan mengazabmu, jika Dia menghendaki. Dan, Kami tidaklah mengutusmu untuk menjadi penjaga bagi mereka.",
      "ar": "رَّبُّكُمۡ أَعۡلَمُ بِكُمۡۖ إِن یَشَأۡ یَرۡحَمۡكُمۡ أَوۡ إِن یَشَأۡ یُعَذِّبۡكُمۡۚ وَمَاۤ أَرۡسَلۡنَـٰكَ عَلَیۡهِمۡ وَكِیلࣰا\n"
    }
  },
  {
    "id": 2084,
    "surahId": 17,
    "ayahNumber": 55,
    "arabicText": "وَرَبُّكَ أَعۡلَمُ بِمَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۗ وَلَقَدۡ فَضَّلۡنَا بَعۡضَ ٱلنَّبِیِّـۧنَ عَلَىٰ بَعۡضࣲۖ وَءَاتَیۡنَا دَاوُۥدَ زَبُورࣰا\n",
    "translations": {
      "en": "seeing that thy Sustainer is fully aware of [what is in the minds of] all beings that are in the heavens and on earth. But, indeed, We did endow some of the prophets more highly than others -just as We bestowed upon David a book of divine wisdom [in token of Our grace]",
      "ms": "Dan Tuhanmu (wahai Muhammad) lebih mengetahui akan sekalian makhluk yang ada di langit dan di bumi; dan sesungguhnya Kami telah melebihkan setengah Nabi-nabi atas setengahnya yang lain; dan Kami telah memberikan Kitab Zabur kepada Nabi Daud.",
      "id": "Dan Tuhan-mu lebih mengetahui siapa yang (ada) di langit dan di bumi. Dan sesungguhnya telah Kami lebihkan sebagian nabi-nabi itu atas sebagian (yang lain), dan Kami berikan Zabur kepada Daud.",
      "ar": "وَرَبُّكَ أَعۡلَمُ بِمَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۗ وَلَقَدۡ فَضَّلۡنَا بَعۡضَ ٱلنَّبِیِّـۧنَ عَلَىٰ بَعۡضࣲۖ وَءَاتَیۡنَا دَاوُۥدَ زَبُورࣰا\n"
    }
  },
  {
    "id": 2085,
    "surahId": 17,
    "ayahNumber": 56,
    "arabicText": "قُلِ ٱدۡعُوا۟ ٱلَّذِینَ زَعَمۡتُم مِّن دُونِهِۦ فَلَا یَمۡلِكُونَ كَشۡفَ ٱلضُّرِّ عَنكُمۡ وَلَا تَحۡوِیلًا\n",
    "translations": {
      "en": "SAY: \"Call upon those [beings] whom you imagine [to be endowed with divine powers] beside Him and [you will find that] they have it not in their power to remove any affliction from you, or to shift it [elsewhere]. \"",
      "ms": "Katakanlah (wahai Muhammad kepada kaum musyrik): \"Serukanlah orang-orang yang kamu dakwa (boleh memberi pertolongan) selain dari Allah, maka sudah tentu mereka tidak berkuasa menghapuskan bahaya daripada kamu dan tidak dapat memindahkannya\".",
      "id": "Katakanlah: \"Panggillah mereka yang kamu anggap (tuhan) selain Allah, maka mereka tidak akan mempunyai kekuasaan untuk menghilangkan bahaya daripadamu dan tidak pula memindahkannya\".",
      "ar": "قُلِ ٱدۡعُوا۟ ٱلَّذِینَ زَعَمۡتُم مِّن دُونِهِۦ فَلَا یَمۡلِكُونَ كَشۡفَ ٱلضُّرِّ عَنكُمۡ وَلَا تَحۡوِیلًا\n"
    }
  },
  {
    "id": 2086,
    "surahId": 17,
    "ayahNumber": 57,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ یَدۡعُونَ یَبۡتَغُونَ إِلَىٰ رَبِّهِمُ ٱلۡوَسِیلَةَ أَیُّهُمۡ أَقۡرَبُ وَیَرۡجُونَ رَحۡمَتَهُۥ وَیَخَافُونَ عَذَابَهُۥۤۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحۡذُورࣰا\n",
    "translations": {
      "en": "Those [saintly beings] whom they invoke are themselves striving to obtain their Sustainer's favour - [even] those among them who are closest [to Him] - hoping for His grace and dreading His chastisement: for, verily, thy Sustainer's chastisement is something to beware of!",
      "ms": "orang-orang yang mereka seru itu, masing-masing mencari jalan mendampingkan diri kepada Tuhannya (dengan berbuat ibadat), sekali pun orang yang lebih dekat kepada Tuhannya, serta mereka pula mengharapkan rahmatNya dan gerun takut akan azabNya; sesungguhnya azab Tuhanmu itu, adalah (perkara yang semestinya) ditakuti.",
      "id": "Orang-orang yang mereka seru itu, mereka sendiri mencari jalan kepada Tuhan mereka siapa di antara mereka yang lebih dekat (kepada Allah) dan mengharapkan rahmat-Nya dan takut akan azab-Nya; sesungguhnya azab Tuhanmu adalah suatu yang (harus) ditakuti.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ یَدۡعُونَ یَبۡتَغُونَ إِلَىٰ رَبِّهِمُ ٱلۡوَسِیلَةَ أَیُّهُمۡ أَقۡرَبُ وَیَرۡجُونَ رَحۡمَتَهُۥ وَیَخَافُونَ عَذَابَهُۥۤۚ إِنَّ عَذَابَ رَبِّكَ كَانَ مَحۡذُورࣰا\n"
    }
  },
  {
    "id": 2087,
    "surahId": 17,
    "ayahNumber": 58,
    "arabicText": "وَإِن مِّن قَرۡیَةٍ إِلَّا نَحۡنُ مُهۡلِكُوهَا قَبۡلَ یَوۡمِ ٱلۡقِیَـٰمَةِ أَوۡ مُعَذِّبُوهَا عَذَابࣰا شَدِیدࣰاۚ كَانَ ذَ ٰ⁠لِكَ فِی ٱلۡكِتَـٰبِ مَسۡطُورࣰا\n",
    "translations": {
      "en": "And [bear in mind:] there is no community which We will not destroy before the Day of Resurrection, or chastise [even earlier, if it proves sinful,] with suffering severe: all this is laid down in Our decree.",
      "ms": "Dan tiada sesebuah negeri pun melainkan Kami akan membinasakannya sebelum hari kiamat, atau Kami menyeksa penduduknya dengan azab seksa yang berat; yang demikian itu adalah tertulis di dalam Kitab (Lauh Mahfuz).",
      "id": "Tak ada suatu negeripun (yang durhaka penduduknya), melainkan Kami membinasakannya sebelum hari kiamat atau Kami azab (penduduknya) dengan azab yang sangat keras. Yang demikian itu telah tertulis di dalam kitab (Lauh Mahfuzh).",
      "ar": "وَإِن مِّن قَرۡیَةٍ إِلَّا نَحۡنُ مُهۡلِكُوهَا قَبۡلَ یَوۡمِ ٱلۡقِیَـٰمَةِ أَوۡ مُعَذِّبُوهَا عَذَابࣰا شَدِیدࣰاۚ كَانَ ذَ ٰ⁠لِكَ فِی ٱلۡكِتَـٰبِ مَسۡطُورࣰا\n"
    }
  },
  {
    "id": 2088,
    "surahId": 17,
    "ayahNumber": 59,
    "arabicText": "وَمَا مَنَعَنَاۤ أَن نُّرۡسِلَ بِٱلۡـَٔایَـٰتِ إِلَّاۤ أَن كَذَّبَ بِهَا ٱلۡأَوَّلُونَۚ وَءَاتَیۡنَا ثَمُودَ ٱلنَّاقَةَ مُبۡصِرَةࣰ فَظَلَمُوا۟ بِهَاۚ وَمَا نُرۡسِلُ بِٱلۡـَٔایَـٰتِ إِلَّا تَخۡوِیفࣰا\n",
    "translations": {
      "en": "And nothing has prevented Us from sending [this message, like the earlier ones,] with miraculous signs [in its wake], save [Our knowledge] that the people of olden times [only too often] gave the lie to them: thus, We provided for [the tribe of] Thamud the she-camel as a light-giving portent, and they sinned against it. And never did We send those signs for any other purpose than to convey a warning.",
      "ms": "Dan tiada yang menghalang Kami dari menghantar turun mukjizat yang mereka minta itu melainkan kerana jenis mukjizat itu telah didustakan oleh kaum-kaum yang telah lalu; dan di antaranya Kami telahpun memberikan kepada kaum Thamud unta betina sebagai mukjizat yang menjadi keterangan yang nyata, lalu mereka berlaku zalim kepadanya; dan biasanya Kami tidak menghantar turun mukjizat-mukjizat itu melainkan untuk menjadi amaran (bagi kebinasaan orang-orang yang memintanya kalau mereka tidak beriman).",
      "id": "Dan sekali-kali tidak ada yang menghalangi Kami untuk mengirimkan (kepadamu) tanda-tanda (kekuasan Kami), melainkan karena tanda-tanda itu telah didustakan oleh orang-orang dahulu. Dan telah Kami berikan kepada Tsamud unta betina itu (sebagai mukjizat) yang dapat dilihat, tetapi mereka menganiaya unta betina itu. Dan Kami tidak memberi tanda-tanda itu melainkan untuk menakuti.",
      "ar": "وَمَا مَنَعَنَاۤ أَن نُّرۡسِلَ بِٱلۡـَٔایَـٰتِ إِلَّاۤ أَن كَذَّبَ بِهَا ٱلۡأَوَّلُونَۚ وَءَاتَیۡنَا ثَمُودَ ٱلنَّاقَةَ مُبۡصِرَةࣰ فَظَلَمُوا۟ بِهَاۚ وَمَا نُرۡسِلُ بِٱلۡـَٔایَـٰتِ إِلَّا تَخۡوِیفࣰا\n"
    }
  },
  {
    "id": 2089,
    "surahId": 17,
    "ayahNumber": 60,
    "arabicText": "وَإِذۡ قُلۡنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِۚ وَمَا جَعَلۡنَا ٱلرُّءۡیَا ٱلَّتِیۤ أَرَیۡنَـٰكَ إِلَّا فِتۡنَةࣰ لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلۡمَلۡعُونَةَ فِی ٱلۡقُرۡءَانِۚ وَنُخَوِّفُهُمۡ فَمَا یَزِیدُهُمۡ إِلَّا طُغۡیَـٰنࣰا كَبِیرࣰا\n",
    "translations": {
      "en": "And lo! We said unto thee, [O Prophet:] \"Behold, thy Sustainer encompasses all mankind [within His knowledge and might]: and so We have ordained that the vision which We have shown thee -as also the tree [of hell,] cursed in this Qur'an - shall be but a trial for men. Now [by Our mentioning hell] We convey a warning to them: but [if they are bent on denying the truth,] this [warning] only increases their gross, overweening arrogance.\"",
      "ms": "Dan (ingatlah) ketika Kami wahyukan kepadamu (wahai Muhammad), bahawa sesungguhnya Tuhanmu meliputi akan manusia (dengan ilmuNya dan kekuasaanNya; dan tiadalah Kami menjadikan pandangan (pada malam Mikraj) yang telah kami perlihatkan kepadamu melainkan sebagai satu ujian bagi manusia; dan (demikian juga Kami jadikan) pokok yang dilaknat di dalam Al-Quran; dan Kami beri mereka takut (dengan berbagai-bagai amaran) maka semuanya itu tidak menambahkan mereka melainkan dengan kekufuran yang melampau.",
      "id": "Dan (ingatlah), ketika Kami wahyukan kepadamu: \"Sesungguhnya (ilmu) Tuhanmu meliputi segala manusia\". Dan Kami tidak menjadikan mimpi yang telah Kami perlihatkan kepadamu, melainkan sebagai ujian bagi manusia dan (begitu pula) pohon kayu yang terkutuk dalam Al Quran. Dan Kami menakut-nakuti mereka, tetapi yang demikian itu hanyalah menambah besar kedurhakaan mereka.",
      "ar": "وَإِذۡ قُلۡنَا لَكَ إِنَّ رَبَّكَ أَحَاطَ بِٱلنَّاسِۚ وَمَا جَعَلۡنَا ٱلرُّءۡیَا ٱلَّتِیۤ أَرَیۡنَـٰكَ إِلَّا فِتۡنَةࣰ لِّلنَّاسِ وَٱلشَّجَرَةَ ٱلۡمَلۡعُونَةَ فِی ٱلۡقُرۡءَانِۚ وَنُخَوِّفُهُمۡ فَمَا یَزِیدُهُمۡ إِلَّا طُغۡیَـٰنࣰا كَبِیرࣰا\n"
    }
  },
  {
    "id": 2090,
    "surahId": 17,
    "ayahNumber": 61,
    "arabicText": "وَإِذۡ قُلۡنَا لِلۡمَلَـٰۤىِٕكَةِ ٱسۡجُدُوا۟ لِـَٔادَمَ فَسَجَدُوۤا۟ إِلَّاۤ إِبۡلِیسَ قَالَ ءَأَسۡجُدُ لِمَنۡ خَلَقۡتَ طِینࣰا\n",
    "translations": {
      "en": "AND LO! We said unto the angels, \"Prostrate yourselves before Adam\"-whereupon they all prostrated themselves, save Iblis. Said he: \"Shall I prostrate myself before one whom Thou hast created out of clay?\"",
      "ms": "Dan (ingatkanlah peristiwa) ketika Kami berfirman kepada malaikat: \"Sujudlah kamu kepada Adam\"; maka mereka sujudlah melainkan iblis; ia berkata: \"Patutkah aku sujud kepada (makhluk) yang Engkau jadikan dari tanah (yang di adun)?\"",
      "id": "Dan (ingatlah), tatkala Kami berfirman kepada para malaikat: \"Sujudlah kamu semua kepada Adam\", lalu mereka sujud kecuali iblis. Dia berkata: \"Apakah aku akan sujud kepada orang yang Engkau ciptakan dari tanah?\"",
      "ar": "وَإِذۡ قُلۡنَا لِلۡمَلَـٰۤىِٕكَةِ ٱسۡجُدُوا۟ لِـَٔادَمَ فَسَجَدُوۤا۟ إِلَّاۤ إِبۡلِیسَ قَالَ ءَأَسۡجُدُ لِمَنۡ خَلَقۡتَ طِینࣰا\n"
    }
  },
  {
    "id": 2091,
    "surahId": 17,
    "ayahNumber": 62,
    "arabicText": "قَالَ أَرَءَیۡتَكَ هَـٰذَا ٱلَّذِی كَرَّمۡتَ عَلَیَّ لَىِٕنۡ أَخَّرۡتَنِ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ لَأَحۡتَنِكَنَّ ذُرِّیَّتَهُۥۤ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "[And] he added: \"Tell me, is this [foolish being] the one whom Thou hast exalted above me? Indeed, if Thou wilt but allow me a respite till the Day of Resurrection, I shall most certainly cause his descendants-all but a few-to obey me blindly!",
      "ms": "Ia berkata lagi: \"Khabarkanlah kepadaku, inikah orangnya yang Engkau muliakan mengatasiku? Jika Engkau beri tempoh kepadaku hingga hari kiamat, tentulah aku akan memancing menyesatkan zuriat keturunannya, kecuali sedikit (di antaranya)\".",
      "id": "Dia (iblis) berkata: \"Terangkanlah kepadaku inikah orangnya yang Engkau muliakan atas diriku? Sesungguhnya jika Engkau memberi tangguh kepadaku sampai hari kiamat, niscaya benar-benar akan aku sesatkan keturunannya, kecuali sebahagian kecil\".",
      "ar": "قَالَ أَرَءَیۡتَكَ هَـٰذَا ٱلَّذِی كَرَّمۡتَ عَلَیَّ لَىِٕنۡ أَخَّرۡتَنِ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ لَأَحۡتَنِكَنَّ ذُرِّیَّتَهُۥۤ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 2092,
    "surahId": 17,
    "ayahNumber": 63,
    "arabicText": "قَالَ ٱذۡهَبۡ فَمَن تَبِعَكَ مِنۡهُمۡ فَإِنَّ جَهَنَّمَ جَزَاۤؤُكُمۡ جَزَاۤءࣰ مَّوۡفُورࣰا\n",
    "translations": {
      "en": "[God] answered: \"Go [the way thou hast chosen]! But as for such of them as shall follow thee - behold, hell will be the recompense of you (all], a recompense most ample!",
      "ms": "Allah berfirman (kepada iblis): \"Pergilah (lakukanlah apa yang engkau rancangkan)! Kemudian siapa yang menurutmu di antara mereka, maka sesungguhnya neraka Jahannamlah balasan kamu semua, sebagai balasan yang cukup.",
      "id": "Tuhan berfirman: \"Pergilah, barangsiapa di antara mereka yang mengikuti kamu, maka sesungguhnya neraka Jahannam adalah balasanmu semua, sebagai suatu pembalasan yang cukup.",
      "ar": "قَالَ ٱذۡهَبۡ فَمَن تَبِعَكَ مِنۡهُمۡ فَإِنَّ جَهَنَّمَ جَزَاۤؤُكُمۡ جَزَاۤءࣰ مَّوۡفُورࣰا\n"
    }
  },
  {
    "id": 2093,
    "surahId": 17,
    "ayahNumber": 64,
    "arabicText": "وَٱسۡتَفۡزِزۡ مَنِ ٱسۡتَطَعۡتَ مِنۡهُم بِصَوۡتِكَ وَأَجۡلِبۡ عَلَیۡهِم بِخَیۡلِكَ وَرَجِلِكَ وَشَارِكۡهُمۡ فِی ٱلۡأَمۡوَ ٰ⁠لِ وَٱلۡأَوۡلَـٰدِ وَعِدۡهُمۡۚ وَمَا یَعِدُهُمُ ٱلشَّیۡطَـٰنُ إِلَّا غُرُورًا\n",
    "translations": {
      "en": "Entice, then, with thy voice such of them as thou canst, and bear upon them with all thy horses and all thy men, and be their partner in [all sins relating to] worldly goods and children, and hold out [all manner of] promises to them: and [they will not know that] whatever Satan promises them is but meant to delude the mind.",
      "ms": "Dan desak serta pujuklah sesiapa yang engkau dapat memujuknya dengan suaramu; dan kerahlah penyokong-penyokongmu yang berkuda serta yang berjalan kaki untuk mengalahkan mereka; dan turut - campurlah dengan mereka dalam menguruskan harta-benda dan anak-anak (mereka); dan janjikanlah mereka (dengan janji-janjimu)\". Padahal tidak ada yang dijanjikan oleh Syaitan itu melainkan tipu daya semata-mata.",
      "id": "Dan hasunglah siapa yang kamu sanggupi di antara mereka dengan ajakanmu, dan kerahkanlah terhadap mereka pasukan berkuda dan pasukanmu yang berjalan kaki dan berserikatlah dengan mereka pada harta dan anak-anak dan beri janjilah mereka. Dan tidak ada yang dijanjikan oleh syaitan kepada mereka melainkan tipuan belaka.",
      "ar": "وَٱسۡتَفۡزِزۡ مَنِ ٱسۡتَطَعۡتَ مِنۡهُم بِصَوۡتِكَ وَأَجۡلِبۡ عَلَیۡهِم بِخَیۡلِكَ وَرَجِلِكَ وَشَارِكۡهُمۡ فِی ٱلۡأَمۡوَ ٰ⁠لِ وَٱلۡأَوۡلَـٰدِ وَعِدۡهُمۡۚ وَمَا یَعِدُهُمُ ٱلشَّیۡطَـٰنُ إِلَّا غُرُورًا\n"
    }
  },
  {
    "id": 2094,
    "surahId": 17,
    "ayahNumber": 65,
    "arabicText": "إِنَّ عِبَادِی لَیۡسَ لَكَ عَلَیۡهِمۡ سُلۡطَـٰنࣱۚ وَكَفَىٰ بِرَبِّكَ وَكِیلࣰا\n",
    "translations": {
      "en": "\"(And yet,] behold, thou shalt have no power over [such of] My servants [as place their trust in Me]: for none is as worthy of trust as thy Sustainer.\"",
      "ms": "Sesungguhnya hamba-hambaKu (yang beriman dengan ikhlas), tiadalah engkau (hai iblis) mempunyai sebarang kuasa terhadap mereka (untuk menyesatkannya); cukuplah Tuhanmu (wahai Muhammad) menjadi Pelindung (bagi mereka).",
      "id": "Sesungguhnya hamba-hamba-Ku, kamu tidak dapat berkuasa atas mereka. Dan cukuplah Tuhan-mu sebagai Penjaga\".",
      "ar": "إِنَّ عِبَادِی لَیۡسَ لَكَ عَلَیۡهِمۡ سُلۡطَـٰنࣱۚ وَكَفَىٰ بِرَبِّكَ وَكِیلࣰا\n"
    }
  },
  {
    "id": 2095,
    "surahId": 17,
    "ayahNumber": 66,
    "arabicText": "رَّبُّكُمُ ٱلَّذِی یُزۡجِی لَكُمُ ٱلۡفُلۡكَ فِی ٱلۡبَحۡرِ لِتَبۡتَغُوا۟ مِن فَضۡلِهِۦۤۚ إِنَّهُۥ كَانَ بِكُمۡ رَحِیمࣰا\n",
    "translations": {
      "en": "YOUR SUSTAINER is He who causes ships to move onward for you through the sea, so that you might go about in quest of some of His bounty: verily, a dispenser of grace is He unto you.",
      "ms": "Tuhan kamulah yang menjalankan untuk kamu kapal-kapal di laut, supaya kamu dapat mencari rezeki dari limpah kurniaNya; sesungguhnya Ia adalah Maha Mengasihani kepada kamu.",
      "id": "Tuhan-mu adalah yang melayarkan kapal-kapal di lautan untukmu, agar kamu mencari sebahagian dari karunia-Nya. Sesungguhnya Dia adalah Maha Penyayang terhadapmu.",
      "ar": "رَّبُّكُمُ ٱلَّذِی یُزۡجِی لَكُمُ ٱلۡفُلۡكَ فِی ٱلۡبَحۡرِ لِتَبۡتَغُوا۟ مِن فَضۡلِهِۦۤۚ إِنَّهُۥ كَانَ بِكُمۡ رَحِیمࣰا\n"
    }
  },
  {
    "id": 2096,
    "surahId": 17,
    "ayahNumber": 67,
    "arabicText": "وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِی ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّاۤ إِیَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَـٰنُ كَفُورًا\n",
    "translations": {
      "en": "And whenever danger befalls you at sea, all those (powers] that you are wont to invoke forsake you, [and nothing remains for you] save Him: but as soon as He has brought you safe ashore, you turn aside [and forget Him]-for, indeed, bereft of all gratitude is man!",
      "ms": "Dan apabila kamu terkena bahaya di laut, (pada saat itu) hilang lenyaplah (dari ingatan kamu) makhluk-makhluk yang kamu seru selain dari Allah; maka apabila Allah selamatkan kamu ke darat, kamu berpaling tadah (tidak mengingatiNya); dan memanglah manusia itu sentiasa kufur (akan nikmat-nikmat Allah).",
      "id": "Dan apabila kamu ditimpa bahaya di lautan, niscaya hilanglah siapa yang kamu seru kecuali Dia, Maka tatkala Dia menyelamatkan kamu ke daratan, kamu berpaling. Dan manusia itu adalah selalu tidak berterima kasih.",
      "ar": "وَإِذَا مَسَّكُمُ ٱلضُّرُّ فِی ٱلۡبَحۡرِ ضَلَّ مَن تَدۡعُونَ إِلَّاۤ إِیَّاهُۖ فَلَمَّا نَجَّىٰكُمۡ إِلَى ٱلۡبَرِّ أَعۡرَضۡتُمۡۚ وَكَانَ ٱلۡإِنسَـٰنُ كَفُورًا\n"
    }
  },
  {
    "id": 2097,
    "surahId": 17,
    "ayahNumber": 68,
    "arabicText": "أَفَأَمِنتُمۡ أَن یَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ یُرۡسِلَ عَلَیۡكُمۡ حَاصِبࣰا ثُمَّ لَا تَجِدُوا۟ لَكُمۡ وَكِیلًا\n",
    "translations": {
      "en": "Can you, then, ever feel sure that He will not cause a tract of dry land to swallow you up, or let loose upon you a deadly storm-wind, whereupon you would find none to be your protector?",
      "ms": "Adakah kamu - (sesudah diselamatkan ke darat) - merasa aman (dan tidak memikirkan), bahawa Allah akan menggempakan sebahagian dari daratan itu menimbus kamu, atau dia akan menghantarkan kepada kamu angin ribut yang menghujani kamu dengan batu; kemudian kamu tidak beroleh sesiapapun yang menjadi pelindung kamu?",
      "id": "Maka apakah kamu merasa aman (dari hukuman Tuhan) yang menjungkir balikkan sebagian daratan bersama kamu atau Dia meniupkan (angin keras yang membawa) batu-batu kecil? dan kamu tidak akan mendapat seorang pelindungpun bagi kamu,",
      "ar": "أَفَأَمِنتُمۡ أَن یَخۡسِفَ بِكُمۡ جَانِبَ ٱلۡبَرِّ أَوۡ یُرۡسِلَ عَلَیۡكُمۡ حَاصِبࣰا ثُمَّ لَا تَجِدُوا۟ لَكُمۡ وَكِیلًا\n"
    }
  },
  {
    "id": 2098,
    "surahId": 17,
    "ayahNumber": 69,
    "arabicText": "أَمۡ أَمِنتُمۡ أَن یُعِیدَكُمۡ فِیهِ تَارَةً أُخۡرَىٰ فَیُرۡسِلَ عَلَیۡكُمۡ قَاصِفࣰا مِّنَ ٱلرِّیحِ فَیُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُوا۟ لَكُمۡ عَلَیۡنَا بِهِۦ تَبِیعࣰا\n",
    "translations": {
      "en": "Or can you, perchance, feel sure that He will not make you put back to sea once again, and then let loose upon you a raging tempest and cause you to drown in requital of your ingratitude - whereupon you would find none to uphold you against Us?",
      "ms": "Atau adakah kamu merasa aman (dan tidak memikirkan) bahawa Allah akan mengembalikan kamu sekali lagi ke laut, kemudian Ia menghantarkan kepada kamu angin ribut yang memecah belahkan segala yang dirempuhnya, lalu Ia mengaramkan kamu dengan sebab kekufuran kamu; kemudian kamu tidak beroleh sesiapapun yang boleh menuntut bela tentang itu terhadap Kami?",
      "id": "atau apakah kamu merasa aman dari dikembalikan-Nya kamu ke laut sekali lagi, lalu Dia meniupkan atas kamu angin taupan dan ditenggelamkan-Nya kamu disebabkan kekafiranmu. Dan kamu tidak akan mendapat seorang penolongpun dalam hal ini terhadap (siksaan) Kami.",
      "ar": "أَمۡ أَمِنتُمۡ أَن یُعِیدَكُمۡ فِیهِ تَارَةً أُخۡرَىٰ فَیُرۡسِلَ عَلَیۡكُمۡ قَاصِفࣰا مِّنَ ٱلرِّیحِ فَیُغۡرِقَكُم بِمَا كَفَرۡتُمۡ ثُمَّ لَا تَجِدُوا۟ لَكُمۡ عَلَیۡنَا بِهِۦ تَبِیعࣰا\n"
    }
  },
  {
    "id": 2099,
    "surahId": 17,
    "ayahNumber": 70,
    "arabicText": "۞ وَلَقَدۡ كَرَّمۡنَا بَنِیۤ ءَادَمَ وَحَمَلۡنَـٰهُمۡ فِی ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَـٰهُم مِّنَ ٱلطَّیِّبَـٰتِ وَفَضَّلۡنَـٰهُمۡ عَلَىٰ كَثِیرࣲ مِّمَّنۡ خَلَقۡنَا تَفۡضِیلࣰا\n",
    "translations": {
      "en": "NOW, INDEED, We have conferred dignity on the children of Adam, and borne them over land and sea, and provided for them sustenance out of the good things of life, and favoured them far above most of Our creation:",
      "ms": "Dan sesungguhnya Kami telah memuliakan anak-anak Adam; dan Kami telah beri mereka menggunakan berbagai-bagai kenderaan di darat dan di laut; dan Kami telah memberikan rezeki kepada mereka dari benda-benda yang baik-baik serta Kami telah lebihkan mereka dengan selebih-lebihnya atas banyak makhluk-makhluk yang telah Kami ciptakan.",
      "id": "Dan sesungguhnya telah Kami muliakan anak-anak Adam, Kami angkut mereka di daratan dan di lautan, Kami beri mereka rezeki dari yang baik-baik dan Kami lebihkan mereka dengan kelebihan yang sempurna atas kebanyakan makhluk yang telah Kami ciptakan.",
      "ar": "۞ وَلَقَدۡ كَرَّمۡنَا بَنِیۤ ءَادَمَ وَحَمَلۡنَـٰهُمۡ فِی ٱلۡبَرِّ وَٱلۡبَحۡرِ وَرَزَقۡنَـٰهُم مِّنَ ٱلطَّیِّبَـٰتِ وَفَضَّلۡنَـٰهُمۡ عَلَىٰ كَثِیرࣲ مِّمَّنۡ خَلَقۡنَا تَفۡضِیلࣰا\n"
    }
  },
  {
    "id": 2100,
    "surahId": 17,
    "ayahNumber": 71,
    "arabicText": "یَوۡمَ نَدۡعُوا۟ كُلَّ أُنَاسِۭ بِإِمَـٰمِهِمۡۖ فَمَنۡ أُوتِیَ كِتَـٰبَهُۥ بِیَمِینِهِۦ فَأُو۟لَـٰۤىِٕكَ یَقۡرَءُونَ كِتَـٰبَهُمۡ وَلَا یُظۡلَمُونَ فَتِیلࣰا\n",
    "translations": {
      "en": "[but] one Day We shall summon all human beings [and judge them] according to the conscious disposition which governed their deeds [in life]: whereupon they whose record shall be placed in their right hand -it is they who will read their record [with happiness]. Yet none shall be wronged by as much as a hair's breadth:",
      "ms": "(Ingatlah) hari Kami menyeru tiap-tiap kumpulan manusia dengan nama imamnya; kemudian sesiapa diberikan Kitabnya di tangan kanannya, maka mereka itu akan membacanya (dengan sukacita), dan mereka tidak dikurangkan (pahala amal-amalnya yang baik) sedikitpun.",
      "id": "(Ingatlah) suatu hari (yang di hari itu) Kami panggil tiap umat dengan pemimpinnya; dan barangsiapa yang diberikan kitab amalannya di tangan kanannya maka mereka ini akan membaca kitabnya itu, dan mereka tidak dianiaya sedikitpun.",
      "ar": "یَوۡمَ نَدۡعُوا۟ كُلَّ أُنَاسِۭ بِإِمَـٰمِهِمۡۖ فَمَنۡ أُوتِیَ كِتَـٰبَهُۥ بِیَمِینِهِۦ فَأُو۟لَـٰۤىِٕكَ یَقۡرَءُونَ كِتَـٰبَهُمۡ وَلَا یُظۡلَمُونَ فَتِیلࣰا\n"
    }
  },
  {
    "id": 2101,
    "surahId": 17,
    "ayahNumber": 72,
    "arabicText": "وَمَن كَانَ فِی هَـٰذِهِۦۤ أَعۡمَىٰ فَهُوَ فِی ٱلۡـَٔاخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِیلࣰا\n",
    "translations": {
      "en": "for whoever is blind [of heart] in this [world] will be blind in the life to come [as well], and still farther astray from the path [of truth].",
      "ms": "Dan (sebaliknya) sesiapa yang berada di dunia ini (dalam keadaan) buta (matahatinya), maka ia juga buta di akhirat dan lebih sesat lagi jalannya.",
      "id": "Dan barangsiapa yang buta (hatinya) di dunia ini, niscaya di akhirat (nanti) ia akan lebih buta (pula) dan lebih tersesat dari jalan (yang benar).",
      "ar": "وَمَن كَانَ فِی هَـٰذِهِۦۤ أَعۡمَىٰ فَهُوَ فِی ٱلۡـَٔاخِرَةِ أَعۡمَىٰ وَأَضَلُّ سَبِیلࣰا\n"
    }
  },
  {
    "id": 2102,
    "surahId": 17,
    "ayahNumber": 73,
    "arabicText": "وَإِن كَادُوا۟ لَیَفۡتِنُونَكَ عَنِ ٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ لِتَفۡتَرِیَ عَلَیۡنَا غَیۡرَهُۥۖ وَإِذࣰا لَّٱتَّخَذُوكَ خَلِیلࣰا\n",
    "translations": {
      "en": "AND,. behold, they [who have gone astray] endeavour to tempt thee away from all [the truth] with which We have inspired thee, [O Prophet,] with a view to making thee invent something else in Our name - in which case they would surely have made thee their friend!",
      "ms": "Dan sesungguhnya nyaris-nyaris mereka dapat memesongkanmu (wahai Muhammad) dari apa yang Kami telah wahyukan kepadamu, supaya engkau ada-adakan atas nama Kami perkara yang lainnya; dan (kalau engkau melakukan yang demikian) baharulah mereka menjadikan engkau sahabat karibnya.",
      "id": "Dan sesungguhnya mereka hampir memalingkan kamu dari apa yang telah Kami wahyukan kepadamu, agar kamu membuat yang lain secara bohong terhadap Kami; dan kalau sudah begitu tentulah mereka mengambil kamu jadi sahabat yang setia.",
      "ar": "وَإِن كَادُوا۟ لَیَفۡتِنُونَكَ عَنِ ٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ لِتَفۡتَرِیَ عَلَیۡنَا غَیۡرَهُۥۖ وَإِذࣰا لَّٱتَّخَذُوكَ خَلِیلࣰا\n"
    }
  },
  {
    "id": 2103,
    "surahId": 17,
    "ayahNumber": 74,
    "arabicText": "وَلَوۡلَاۤ أَن ثَبَّتۡنَـٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَیۡهِمۡ شَیۡـࣰٔا قَلِیلًا\n",
    "translations": {
      "en": "And 'had We not made thee firm [in faith], thou might have inclined to them a. little",
      "ms": "Dan kalaulah tidak Kami menetapkan engkau (berpegang teguh kepada kebenaran), tentulah engkau sudah mendekati dengan menyetujui sedikit kepada kehendak mereka.",
      "id": "Dan kalau Kami tidak memperkuat (hati)mu, niscaya kamu hampir-hampir condong sedikit kepada mereka,",
      "ar": "وَلَوۡلَاۤ أَن ثَبَّتۡنَـٰكَ لَقَدۡ كِدتَّ تَرۡكَنُ إِلَیۡهِمۡ شَیۡـࣰٔا قَلِیلًا\n"
    }
  },
  {
    "id": 2104,
    "surahId": 17,
    "ayahNumber": 75,
    "arabicText": "إِذࣰا لَّأَذَقۡنَـٰكَ ضِعۡفَ ٱلۡحَیَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَیۡنَا نَصِیرࣰا\n",
    "translations": {
      "en": "in which case We would indeed have made thee taste double [chastisement] in life and double [chastisement] after death, and thou wouldst have found none to succour thee against Us!",
      "ms": "Jika (engkau melakukan yang) demikian, tentulah Kami akan merasakanmu kesengsaraan yang berganda semasa hidup dan kesengsaraan yang berganda juga semasa mati; kemudian engkau tidak beroleh seseorang penolong pun terhadap hukuman Kami.",
      "id": "kalau terjadi demikian, benar-benarlah Kami akan rasakan kepadamu (siksaan) berlipat ganda di dunia ini dan begitu (pula siksaan) berlipat ganda sesudah mati, dan kamu tidak akan mendapat seorang penolongpun terhadap Kami.",
      "ar": "إِذࣰا لَّأَذَقۡنَـٰكَ ضِعۡفَ ٱلۡحَیَوٰةِ وَضِعۡفَ ٱلۡمَمَاتِ ثُمَّ لَا تَجِدُ لَكَ عَلَیۡنَا نَصِیرࣰا\n"
    }
  },
  {
    "id": 2105,
    "surahId": 17,
    "ayahNumber": 76,
    "arabicText": "وَإِن كَادُوا۟ لَیَسۡتَفِزُّونَكَ مِنَ ٱلۡأَرۡضِ لِیُخۡرِجُوكَ مِنۡهَاۖ وَإِذࣰا لَّا یَلۡبَثُونَ خِلَـٰفَكَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "And [since they see that they cannot persuade thee,] they endeavour to estrange thee from the land [of thy birth] with a view to driving thee away from, it-but, then, after thou wilt have left, they themselves will not remain [in it] for more than a little while:",
      "ms": "Dan sesungguhnya mereka hampir-hampir berjaya mengganggumu daripada tinggal aman di bumi (Makkah) dengan tujuan mereka dapat mengusirmu dari negeri itu; dan jika berlaku demikian, maka mereka tidak akan tinggal di situ sesudahmu melainkan sedikit masa sahaja.",
      "id": "Dan sesungguhnya benar-benar mereka hampir membuatmu gelisah di negeri (Mekah) untuk mengusirmu daripadanya dan kalau terjadi demikian, niscaya sepeninggalmu mereka tidak tinggal, melainkan sebentar saja.",
      "ar": "وَإِن كَادُوا۟ لَیَسۡتَفِزُّونَكَ مِنَ ٱلۡأَرۡضِ لِیُخۡرِجُوكَ مِنۡهَاۖ وَإِذࣰا لَّا یَلۡبَثُونَ خِلَـٰفَكَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 2106,
    "surahId": 17,
    "ayahNumber": 77,
    "arabicText": "سُنَّةَ مَن قَدۡ أَرۡسَلۡنَا قَبۡلَكَ مِن رُّسُلِنَاۖ وَلَا تَجِدُ لِسُنَّتِنَا تَحۡوِیلًا\n",
    "translations": {
      "en": "[such has been Our] way with all of Our apostles whom We sent before thy time; and no change wilt thou find in Our ways.",
      "ms": "(Demikianlah) peraturan (Kami yang tetap mengenai) orang-orang yang telah Kami utuskan sebelummu dari Rasul-rasul Kami; dan engkau tidak akan dapati sebarang perubahan bagi peraturan Kami yang tetap itu.",
      "id": "(Kami menetapkan yang demikian) sebagai suatu ketetapan terhadap rasul-rasul Kami yang Kami utus sebelum kamu dan tidak akan kamu dapati perubahan bagi ketetapan Kami itu.",
      "ar": "سُنَّةَ مَن قَدۡ أَرۡسَلۡنَا قَبۡلَكَ مِن رُّسُلِنَاۖ وَلَا تَجِدُ لِسُنَّتِنَا تَحۡوِیلًا\n"
    }
  },
  {
    "id": 2107,
    "surahId": 17,
    "ayahNumber": 78,
    "arabicText": "أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمۡسِ إِلَىٰ غَسَقِ ٱلَّیۡلِ وَقُرۡءَانَ ٱلۡفَجۡرِۖ إِنَّ قُرۡءَانَ ٱلۡفَجۡرِ كَانَ مَشۡهُودࣰا\n",
    "translations": {
      "en": "BE CONSTANT in [thy] prayer from the time when the sun has passed its zenith till the darkness of night, and [be ever mindful of its] recitation at dawn: for, behold, the recitation [of prayer] at dawn is indeed witnessed [by all that is holy].",
      "ms": "Dirikanlah olehmu sembahyang ketika gelincir matahari hingga waktu gelap malam, dan (dirikanlah) sembahyang subuh sesungguhnya sembahyang subuh itu adalah disaksikan (keistimewaannya).",
      "id": "Dirikanlah shalat dari sesudah matahari tergelincir sampai gelap malam dan (dirikanlah pula shalat) subuh. Sesungguhnya shalat subuh itu disaksikan (oleh malaikat).",
      "ar": "أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمۡسِ إِلَىٰ غَسَقِ ٱلَّیۡلِ وَقُرۡءَانَ ٱلۡفَجۡرِۖ إِنَّ قُرۡءَانَ ٱلۡفَجۡرِ كَانَ مَشۡهُودࣰا\n"
    }
  },
  {
    "id": 2108,
    "surahId": 17,
    "ayahNumber": 79,
    "arabicText": "وَمِنَ ٱلَّیۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةࣰ لَّكَ عَسَىٰۤ أَن یَبۡعَثَكَ رَبُّكَ مَقَامࣰا مَّحۡمُودࣰا\n",
    "translations": {
      "en": "And rise from thy sleep and pray during part of the night [as well], as a free offering from thee, and thy Sustainer may well raise thee to a glorious station [in the life to come].",
      "ms": "Dan bangunlah pada sebahagian dari waktu malam serta kerjakanlah \"sembahyang tahajjud\" padanya, sebagai sembahyang tambahan bagimu; semoga Tuhanmu membangkit dan menempatkanmu pada hari akhirat di tempat yang terpuji.",
      "id": "Dan pada sebahagian malam hari bersembahyang tahajudlah kamu sebagai suatu ibadah tambahan bagimu; mudah-mudahan Tuhan-mu mengangkat kamu ke tempat yang terpuji.",
      "ar": "وَمِنَ ٱلَّیۡلِ فَتَهَجَّدۡ بِهِۦ نَافِلَةࣰ لَّكَ عَسَىٰۤ أَن یَبۡعَثَكَ رَبُّكَ مَقَامࣰا مَّحۡمُودࣰا\n"
    }
  },
  {
    "id": 2109,
    "surahId": 17,
    "ayahNumber": 80,
    "arabicText": "وَقُل رَّبِّ أَدۡخِلۡنِی مُدۡخَلَ صِدۡقࣲ وَأَخۡرِجۡنِی مُخۡرَجَ صِدۡقࣲ وَٱجۡعَل لِّی مِن لَّدُنكَ سُلۡطَـٰنࣰا نَّصِیرࣰا\n",
    "translations": {
      "en": "And say [in thy prayer]: \"O my Sustainer! Cause me to enter [upon whatever I may do] in a manner. true and sincere, and cause me to leave [it] in a manner true and sincere, and grant me, out of Thy grace, sustaining strength!\"",
      "ms": "Dan pohonkanlah (wahai Muhammad, dengan berdoa): \"Wahai Tuhanku! Masukkanlah daku ke dalam urusan ugamaku dengan kemasukan yang benar lagi mulia, serta keluarkanlah daku daripadanya dengan cara keluar yang benar lagi mulia; dan berikanlah kepadaku dari sisiMu hujah keterangan serta kekuasaan yang menolongku\",",
      "id": "Dan katakanlah: \"Ya Tuhan-ku, masukkanlah aku secara masuk yang benar dan keluarkanlah (pula) aku secara keluar yang benar dan berikanlah kepadaku dari sisi Engkau kekuasaan yang menolong.",
      "ar": "وَقُل رَّبِّ أَدۡخِلۡنِی مُدۡخَلَ صِدۡقࣲ وَأَخۡرِجۡنِی مُخۡرَجَ صِدۡقࣲ وَٱجۡعَل لِّی مِن لَّدُنكَ سُلۡطَـٰنࣰا نَّصِیرࣰا\n"
    }
  },
  {
    "id": 2110,
    "surahId": 17,
    "ayahNumber": 81,
    "arabicText": "وَقُلۡ جَاۤءَ ٱلۡحَقُّ وَزَهَقَ ٱلۡبَـٰطِلُۚ إِنَّ ٱلۡبَـٰطِلَ كَانَ زَهُوقࣰا\n",
    "translations": {
      "en": "And say: \"The truth has now come [to light], and falsehood has withered away: for, behold, all falsehood is bound to wither away!\"",
      "ms": "Dan katakanlah:\" Telah datang kebenaran (Islam), dan hilang lenyaplah perkara yang salah (kufur dan syirik); sesungguhnya yang salah itu sememangnya satu perkara yang tetap lenyap\".",
      "id": "Dan katakanlah: \"Yang benar telah datang dan yang batil telah lenyap\". Sesungguhnya yang batil itu adalah sesuatu yang pasti lenyap.",
      "ar": "وَقُلۡ جَاۤءَ ٱلۡحَقُّ وَزَهَقَ ٱلۡبَـٰطِلُۚ إِنَّ ٱلۡبَـٰطِلَ كَانَ زَهُوقࣰا\n"
    }
  },
  {
    "id": 2111,
    "surahId": 17,
    "ayahNumber": 82,
    "arabicText": "وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَاۤءࣱ وَرَحۡمَةࣱ لِّلۡمُؤۡمِنِینَ وَلَا یَزِیدُ ٱلظَّـٰلِمِینَ إِلَّا خَسَارࣰا\n",
    "translations": {
      "en": "THUS, step by step, We bestow from on high through this Qur'an all that gives health [to the spirit] and is a grace unto those who believe [in Us], the while it only adds to the ruin of evildoers:",
      "ms": "Dan Kami turunkan dengan beransur-ansur dari Al-Quran Aya-ayat Suci yang menjadi ubat penawar dan rahmat bagi orang-orang yang beriman kepadanya; dan (sebaliknya) Al-Quran tidak menambahkan orang-orang yang zalim (disebabkan keingkaran mereka) melainkan kerugian jua.",
      "id": "Dan Kami turunkan dari Al Quran suatu yang menjadi penawar dan rahmat bagi orang-orang yang beriman dan Al Quran itu tidaklah menambah kepada orang-orang yang zalim selain kerugian.",
      "ar": "وَنُنَزِّلُ مِنَ ٱلۡقُرۡءَانِ مَا هُوَ شِفَاۤءࣱ وَرَحۡمَةࣱ لِّلۡمُؤۡمِنِینَ وَلَا یَزِیدُ ٱلظَّـٰلِمِینَ إِلَّا خَسَارࣰا\n"
    }
  },
  {
    "id": 2112,
    "surahId": 17,
    "ayahNumber": 83,
    "arabicText": "وَإِذَاۤ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَـٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ كَانَ یَـُٔوسࣰا\n",
    "translations": {
      "en": "for [it often happens that] when We bestow Our blessings upon man, he turns away and arrogantly keeps aloof [from any thought of Us]; and when evil fortune touches him, he abandons all hope.",
      "ms": "Dan apabila Kami kurniakan nikmat kepada manusia, berpalinglah ia serta menjauhkan diri (dari bersyukur); dan apabila ia merasai kesusahan, jadilah ia berputus asa.",
      "id": "Dan apabila Kami berikan kesenangan kepada manusia niscaya berpalinglah dia; dan membelakang dengan sikap yang sombong; dan apabila dia ditimpa kesusahan niscaya dia berputus asa.",
      "ar": "وَإِذَاۤ أَنۡعَمۡنَا عَلَى ٱلۡإِنسَـٰنِ أَعۡرَضَ وَنَـَٔا بِجَانِبِهِۦ وَإِذَا مَسَّهُ ٱلشَّرُّ كَانَ یَـُٔوسࣰا\n"
    }
  },
  {
    "id": 2113,
    "surahId": 17,
    "ayahNumber": 84,
    "arabicText": "قُلۡ كُلࣱّ یَعۡمَلُ عَلَىٰ شَاكِلَتِهِۦ فَرَبُّكُمۡ أَعۡلَمُ بِمَنۡ هُوَ أَهۡدَىٰ سَبِیلࣰا\n",
    "translations": {
      "en": "Say: \"Everyone acts in a manner peculiar to himself -and your Sustainer is fully aware as to who has chosen the best path.\"",
      "ms": "Katakanlah (wahai Muhammad): \"Tiap-tiap seorang beramal menurut pembawaan jiwanya sendiri; maka Tuhan kamu lebih mengetahui siapakah (di antara kamu) yang lebih betul jalannya\".",
      "id": "Katakanlah: \"Tiap-tiap orang berbuat menurut keadaannya masing-masing\". Maka Tuhanmu lebih mengetahui siapa yang lebih benar jalannya.",
      "ar": "قُلۡ كُلࣱّ یَعۡمَلُ عَلَىٰ شَاكِلَتِهِۦ فَرَبُّكُمۡ أَعۡلَمُ بِمَنۡ هُوَ أَهۡدَىٰ سَبِیلࣰا\n"
    }
  },
  {
    "id": 2114,
    "surahId": 17,
    "ayahNumber": 85,
    "arabicText": "وَیَسۡـَٔلُونَكَ عَنِ ٱلرُّوحِۖ قُلِ ٱلرُّوحُ مِنۡ أَمۡرِ رَبِّی وَمَاۤ أُوتِیتُم مِّنَ ٱلۡعِلۡمِ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "AND THEY will ask thee about [the nature of] divine inspiration. Say: \"This inspiration [comes] at my Sustainer's behest; and [you cannot understand its nature, O men, since] you have been granted very little of [real] knowledge.\"",
      "ms": "Dan mereka bertanya kepadamu tentang roh. Katakan: \"Roh itu dari perkara urusan Tuhanku; dan kamu tidak diberikan ilmu pengetahuan melainkan sedikit sahaja\".",
      "id": "Dan mereka bertanya kepadamu tentang roh. Katakanlah: \"Roh itu termasuk urusan Tuhan-ku, dan tidaklah kamu diberi pengetahuan melainkan sedikit\".",
      "ar": "وَیَسۡـَٔلُونَكَ عَنِ ٱلرُّوحِۖ قُلِ ٱلرُّوحُ مِنۡ أَمۡرِ رَبِّی وَمَاۤ أُوتِیتُم مِّنَ ٱلۡعِلۡمِ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 2115,
    "surahId": 17,
    "ayahNumber": 86,
    "arabicText": "وَلَىِٕن شِئۡنَا لَنَذۡهَبَنَّ بِٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ ثُمَّ لَا تَجِدُ لَكَ بِهِۦ عَلَیۡنَا وَكِیلًا\n",
    "translations": {
      "en": "And if We so willed, We could indeed take away whatever We have revealed unto thee, and in that [state of need] thou wouldst find none to plead in thy behalf before Us.",
      "ms": "Dan sesungguhnya jika Kami kehendaki, tentulah Kami akan hapuskan apa yang Kami telah wahyukan kepadamu, kemudian engkau tidak akan beroleh sebarang pembela terhadap Kami untuk mengembalikannya.",
      "id": "Dan sesungguhnya jika Kami menghendaki, niscaya Kami lenyapkan apa yang telah Kami wahyukan kepadamu, dan dengan pelenyapan itu, kamu tidak akan mendapatkan seorang pembelapun terhadap Kami,",
      "ar": "وَلَىِٕن شِئۡنَا لَنَذۡهَبَنَّ بِٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ ثُمَّ لَا تَجِدُ لَكَ بِهِۦ عَلَیۡنَا وَكِیلًا\n"
    }
  },
  {
    "id": 2116,
    "surahId": 17,
    "ayahNumber": 87,
    "arabicText": "إِلَّا رَحۡمَةࣰ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَیۡكَ كَبِیرࣰا\n",
    "translations": {
      "en": "[Thou art spared] only by thy Sustainer's grace: behold, His favour towards thee is great indeed!",
      "ms": "(Tetapi kekalnya Al-Quran itu) hanyalah sebagai rahmat dari tuhanmu; sesungguhnya limpah kurnianya kepadamu (wahai Muhammad) amatlah besar.",
      "id": "kecuali karena rahmat dari Tuhanmu. Sesungguhnya karunia-Nya atasmu adalah besar.",
      "ar": "إِلَّا رَحۡمَةࣰ مِّن رَّبِّكَۚ إِنَّ فَضۡلَهُۥ كَانَ عَلَیۡكَ كَبِیرࣰا\n"
    }
  },
  {
    "id": 2117,
    "surahId": 17,
    "ayahNumber": 88,
    "arabicText": "قُل لَّىِٕنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰۤ أَن یَأۡتُوا۟ بِمِثۡلِ هَـٰذَا ٱلۡقُرۡءَانِ لَا یَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضࣲ ظَهِیرࣰا\n",
    "translations": {
      "en": "Say: \"If all mankind and all invisible beings would come together with a view to producing the like of this Qur'an, they could not produce its like even though they were to exert all their strength in aiding one another!\"",
      "ms": "Katakanlah (wahai Muhammad): \"Sesungguhnya jika sekalian manusia dan jin berhimpun dengan tujuan hendak membuat dan mendatangkan sebanding dengan Al-Quran ini, mereka tidak akan dapat membuat dan mendatangkan yang sebanding dengannya, walaupun mereka bantu-membantu sesama sendiri\".",
      "id": "Katakanlah: \"Sesungguhnya jika manusia dan jin berkumpul untuk membuat yang serupa Al Quran ini, niscaya mereka tidak akan dapat membuat yang serupa dengan dia, sekalipun sebagian mereka menjadi pembantu bagi sebagian yang lain\".",
      "ar": "قُل لَّىِٕنِ ٱجۡتَمَعَتِ ٱلۡإِنسُ وَٱلۡجِنُّ عَلَىٰۤ أَن یَأۡتُوا۟ بِمِثۡلِ هَـٰذَا ٱلۡقُرۡءَانِ لَا یَأۡتُونَ بِمِثۡلِهِۦ وَلَوۡ كَانَ بَعۡضُهُمۡ لِبَعۡضࣲ ظَهِیرࣰا\n"
    }
  },
  {
    "id": 2118,
    "surahId": 17,
    "ayahNumber": 89,
    "arabicText": "وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِی هَـٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلࣲ فَأَبَىٰۤ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورࣰا\n",
    "translations": {
      "en": "For, indeed, many facets have We given in this Qur'an to every kind of lesson [designed] for [the benefit of] mankind! However, most men are unwilling to accept anything but blasphemy",
      "ms": "Dan sesungguhnya Kami telah menerangkan berulang-ulang kepada manusia, di dalam Al-Quran ini, dengan berbagai-bagai contoh perbandingan (yang mendatangkan iktibar); dalam pada itu, kebanyakan manusia tidak mahu menerima selain dari kekufuran.",
      "id": "Dan sesungguhnya Kami telah mengulang-ulang kepada manusia dalam Al Quran ini tiap-tiap macam perumpamaan, tapi kebanyakan manusia tidak menyukai kecuali mengingkari(nya).",
      "ar": "وَلَقَدۡ صَرَّفۡنَا لِلنَّاسِ فِی هَـٰذَا ٱلۡقُرۡءَانِ مِن كُلِّ مَثَلࣲ فَأَبَىٰۤ أَكۡثَرُ ٱلنَّاسِ إِلَّا كُفُورࣰا\n"
    }
  },
  {
    "id": 2119,
    "surahId": 17,
    "ayahNumber": 90,
    "arabicText": "وَقَالُوا۟ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ یَنۢبُوعًا\n",
    "translations": {
      "en": "and so they say: \"[O Muhammad,] we shall not believe thee till thou cause a spring to gush forth for us from the earth,",
      "ms": "Dan mereka berkata: \"Kami tidak sekali-kali akan beriman kepadamu (wahai Muhammad), sehingga engkau memancarkan matair dari bumi, bagi Kami.",
      "id": "Dan mereka berkata: \"Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dan bumi untuk kami,",
      "ar": "وَقَالُوا۟ لَن نُّؤۡمِنَ لَكَ حَتَّىٰ تَفۡجُرَ لَنَا مِنَ ٱلۡأَرۡضِ یَنۢبُوعًا\n"
    }
  },
  {
    "id": 2120,
    "surahId": 17,
    "ayahNumber": 91,
    "arabicText": "أَوۡ تَكُونَ لَكَ جَنَّةࣱ مِّن نَّخِیلࣲ وَعِنَبࣲ فَتُفَجِّرَ ٱلۡأَنۡهَـٰرَ خِلَـٰلَهَا تَفۡجِیرًا\n",
    "translations": {
      "en": "or thou have a garden of date-palms and vines and cause rivers to gush forth in their midst in a sudden rush,",
      "ms": "Atau (sehingga) engkau mempunyai kebun dari pohon-pohon tamar dan anggur, kemudian engkau mengalirkan sungai-sungai dari celah-celahnya dengan aliran yang terpancar terus-menerus.",
      "id": "atau kamu mempunyai sebuah kebun korma dan anggur, lalu kamu alirkan sungai-sungai di celah kebun yang deras alirannya,",
      "ar": "أَوۡ تَكُونَ لَكَ جَنَّةࣱ مِّن نَّخِیلࣲ وَعِنَبࣲ فَتُفَجِّرَ ٱلۡأَنۡهَـٰرَ خِلَـٰلَهَا تَفۡجِیرًا\n"
    }
  },
  {
    "id": 2121,
    "surahId": 17,
    "ayahNumber": 92,
    "arabicText": "أَوۡ تُسۡقِطَ ٱلسَّمَاۤءَ كَمَا زَعَمۡتَ عَلَیۡنَا كِسَفًا أَوۡ تَأۡتِیَ بِٱللَّهِ وَٱلۡمَلَـٰۤىِٕكَةِ قَبِیلًا\n",
    "translations": {
      "en": "or thou cause the skies to fall down upon us in smithereens, as thou hast threatened, or [till] thou bring God and the angels face to face before us,",
      "ms": "Atau (sehingga) engkau gugurkan langit berkeping-keping atas kami, sebagaimana yang engkau katakan (akan berlaku); atau (sehingga) engkau bawakan Allah dan malaikat untuk kami menyaksikannya.",
      "id": "atau kamu jatuhkan langit berkeping-keping atas kami, sebagaimana kamu katakan atau kamu datangkan Allah dan malaikat-malaikat berhadapan muka dengan kami.",
      "ar": "أَوۡ تُسۡقِطَ ٱلسَّمَاۤءَ كَمَا زَعَمۡتَ عَلَیۡنَا كِسَفًا أَوۡ تَأۡتِیَ بِٱللَّهِ وَٱلۡمَلَـٰۤىِٕكَةِ قَبِیلًا\n"
    }
  },
  {
    "id": 2122,
    "surahId": 17,
    "ayahNumber": 93,
    "arabicText": "أَوۡ یَكُونَ لَكَ بَیۡتࣱ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِی ٱلسَّمَاۤءِ وَلَن نُّؤۡمِنَ لِرُقِیِّكَ حَتَّىٰ تُنَزِّلَ عَلَیۡنَا كِتَـٰبࣰا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّی هَلۡ كُنتُ إِلَّا بَشَرࣰا رَّسُولࣰا\n",
    "translations": {
      "en": "or thou have a house [made] of gold, or thou ascend to heaven - but nay, we would not [even] believe in thy ascension unless thou bring down to us [from heaven] a writing which we [ourselves] could read! Say thou, [O Prophet:] \"Limitless in His glory is my Sustainer! Am I, then, aught but a mortal man, an apostle?\"",
      "ms": "Atau (sehingga) engkau mempunyai sebuah rumah terhias dari emas; atau (sehingga) engkau naik ke langit; dan kami tidak sekali-kali akan percaya tentang kenaikanmu ke langit sebelum engkau turunkan kepada kami sebuah kitab yang dapat kami membacanya\". Katakanlah (wahai Muhammad):\" Maha Suci Tuhanku! Bukankah aku ini hanya seorang manusia yang menjadi Rasul?",
      "id": "Atau kamu mempunyai sebuah rumah dari emas, atau kamu naik ke langit. Dan kami sekali-kali tidak akan mempercayai kenaikanmu itu hingga kamu turunkan atas kami sebuah kitab yang kami baca\". Katakanlah: \"Maha Suci Tuhanku, bukankah aku ini hanya seorang manusia yang menjadi rasul?\"",
      "ar": "أَوۡ یَكُونَ لَكَ بَیۡتࣱ مِّن زُخۡرُفٍ أَوۡ تَرۡقَىٰ فِی ٱلسَّمَاۤءِ وَلَن نُّؤۡمِنَ لِرُقِیِّكَ حَتَّىٰ تُنَزِّلَ عَلَیۡنَا كِتَـٰبࣰا نَّقۡرَؤُهُۥۗ قُلۡ سُبۡحَانَ رَبِّی هَلۡ كُنتُ إِلَّا بَشَرࣰا رَّسُولࣰا\n"
    }
  },
  {
    "id": 2123,
    "surahId": 17,
    "ayahNumber": 94,
    "arabicText": "وَمَا مَنَعَ ٱلنَّاسَ أَن یُؤۡمِنُوۤا۟ إِذۡ جَاۤءَهُمُ ٱلۡهُدَىٰۤ إِلَّاۤ أَن قَالُوۤا۟ أَبَعَثَ ٱللَّهُ بَشَرࣰا رَّسُولࣰا\n",
    "translations": {
      "en": "Yet whenever [God's] guidance came to them [through a prophet,] nothing has ever kept people from believing [in him] save this their objection: \"Would God have sent a [mere] mortal man as His apostle?\"",
      "ms": "Dan tiadalah yang menghalang orang-orang musyrik itu dari beriman ketika datang kepada mereka hidayah petunjuk, melainkan (keingkaran mereka tentang manusia menjadi Rasul, sehingga) mereka berkata dengan hairan: \"Patutkah Allah mengutus seorang manusia menjadi Rasul?\"",
      "id": "Dan tidak ada sesuatu yang menghalangi manusia untuk beriman tatkala datang petunjuk kepadanya, kecuali perkataan mereka: \"Adakah Allah mengutus seorang manusia menjadi rasuI?\"",
      "ar": "وَمَا مَنَعَ ٱلنَّاسَ أَن یُؤۡمِنُوۤا۟ إِذۡ جَاۤءَهُمُ ٱلۡهُدَىٰۤ إِلَّاۤ أَن قَالُوۤا۟ أَبَعَثَ ٱللَّهُ بَشَرࣰا رَّسُولࣰا\n"
    }
  },
  {
    "id": 2124,
    "surahId": 17,
    "ayahNumber": 95,
    "arabicText": "قُل لَّوۡ كَانَ فِی ٱلۡأَرۡضِ مَلَـٰۤىِٕكَةࣱ یَمۡشُونَ مُطۡمَىِٕنِّینَ لَنَزَّلۡنَا عَلَیۡهِم مِّنَ ٱلسَّمَاۤءِ مَلَكࣰا رَّسُولࣰا\n",
    "translations": {
      "en": "Say: \"If angels were walking about on earth as their natural abode, We would indeed have sent down unto them an angel out of heaven as Our apostle.\"",
      "ms": "Katakanlah (wahai Muhammad): \"Kalau ada di bumi, malaikat yang berjalan serta tinggal mendiaminya, tentulah kami akan turunkan kepada mereka dari langit, malaikat yang menjadi rasul\".",
      "id": "Katakanlah: \"Kalau seandainya ada malaikat-malaikat yang berjalan-jalan sebagai penghuni di bumi, niscaya Kami turunkan dari langit kepada mereka seorang malaikat menjadi rasul\".",
      "ar": "قُل لَّوۡ كَانَ فِی ٱلۡأَرۡضِ مَلَـٰۤىِٕكَةࣱ یَمۡشُونَ مُطۡمَىِٕنِّینَ لَنَزَّلۡنَا عَلَیۡهِم مِّنَ ٱلسَّمَاۤءِ مَلَكࣰا رَّسُولࣰا\n"
    }
  },
  {
    "id": 2125,
    "surahId": 17,
    "ayahNumber": 96,
    "arabicText": "قُلۡ كَفَىٰ بِٱللَّهِ شَهِیدَۢا بَیۡنِی وَبَیۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِیرَۢا بَصِیرࣰا\n",
    "translations": {
      "en": "Say: \"None can bear witness between me and you as God does: verily, fully aware is He of His creatures, and He sees all [that is in their hearts].\"",
      "ms": "Katakanlah lagi: \"Cukuplah Allah menjadi saksi antaraku dengan kamu; sesungguhnya adalah Ia Amat Mendalam pengetahuanNya, lagi Amat Melihat akan keadaan hamba-hambaNya\".",
      "id": "Katakanlah: \"Cukuplah Allah menjadi saksi antara aku dan kamu sekalian. Sesungguhnya Dia adalah Maha Mengetahui lagi Maha Melihat akan hamba-hamba-Nya\".",
      "ar": "قُلۡ كَفَىٰ بِٱللَّهِ شَهِیدَۢا بَیۡنِی وَبَیۡنَكُمۡۚ إِنَّهُۥ كَانَ بِعِبَادِهِۦ خَبِیرَۢا بَصِیرࣰا\n"
    }
  },
  {
    "id": 2126,
    "surahId": 17,
    "ayahNumber": 97,
    "arabicText": "وَمَن یَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن یُضۡلِلۡ فَلَن تَجِدَ لَهُمۡ أَوۡلِیَاۤءَ مِن دُونِهِۦۖ وَنَحۡشُرُهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ عَلَىٰ وُجُوهِهِمۡ عُمۡیࣰا وَبُكۡمࣰا وَصُمࣰّاۖ مَّأۡوَىٰهُمۡ جَهَنَّمُۖ كُلَّمَا خَبَتۡ زِدۡنَـٰهُمۡ سَعِیرࣰا\n",
    "translations": {
      "en": "And he whom God guides, he alone has found the right way; whereas for those whom He lets go astray thou canst never find anyone to protect them from Him: and [so, when] We shall gather them together on the Day of Resurrection, [they will lie] prone upon their faces, blind and dumb and deaf, with hell as their goal; [and] every time [the fire] abates, We shall increase for them [its] blazing flame.",
      "ms": "Dan sesiapa yang diberi hidayah petunjuk oleh Allah maka dia lah yang sebenar-benarnya berjaya mencapai kebahagiaan; dan sesiapa yang disesatkanNya maka engkau tidak sekali-kali akan mendapati bagi mereka, penolong-penolong yang lain daripadaNya. Dan Kami akan himpunkan mereka pada hari kiamat (dengan menyeret mereka masing-masing) atas mukanya, dalam keadaan buta, bisu dan pekak; tempat kediaman mereka: neraka Jahannam; tiap-tiap kali malap julangan apinya, Kami tambahi mereka dengan api yang menjulang-julang.",
      "id": "Dan barangsiapa yang ditunjuki Allah, dialah yang mendapat petunjuk dan barangsiapa yang Dia sesatkan maka sekali-kali kamu tidak akan mendapat penolong-penolong bagi mereka selain dari Dia. Dan Kami akan mengumpulkan mereka pada hari kiamat (diseret) atas muka mereka dalam keadaan buta, bisu dan pekak. Tempat kediaman mereka adalah neraka jahannam. Tiap-tiap kali nyala api Jahannam itu akan padam, Kami tambah lagi bagi mereka nyalanya.",
      "ar": "وَمَن یَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن یُضۡلِلۡ فَلَن تَجِدَ لَهُمۡ أَوۡلِیَاۤءَ مِن دُونِهِۦۖ وَنَحۡشُرُهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ عَلَىٰ وُجُوهِهِمۡ عُمۡیࣰا وَبُكۡمࣰا وَصُمࣰّاۖ مَّأۡوَىٰهُمۡ جَهَنَّمُۖ كُلَّمَا خَبَتۡ زِدۡنَـٰهُمۡ سَعِیرࣰا\n"
    }
  },
  {
    "id": 2127,
    "surahId": 17,
    "ayahNumber": 98,
    "arabicText": "ذَ ٰ⁠لِكَ جَزَاۤؤُهُم بِأَنَّهُمۡ كَفَرُوا۟ بِـَٔایَـٰتِنَا وَقَالُوۤا۟ أَءِذَا كُنَّا عِظَـٰمࣰا وَرُفَـٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقࣰا جَدِیدًا\n",
    "translations": {
      "en": "Such will be their requital for having rejected Our messages and having said, \"After we will have become bones and dust, shall we, forsooth, be raised from the dead in a new act of creation?\"",
      "ms": "Balasan mereka yang sedemikian, ialah kerana mereka kufur ingkarkan ayat-ayat Kami, dan mereka berkata: \"Adakah sesudah Kami menjadi tulang dan benda yang reput, adakah Kami akan dibangkitkan semula dalam kejadian yang baharu?\"",
      "id": "Itulah balasan bagi mereka, karena sesungguhnya mereka kafir kepada ayat-ayat Kami dan (karena mereka) berkata: \"Apakah bila kami telah menjadi tulang belulang dan benda-benda yang hancur, apakah kami benar-benar akan dibangkitkan kembali sebagai makhluk baru?\"",
      "ar": "ذَ ٰ⁠لِكَ جَزَاۤؤُهُم بِأَنَّهُمۡ كَفَرُوا۟ بِـَٔایَـٰتِنَا وَقَالُوۤا۟ أَءِذَا كُنَّا عِظَـٰمࣰا وَرُفَـٰتًا أَءِنَّا لَمَبۡعُوثُونَ خَلۡقࣰا جَدِیدًا\n"
    }
  },
  {
    "id": 2128,
    "surahId": 17,
    "ayahNumber": 99,
    "arabicText": "۞ أَوَلَمۡ یَرَوۡا۟ أَنَّ ٱللَّهَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ قَادِرٌ عَلَىٰۤ أَن یَخۡلُقَ مِثۡلَهُمۡ وَجَعَلَ لَهُمۡ أَجَلࣰا لَّا رَیۡبَ فِیهِ فَأَبَى ٱلظَّـٰلِمُونَ إِلَّا كُفُورࣰا\n",
    "translations": {
      "en": "Are they, then, not aware that God, who has created the heavens and the earth, has the power to create them anew in their own likeness, having, beyond any doubt, set a term for their resurrection? However, all [such] evildoers are unwilling to accept anything but blasphemy!",
      "ms": "Tidakkah mereka mahu memikirkan dan meyakini bahawa Allah yang menciptakan langit dan bumi, berkuasa menciptakan orang orang yang seperti mereka (dalam bentuk yang baharu), padahal Ia telahpun menentukan bagi mereka tempoh yang tidak ada syak padanya.? Dalam pada itu, orang orang yang zalim enggan menerima melainkan kekufuran.",
      "id": "Dan apakah mereka tidak memperhatikan bahwasanya Allah yang menciptakan langit dan bumi adalah kuasa (pula) menciptakan yang serupa dengan mereka, dan telah menetapkan waktu yang tertentu bagi mereka yang tidak ada keraguan padanya? Maka orang-orang zalim itu tidak menghendaki kecuali kekafiran.",
      "ar": "۞ أَوَلَمۡ یَرَوۡا۟ أَنَّ ٱللَّهَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ قَادِرٌ عَلَىٰۤ أَن یَخۡلُقَ مِثۡلَهُمۡ وَجَعَلَ لَهُمۡ أَجَلࣰا لَّا رَیۡبَ فِیهِ فَأَبَى ٱلظَّـٰلِمُونَ إِلَّا كُفُورࣰا\n"
    }
  },
  {
    "id": 2129,
    "surahId": 17,
    "ayahNumber": 100,
    "arabicText": "قُل لَّوۡ أَنتُمۡ تَمۡلِكُونَ خَزَاۤىِٕنَ رَحۡمَةِ رَبِّیۤ إِذࣰا لَّأَمۡسَكۡتُمۡ خَشۡیَةَ ٱلۡإِنفَاقِۚ وَكَانَ ٱلۡإِنسَـٰنُ قَتُورࣰا\n",
    "translations": {
      "en": "Say: \"If you were to own' all the treasure-houses of my Sustainer's bounty, lo! you would still try to hold on [to them] tightly for fear of spending [too much]: for man has always been avaricious [whereas God is limitless in His bounty].",
      "ms": "Katakanlah (wahai muhammad): \"jika kamu memiliki perbendaharaan rahmat Tuhanku pada ketika itu tentulah kamu akan berlaku bakhil kedekut kerana takut kehabisan; dan sememangnya manusia itu bertabiat bakhil kedekut\".",
      "id": "Katakanlah: \"Kalau seandainya kamu menguasai perbendaharaan-perbendaharaan rahmat Tuhanku, niscaya perbendaharaan itu kamu tahan, karena takut membelanjakannya\". Dan adalah manusia itu sangat kikir.",
      "ar": "قُل لَّوۡ أَنتُمۡ تَمۡلِكُونَ خَزَاۤىِٕنَ رَحۡمَةِ رَبِّیۤ إِذࣰا لَّأَمۡسَكۡتُمۡ خَشۡیَةَ ٱلۡإِنفَاقِۚ وَكَانَ ٱلۡإِنسَـٰنُ قَتُورࣰا\n"
    }
  },
  {
    "id": 2130,
    "surahId": 17,
    "ayahNumber": 101,
    "arabicText": "وَلَقَدۡ ءَاتَیۡنَا مُوسَىٰ تِسۡعَ ءَایَـٰتِۭ بَیِّنَـٰتࣲۖ فَسۡـَٔلۡ بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ إِذۡ جَاۤءَهُمۡ فَقَالَ لَهُۥ فِرۡعَوۡنُ إِنِّی لَأَظُنُّكَ یَـٰمُوسَىٰ مَسۡحُورࣰا\n",
    "translations": {
      "en": "AND, INDEED, We gave unto Moses nine clear messages. Ask, then, the children of Israel [to tell thee what happened] when he came unto them, [and appealed to Pharaoh,] and Pharaoh said unto him, \"Verily, O Moses, I think that thou art full of sorcery!\"",
      "ms": "Dan sesungguhnya Kami telah memberi kepada Nabi Musa sembilan mukjizat yang jelas nyata (membuktikan kebenarannya); maka bertanyalah (wahai Muhammad) kepada Bani Israil (tentang itu): Ketika Nabi Musa datang kepada Firaun dan kaumnya (serta menunjukkan mukjizatnya), lalu berkatalah Firaun kepadanya: \"Sesungguhnya aku fikir, engkau ini wahai Musa, seorang yang terkena sihir\"",
      "id": "Dan sesungguhnya Kami telah memberikan kepada Musa sembilan buah mukjizat yang nyata, maka tanyakanlah kepada Bani Israil, tatkala Musa datang kepada mereka lalu Fir'aun berkata kepadanya: \"Sesungguhnya aku sangka kamu, hai Musa, seorang yang kena sihir\".",
      "ar": "وَلَقَدۡ ءَاتَیۡنَا مُوسَىٰ تِسۡعَ ءَایَـٰتِۭ بَیِّنَـٰتࣲۖ فَسۡـَٔلۡ بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ إِذۡ جَاۤءَهُمۡ فَقَالَ لَهُۥ فِرۡعَوۡنُ إِنِّی لَأَظُنُّكَ یَـٰمُوسَىٰ مَسۡحُورࣰا\n"
    }
  },
  {
    "id": 2131,
    "surahId": 17,
    "ayahNumber": 102,
    "arabicText": "قَالَ لَقَدۡ عَلِمۡتَ مَاۤ أَنزَلَ هَـٰۤؤُلَاۤءِ إِلَّا رَبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ بَصَاۤىِٕرَ وَإِنِّی لَأَظُنُّكَ یَـٰفِرۡعَوۡنُ مَثۡبُورࣰا\n",
    "translations": {
      "en": "Answered [Moses]: \"Thou knowest well that none but the Sustainer of the heavens and the earth has bestowed these [miraculous signs] from on high, as a means of insight [for thee]; and, verily, O Pharaoh, [since thou hast chosen to reject them;] I think that thou art utterly lost!\"",
      "ms": "Nabi Musa menjawab: \"Sebenarnya engkau (hai Firaun) telah pun mengetahui: tiadalah yang menurunkan mukjizat-mukjizat ini melainkan Tuhan yang mencipta dan mentadbirkan langit dan bumi, sebagai bukti-bukti yang menerangkan kebenaran; dan sebenarnya aku fikir, engkau hai Firaun, akan binasa\".",
      "id": "Musa menjawab: \"Sesungguhnya kamu telah mengetahui, bahwa tiada yang menurunkan mukjizat-mukjizat itu kecuali Tuhan Yang memelihara langit dan bumi sebagai bukti-bukti yang nyata; dan sesungguhnya aku mengira kamu, hai Fir'aun, seorang yang akan binasa\".",
      "ar": "قَالَ لَقَدۡ عَلِمۡتَ مَاۤ أَنزَلَ هَـٰۤؤُلَاۤءِ إِلَّا رَبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ بَصَاۤىِٕرَ وَإِنِّی لَأَظُنُّكَ یَـٰفِرۡعَوۡنُ مَثۡبُورࣰا\n"
    }
  },
  {
    "id": 2132,
    "surahId": 17,
    "ayahNumber": 103,
    "arabicText": "فَأَرَادَ أَن یَسۡتَفِزَّهُم مِّنَ ٱلۡأَرۡضِ فَأَغۡرَقۡنَـٰهُ وَمَن مَّعَهُۥ جَمِیعࣰا\n",
    "translations": {
      "en": "And then Pharaoh resolved to wipe them off [the face of] the earth - whereupon We caused him and all who were with him to drown [in the sea].",
      "ms": "Maka Firaun pun berkira hendak mengusir mereka dari bumi (Mesir) lalu Kami tenggelamkan dia bersama-sama pengikut-pengikutnya seluruhnya.",
      "id": "Kemudian (Fir'aun) hendak mengusir mereka (Musa dan pengikut-pengikutnya) dari bumi (Mesir) itu, maka Kami tenggelamkan dia (Fir'aun) serta orang-orang yang bersama-sama dia seluruhnya,",
      "ar": "فَأَرَادَ أَن یَسۡتَفِزَّهُم مِّنَ ٱلۡأَرۡضِ فَأَغۡرَقۡنَـٰهُ وَمَن مَّعَهُۥ جَمِیعࣰا\n"
    }
  },
  {
    "id": 2133,
    "surahId": 17,
    "ayahNumber": 104,
    "arabicText": "وَقُلۡنَا مِنۢ بَعۡدِهِۦ لِبَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ ٱسۡكُنُوا۟ ٱلۡأَرۡضَ فَإِذَا جَاۤءَ وَعۡدُ ٱلۡـَٔاخِرَةِ جِئۡنَا بِكُمۡ لَفِیفࣰا\n",
    "translations": {
      "en": "And after that We said unto the children of Israel: \"Dwell now securely on earth - but [remember that] when the promise of the Last Day shall come to pass, We will bring you forth as [parts of] a motley crowd!",
      "ms": "Dan Kami katakan kepada Bani Israil, sesudah Firaun (dibinasakan): \"Tinggalah kamu di negeri itu kemudian apabila datang tempoh hari akhirat, Kami datangkan kamu (ke Padang Mahsyar) dengan bercampur-aduk.",
      "id": "dan Kami berfirman sesudah itu kepada Bani Israil: \"Diamlah di negeri ini, maka apabila datang masa berbangkit, niscaya Kami datangkan kamu dalam keadaan bercampur baur (dengan musuhmu)\".",
      "ar": "وَقُلۡنَا مِنۢ بَعۡدِهِۦ لِبَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ ٱسۡكُنُوا۟ ٱلۡأَرۡضَ فَإِذَا جَاۤءَ وَعۡدُ ٱلۡـَٔاخِرَةِ جِئۡنَا بِكُمۡ لَفِیفࣰا\n"
    }
  },
  {
    "id": 2134,
    "surahId": 17,
    "ayahNumber": 105,
    "arabicText": "وَبِٱلۡحَقِّ أَنزَلۡنَـٰهُ وَبِٱلۡحَقِّ نَزَلَۗ وَمَاۤ أَرۡسَلۡنَـٰكَ إِلَّا مُبَشِّرࣰا وَنَذِیرࣰا\n",
    "translations": {
      "en": "AND AS a guide towards the truth have We bestowed this [revelation] from on high; with this [very] truth has it come down [unto thee, O Prophet]: for We have sent thee but as a herald of glad tidings and a warner,",
      "ms": "Dan dengan cara yang sungguh layak serta berhikmat Kami turunkan Al-Quran, dan dengan meliputi segala kebenaran ia diturunkan; dan tiadalah Kami mengutusmu (wahai Muhammad) melainkan sebagai pembawa berita gembira (bagi orang-orang yang beriman) dan pembawa amaran (kepada orang-orang yang ingkar).",
      "id": "Dan Kami turunkan (Al Quran) itu dengan sebenar-benarnya dan Al Quran itu telah turun dengan (membawa) kebenaran. Dan Kami tidak mengutus kamu, melainkan sebagai pembawa berita gembira dan pemberi peringatan.",
      "ar": "وَبِٱلۡحَقِّ أَنزَلۡنَـٰهُ وَبِٱلۡحَقِّ نَزَلَۗ وَمَاۤ أَرۡسَلۡنَـٰكَ إِلَّا مُبَشِّرࣰا وَنَذِیرࣰا\n"
    }
  },
  {
    "id": 2135,
    "surahId": 17,
    "ayahNumber": 106,
    "arabicText": "وَقُرۡءَانࣰا فَرَقۡنَـٰهُ لِتَقۡرَأَهُۥ عَلَى ٱلنَّاسِ عَلَىٰ مُكۡثࣲ وَنَزَّلۡنَـٰهُ تَنزِیلࣰا\n",
    "translations": {
      "en": "[bearing] a discourse which We have gradually unfolded, so that thou might read it out to mankind by stages, seeing that We have bestowed it from on high step by step, as [one] revelation.",
      "ms": "Dan Al-Quran itu Kami bahagi-bahagikan supaya engkau membacakannya kepada manusia dengan lambat tenang; dan Kami menurunkannya beransur-ansur.",
      "id": "Dan Al Quran itu telah Kami turunkan dengan berangsur-angsur agar kamu membacakannya perlahan-lahan kepada manusia dan Kami menurunkannya bagian demi bagian.",
      "ar": "وَقُرۡءَانࣰا فَرَقۡنَـٰهُ لِتَقۡرَأَهُۥ عَلَى ٱلنَّاسِ عَلَىٰ مُكۡثࣲ وَنَزَّلۡنَـٰهُ تَنزِیلࣰا\n"
    }
  },
  {
    "id": 2136,
    "surahId": 17,
    "ayahNumber": 107,
    "arabicText": "قُلۡ ءَامِنُوا۟ بِهِۦۤ أَوۡ لَا تُؤۡمِنُوۤا۟ۚ إِنَّ ٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ مِن قَبۡلِهِۦۤ إِذَا یُتۡلَىٰ عَلَیۡهِمۡ یَخِرُّونَ لِلۡأَذۡقَانِ سُجَّدࣰا\n",
    "translations": {
      "en": "Say: \"Believe in it or do not believe.\" Behold, those who are already endowed with [innate] knowledge fall down upon their faces in prostration as soon as this [divine writ] is conveyed unto them,",
      "ms": "Katakanlah (wahai Muhammad kepada orang-orang yang ingkar itu): \"Sama ada kamu beriman kepada Al-Quran atau kamu tiada beriman, (tidaklah menjadi hal); kerana sesungguhnya orang-orang yang diberi ilmu sebelum itu apabila dibacakan Al-Quran kepada mereka, mereka segera tunduk sujud (dalam keadaan hiba dan khusyuk);",
      "id": "Katakanlah: \"Berimanlah kamu kepadanya atau tidak usah beriman (sama saja bagi Allah). Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya apabila Al Quran dibacakan kepada mereka, mereka menyungkur atas muka mereka sambil bersujud,",
      "ar": "قُلۡ ءَامِنُوا۟ بِهِۦۤ أَوۡ لَا تُؤۡمِنُوۤا۟ۚ إِنَّ ٱلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ مِن قَبۡلِهِۦۤ إِذَا یُتۡلَىٰ عَلَیۡهِمۡ یَخِرُّونَ لِلۡأَذۡقَانِ سُجَّدࣰا\n"
    }
  },
  {
    "id": 2137,
    "surahId": 17,
    "ayahNumber": 108,
    "arabicText": "وَیَقُولُونَ سُبۡحَـٰنَ رَبِّنَاۤ إِن كَانَ وَعۡدُ رَبِّنَا لَمَفۡعُولࣰا\n",
    "translations": {
      "en": "and say, \"Limitless in His glory is our Sustainer! Verily, our Sustainer's promise has been fulfilled!\"",
      "ms": "Serta mereka menegaskan (dalam sujudnya): \"Maha Suci Tuhan kami! Sesungguhnya janji Tuhan kami tetap terlaksana. \"",
      "id": "dan mereka berkata: \"Maha Suci Tuhan kami, sesungguhnya janji Tuhan kami pasti dipenuhi\".",
      "ar": "وَیَقُولُونَ سُبۡحَـٰنَ رَبِّنَاۤ إِن كَانَ وَعۡدُ رَبِّنَا لَمَفۡعُولࣰا\n"
    }
  },
  {
    "id": 2138,
    "surahId": 17,
    "ayahNumber": 109,
    "arabicText": "وَیَخِرُّونَ لِلۡأَذۡقَانِ یَبۡكُونَ وَیَزِیدُهُمۡ خُشُوعࣰا ۩\n",
    "translations": {
      "en": "And so they fall down upon their faces, weeping, and [their consciousness of God's grace] increases their humility.",
      "ms": "Dan mereka segera tunduk sujud itu sambil menangis, sedang Al-Quran menambahkan mereka khusyuk.",
      "id": "Dan mereka menyungkur atas muka mereka sambil menangis dan mereka bertambah khusyu'.",
      "ar": "وَیَخِرُّونَ لِلۡأَذۡقَانِ یَبۡكُونَ وَیَزِیدُهُمۡ خُشُوعࣰا ۩\n"
    }
  },
  {
    "id": 2139,
    "surahId": 17,
    "ayahNumber": 110,
    "arabicText": "قُلِ ٱدۡعُوا۟ ٱللَّهَ أَوِ ٱدۡعُوا۟ ٱلرَّحۡمَـٰنَۖ أَیࣰّا مَّا تَدۡعُوا۟ فَلَهُ ٱلۡأَسۡمَاۤءُ ٱلۡحُسۡنَىٰۚ وَلَا تَجۡهَرۡ بِصَلَاتِكَ وَلَا تُخَافِتۡ بِهَا وَٱبۡتَغِ بَیۡنَ ذَ ٰ⁠لِكَ سَبِیلࣰا\n",
    "translations": {
      "en": "Say: \"Invoke God, or invoke the Most Gracious: by whichever name you invoke Him, [He is always the One-for] His are all the attributes of perfection. And [pray unto Him; yet] be not too loud in thy prayer nor speak it in too low a voice, but follow a way in-between;",
      "ms": "Katakanlah (wahai Muhammad): \"Serulah nama \" Allah\" atau nama \"Ar-Rahman\", yang mana sahaja kamu serukan (dari kedua-dua nama itu adalah baik belaka); kerana Allah mempunyai banyak nama-nama yang baik serta mulia\". Dan janganlah engkau nyaringkan bacaan doa atau sembahyangmu, juga janganlah engkau perlahankannya, dan gunakanlah sahaja satu cara yang sederhana antara itu.",
      "id": "Katakanlah: \"Serulah Allah atau serulah Ar-Rahman. Dengan nama yang mana saja kamu seru, Dia mempunyai al asmaaul husna (nama-nama yang terbaik) dan janganlah kamu mengeraskan suaramu dalam shalatmu dan janganlah pula merendahkannya dan carilah jalan tengah di antara kedua itu\".",
      "ar": "قُلِ ٱدۡعُوا۟ ٱللَّهَ أَوِ ٱدۡعُوا۟ ٱلرَّحۡمَـٰنَۖ أَیࣰّا مَّا تَدۡعُوا۟ فَلَهُ ٱلۡأَسۡمَاۤءُ ٱلۡحُسۡنَىٰۚ وَلَا تَجۡهَرۡ بِصَلَاتِكَ وَلَا تُخَافِتۡ بِهَا وَٱبۡتَغِ بَیۡنَ ذَ ٰ⁠لِكَ سَبِیلࣰا\n"
    }
  },
  {
    "id": 2140,
    "surahId": 17,
    "ayahNumber": 111,
    "arabicText": "وَقُلِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِی لَمۡ یَتَّخِذۡ وَلَدࣰا وَلَمۡ یَكُن لَّهُۥ شَرِیكࣱ فِی ٱلۡمُلۡكِ وَلَمۡ یَكُن لَّهُۥ وَلِیࣱّ مِّنَ ٱلذُّلِّۖ وَكَبِّرۡهُ تَكۡبِیرَۢا\n",
    "translations": {
      "en": "and say: \"All praise is due to God, who begets no offspring, and has no partner in His dominion, and has no weakness, and therefore no need of any aid\" -and [thus] extol His limitless greatness.",
      "ms": "Dan katakanlah: \"Segala puji tertentu bagi Allah yang tiada mempunyai anak, dan tiada bagiNya sekutu dalam urusan kerajaanNya, dan tiada bagiNya penolong disebabkan sesuatu kelemahanNya; dan hendaklah engkau membesarkan serta memuliakanNya dengan bersungguh-sungguh!\"",
      "id": "Dan katakanlah: \"Segala puji bagi Allah Yang tidak mempunyai anak dan tidak mempunyai sekutu dalam kerajaan-Nya dan Dia bukan pula hina yang memerlukan penolong dan agungkanlah Dia dengan pengagungan yang sebesar-besarnya.",
      "ar": "وَقُلِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِی لَمۡ یَتَّخِذۡ وَلَدࣰا وَلَمۡ یَكُن لَّهُۥ شَرِیكࣱ فِی ٱلۡمُلۡكِ وَلَمۡ یَكُن لَّهُۥ وَلِیࣱّ مِّنَ ٱلذُّلِّۖ وَكَبِّرۡهُ تَكۡبِیرَۢا\n"
    }
  }
]