[
  {
    "id": 1474,
    "surahId": 11,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ كِتَـٰبٌ أُحۡكِمَتۡ ءَایَـٰتُهُۥ ثُمَّ فُصِّلَتۡ مِن لَّدُنۡ حَكِیمٍ خَبِیرٍ\n",
    "translations": {
      "en": "Alif. Lam. Ra. A DIVINE WRIT [is this], with messages that have been made clear in and by themselves, and have been distinctly spelled out as well - [bestowed upon you] out of the grace of One who is wise, all-aware,",
      "ms": "Alif, Laam, Raa'. Al-Quran sebuah Kitab yang tersusun ayat-ayatnya dengan tetap teguh, kemudian dijelaskan pula kandungannya satu persatu. (Susunan dan penjelasan itu) adalah dari sisi Allah Yang Maha Bijaksana, lagi Maha Mendalam pengetahuanNya.",
      "id": "Alif laam raa, (inilah) suatu kitab yang ayat-ayatnya disusun dengan rapi serta dijelaskan secara terperinci, yang diturunkan dari sisi (Allah) Yang Maha Bijaksana lagi Maha Tahu,",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ كِتَـٰبٌ أُحۡكِمَتۡ ءَایَـٰتُهُۥ ثُمَّ فُصِّلَتۡ مِن لَّدُنۡ حَكِیمٍ خَبِیرٍ\n"
    }
  },
  {
    "id": 1475,
    "surahId": 11,
    "ayahNumber": 2,
    "arabicText": "أَلَّا تَعۡبُدُوۤا۟ إِلَّا ٱللَّهَۚ إِنَّنِی لَكُم مِّنۡهُ نَذِیرࣱ وَبَشِیرࣱ\n",
    "translations": {
      "en": "so that you may worship none but God. [Say, O Prophet:] \"Behold, I come unto you from Him [as] a warner and a bearer of glad tidings:",
      "ms": "(Al-Quran yang demikian sifatnya diturunkan oleh Allah) supaya janganlah kamu menyembah sesuatupun melainkan Allah. (Katakanlah wahai Muhammad): \"Sesungguhnya aku diutus oleh Allah kepada kamu, sebagai pemberi amaran (kepada orang-orang yang (ingkar), dan pembawa berita gembira (kepada orang-orang yang (beriman).",
      "id": "agar kamu tidak menyembah selain Allah. Sesungguhnya aku (Muhammad) adalah pemberi peringatan dan pembawa khabar gembira kepadamu daripada-Nya,",
      "ar": "أَلَّا تَعۡبُدُوۤا۟ إِلَّا ٱللَّهَۚ إِنَّنِی لَكُم مِّنۡهُ نَذِیرࣱ وَبَشِیرࣱ\n"
    }
  },
  {
    "id": 1476,
    "surahId": 11,
    "ayahNumber": 3,
    "arabicText": "وَأَنِ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِ یُمَتِّعۡكُم مَّتَـٰعًا حَسَنًا إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى وَیُؤۡتِ كُلَّ ذِی فَضۡلࣲ فَضۡلَهُۥۖ وَإِن تَوَلَّوۡا۟ فَإِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمࣲ كَبِیرٍ\n",
    "translations": {
      "en": "Ask your Sustainer to forgive you your sins, and then turn towards Him in repentance - [whereupon] He will grant you a goodly enjoyment of life [in this world] until a term set [by Him is fulfilled]; and [in the life to come] He will bestow upon everyone possessed of merit [a full reward for] his merit. But if you turn away, then, verily, I dread for you the suffering [which is bound to befall you] on that awesome Day",
      "ms": "Dan hendaklah kamu meminta ampun kepada Tuhan kamu (dari perbuatan syirik), kemudian hendaklah kamu rujuk kembali taat kepadaNya; supaya Ia memberi kamu nikmat kesenangan hidup yang baik (di dunia) hingga ke suatu masa yang tertentu, dan (di akhirat pula) Ia akan memberi kepada tiap-tiap seorang yang mempunyai kelebihan (dalam sebarang amal yang soleh) akan pahala kelebihannya itu; dan jika kamu berpaling (membelakangkan tiga perkara itu), maka sesungguhnya aku bimbang kamu akan beroleh azab hari kiamat yang besar (huru-haranya).",
      "id": "dan hendaklah kamu meminta ampun kepada Tuhanmu dan bertaubat kepada-Nya. (Jika kamu mengerjakan yang demikian), niscaya Dia akan memberi kenikmatan yang baik (terus menerus) kepadamu sampai kepada waktu yang telah ditentukan dan Dia akan memberikan kepada tiap-tiap orang yang mempunyai keutamaan (balasan) keutamaannya. Jika kamu berpaling, maka sesungguhnya aku takut kamu akan ditimpa siksa hari kiamat.",
      "ar": "وَأَنِ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِ یُمَتِّعۡكُم مَّتَـٰعًا حَسَنًا إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى وَیُؤۡتِ كُلَّ ذِی فَضۡلࣲ فَضۡلَهُۥۖ وَإِن تَوَلَّوۡا۟ فَإِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمࣲ كَبِیرٍ\n"
    }
  },
  {
    "id": 1477,
    "surahId": 11,
    "ayahNumber": 4,
    "arabicText": "إِلَى ٱللَّهِ مَرۡجِعُكُمۡۖ وَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرٌ\n",
    "translations": {
      "en": "Unto God you all must return: and He has the power to will anything.\"",
      "ms": "Kepada Allah jualah kembalinya kamu, dan Ia Maha Kuasa atas tiap-tiap sesuatu\".",
      "id": "Kepada Allah-lah kembalimu, dan Dia Maha Kuasa atas segala sesuatu.",
      "ar": "إِلَى ٱللَّهِ مَرۡجِعُكُمۡۖ وَهُوَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرٌ\n"
    }
  },
  {
    "id": 1478,
    "surahId": 11,
    "ayahNumber": 5,
    "arabicText": "أَلَاۤ إِنَّهُمۡ یَثۡنُونَ صُدُورَهُمۡ لِیَسۡتَخۡفُوا۟ مِنۡهُۚ أَلَا حِینَ یَسۡتَغۡشُونَ ثِیَابَهُمۡ یَعۡلَمُ مَا یُسِرُّونَ وَمَا یُعۡلِنُونَۚ إِنَّهُۥ عَلِیمُۢ بِذَاتِ ٱلصُّدُورِ\n",
    "translations": {
      "en": "Oh, verily, they [who are bent on denying the truth of this divine writ] are enshrouding their hearts in order to hide from Him. Oh, verily, [even] when they cover themselves with their garments [in order not to see or hear], He knows all that they keep secret as well as all that they bring into the open - for, behold, He has full knowledge of what is in the hearts [of men].",
      "ms": "Ketahuilah! Sesungguhnya mereka yang ingkar itu membongkokkan badan mereka untuk menyembunyikan (perasaan buruk yang ada dalam dada mereka) daripada Allah. Ketahuilah! Semasa mereka berselubung dengan pakaian mereka sekalipun, Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka zahirkan; sesungguhnya Ia Maha Mengetahui akan segala (isi hati) yang ada di dalam dada.",
      "id": "Ingatlah, sesungguhnya (orang munafik itu) memalingkan dada mereka untuk menyembunyikan diri daripadanya (Muhammad). Ingatlah, di waktu mereka menyelimuti dirinya dengan kain, Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka lahirkan, sesungguhnya Allah Maha Mengetahui segala isi hati.",
      "ar": "أَلَاۤ إِنَّهُمۡ یَثۡنُونَ صُدُورَهُمۡ لِیَسۡتَخۡفُوا۟ مِنۡهُۚ أَلَا حِینَ یَسۡتَغۡشُونَ ثِیَابَهُمۡ یَعۡلَمُ مَا یُسِرُّونَ وَمَا یُعۡلِنُونَۚ إِنَّهُۥ عَلِیمُۢ بِذَاتِ ٱلصُّدُورِ\n"
    }
  },
  {
    "id": 1479,
    "surahId": 11,
    "ayahNumber": 6,
    "arabicText": "۞ وَمَا مِن دَاۤبَّةࣲ فِی ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا وَیَعۡلَمُ مُسۡتَقَرَّهَا وَمُسۡتَوۡدَعَهَاۚ كُلࣱّ فِی كِتَـٰبࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "And there is no living creature on earth but depends for its sustenance on God; and He knows its time-limit [on earth] and its resting-place [after death]: all [this] is laid down in [His] clear decree.",
      "ms": "Dan tiadalah sesuatupun dari makhluk-makhluk yang bergerak di bumi melainkan Allah jualah yang menanggung rezekinya dan mengetahui tempat kediamannya dan tempat ia disimpan. Semuanya itu tersurat di dalam Kitab (Lauh mahfuz) yang nyata (kepada malaikat-malaikat yang berkenaan).",
      "id": "Dan tidak ada suatu binatang melata pun di bumi melainkan Allah-lah yang memberi rezekinya, dan Dia mengetahui tempat berdiam binatang itu dan tempat penyimpanannya. Semuanya tertulis dalam Kitab yang nyata (Lauh mahfuzh).",
      "ar": "۞ وَمَا مِن دَاۤبَّةࣲ فِی ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا وَیَعۡلَمُ مُسۡتَقَرَّهَا وَمُسۡتَوۡدَعَهَاۚ كُلࣱّ فِی كِتَـٰبࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 1480,
    "surahId": 11,
    "ayahNumber": 7,
    "arabicText": "وَهُوَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ فِی سِتَّةِ أَیَّامࣲ وَكَانَ عَرۡشُهُۥ عَلَى ٱلۡمَاۤءِ لِیَبۡلُوَكُمۡ أَیُّكُمۡ أَحۡسَنُ عَمَلࣰاۗ وَلَىِٕن قُلۡتَ إِنَّكُم مَّبۡعُوثُونَ مِنۢ بَعۡدِ ٱلۡمَوۡتِ لَیَقُولَنَّ ٱلَّذِینَ كَفَرُوۤا۟ إِنۡ هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "And He it is who has created the heavens and the earth in six aeons; and [ever since He has willed to create life,] the throne of His almightiness has rested upon water. [God reminds you of your dependence on Him] in order to test you [and thus to make manifest] which of you is best in conduct. For thus it is: if thou sayest [unto men], \"Behold, you shall be raised again after death!\" - they who are bent on denying the truth are sure to answer, \"This is clearly nothing but an enchanting delusion\"",
      "ms": "Dan Dia lah yang menjadikan langit dan bumi dalam masa, sedang \"ArasyNya, berada di atas air (Ia menjadikan semuanya itu untuk menguji kamu: siapakah di antara kamu yang lebih baik amalnya. Dan demi sesungguhnya! Jika engkau (wahai Muhammad) berkata: \"Bahawa kamu akan dibangkitkan hidup kembali sesudah mati\" tentulah orang-orang yang ingkar akan berkata: \"Ini tidak lain, hanyalah seperti sihir yang nyata (tipuannya)\".",
      "id": "Dan Dialah yang menciptakan langit dan bumi dalam enam masa, dan adalah singgasana-Nya (sebelum itu) di atas air, agar Dia menguji siapakah di antara kamu yang lebih baik amalnya, dan jika kamu berkata (kepada penduduk Mekah): \"Sesungguhnya kamu akan dibangkitkan sesudah mati\", niscaya orang-orang yang kafir itu akan berkata: \"Ini tidak lain hanyalah sihir yang nyata\".",
      "ar": "وَهُوَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ فِی سِتَّةِ أَیَّامࣲ وَكَانَ عَرۡشُهُۥ عَلَى ٱلۡمَاۤءِ لِیَبۡلُوَكُمۡ أَیُّكُمۡ أَحۡسَنُ عَمَلࣰاۗ وَلَىِٕن قُلۡتَ إِنَّكُم مَّبۡعُوثُونَ مِنۢ بَعۡدِ ٱلۡمَوۡتِ لَیَقُولَنَّ ٱلَّذِینَ كَفَرُوۤا۟ إِنۡ هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 1481,
    "surahId": 11,
    "ayahNumber": 8,
    "arabicText": "وَلَىِٕنۡ أَخَّرۡنَا عَنۡهُمُ ٱلۡعَذَابَ إِلَىٰۤ أُمَّةࣲ مَّعۡدُودَةࣲ لَّیَقُولُنَّ مَا یَحۡبِسُهُۥۤۗ أَلَا یَوۡمَ یَأۡتِیهِمۡ لَیۡسَ مَصۡرُوفًا عَنۡهُمۡ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n",
    "translations": {
      "en": "And thus it is: if We defer their suffering until a time-limit set [by Us], they are sure to say, \"What is preventing it [from coming now]?\" Oh, verily, on the Day when it befalls them there will be nothing to avert it from them; and they shall be overwhelmed by the very thing which they were wont to deride.",
      "ms": "Dan demi sesungguhnya! Jika kami tangguhkan azab daripada menimpa mereka hingga ke suatu masa yang tertentu, tentulah mereka akan berkata (secara mengejek): \"Apakah yang menghalangnya?\" Ketahuilah! Pada hari datangnya azab itu kepada mereka, tidak akan dapat ditolak daripada menimpa mereka, dan tentulah mereka akan diliputi oleh azab yang mereka telah ejek-ejek itu.",
      "id": "Dan sesungguhnya jika Kami undurkan azab dari mereka sampai kepada suatu waktu yang ditentukan. niscaya mereka akan berkata: \"Apakah yang menghalanginya?\" lngatlah, diwaktu azab itu datang kepada mereka tidaklah dapat dipalingkan dari mereka dan mereka diliputi oleh azab yang dahulunya mereka selalu memperolok-olokkannya.",
      "ar": "وَلَىِٕنۡ أَخَّرۡنَا عَنۡهُمُ ٱلۡعَذَابَ إِلَىٰۤ أُمَّةࣲ مَّعۡدُودَةࣲ لَّیَقُولُنَّ مَا یَحۡبِسُهُۥۤۗ أَلَا یَوۡمَ یَأۡتِیهِمۡ لَیۡسَ مَصۡرُوفًا عَنۡهُمۡ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n"
    }
  },
  {
    "id": 1482,
    "surahId": 11,
    "ayahNumber": 9,
    "arabicText": "وَلَىِٕنۡ أَذَقۡنَا ٱلۡإِنسَـٰنَ مِنَّا رَحۡمَةࣰ ثُمَّ نَزَعۡنَـٰهَا مِنۡهُ إِنَّهُۥ لَیَـُٔوسࣱ كَفُورࣱ\n",
    "translations": {
      "en": "And thus it is: if We let man taste some of Our grace, and then take it away from him -behold, he abandons all hope, forgetting all gratitude [for Our past favours].",
      "ms": "Dan demi sesungguhnya! Jika Kami rasakan manusia sesuatu pemberian rahmat dari Kami kemudian Kami tarik balik pemberian itu daripadanya, mendapati dia amat berputus asa, lagi amat tidak bersyukur.",
      "id": "Dan jika Kami rasakan kepada manusia suatu rahmat (nikmat) dari Kami, kemudian rahmat itu Kami cabut daripadanya, pastilah dia menjadi putus asa lagi tidak berterima kasih.",
      "ar": "وَلَىِٕنۡ أَذَقۡنَا ٱلۡإِنسَـٰنَ مِنَّا رَحۡمَةࣰ ثُمَّ نَزَعۡنَـٰهَا مِنۡهُ إِنَّهُۥ لَیَـُٔوسࣱ كَفُورࣱ\n"
    }
  },
  {
    "id": 1483,
    "surahId": 11,
    "ayahNumber": 10,
    "arabicText": "وَلَىِٕنۡ أَذَقۡنَـٰهُ نَعۡمَاۤءَ بَعۡدَ ضَرَّاۤءَ مَسَّتۡهُ لَیَقُولَنَّ ذَهَبَ ٱلسَّیِّـَٔاتُ عَنِّیۤۚ إِنَّهُۥ لَفَرِحࣱ فَخُورٌ\n",
    "translations": {
      "en": "And thus it is: if We let him taste ease and plenty after hardship has visited him, he is sure to say, \"Gone is all affliction from me!\"-for, behold, he is given to vain exultation, and glories only in himself.",
      "ms": "Dan demi sesungguhnya! kalau Kami memberinya pula kesenangan sesudah ia menderita kesusahan, tentulah ia akan berkata: \"Telah hilang lenyaplah dariku segala kesusahan yang menimpaku\". Sesungguhnya ia (dengan kesenangannya itu) riang gembira, lagi bermegah-megah (kepada orang ramai).",
      "id": "Dan jika Kami rasakan kepadanya kebahagiaan sesudah bencana yang menimpanya, niscaya dia akan berkata: \"Telah hilang bencana-bencana itu daripadaku\"; sesungguhnya dia sangat gembira lagi bangga,",
      "ar": "وَلَىِٕنۡ أَذَقۡنَـٰهُ نَعۡمَاۤءَ بَعۡدَ ضَرَّاۤءَ مَسَّتۡهُ لَیَقُولَنَّ ذَهَبَ ٱلسَّیِّـَٔاتُ عَنِّیۤۚ إِنَّهُۥ لَفَرِحࣱ فَخُورٌ\n"
    }
  },
  {
    "id": 1484,
    "surahId": 11,
    "ayahNumber": 11,
    "arabicText": "إِلَّا ٱلَّذِینَ صَبَرُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أُو۟لَـٰۤىِٕكَ لَهُم مَّغۡفِرَةࣱ وَأَجۡرࣱ كَبِیرࣱ\n",
    "translations": {
      "en": "[And thus it is with most men-] save those who are patient in adversity and do righteous deeds: it is they whom forgiveness of sins awaits, and a great reward.",
      "ms": "Kecuali orang-orang yang sabar dan mengerjakan amal soleh maka mereka itu akan beroleh keampunan dan pahala yang besar.",
      "id": "kecuali orang-orang yang sabar (terhadap bencana), dan mengerjakan amal-amal saleh; mereka itu beroleh ampunan dan pahala yang besar.",
      "ar": "إِلَّا ٱلَّذِینَ صَبَرُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أُو۟لَـٰۤىِٕكَ لَهُم مَّغۡفِرَةࣱ وَأَجۡرࣱ كَبِیرࣱ\n"
    }
  },
  {
    "id": 1485,
    "surahId": 11,
    "ayahNumber": 12,
    "arabicText": "فَلَعَلَّكَ تَارِكُۢ بَعۡضَ مَا یُوحَىٰۤ إِلَیۡكَ وَضَاۤىِٕقُۢ بِهِۦ صَدۡرُكَ أَن یَقُولُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ كَنزٌ أَوۡ جَاۤءَ مَعَهُۥ مَلَكٌۚ إِنَّمَاۤ أَنتَ نَذِیرࣱۚ وَٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ وَكِیلٌ\n",
    "translations": {
      "en": "IS IT, then, conceivable [O Prophet] that thou couldst omit any part of what is being revealed unto thee [because the deniers of the truth dislike it,-and] because thy heart is distressed at their saying, \"Why has not a treasure been bestowed upon him from on high?\" -or, \"[Why has not] an angel come [visibly:: with him?\" [They fail to understand that] thou art only a warner, whereas God has everything in His care;",
      "ms": "Jangan-jangan engkau (wahai Muhammad) tidak menyampaikan sebahagian dari apa yang diwahyukan kepadamu serta merasa sempit dada untuk menyampaikannya disebabkan orang-orang yang ingkar itu berkata: \"Mengapa tidak diturunkan kepada (Muhammad) perbendaharaan (harta benda yang banyak), ataupun datang bersama-sama dengannya malaikat (untuk menolongnya menyiarkan Islam)?\" Kerana sesungguhnya engkau hanyalah seorang Rasul pemberi amaran kepada orang-orang yang ingkar, dan Allah jualah Pentadbir yang menguruskan tiap-tiap sesuatu (maka berserahlah diri kepadaNya).",
      "id": "Maka boleh jadi kamu hendak meninggalkan sebahagian dari apa yang diwahyukan kepadamu dan sempit karenanya dadamu, karena khawatir bahwa mereka akan mengatakan: \"Mengapa tidak diturunkan kepadanya perbendaharaan (kekayaan) atau datang bersama-sama dengan dia seorang malaikat?\" Sesungguhnya kamu hanyalah seorang pemberi peringatan dan Allah Pemelihara segala sesuatu.",
      "ar": "فَلَعَلَّكَ تَارِكُۢ بَعۡضَ مَا یُوحَىٰۤ إِلَیۡكَ وَضَاۤىِٕقُۢ بِهِۦ صَدۡرُكَ أَن یَقُولُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ كَنزٌ أَوۡ جَاۤءَ مَعَهُۥ مَلَكٌۚ إِنَّمَاۤ أَنتَ نَذِیرࣱۚ وَٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ وَكِیلٌ\n"
    }
  },
  {
    "id": 1486,
    "surahId": 11,
    "ayahNumber": 13,
    "arabicText": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُوا۟ بِعَشۡرِ سُوَرࣲ مِّثۡلِهِۦ مُفۡتَرَیَـٰتࣲ وَٱدۡعُوا۟ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "and so they assert, \"[Muhammad himself] has invented this [Qur'an)!\" Say [unto them]: \"Produce, then, ten surahs of similar merit, invented [by yourselves], and [to this end] call to your aid whomever you can, other than, God, if what you say is true!",
      "ms": "Bukan itu sahaja kata-kata mereka bahkan mereka menuduh dengan mengatakan: \"Ia (Muhammad) yang mereka-reka Al-Quran itu! \" katakanlah (wahai Muhammad): \"(Jika demikian tuduhan kamu), maka cubalah buat serta datangkan sepuluh surah rekaan yang sebanding dengan Al-Quran itu, dan panggilah siapa sahaja yang kamu sanggup memanggilnya, yang lain dari Allah, jika betul kamu orang-orang yang benar\".",
      "id": "Bahkan mereka mengatakan: \"Muhammad telah membuat-buat Al Quran itu\", Katakanlah: \"(Kalau demikian), maka datangkanlah sepuluh surat-surat yang dibuat-buat yang menyamainya, dan panggillah orang-orang yang kamu sanggup (memanggilnya) selain Allah, jika kamu memang orang-orang yang benar\".",
      "ar": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ فَأۡتُوا۟ بِعَشۡرِ سُوَرࣲ مِّثۡلِهِۦ مُفۡتَرَیَـٰتࣲ وَٱدۡعُوا۟ مَنِ ٱسۡتَطَعۡتُم مِّن دُونِ ٱللَّهِ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 1487,
    "surahId": 11,
    "ayahNumber": 14,
    "arabicText": "فَإِلَّمۡ یَسۡتَجِیبُوا۟ لَكُمۡ فَٱعۡلَمُوۤا۟ أَنَّمَاۤ أُنزِلَ بِعِلۡمِ ٱللَّهِ وَأَن لَّاۤ إِلَـٰهَ إِلَّا هُوَۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ\n",
    "translations": {
      "en": "And if they [whom you have called to your aid] are not able to help you, then know that [this Qur'an] has been bestowed from on high out of God's wisdom alone, and that there is no deity save Him. Will you, then, surrender yourselves unto Him?\"",
      "ms": "Oleh itu, jika mereka (penolong-penolong kamu) tidak dapat melaksanakan permintaan kamu (untuk membuat surah-surah yang sebanding dengan Al-Quran), maka ketahuilah bahawa Al-Quran itu diturunkan hanyalah menurut pengetahuan Allah, dan bahawa tidak ada tuhan yang berhak disembah melainkan Allah. Setelah (terbukti hakikat yang demikian) maka adakah kamu mengakui Islam dan menurut aturannya?",
      "id": "Jika mereka yang kamu seru itu tidak menerima seruanmu (ajakanmu) itu maka ketahuilah, sesungguhnya Al Quran itu diturunkan dengan ilmu Allah, dan bahwasanya tidak ada Tuhan selain Dia, maka maukah kamu berserah diri (kepada Allah)?",
      "ar": "فَإِلَّمۡ یَسۡتَجِیبُوا۟ لَكُمۡ فَٱعۡلَمُوۤا۟ أَنَّمَاۤ أُنزِلَ بِعِلۡمِ ٱللَّهِ وَأَن لَّاۤ إِلَـٰهَ إِلَّا هُوَۖ فَهَلۡ أَنتُم مُّسۡلِمُونَ\n"
    }
  },
  {
    "id": 1488,
    "surahId": 11,
    "ayahNumber": 15,
    "arabicText": "مَن كَانَ یُرِیدُ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا وَزِینَتَهَا نُوَفِّ إِلَیۡهِمۡ أَعۡمَـٰلَهُمۡ فِیهَا وَهُمۡ فِیهَا لَا یُبۡخَسُونَ\n",
    "translations": {
      "en": "AS FOR THOSE who care for [no more than] the life of this world and its bounties -We shall repay them in full for all that they did in this [life], and they, shall not be deprived of their just due therein:",
      "ms": "Sesiapa yang keadaan usahanya semata-mata berkehendakkan kehidupan dunia dan perhiasannya (dengan tidak disaksikan sama oleh Al-Quran tentang sah batalnya), maka Kami akan sempurnakan hasil usaha mereka di dunia, dan mereka tidak dikurangkan sedikitpun padanya.",
      "id": "Barangsiapa yang menghendaki kehidupan dunia dan perhiasannya, niscaya Kami berikan kepada mereka balasan pekerjaan mereka di dunia dengan sempurna dan mereka di dunia itu tidak akan dirugikan.",
      "ar": "مَن كَانَ یُرِیدُ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا وَزِینَتَهَا نُوَفِّ إِلَیۡهِمۡ أَعۡمَـٰلَهُمۡ فِیهَا وَهُمۡ فِیهَا لَا یُبۡخَسُونَ\n"
    }
  },
  {
    "id": 1489,
    "surahId": 11,
    "ayahNumber": 16,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ لَیۡسَ لَهُمۡ فِی ٱلۡـَٔاخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُوا۟ فِیهَا وَبَـٰطِلࣱ مَّا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "[yet] it is they who, in the life to come, shall have nothing but the fire -for in vain shall be all that they wrought in this [world], and worthless all that they ever did!",
      "ms": "Merekalah orang-orang yang tidak ada baginya pada hari akhirat kelak selain daripada azab neraka, dan pada hari itu gugurlah apa yang mereka lakukan di dunia, dan batalah apa yang mereka telah kerjakan.",
      "id": "Itulah orang-orang yang tidak memperoleh di akhirat, kecuali neraka dan lenyaplah di akhirat itu apa yang telah mereka usahakan di dunia dan sia-sialah apa yang telah mereka kerjakan.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ لَیۡسَ لَهُمۡ فِی ٱلۡـَٔاخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُوا۟ فِیهَا وَبَـٰطِلࣱ مَّا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 1490,
    "surahId": 11,
    "ayahNumber": 17,
    "arabicText": "أَفَمَن كَانَ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّهِۦ وَیَتۡلُوهُ شَاهِدࣱ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَـٰبُ مُوسَىٰۤ إِمَامࣰا وَرَحۡمَةًۚ أُو۟لَـٰۤىِٕكَ یُؤۡمِنُونَ بِهِۦۚ وَمَن یَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِی مِرۡیَةࣲ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Can, then, [he who cares for no more than the life of this world be compared with] one who takes his stand on a clear evidence from his Sustainer, conveyed through [this] testimony from Him, as was the revelation vouchsafed to Moses aforetime-[a divine writ ordained by Him] to be a guidance and grace [unto man]? They [who understand this message-it is they alone who truly] believe in it; whereas for any of those who, leagued together [in common hostility], deny its truth - the fire shall be their appointed state [in the life to come]. And so, be not in doubt about this [revelation]: behold, it is the truth from thy Sustainer, even though most people will not believe in it.",
      "ms": "Jika demikian, adakah sama mereka itu dengan orang-orang yang keadaannya sentiasa berdasarkan bukti yang terdapat dari (benda-benda yang diciptakan oleh) Tuhannya, dan diikuti oleh Kitab Suci Al-Quran memberi kenyataan - sebagai saksi dari pihak Tuhan meneguhkan bukti yang tersebut; dan sebelum itu, kenyataan yang serupa diberi oleh Kitab Nabi Musa yang menjadi ikutan dan rahmat (kepada umatnya)? Orang-orang yang berkeadaan demikian, mengakui - menerima Al-Quran; dan sesiapa ingkar akan Al-Quran itu dari kumpulan-kumpulan kaum kafir, maka nerakalah dijanjikan menjadi tempatnya. Oleh itu, janganlah engkau (wahai Muhammad) menaruh perasaan ragu-ragu terhadap Al-Quran, kerana sesungguhnya Al-Quran itu adalah perkara yang benar dari Tuhanmu, tetapi kebanyakan manusia tidak percaya kepadanya.",
      "id": "Apakah (orang-orang kafir itu sama dengan) orang-orang yang ada mempunyai bukti yang nyata (Al Quran) dari Tuhannya, dan diikuti pula oleh seorang saksi (Muhammad) dari Allah dan sebelum Al Quran itu telah ada Kitab Musa yang menjadi pedoman dan rahmat? Mereka itu beriman kepada Al Quran. Dan barangsiapa di antara mereka (orang-orang Quraisy) dan sekutu-sekutunya yang kafir kepada Al Quran, maka nerakalah tempat yang diancamkan baginya, karena itu janganlah kamu ragu-ragu terhadap Al Quran itu. Sesungguhnya (Al Quran) itu benar-benar dari Tuhanmu, tetapi kebanyakan manusia tidak beriman.",
      "ar": "أَفَمَن كَانَ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّهِۦ وَیَتۡلُوهُ شَاهِدࣱ مِّنۡهُ وَمِن قَبۡلِهِۦ كِتَـٰبُ مُوسَىٰۤ إِمَامࣰا وَرَحۡمَةًۚ أُو۟لَـٰۤىِٕكَ یُؤۡمِنُونَ بِهِۦۚ وَمَن یَكۡفُرۡ بِهِۦ مِنَ ٱلۡأَحۡزَابِ فَٱلنَّارُ مَوۡعِدُهُۥۚ فَلَا تَكُ فِی مِرۡیَةࣲ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 1491,
    "surahId": 11,
    "ayahNumber": 18,
    "arabicText": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُو۟لَـٰۤىِٕكَ یُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَیَقُولُ ٱلۡأَشۡهَـٰدُ هَـٰۤؤُلَاۤءِ ٱلَّذِینَ كَذَبُوا۟ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "And who could be more wicked than they who attribute their own lying inventions to God? [On the Day of Judgment, such as] these shall be arraigned before their Sustainer, and those who are called upon to bear witness [against them] shall say, \"It is they who uttered lies about their Sustainer!\" Oh, verily, God's rejection is the due of all evildoers",
      "ms": "Dan tidak ada yang lebih zalim daripada orang-orang yang mereka-reka perkara-perkara dusta terhadap Allah! Orang-orang yang demikian sifatnya akan dibawa mengadap Tuhan mereka, dan pada hari itu akan berkatalah saksi-saksi (dari malaikat-malaikat, Nabi-nabi, dan anggota-anggota tubuh mereka sendiri): \"Inilah orang-orang yang membuat-buat dusta terhadap Tuhan mereka\". Ketahuilah (sesungguhnya) laknat Allah tertimpa kepada orang-orang yang zalim!",
      "id": "Dan siapakah yang lebih zalim daripada orang yang membuat-buat dusta terhadap Allah? Mereka itu akan dihadapkan kepada Tuhan mereka, dan para saksi akan berkata: \"Orang-orang inilah yang telah berdusta terhadap Tuhan mereka\". Ingatlah, kutukan Allah (ditimpakan) atas orang-orang yang zalim,",
      "ar": "وَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبًاۚ أُو۟لَـٰۤىِٕكَ یُعۡرَضُونَ عَلَىٰ رَبِّهِمۡ وَیَقُولُ ٱلۡأَشۡهَـٰدُ هَـٰۤؤُلَاۤءِ ٱلَّذِینَ كَذَبُوا۟ عَلَىٰ رَبِّهِمۡۚ أَلَا لَعۡنَةُ ٱللَّهِ عَلَى ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1492,
    "surahId": 11,
    "ayahNumber": 19,
    "arabicText": "ٱلَّذِینَ یَصُدُّونَ عَن سَبِیلِ ٱللَّهِ وَیَبۡغُونَهَا عِوَجࣰا وَهُم بِٱلۡـَٔاخِرَةِ هُمۡ كَـٰفِرُونَ\n",
    "translations": {
      "en": "who turn others away from the path of God and try to make it appear crooked -since it is they, they who refuse to acknowledge the truth of the life to come!",
      "ms": "Orang-orang yang menghalang dirinya sendiri dan orang lain dari jalan ugama Allah dan berusaha supaya jalan itu menjadi bengkok terpesong, sedang mereka pula ingkarkan hari akhirat;",
      "id": "(yaitu) orang-orang yang menghalangi (manusia) dari jalan Allah dan menghendaki (supaya) jalan itu bengkok. Dan mereka itulah orang-orang yang tidak percaya akan adanya hari akhirat.",
      "ar": "ٱلَّذِینَ یَصُدُّونَ عَن سَبِیلِ ٱللَّهِ وَیَبۡغُونَهَا عِوَجࣰا وَهُم بِٱلۡـَٔاخِرَةِ هُمۡ كَـٰفِرُونَ\n"
    }
  },
  {
    "id": 1493,
    "surahId": 11,
    "ayahNumber": 20,
    "arabicText": "أُو۟لَـٰۤىِٕكَ لَمۡ یَكُونُوا۟ مُعۡجِزِینَ فِی ٱلۡأَرۡضِ وَمَا كَانَ لَهُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِیَاۤءَۘ یُضَـٰعَفُ لَهُمُ ٱلۡعَذَابُۚ مَا كَانُوا۟ یَسۡتَطِیعُونَ ٱلسَّمۡعَ وَمَا كَانُوا۟ یُبۡصِرُونَ\n",
    "translations": {
      "en": "Never can they elude [their final reckoning, even if they remain unscathed] on earth: never will they find anyone who could protect them from God. [In the life to come] double suffering will be imposed on them for having lost the ability to hear [the truth] and having failed to see [it].",
      "ms": "Mereka itu tidak akan dapat melemahkan kekuasaan Allah daripada menimpakan mereka dengan azab di dunia, dan tidak ada pula bagi mereka, yang lain dari Allah, sesiapapun yang dapat menolong melepaskan mereka dari seksaNya. Azab untuk mereka akan digandakan (kerana mereka sangat bencikan jalan ugama Allah), sehingga mereka tidak tahan mendengarnya, dan tidak pula suka melihat tanda-tanda kebenarannya.",
      "id": "Orang-orang itu tidak mampu menghalang-halangi Allah untuk (mengazab mereka) di bumi ini, dan sekali-kali tidak adalah bagi mereka penolong selain Allah. Siksaan itu dilipat gandakan kepada mereka. Mereka selalu tidak dapat mendengar (kebenaran) dan mereka selalu tidak dapat melihat(nya).",
      "ar": "أُو۟لَـٰۤىِٕكَ لَمۡ یَكُونُوا۟ مُعۡجِزِینَ فِی ٱلۡأَرۡضِ وَمَا كَانَ لَهُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِیَاۤءَۘ یُضَـٰعَفُ لَهُمُ ٱلۡعَذَابُۚ مَا كَانُوا۟ یَسۡتَطِیعُونَ ٱلسَّمۡعَ وَمَا كَانُوا۟ یُبۡصِرُونَ\n"
    }
  },
  {
    "id": 1494,
    "surahId": 11,
    "ayahNumber": 21,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ خَسِرُوۤا۟ أَنفُسَهُمۡ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n",
    "translations": {
      "en": "It is they who have squandered their own selves-for [on the Day of Resurrection] all their false imagery will have forsaken them:",
      "ms": "Merekalah orang-orang yang merugikan diri sendiri, dan hilang lenyaplah dari mereka apa yang mereka ada-adakan.",
      "id": "Mereka itulah orang-orang yang merugikan dirinya sendiri, dan lenyaplah dari mereka apa yang selalu mereka ada-adakan.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ خَسِرُوۤا۟ أَنفُسَهُمۡ وَضَلَّ عَنۡهُم مَّا كَانُوا۟ یَفۡتَرُونَ\n"
    }
  },
  {
    "id": 1495,
    "surahId": 11,
    "ayahNumber": 22,
    "arabicText": "لَا جَرَمَ أَنَّهُمۡ فِی ٱلۡـَٔاخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ\n",
    "translations": {
      "en": "truly it is they, they who in the life to come shall be the losers!",
      "ms": "Tidak syak lagi, bahawa sesungguhnya merekalah yang paling rugi, pada hari akhirat kelak.",
      "id": "Pasti mereka itu di akhirat menjadi orang-orang yang paling merugi.",
      "ar": "لَا جَرَمَ أَنَّهُمۡ فِی ٱلۡـَٔاخِرَةِ هُمُ ٱلۡأَخۡسَرُونَ\n"
    }
  },
  {
    "id": 1496,
    "surahId": 11,
    "ayahNumber": 23,
    "arabicText": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَأَخۡبَتُوۤا۟ إِلَىٰ رَبِّهِمۡ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلۡجَنَّةِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n",
    "translations": {
      "en": "Behold, [only] those who attain to faith and do righteous deeds and humble themselves before their Sustainer - [only] they are destined for paradise, and there shall they abide.",
      "ms": "Sesungguhnya orang-orang yang beriman dan mengerjakan amal yang soleh, serta tunduk taat menunaikan ibadat kepada Tuhan mereka dengan khusyuk, mereka itulah ahli Syurga, mereka kekal di dalamnya.",
      "id": "Sesungguhnya orang-orang yang beriman dan mengerjakan amal-amal saleh dan merendahkan diri kepada Tuhan mereka, mereka itu adalah penghuni-penghuni surga; mereka kekal di dalamnya.",
      "ar": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَأَخۡبَتُوۤا۟ إِلَىٰ رَبِّهِمۡ أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلۡجَنَّةِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n"
    }
  },
  {
    "id": 1497,
    "surahId": 11,
    "ayahNumber": 24,
    "arabicText": "۞ مَثَلُ ٱلۡفَرِیقَیۡنِ كَٱلۡأَعۡمَىٰ وَٱلۡأَصَمِّ وَٱلۡبَصِیرِ وَٱلسَّمِیعِۚ هَلۡ یَسۡتَوِیَانِ مَثَلًاۚ أَفَلَا تَذَكَّرُونَ\n",
    "translations": {
      "en": "These two kinds of man may be likened to the blind and deaf and the seeing and hearing. Can these two be deemed alike in [their] nature? ` Will you not, then, keep this in mind?",
      "ms": "Bandingan dua golongan (yang kafir dan yang beriman) itu samalah seperti orang yang buta serta pekak, dengan orang yang celik serta mendengar; kedua-dua golongan itu tidaklah sama keadaannya. (Setelah kamu mengetahui yang demikian) maka tidakkah kamu mahu mengambil peringatan dan insaf?",
      "id": "Perbandingan kedua golongan itu (orang-orang kafir dan orang-orang mukmin), seperti orang buta dan tuli dengan orang yang dapat melihat dan dapat mendengar. Adakah kedua golongan itu sama keadaan dan sifatnya? Maka tidakkah kamu mengambil pelajaran (daripada perbandingan itu)?",
      "ar": "۞ مَثَلُ ٱلۡفَرِیقَیۡنِ كَٱلۡأَعۡمَىٰ وَٱلۡأَصَمِّ وَٱلۡبَصِیرِ وَٱلسَّمِیعِۚ هَلۡ یَسۡتَوِیَانِ مَثَلًاۚ أَفَلَا تَذَكَّرُونَ\n"
    }
  },
  {
    "id": 1498,
    "surahId": 11,
    "ayahNumber": 25,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦۤ إِنِّی لَكُمۡ نَذِیرࣱ مُّبِینٌ\n",
    "translations": {
      "en": "AND INDEED, [it was with the same message that] We sent forth Noah unto his people: \"Behold, I come unto you with the plain warning",
      "ms": "Dan demi sesungguhnya! Kami telah utuskan Nabi Nuh lalu ia memberitahu kaumnya dengan berkata: \"Sesungguhnya aku ini seorang Rasul pemberi amaran yang nyata kepada kamu.",
      "id": "Dan sesungguhnya Kami telah mengutus Nuh kepada kaumnya, (dia berkata): \"Sesungguhnya aku adalah pemberi peringatan yang nyata bagi kamu,",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦۤ إِنِّی لَكُمۡ نَذِیرࣱ مُّبِینٌ\n"
    }
  },
  {
    "id": 1499,
    "surahId": 11,
    "ayahNumber": 26,
    "arabicText": "أَن لَّا تَعۡبُدُوۤا۟ إِلَّا ٱللَّهَۖ إِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمٍ أَلِیمࣲ\n",
    "translations": {
      "en": "that you may worship none but God-for, verily, I fear lest suffering befall you on a grievous Day!\"",
      "ms": "\"Iaitu janganlah kamu menyembah melainkan Allah; sesungguhnya aku bimbang (jika kamu menyembah yang lainnya), kamu akan ditimpa azab yang tidak terperi sakitnya pada hari pembalasan\".",
      "id": "agar kamu tidak menyembah selain Allah. Sesungguhnya aku takut kamu akan ditimpa azab (pada) hari yang sangat menyedihkan\".",
      "ar": "أَن لَّا تَعۡبُدُوۤا۟ إِلَّا ٱللَّهَۖ إِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمٍ أَلِیمࣲ\n"
    }
  },
  {
    "id": 1500,
    "surahId": 11,
    "ayahNumber": 27,
    "arabicText": "فَقَالَ ٱلۡمَلَأُ ٱلَّذِینَ كَفَرُوا۟ مِن قَوۡمِهِۦ مَا نَرَىٰكَ إِلَّا بَشَرࣰا مِّثۡلَنَا وَمَا نَرَىٰكَ ٱتَّبَعَكَ إِلَّا ٱلَّذِینَ هُمۡ أَرَاذِلُنَا بَادِیَ ٱلرَّأۡیِ وَمَا نَرَىٰ لَكُمۡ عَلَیۡنَا مِن فَضۡلِۭ بَلۡ نَظُنُّكُمۡ كَـٰذِبِینَ\n",
    "translations": {
      "en": "But the great ones among his people, who refused to acknowledge the truth, answered: \"We do not see in thee anything but a mortal man like ourselves; and we do not see that any follow thee save those who are quite obviously the most abject among us; and we do not see that you could be in any way superior to us: on the contrary, we think that you are liars!\"",
      "ms": "Maka berkatalah ketua-ketua yang kafir dari kaumnya: \"Kami tidak memandangmu (wahai Nuh) melainkan sebagai seorang manusia seperti kami; dan kami tidak nampak golongan yang mengikutmu melainkan orang-orang kami yang miskin hina, lagi berfikiran singkat; dan kami juga tidak memandang kamu (semua) mempunyai sebarang kelebihan yang mengatasi kami, bahkan kami menganggap kamu orang-orang pendusta\".",
      "id": "Maka berkatalah pemimpin-pemimpin yang kafir dari kaumnya: \"Kami tidak melihat kamu, melainkan (sebagai) seorang manusia (biasa) seperti kami, dan kami tidak melihat orang-orang yang mengikuti kamu, melainkan orang-orang yang hina dina di antara kami yang lekas percaya saja, dan kami tidak melihat kamu memiliki sesuatu kelebihan apapun atas kami, bahkan kami yakin bahwa kamu adalah orang-orang yang dusta\".",
      "ar": "فَقَالَ ٱلۡمَلَأُ ٱلَّذِینَ كَفَرُوا۟ مِن قَوۡمِهِۦ مَا نَرَىٰكَ إِلَّا بَشَرࣰا مِّثۡلَنَا وَمَا نَرَىٰكَ ٱتَّبَعَكَ إِلَّا ٱلَّذِینَ هُمۡ أَرَاذِلُنَا بَادِیَ ٱلرَّأۡیِ وَمَا نَرَىٰ لَكُمۡ عَلَیۡنَا مِن فَضۡلِۭ بَلۡ نَظُنُّكُمۡ كَـٰذِبِینَ\n"
    }
  },
  {
    "id": 1501,
    "surahId": 11,
    "ayahNumber": 28,
    "arabicText": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَءَاتَىٰنِی رَحۡمَةࣰ مِّنۡ عِندِهِۦ فَعُمِّیَتۡ عَلَیۡكُمۡ أَنُلۡزِمُكُمُوهَا وَأَنتُمۡ لَهَا كَـٰرِهُونَ\n",
    "translations": {
      "en": "Said [Noah]: \"O my people! What do you think? If [it be true that I am taking my stand on a clear evidence from my~ Sustainer, who has vouchsafed unto me grace from Himself - [a revelation] to which you have remained blind-: [if this be true,] can we force it on you even though it be hateful to you?",
      "ms": "Nabi Nuh berkata: \"Wahai kaumku! Jika keadaanku berdasarkan bukti yang nyata dari Tuhanku, serta Ia mengurniakan pangkat Nabi kepadaku dari sisiNya, kemudian bukti yang nyata itu menjadi kabur pada pandangan kamu (disebabkan keingkaran kamu yang telah sebati), maka adakah kamu nampak ada gunanya Kami memaksa kamu menerima bukti itu sedang kamu tidak suka kepadanya?",
      "id": "Berkata Nuh: \"Hai kaumku, bagaimana pikiranmu, jika aku ada mempunyai bukti yang nyata dari Tuhanku, dan diberinya aku rahmat dari sisi-Nya, tetapi rahmat itu disamarkan bagimu. Apa akan kami paksakankah kamu menerimanya, padahal kamu tiada menyukainya?\"",
      "ar": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَءَاتَىٰنِی رَحۡمَةࣰ مِّنۡ عِندِهِۦ فَعُمِّیَتۡ عَلَیۡكُمۡ أَنُلۡزِمُكُمُوهَا وَأَنتُمۡ لَهَا كَـٰرِهُونَ\n"
    }
  },
  {
    "id": 1502,
    "surahId": 11,
    "ayahNumber": 29,
    "arabicText": "وَیَـٰقَوۡمِ لَاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ مَالًاۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱللَّهِۚ وَمَاۤ أَنَا۠ بِطَارِدِ ٱلَّذِینَ ءَامَنُوۤا۟ۚ إِنَّهُم مُّلَـٰقُوا۟ رَبِّهِمۡ وَلَـٰكِنِّیۤ أَرَىٰكُمۡ قَوۡمࣰا تَجۡهَلُونَ\n",
    "translations": {
      "en": "\"And, O my people, no benefit do I ask of you for this [message]: my reward rests with none but God. And I shall not repulse [any of] those who have attained to faith. Verily, they [know that they] are destined to meet their Sustainer, whereas in you I see people without any awareness [of right and wrong]!",
      "ms": "Dan (ketahuilah) wahai kaumku! Aku tidak meminta kepada kamu sebarang harta benda sebagai upah menyampaikan ugama Allah itu, tiadalah aku harapkan upahku melainkan dari Allah semata-mata; dan aku tidak akan menghalau orang-orang yang beriman (sebagaimana yang kamu minta itu), kerana sesungguhnya mereka akan menemui Tuhan mereka (dan pada hari itu mereka akan menuntut dan menerima hak masing-masing); tetapi aku nampak kamu semua, kaum yang tidak mengetahui apa yang mesti diketahui.",
      "id": "Dan (dia berkata): \"Hai kaumku, aku tiada meminta harta benda kepada kamu (sebagai upah) bagi seruanku. Upahku hanyalah dari Allah dan aku sekali-kali tidak akan mengusir orang-orang yang telah beriman. Sesungguhnya mereka akan bertemu dengan Tuhannya, akan tetapi aku memandangmu suatu kaum yang tidak mengetahui\".",
      "ar": "وَیَـٰقَوۡمِ لَاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ مَالًاۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱللَّهِۚ وَمَاۤ أَنَا۠ بِطَارِدِ ٱلَّذِینَ ءَامَنُوۤا۟ۚ إِنَّهُم مُّلَـٰقُوا۟ رَبِّهِمۡ وَلَـٰكِنِّیۤ أَرَىٰكُمۡ قَوۡمࣰا تَجۡهَلُونَ\n"
    }
  },
  {
    "id": 1503,
    "surahId": 11,
    "ayahNumber": 30,
    "arabicText": "وَیَـٰقَوۡمِ مَن یَنصُرُنِی مِنَ ٱللَّهِ إِن طَرَدتُّهُمۡۚ أَفَلَا تَذَكَّرُونَ\n",
    "translations": {
      "en": "And, O my people, who would shield me from God were I to repulse them? Will you not, then, keep this in mind?",
      "ms": "Dan lagi wahai kaumku! Siapakah yang akan menolongku dari azab Allah jika aku menghalau mereka? Maka mengapa kamu tidak mahu ingatkan kekuasaan Allah?",
      "id": "Dan (dia berkata): \"Hai kaumku, siapakah yang akan menolongku dari (azab) Allah jika aku mengusir mereka. Maka tidakkah kamu mengambil pelajaran?",
      "ar": "وَیَـٰقَوۡمِ مَن یَنصُرُنِی مِنَ ٱللَّهِ إِن طَرَدتُّهُمۡۚ أَفَلَا تَذَكَّرُونَ\n"
    }
  },
  {
    "id": 1504,
    "surahId": 11,
    "ayahNumber": 31,
    "arabicText": "وَلَاۤ أَقُولُ لَكُمۡ عِندِی خَزَاۤىِٕنُ ٱللَّهِ وَلَاۤ أَعۡلَمُ ٱلۡغَیۡبَ وَلَاۤ أَقُولُ إِنِّی مَلَكࣱ وَلَاۤ أَقُولُ لِلَّذِینَ تَزۡدَرِیۤ أَعۡیُنُكُمۡ لَن یُؤۡتِیَهُمُ ٱللَّهُ خَیۡرًاۖ ٱللَّهُ أَعۡلَمُ بِمَا فِیۤ أَنفُسِهِمۡ إِنِّیۤ إِذࣰا لَّمِنَ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "\"And I do not say unto you, `God's treasures are with me'; nor [do I say], `I know the reality which is beyond the reach of human perception'; nor do I say, 'Behold, I am an angel'; nor do I say of those whom your eyes hold in contempt, `Never will God grant them any good'- for God is fully aware of what is in their hearts. [Were I to speak thus,] verily, I would indeed be among the evildoers.\"",
      "ms": "Dan aku tidak pernah berkata kepada kamu: di sisiku ada perbendaharaan Allah, dan tidaklah aku mendakwa mengetahui perkara-perkara yang ghaib dan aku tidak mengatakan bahawa aku ini malaikat; dan aku juga tidak berkata terhadap orang-orang yang beriman yang kamu pandang hina itu, bahawa Allah tidak akan memberi kebaikan kepada mereka. Allah lebih mengetahui akan apa yang ada di dalam hati mereka. Sesungguhnya aku jika bertindak demikian, nescaya menjadilah aku dari orang-orang yang zalim\".",
      "id": "Dan aku tidak mengatakan kepada kamu (bahwa): \"Aku mempunyai gudang-gudang rezeki dan kekayaan dari Allah, dan aku tiada mengetahui yang ghaib\", dan tidak (pula) aku mengatakan: \"Bahwa sesungguhnya aku adalah malaikat\", dan tidak juga aku mengatakan kepada orang-orang yang dipandang hina oleh penglihatanmu: \"Sekali-kali Allah tidak akan mendatangkan kebaikan kepada mereka\". Allah lebih mengetahui apa yang ada pada diri mereka; sesungguhnya aku, kalau begitu benar-benar termasuk orang-orang yang zalim.",
      "ar": "وَلَاۤ أَقُولُ لَكُمۡ عِندِی خَزَاۤىِٕنُ ٱللَّهِ وَلَاۤ أَعۡلَمُ ٱلۡغَیۡبَ وَلَاۤ أَقُولُ إِنِّی مَلَكࣱ وَلَاۤ أَقُولُ لِلَّذِینَ تَزۡدَرِیۤ أَعۡیُنُكُمۡ لَن یُؤۡتِیَهُمُ ٱللَّهُ خَیۡرًاۖ ٱللَّهُ أَعۡلَمُ بِمَا فِیۤ أَنفُسِهِمۡ إِنِّیۤ إِذࣰا لَّمِنَ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1505,
    "surahId": 11,
    "ayahNumber": 32,
    "arabicText": "قَالُوا۟ یَـٰنُوحُ قَدۡ جَـٰدَلۡتَنَا فَأَكۡثَرۡتَ جِدَ ٰ⁠لَنَا فَأۡتِنَا بِمَا تَعِدُنَاۤ إِن كُنتَ مِنَ ٱلصَّـٰدِقِینَ\n",
    "translations": {
      "en": "[But the great ones] said: \"O Noah! Thou hast contended with us in argument, and hast [needlessly] prolonged our controversy: bring upon us, therefore, that with which thou dost threaten us, if thou art a man of truth!\"",
      "ms": "Mereka berkata: \"Wahai Nuh! Sesungguhnya engkau telah bertikam lidah membantah kami lalu engkau banyakkan sangat hujjah-hujjah semasa mengemukakan bantahanmu kepada kami; oleh itu, datangkanlah azab Allah yang engkau janjikan kepada kami, jika betul engkau dari orang-orang yang benar\".",
      "id": "Mereka berkata \"Hai Nuh, sesungguhnya kamu telah berbantah dengan kami, dan kamu telah memperpanjang bantahanmu terhadap kami, maka datangkanlah kepada kami azab yang kamu ancamkan kepada kami, jika kamu termasuk orang-orang yang benar\".",
      "ar": "قَالُوا۟ یَـٰنُوحُ قَدۡ جَـٰدَلۡتَنَا فَأَكۡثَرۡتَ جِدَ ٰ⁠لَنَا فَأۡتِنَا بِمَا تَعِدُنَاۤ إِن كُنتَ مِنَ ٱلصَّـٰدِقِینَ\n"
    }
  },
  {
    "id": 1506,
    "surahId": 11,
    "ayahNumber": 33,
    "arabicText": "قَالَ إِنَّمَا یَأۡتِیكُم بِهِ ٱللَّهُ إِن شَاۤءَ وَمَاۤ أَنتُم بِمُعۡجِزِینَ\n",
    "translations": {
      "en": "He answered: \"Only God can bring it upon you, if He so wills, and you shall not elude it:",
      "ms": "Nabi Nuh menjawab: \"Sesungguhnya Allah jualah yang akan mendatangkan azabNya itu kepada kamu jika Ia kehendaki, dan kamu tidak sekali-kali akan dapat melemahkan kuasa Allah!",
      "id": "Nuh menjawab: \"Hanyalah Allah yang akan mendatangkan azab itu kepadamu jika Dia menghendaki, dan kamu sekali-kali tidak dapat melepaskan diri.",
      "ar": "قَالَ إِنَّمَا یَأۡتِیكُم بِهِ ٱللَّهُ إِن شَاۤءَ وَمَاۤ أَنتُم بِمُعۡجِزِینَ\n"
    }
  },
  {
    "id": 1507,
    "surahId": 11,
    "ayahNumber": 34,
    "arabicText": "وَلَا یَنفَعُكُمۡ نُصۡحِیۤ إِنۡ أَرَدتُّ أَنۡ أَنصَحَ لَكُمۡ إِن كَانَ ٱللَّهُ یُرِیدُ أَن یُغۡوِیَكُمۡۚ هُوَ رَبُّكُمۡ وَإِلَیۡهِ تُرۡجَعُونَ\n",
    "translations": {
      "en": "for, my advice will not benefit you -much as I desire to give you good advice - if it be God's will that you shall remain lost in grievous error. He is your Sustainer, and unto Him you must return.\"",
      "ms": "Dan tidak ada gunanya nasihatku kepada kamu, jika aku hendak menasihati kamu, kalau Allah hendak menyesatkan kamu (kerana kamu tetap berdegil); Dia lah Tuhan kamu dan kepadaNya kamu akan kembali\".",
      "id": "Dan tidaklah bermanfaat kepadamu nasehatku jika aku hendak memberi nasehat kepada kamu, sekiranya Allah hendak menyesatkan kamu, Dia adalah Tuhanmu, dan kepada-Nya-lah kamu dikembalikan\".",
      "ar": "وَلَا یَنفَعُكُمۡ نُصۡحِیۤ إِنۡ أَرَدتُّ أَنۡ أَنصَحَ لَكُمۡ إِن كَانَ ٱللَّهُ یُرِیدُ أَن یُغۡوِیَكُمۡۚ هُوَ رَبُّكُمۡ وَإِلَیۡهِ تُرۡجَعُونَ\n"
    }
  },
  {
    "id": 1508,
    "surahId": 11,
    "ayahNumber": 35,
    "arabicText": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَیۡتُهُۥ فَعَلَیَّ إِجۡرَامِی وَأَنَا۠ بَرِیۤءࣱ مِّمَّا تُجۡرِمُونَ\n",
    "translations": {
      "en": "DO SOME, perchance, assert, \"[Muhammad] has invented this [story]\"? Say [O Prophet]: \"If I have invented it, upon me be this sin; but far be it from me to commit the sin of which you are guilty.\"",
      "ms": "(Mereka terus berdegil), bahkan mereka menuduh dengan mengatakan Nabi Nuh sengaja mengada-adakan secara dusta: bahawa Tuhan mengurniakan pangkat Nabi kepadanya. Nabi Nuh diperintahkan menjawab dengan berkata: \"Kalau aku yang mereka-reka wahyu itu maka akulah yang akan menanggung dosa perbuatanku itu, dan sebenarnya aku bersih dari dosa kesalahan kamu menuduhku\".",
      "id": "Malahan kaum Nuh itu berkata: \"Dia cuma membuat-buat nasihatnya saja\". Katakanlah: \"Jika aku membuat-buat nasihat itu, maka hanya akulah yang memikul dosaku, dan aku berlepas diri dari dosa yang kamu perbuat\".",
      "ar": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَیۡتُهُۥ فَعَلَیَّ إِجۡرَامِی وَأَنَا۠ بَرِیۤءࣱ مِّمَّا تُجۡرِمُونَ\n"
    }
  },
  {
    "id": 1509,
    "surahId": 11,
    "ayahNumber": 36,
    "arabicText": "وَأُوحِیَ إِلَىٰ نُوحٍ أَنَّهُۥ لَن یُؤۡمِنَ مِن قَوۡمِكَ إِلَّا مَن قَدۡ ءَامَنَ فَلَا تَبۡتَىِٕسۡ بِمَا كَانُوا۟ یَفۡعَلُونَ\n",
    "translations": {
      "en": "AND THIS was revealed unto Noah: \"Never will any of thy people believe except those who have already attained to faith. Be not, then, distressed by anything that they may do,",
      "ms": "Dan (setelah itu) diwahyukan kepada Nabi Nuh: \"Bahawa sesungguhnya tidak akan beriman lagi dari kaummu melainkan orang-orang yang telah sedia beriman. Oleh itu, janganlah engkau berdukacita tentang apa yang mereka sentiasa lakukan.",
      "id": "Dan diwahyukan kepada Nuh, bahwasanya sekali-kali tidak akan beriman di antara kaummu, kecuali orang yang telah beriman (saja), karena itu janganlah kamu bersedih hati tentang apa yang selalu mereka kerjakan.",
      "ar": "وَأُوحِیَ إِلَىٰ نُوحٍ أَنَّهُۥ لَن یُؤۡمِنَ مِن قَوۡمِكَ إِلَّا مَن قَدۡ ءَامَنَ فَلَا تَبۡتَىِٕسۡ بِمَا كَانُوا۟ یَفۡعَلُونَ\n"
    }
  },
  {
    "id": 1510,
    "surahId": 11,
    "ayahNumber": 37,
    "arabicText": "وَٱصۡنَعِ ٱلۡفُلۡكَ بِأَعۡیُنِنَا وَوَحۡیِنَا وَلَا تُخَـٰطِبۡنِی فِی ٱلَّذِینَ ظَلَمُوۤا۟ إِنَّهُم مُّغۡرَقُونَ\n",
    "translations": {
      "en": "but build, under Our eyes and according to Our inspiration, the ark [that shall save thee and those who follow thee]; and do not appeal to Me in behalf of those who are bent on evildoing for, behold, they are destined to be drowned!\"",
      "ms": "Dan buatlah bahtera dengan pengawasan serta kawalan Kami, dan dengan panduan wahyu Kami (tentang cara membuatnya); dan janganlah engkau merayu kepadaKu untuk menolong kaum yang zalim itu, kerana sesungguhnya mereka akan ditenggelamkan (dengan taufan)\".",
      "id": "Dan buatlah bahtera itu dengan pengawasan dan petunjuk wahyu Kami, dan janganlah kamu bicarakan dengan Aku tentang orang-orang yang zalim itu; sesungguhnya mereka itu akan ditenggelamkan.",
      "ar": "وَٱصۡنَعِ ٱلۡفُلۡكَ بِأَعۡیُنِنَا وَوَحۡیِنَا وَلَا تُخَـٰطِبۡنِی فِی ٱلَّذِینَ ظَلَمُوۤا۟ إِنَّهُم مُّغۡرَقُونَ\n"
    }
  },
  {
    "id": 1511,
    "surahId": 11,
    "ayahNumber": 38,
    "arabicText": "وَیَصۡنَعُ ٱلۡفُلۡكَ وَكُلَّمَا مَرَّ عَلَیۡهِ مَلَأࣱ مِّن قَوۡمِهِۦ سَخِرُوا۟ مِنۡهُۚ قَالَ إِن تَسۡخَرُوا۟ مِنَّا فَإِنَّا نَسۡخَرُ مِنكُمۡ كَمَا تَسۡخَرُونَ\n",
    "translations": {
      "en": "And [so Noah] set himself to building the ark; and every time the great ones of his people passed by him, they scoffed at him. [Thereupon] he said: \"If you are scoffing at us-behold, we are scoffing at you [and your ignorance], just as you are scoffing at us.",
      "ms": "Dan Nabi Nuh pun membuat bahtera itu, dan tiap-tiap kali sepuak dari kaumnya melalui tempat ia membina bahteranya, mereka mengejek-ejeknya. Nabi Nuh pun menjawab: \"Jika kamu memandang kami bodoh (kerana membuat bahtera ini), maka sesungguhnya kami juga memandang kamu bodoh (kerana keingkaran kamu), sebagai (balasan) ejekan kamu.",
      "id": "Dan mulailah Nuh membuat bahtera. Dan setiap kali pemimpin kaumnya berjalan meliwati Nuh, mereka mengejeknya. Berkatalah Nuh: \"Jika kamu mengejek kami, maka sesungguhnya kami (pun) mengejekmu sebagaimana kamu sekalian mengejek (kami).",
      "ar": "وَیَصۡنَعُ ٱلۡفُلۡكَ وَكُلَّمَا مَرَّ عَلَیۡهِ مَلَأࣱ مِّن قَوۡمِهِۦ سَخِرُوا۟ مِنۡهُۚ قَالَ إِن تَسۡخَرُوا۟ مِنَّا فَإِنَّا نَسۡخَرُ مِنكُمۡ كَمَا تَسۡخَرُونَ\n"
    }
  },
  {
    "id": 1512,
    "surahId": 11,
    "ayahNumber": 39,
    "arabicText": "فَسَوۡفَ تَعۡلَمُونَ مَن یَأۡتِیهِ عَذَابࣱ یُخۡزِیهِ وَیَحِلُّ عَلَیۡهِ عَذَابࣱ مُّقِیمٌ\n",
    "translations": {
      "en": "But in time you will come to know who it is that [in this world] shall be visited by suffering which will cover him with ignominy, and upon whom long lasting suffering shall alight [in the life to come]!\"",
      "ms": "Maka kamu akan mengetahui siapakah yang akan didatangi azab yang menghinakannya di dunia, dan yang akan ditimpakan pula dengan azab yang kekal pada hari akhirat kelak\".",
      "id": "Kelak kamu akan mengetahui siapa yang akan ditimpa oleh azab yang menghinakannya dan yang akan ditimpa azab yang kekal\".",
      "ar": "فَسَوۡفَ تَعۡلَمُونَ مَن یَأۡتِیهِ عَذَابࣱ یُخۡزِیهِ وَیَحِلُّ عَلَیۡهِ عَذَابࣱ مُّقِیمٌ\n"
    }
  },
  {
    "id": 1513,
    "surahId": 11,
    "ayahNumber": 40,
    "arabicText": "حَتَّىٰۤ إِذَا جَاۤءَ أَمۡرُنَا وَفَارَ ٱلتَّنُّورُ قُلۡنَا ٱحۡمِلۡ فِیهَا مِن كُلࣲّ زَوۡجَیۡنِ ٱثۡنَیۡنِ وَأَهۡلَكَ إِلَّا مَن سَبَقَ عَلَیۡهِ ٱلۡقَوۡلُ وَمَنۡ ءَامَنَۚ وَمَاۤ ءَامَنَ مَعَهُۥۤ إِلَّا قَلِیلࣱ\n",
    "translations": {
      "en": "[And so it went on] till, when Our judgment came to pass, and waters gushed forth in torrents over the face of the earth, We said [unto Noah]: \"Place on board of this [ark] one pair of each [kind of animal] of either sex, as well as thy family -except those on whom [Our] sentence has already been passed -and all [others] who have attained to faith!\"-for, only a few [of Noah's people] shared his faith.",
      "ms": "(Nabi Nuh terus bekerja) sehingga apabila datang hukum Kami untuk membinasakan mereka dan air memancut-mancut dari muka bumi (yang menandakan kedatangan taufan), Kami berfirman kepada Nabi Nuh: \"Bawalah dalam bahtera itu dua dari tiap-tiap sejenis haiwan (jantan dan betina), dan bawalah ahlimu kecuali orang yang telah ditetapkan hukuman azab atasnya (disebabkan kekufurannya), juga bawalah orang-orang beriman\". Dan tidak ada orang-orang yang beriman yang turut bersama-samanya, melainkan sedikit sahaja.",
      "id": "Hingga apabila perintah Kami datang dan dapur telah memancarkan air, Kami berfirman: \"Muatkanlah ke dalam bahtera itu dari masing-masing binatang sepasang (jantan dan betina), dan keluargamu kecuali orang yang telah terdahulu ketetapan terhadapnya dan (muatkan pula) orang-orang yang beriman\". Dan tidak beriman bersama dengan Nuh itu kecuali sedikit.",
      "ar": "حَتَّىٰۤ إِذَا جَاۤءَ أَمۡرُنَا وَفَارَ ٱلتَّنُّورُ قُلۡنَا ٱحۡمِلۡ فِیهَا مِن كُلࣲّ زَوۡجَیۡنِ ٱثۡنَیۡنِ وَأَهۡلَكَ إِلَّا مَن سَبَقَ عَلَیۡهِ ٱلۡقَوۡلُ وَمَنۡ ءَامَنَۚ وَمَاۤ ءَامَنَ مَعَهُۥۤ إِلَّا قَلِیلࣱ\n"
    }
  },
  {
    "id": 1514,
    "surahId": 11,
    "ayahNumber": 41,
    "arabicText": "۞ وَقَالَ ٱرۡكَبُوا۟ فِیهَا بِسۡمِ ٱللَّهِ مَجۡرٜىٰهَا وَمُرۡسَىٰهَاۤۚ إِنَّ رَبِّی لَغَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "So he said [unto his followers]: \"Embark in this [ship]! In the name of God be its run and its riding at anchor! Behold, my. Sustainer is indeed much-forgiving, a dispenser of grace!\"",
      "ms": "Dan (ketika itu) berkatalah Nabi Nuh (kepada pengikut-pengikutnya yang beriman): \"Naiklah kamu ke bahtera itu sambil berkata: ' Dengan nama Allah bergerak lajunya dan berhentinya '. Sesungguhnya Tuhanku adalah Maha Pengampun, lagi Maha Mengasihani.\"",
      "id": "Dan Nuh berkata: \"Naiklah kamu sekalian ke dalamnya dengan menyebut nama Allah di waktu berlayar dan berlabuhnya\". Sesungguhnya Tuhanku benar-benar Maha Pengampun lagi Maha Penyayang.",
      "ar": "۞ وَقَالَ ٱرۡكَبُوا۟ فِیهَا بِسۡمِ ٱللَّهِ مَجۡرٜىٰهَا وَمُرۡسَىٰهَاۤۚ إِنَّ رَبِّی لَغَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 1515,
    "surahId": 11,
    "ayahNumber": 42,
    "arabicText": "وَهِیَ تَجۡرِی بِهِمۡ فِی مَوۡجࣲ كَٱلۡجِبَالِ وَنَادَىٰ نُوحٌ ٱبۡنَهُۥ وَكَانَ فِی مَعۡزِلࣲ یَـٰبُنَیَّ ٱرۡكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلۡكَـٰفِرِینَ\n",
    "translations": {
      "en": "And it moved on with them into waves that were like mountains. At that [moment] Noah cried out to a son of his, who had kept himself aloof [from the others]: \"O my dear son! Embark with us, and remain not with those who deny the truth!\"",
      "ms": "(Mereka semua naik) dan bahtera itupun bergerak laju membawa mereka dalam ombak yang seperti gunung-ganang, dan (sebelum itu) Nabi Nuh memanggil anaknya, yang sedang berada di tempat yang terpisah daripadanya: \"Wahai anakku, naiklah bersama-sama kami, dan janganlah engkau tinggal dengan orang-orang yang kafir\".",
      "id": "Dan bahtera itu berlayar membawa mereka dalam gelombang laksana gunung. Dan Nuh memanggil anaknya, sedang anak itu berada di tempat yang jauh terpencil: \"Hai anakku, naiklah (ke kapal) bersama kami dan janganlah kamu berada bersama orang-orang yang kafir\".",
      "ar": "وَهِیَ تَجۡرِی بِهِمۡ فِی مَوۡجࣲ كَٱلۡجِبَالِ وَنَادَىٰ نُوحٌ ٱبۡنَهُۥ وَكَانَ فِی مَعۡزِلࣲ یَـٰبُنَیَّ ٱرۡكَب مَّعَنَا وَلَا تَكُن مَّعَ ٱلۡكَـٰفِرِینَ\n"
    }
  },
  {
    "id": 1516,
    "surahId": 11,
    "ayahNumber": 43,
    "arabicText": "قَالَ سَـَٔاوِیۤ إِلَىٰ جَبَلࣲ یَعۡصِمُنِی مِنَ ٱلۡمَاۤءِۚ قَالَ لَا عَاصِمَ ٱلۡیَوۡمَ مِنۡ أَمۡرِ ٱللَّهِ إِلَّا مَن رَّحِمَۚ وَحَالَ بَیۡنَهُمَا ٱلۡمَوۡجُ فَكَانَ مِنَ ٱلۡمُغۡرَقِینَ\n",
    "translations": {
      "en": "[But the son] answered: \"I shall betake myself to a mountain that will protect me from the waters.\" Said [Noah]: \"Today there is no protection [for anyone] from God's judgment, save [for] those who have earned [His] mercy!\" And a wave rose up between them, and [the son] was among those who were drowned.",
      "ms": "Anaknya menjawab: \"Aku akan pergi berlindung ke sebuah gunung yang dapat menyelamatkan aku daripada ditenggelamkan oleh air\". Nabi Nuh berkata: \"Hari ini tidak ada sesuatupun yang akan dapat melindungi dari azab Allah, kecuali orang yang dikasihani olehNya\". Dan dengan serta-merta ombak itu pun memisahkan antara keduanya, lalu menjadilah ia (anak yang derhaka itu) dari orang-orang yang ditenggelamkan oleh taufan.",
      "id": "Anaknya menjawab: \"Aku akan mencari perlindungan ke gunung yang dapat memeliharaku dari air bah!\" Nuh berkata: \"Tidak ada yang melindungi hari ini dari azab Allah selain Allah (saja) Yang Maha Penyayang\". Dan gelombang menjadi penghalang antara keduanya; maka jadilah anak itu termasuk orang-orang yang ditenggelamkan.",
      "ar": "قَالَ سَـَٔاوِیۤ إِلَىٰ جَبَلࣲ یَعۡصِمُنِی مِنَ ٱلۡمَاۤءِۚ قَالَ لَا عَاصِمَ ٱلۡیَوۡمَ مِنۡ أَمۡرِ ٱللَّهِ إِلَّا مَن رَّحِمَۚ وَحَالَ بَیۡنَهُمَا ٱلۡمَوۡجُ فَكَانَ مِنَ ٱلۡمُغۡرَقِینَ\n"
    }
  },
  {
    "id": 1517,
    "surahId": 11,
    "ayahNumber": 44,
    "arabicText": "وَقِیلَ یَـٰۤأَرۡضُ ٱبۡلَعِی مَاۤءَكِ وَیَـٰسَمَاۤءُ أَقۡلِعِی وَغِیضَ ٱلۡمَاۤءُ وَقُضِیَ ٱلۡأَمۡرُ وَٱسۡتَوَتۡ عَلَى ٱلۡجُودِیِّۖ وَقِیلَ بُعۡدࣰا لِّلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "And the word was spoken: \"O earth, swallow up thy waters! And, O sky, cease [thy rain]!\" And the waters sank into the earth, and the will [of God] was done, and the ark came to rest on Mount Judl And the word was spoken: \"Away with these evildoing folk!\"",
      "ms": "Dan (setelah binasanya kaum kafir itu) diperintahkan kepada bumi dan langit dengan berkata: \"Wahai bumi telanlah airmu, dan wahai langit berhentilah dari curahan hujanmu\". Dan (ketika itu) surutlah air, serta terlaksanalah perintah (Allah) itu. Dan bahtera Nabi Nuh itupun berhenti di atas gunung \"Judi\" serta diingatkan (kepada kaum kafir umumnya bahawa): \"Kebinasaanlah akhirnya bagi orang-orang yang zalim\".",
      "id": "Dan difirmankan: \"Hai bumi telanlah airmu, dan hai langit (hujan) berhentilah,\" dan airpun disurutkan, perintahpun diselesaikan dan bahtera itupun berlabuh di atas bukit Judi, dan dikatakan: \"Binasalah orang-orang yang zalim\".",
      "ar": "وَقِیلَ یَـٰۤأَرۡضُ ٱبۡلَعِی مَاۤءَكِ وَیَـٰسَمَاۤءُ أَقۡلِعِی وَغِیضَ ٱلۡمَاۤءُ وَقُضِیَ ٱلۡأَمۡرُ وَٱسۡتَوَتۡ عَلَى ٱلۡجُودِیِّۖ وَقِیلَ بُعۡدࣰا لِّلۡقَوۡمِ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1518,
    "surahId": 11,
    "ayahNumber": 45,
    "arabicText": "وَنَادَىٰ نُوحࣱ رَّبَّهُۥ فَقَالَ رَبِّ إِنَّ ٱبۡنِی مِنۡ أَهۡلِی وَإِنَّ وَعۡدَكَ ٱلۡحَقُّ وَأَنتَ أَحۡكَمُ ٱلۡحَـٰكِمِینَ\n",
    "translations": {
      "en": "And Noah called out to his Sustainer, and said: \"O my Sustainer! Verily, my son was of my family; and, verily, Thy promise always comes true, and Thou art the most just of all judges!\"",
      "ms": "Dan Nabi Nuh merayu kepada Tuhannya dengan berkata: \"Wahai Tuhanku! Sesungguhnya anakku itu dari keluargaku sendiri, dan bahawa janjiMu itu adalah benar, dan Engkau adalah sebijak-bijak Hakim yang menghukum dengan seadil-adilnya\".",
      "id": "Dan Nuh berseru kepada Tuhannya sambil berkata: \"Ya Tuhanku, sesungguhnya anakku termasuk keluargaku, dan sesungguhnya janji Engkau itulah yang benar. Dan Engkau adalah Hakim yang seadil-adilnya\".",
      "ar": "وَنَادَىٰ نُوحࣱ رَّبَّهُۥ فَقَالَ رَبِّ إِنَّ ٱبۡنِی مِنۡ أَهۡلِی وَإِنَّ وَعۡدَكَ ٱلۡحَقُّ وَأَنتَ أَحۡكَمُ ٱلۡحَـٰكِمِینَ\n"
    }
  },
  {
    "id": 1519,
    "surahId": 11,
    "ayahNumber": 46,
    "arabicText": "قَالَ یَـٰنُوحُ إِنَّهُۥ لَیۡسَ مِنۡ أَهۡلِكَۖ إِنَّهُۥ عَمَلٌ غَیۡرُ صَـٰلِحࣲۖ فَلَا تَسۡـَٔلۡنِ مَا لَیۡسَ لَكَ بِهِۦ عِلۡمٌۖ إِنِّیۤ أَعِظُكَ أَن تَكُونَ مِنَ ٱلۡجَـٰهِلِینَ\n",
    "translations": {
      "en": "[God] answered: \"O Noah, behold, he was not of thy family, for, verily, he was unrighteous in his conduct. And thou shalt not ask of Me anything whereof thou canst not have any knowledge: thus, behold, do I admonish thee lest thou become one of those who are unaware [of what is right].\"",
      "ms": "Allah berfirman: \"Wahai Nuh! Sesungguhnya anakmu itu bukanlah dari keluargamu (kerana ia telah terputus hubungan denganmu disebabkan kekufurannya); sesungguhnya bawaannya bukanlah amal yang soleh, maka janganlah engkau memohon kepadaKu sesuatu yang engkau tidak mempunyai pengetahuan mengenainya. Sebenarnya Aku melarangmu dari menjadi orang yang jahil\".",
      "id": "Allah berfirman: \"Hai Nuh, sesungguhnya dia bukanlah termasuk keluargamu (yang dijanjikan akan diselamatkan), sesungguhnya (perbuatan)nya perbuatan yang tidak baik. Sebab itu janganlah kamu memohon kepada-Ku sesuatu yang kamu tidak mengetahui (hakekat)nya. Sesungguhnya Aku memperingatkan kepadamu supaya kamu jangan termasuk orang-orang yang tidak berpengetahuan\".",
      "ar": "قَالَ یَـٰنُوحُ إِنَّهُۥ لَیۡسَ مِنۡ أَهۡلِكَۖ إِنَّهُۥ عَمَلٌ غَیۡرُ صَـٰلِحࣲۖ فَلَا تَسۡـَٔلۡنِ مَا لَیۡسَ لَكَ بِهِۦ عِلۡمٌۖ إِنِّیۤ أَعِظُكَ أَن تَكُونَ مِنَ ٱلۡجَـٰهِلِینَ\n"
    }
  },
  {
    "id": 1520,
    "surahId": 11,
    "ayahNumber": 47,
    "arabicText": "قَالَ رَبِّ إِنِّیۤ أَعُوذُ بِكَ أَنۡ أَسۡـَٔلَكَ مَا لَیۡسَ لِی بِهِۦ عِلۡمࣱۖ وَإِلَّا تَغۡفِرۡ لِی وَتَرۡحَمۡنِیۤ أَكُن مِّنَ ٱلۡخَـٰسِرِینَ\n",
    "translations": {
      "en": "Said [Noah]: \"O my Sustainer! Verily, I seek refuge with Thee from [ever again] asking of Thee anything whereof I cannot have any knowledge! For unless Thou grant me forgiveness and bestow Thy mercy upon me, I shall be among the lost!\"",
      "ms": "Nabi Nuh berkata: \"Wahai Tuhanku! Sesungguhnya aku berlindung kepadaMu daripada memohon sesuatu yang aku tidak mempunyai pengetahuan mengenainya; dan jika Engkau tidak mengampunkan dosaku, dan memberi rahmat kepadaku, nescaya menjadilah aku dari orang-orang yang rugi\".",
      "id": "Nuh berkata: Ya Tuhanku, sesungguhnya aku berlindung kepada Engkau dari memohon kepada Engkau sesuatu yang aku tiada mengetahui (hakekat)nya. Dan sekiranya Engkau tidak memberi ampun kepadaku, dan (tidak) menaruh belas kasihan kepadaku, niscaya aku akan termasuk orang-orang yang merugi\".",
      "ar": "قَالَ رَبِّ إِنِّیۤ أَعُوذُ بِكَ أَنۡ أَسۡـَٔلَكَ مَا لَیۡسَ لِی بِهِۦ عِلۡمࣱۖ وَإِلَّا تَغۡفِرۡ لِی وَتَرۡحَمۡنِیۤ أَكُن مِّنَ ٱلۡخَـٰسِرِینَ\n"
    }
  },
  {
    "id": 1521,
    "surahId": 11,
    "ayahNumber": 48,
    "arabicText": "قِیلَ یَـٰنُوحُ ٱهۡبِطۡ بِسَلَـٰمࣲ مِّنَّا وَبَرَكَـٰتٍ عَلَیۡكَ وَعَلَىٰۤ أُمَمࣲ مِّمَّن مَّعَكَۚ وَأُمَمࣱ سَنُمَتِّعُهُمۡ ثُمَّ یَمَسُّهُم مِّنَّا عَذَابٌ أَلِیمࣱ\n",
    "translations": {
      "en": "[Thereupon] the word was spoken: \"O Noah! Disembark in peace from Us, and with [Our] blessings upon thee as well as upon the people [who are with thee, and the righteous ones that will spring from thee and] from those who are with thee. But [as for the unrighteous] folk [that will spring from you] - We shall allow them to enjoy life [for a little while], and then there will befall them grievous suffering from Us.\"",
      "ms": "Allah berfirman: Wahai Nuh! Turunlah (dari bahtera itu) dengan selamat dan berkat dari Kami kepadamu dan kepada umat-umat yang bersama-samamu. Dan (dalam pada itu) ada umat-umat dari keturunan mereka yang Kami akan beri kesenangan kepadanya (dalam kehidupan dunia), kemudian mereka akan dikenakan azab dari Kami yang tidak terperi sakitnya\".",
      "id": "Difirmankan: \"Hai Nuh, turunlah dengan selamat sejahtera dan penuh keberkatan dari Kami atasmu dan atas umat-umat (yang mukmin) dari orang-orang yang bersamamu. Dan ada (pula) umat-umat yang Kami beri kesenangan pada mereka (dalam kehidupan dunia), kemudian mereka akan ditimpa azab yang pedih dari Kami\".",
      "ar": "قِیلَ یَـٰنُوحُ ٱهۡبِطۡ بِسَلَـٰمࣲ مِّنَّا وَبَرَكَـٰتٍ عَلَیۡكَ وَعَلَىٰۤ أُمَمࣲ مِّمَّن مَّعَكَۚ وَأُمَمࣱ سَنُمَتِّعُهُمۡ ثُمَّ یَمَسُّهُم مِّنَّا عَذَابٌ أَلِیمࣱ\n"
    }
  },
  {
    "id": 1522,
    "surahId": 11,
    "ayahNumber": 49,
    "arabicText": "تِلۡكَ مِنۡ أَنۢبَاۤءِ ٱلۡغَیۡبِ نُوحِیهَاۤ إِلَیۡكَۖ مَا كُنتَ تَعۡلَمُهَاۤ أَنتَ وَلَا قَوۡمُكَ مِن قَبۡلِ هَـٰذَاۖ فَٱصۡبِرۡۖ إِنَّ ٱلۡعَـٰقِبَةَ لِلۡمُتَّقِینَ\n",
    "translations": {
      "en": "THESE ACCOUNTS of something that was beyond the reach of thy perception We [now] reveal unto thee, [O Muhammad: for] neither thou nor thy people knew them [fully] ere this. Be, then, [like Noah,] patient in adversity - for, behold, the future belongs to the God-conscious!",
      "ms": "(Kisah Nabi Nuh) itu adalah dari perkara-perkara yang ghaib yang Kami wahyukan kepadamu (wahai Muhammad), yang engkau dan kaum engkau tidak mengetahuinya sebelum ini. Oleh itu, bersabarlah. Sesungguhnya kesudahan yang baik (yang membawa kejayaan di dunia dan kebahagiaan di akhirat) adalah bagi orang-orang yang bertaqwa.",
      "id": "Itu adalah di antara berita-berita penting tentang yang ghaib yang Kami wahyukan kepadamu (Muhammad); tidak pernah kamu mengetahuinya dan tidak (pula) kaummu sebelum ini. Maka bersabarlah; sesungguhnya kesudahan yang baik adalah bagi orang-orang yang bertakwa.",
      "ar": "تِلۡكَ مِنۡ أَنۢبَاۤءِ ٱلۡغَیۡبِ نُوحِیهَاۤ إِلَیۡكَۖ مَا كُنتَ تَعۡلَمُهَاۤ أَنتَ وَلَا قَوۡمُكَ مِن قَبۡلِ هَـٰذَاۖ فَٱصۡبِرۡۖ إِنَّ ٱلۡعَـٰقِبَةَ لِلۡمُتَّقِینَ\n"
    }
  },
  {
    "id": 1523,
    "surahId": 11,
    "ayahNumber": 50,
    "arabicText": "وَإِلَىٰ عَادٍ أَخَاهُمۡ هُودࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۤۖ إِنۡ أَنتُمۡ إِلَّا مُفۡتَرُونَ\n",
    "translations": {
      "en": "AND UNTO [the tribe of] `Ad [We sent] their brother Hud. He said: \"O my people! Worship God [alone]: you have no deity other than Him. [As it is,] you are but inventors of falsehood!",
      "ms": "Dan kepada kaum Aad, Kami utuskan saudara mereka: Nabi hud ia berkata: \"Wahai kaumku! Sembahlah kamu akan Allah! Sebenarnya tiada Tuhan bagi kamu selain daripadaNya. kamu hanyalah orang-orang yang mengada-adakan perkara-perkara yang dusta (terhadap Allah).",
      "id": "Dan kepada kaum 'Ad (Kami utus) saudara mereka, Huud. Ia berkata: \"Hai kaumku, sembahlah Allah, sekali-kali tidak ada bagimu Tuhan selain Dia. Kamu hanyalah mengada-adakan saja.",
      "ar": "وَإِلَىٰ عَادٍ أَخَاهُمۡ هُودࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۤۖ إِنۡ أَنتُمۡ إِلَّا مُفۡتَرُونَ\n"
    }
  },
  {
    "id": 1524,
    "surahId": 11,
    "ayahNumber": 51,
    "arabicText": "یَـٰقَوۡمِ لَاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ أَجۡرًاۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱلَّذِی فَطَرَنِیۤۚ أَفَلَا تَعۡقِلُونَ\n",
    "translations": {
      "en": "\"O my people! No reward do I ask of you for this [message]: my reward rests with none but Him who brought me into being. Will you not, then, use your reason?",
      "ms": "Wahai kaumku! Tiadalah aku meminta sebarang upah daripada kamu tentang (ajaran yang aku sampaikan) itu. Upahku hanyalah dari Allah yang menciptakan daku; maka mengapa kamu tidak mahu menggunakan akal (untuk mengetahui kebenaran)?",
      "id": "Hai kaumku, aku tidak meminta upah kepadamu bagi seruanku ini. Upahku tidak lain hanyalah dari Allah yang telah menciptakanku. Maka tidakkah kamu memikirkan(nya)?\"",
      "ar": "یَـٰقَوۡمِ لَاۤ أَسۡـَٔلُكُمۡ عَلَیۡهِ أَجۡرًاۖ إِنۡ أَجۡرِیَ إِلَّا عَلَى ٱلَّذِی فَطَرَنِیۤۚ أَفَلَا تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1525,
    "surahId": 11,
    "ayahNumber": 52,
    "arabicText": "وَیَـٰقَوۡمِ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِ یُرۡسِلِ ٱلسَّمَاۤءَ عَلَیۡكُم مِّدۡرَارࣰا وَیَزِدۡكُمۡ قُوَّةً إِلَىٰ قُوَّتِكُمۡ وَلَا تَتَوَلَّوۡا۟ مُجۡرِمِینَ\n",
    "translations": {
      "en": "\"Hence, O my people, ask your Sustainer to forgive you your sins, and then turn towards Him in repentance-[whereupon] He will shower upon you heavenly blessings abundant, and will add strength to your strength: only do not turn away [from me] as people lost in sin!\"",
      "ms": "Dan wahai kaumku! Mintalah ampun kepada Tuhan kamu, kemudian kembalilah taat kepadaNya, supaya Ia menghantarkan kepada kamu hujan lebat serta menambahkan kamu kekuatan di samping kekuatan kamu yang sedia ada; dan janganlah kamu membelakangkan seruanku dengan terus melakukan dosa!",
      "id": "Dan (dia berkata): \"Hai kaumku, mohonlah ampun kepada Tuhanmu lalu bertobatlah kepada-Nya, niscaya Dia menurunkan hujan yang sangat deras atasmu, dan Dia akan menambahkan kekuatan kepada kekuatanmu, dan janganlah kamu berpaling dengan berbuat dosa\".",
      "ar": "وَیَـٰقَوۡمِ ٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِ یُرۡسِلِ ٱلسَّمَاۤءَ عَلَیۡكُم مِّدۡرَارࣰا وَیَزِدۡكُمۡ قُوَّةً إِلَىٰ قُوَّتِكُمۡ وَلَا تَتَوَلَّوۡا۟ مُجۡرِمِینَ\n"
    }
  },
  {
    "id": 1526,
    "surahId": 11,
    "ayahNumber": 53,
    "arabicText": "قَالُوا۟ یَـٰهُودُ مَا جِئۡتَنَا بِبَیِّنَةࣲ وَمَا نَحۡنُ بِتَارِكِیۤ ءَالِهَتِنَا عَن قَوۡلِكَ وَمَا نَحۡنُ لَكَ بِمُؤۡمِنِینَ\n",
    "translations": {
      "en": "Said they: \"O Hud! Thou hast brought us no clear evidence [that thou art a prophet]; and we are not going to forsake our gods on thy mere word, the more so as we do not believe thee.",
      "ms": "Mereka berkata: \"Wahai Hud! Engkau tidak membawa kepada kami sebarang keterangan yang membuktikan kebenaranmu, dan kami tidak akan meninggalkan penyembahan tuhan-tuhan kami dengan sebab kata-katamu itu! Dan kami tidak sekali-kali percaya kepadamu!",
      "id": "Kaum 'Ad berkata: \"Hai Huud, kamu tidak mendatangkan kepada kami suatu bukti yang nyata, dan kami sekali-kali tidak akan meninggalkan sembahan-sembahan kami karena perkataanmu, dan kami sekali-kali tidak akan mempercayai kamu.",
      "ar": "قَالُوا۟ یَـٰهُودُ مَا جِئۡتَنَا بِبَیِّنَةࣲ وَمَا نَحۡنُ بِتَارِكِیۤ ءَالِهَتِنَا عَن قَوۡلِكَ وَمَا نَحۡنُ لَكَ بِمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1527,
    "surahId": 11,
    "ayahNumber": 54,
    "arabicText": "إِن نَّقُولُ إِلَّا ٱعۡتَرَىٰكَ بَعۡضُ ءَالِهَتِنَا بِسُوۤءࣲۗ قَالَ إِنِّیۤ أُشۡهِدُ ٱللَّهَ وَٱشۡهَدُوۤا۟ أَنِّی بَرِیۤءࣱ مِّمَّا تُشۡرِكُونَ\n",
    "translations": {
      "en": "We can say no more than that one of our gods may have smitten thee with something evil!\" Answered [Hud]: \"Behold, I call God to witness - and you, too, be [my] witnesses - that, verily, it is not in me to ascribe divinity, as you do, to aught",
      "ms": "\" Kami hanya boleh berkata bahawa setengah dari tuhan-tuhan kami telah mengenakanmu sesuatu penyakit gila (disebabkan engkau selalu mencaci penyembahan kami itu)\". Nabi Hud menjawab: \"Sesungguhnya aku menyeru Allah menjadi saksi tentang kebenaranku, dan kamu juga saksikanlah bahawa aku bersih dari dosa perbuatan syirik kamu -",
      "id": "Kami tidak mengatakan melainkan bahwa sebagian sembahan kami telah menimpakan penyakit gila atas dirimu\". Huud menjawab: \"Sesungguhnya aku bersaksi kepada Allah dan saksikanlah olehmu sekalian bahwa sesungguhnya aku berlepas diri dari apa yang kamu persekutukan,",
      "ar": "إِن نَّقُولُ إِلَّا ٱعۡتَرَىٰكَ بَعۡضُ ءَالِهَتِنَا بِسُوۤءࣲۗ قَالَ إِنِّیۤ أُشۡهِدُ ٱللَّهَ وَٱشۡهَدُوۤا۟ أَنِّی بَرِیۤءࣱ مِّمَّا تُشۡرِكُونَ\n"
    }
  },
  {
    "id": 1528,
    "surahId": 11,
    "ayahNumber": 55,
    "arabicText": "مِن دُونِهِۦۖ فَكِیدُونِی جَمِیعࣰا ثُمَّ لَا تُنظِرُونِ\n",
    "translations": {
      "en": "beside Him! Contrive, then, [anything that you may wish] against me, all of you, and give me no respite!",
      "ms": "\" Menyembah yang lain dari Allah. Maka rancangkanlah tipu helah kamu semua terhadapku, kemudian jalankan terus, janganlah kamu beri tempoh kepadaku mempertahankan diri.",
      "id": "dari selain-Nya, sebab itu jalankanlah tipu dayamu semuanya terhadapku dan janganlah kamu memberi tangguh kepadaku.",
      "ar": "مِن دُونِهِۦۖ فَكِیدُونِی جَمِیعࣰا ثُمَّ لَا تُنظِرُونِ\n"
    }
  },
  {
    "id": 1529,
    "surahId": 11,
    "ayahNumber": 56,
    "arabicText": "إِنِّی تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّی وَرَبِّكُمۚ مَّا مِن دَاۤبَّةٍ إِلَّا هُوَ ءَاخِذُۢ بِنَاصِیَتِهَاۤۚ إِنَّ رَبِّی عَلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "Behold, I have placed my trust in God, [who is] my Sustainer as well as your Sustainer: for there is no living creature which He does not hold by its forelock. Verily, straight is my Sustainer's way!",
      "ms": "\" Kerana sesungguhnya aku telah berserah diri kepada Allah, Tuhanku dan Tuhan kamu! Tiadalah sesuatupun dari makhluk-makhluk yang bergerak di muka bumi melainkan Allah jualah yang menguasainya. Sesungguhnya Tuhanku tetap di atas jalan yang lurus.",
      "id": "Sesungguhnya aku bertawakkal kepada Allah Tuhanku dan Tuhanmu. Tidak ada suatu binatang melatapun melainkan Dialah yang memegang ubun-ubunnya. Sesungguhnya Tuhanku di atas jalan yang lurus\".",
      "ar": "إِنِّی تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّی وَرَبِّكُمۚ مَّا مِن دَاۤبَّةٍ إِلَّا هُوَ ءَاخِذُۢ بِنَاصِیَتِهَاۤۚ إِنَّ رَبِّی عَلَىٰ صِرَ ٰ⁠طࣲ مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 1530,
    "surahId": 11,
    "ayahNumber": 57,
    "arabicText": "فَإِن تَوَلَّوۡا۟ فَقَدۡ أَبۡلَغۡتُكُم مَّاۤ أُرۡسِلۡتُ بِهِۦۤ إِلَیۡكُمۡۚ وَیَسۡتَخۡلِفُ رَبِّی قَوۡمًا غَیۡرَكُمۡ وَلَا تَضُرُّونَهُۥ شَیۡـًٔاۚ إِنَّ رَبِّی عَلَىٰ كُلِّ شَیۡءٍ حَفِیظࣱ\n",
    "translations": {
      "en": "\"But if you choose to turn away, then [know that] I have delivered to you the message with which I was sent unto you, and [that] my Sustainer may cause another people to take your place, whereas you will in no wise harm Him. Verily, my Sustainer watches over all things!\"",
      "ms": "Dalam pada itu, jika kamu membelakangkan juga seruanku, maka tidaklah menjadi hal kepadaku kerana aku telah sampaikan kepada kamu apa yang telah diutus oleh Allah untuk menyampaikannya, dan Tuhanku akan menggantikan kamu dengan suatu kaum yang lain (setelah kamu dibinasakan); dan kamu pula tidak akan dapat membahayakanNya sedikitpun. Sesungguhnya Tuhanku Maha Pengawal dan Pemulihara tiap-tiap sesuatu.\"",
      "id": "Jika kamu berpaling, maka sesungguhnya aku telah menyampaikan kepadamu apa (amanat) yang aku diutus (untuk menyampaikan)nya kepadamu. Dan Tuhanku akan mengganti (kamu) dengan kaum yang lain (dari) kamu; dan kamu tidak dapat membuat mudharat kepada-Nya sedikitpun. Sesungguhnya Tuhanku adalah Maha Pemelihara segala sesuatu.",
      "ar": "فَإِن تَوَلَّوۡا۟ فَقَدۡ أَبۡلَغۡتُكُم مَّاۤ أُرۡسِلۡتُ بِهِۦۤ إِلَیۡكُمۡۚ وَیَسۡتَخۡلِفُ رَبِّی قَوۡمًا غَیۡرَكُمۡ وَلَا تَضُرُّونَهُۥ شَیۡـًٔاۚ إِنَّ رَبِّی عَلَىٰ كُلِّ شَیۡءٍ حَفِیظࣱ\n"
    }
  },
  {
    "id": 1531,
    "surahId": 11,
    "ayahNumber": 58,
    "arabicText": "وَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا هُودࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَنَجَّیۡنَـٰهُم مِّنۡ عَذَابٍ غَلِیظࣲ\n",
    "translations": {
      "en": "And so, when Our judgment came to pass, by Our grace We saved Hud and those who shared his faith; and We saved them [too] from suffering severe [in the life to come].",
      "ms": "Dan apabila datang azab Kami, Kami selamatkan Nabi Hud beserta dengan umatnya yang beriman, dengan rahmat dari Kami; dan Kami selamatkan mereka dari azab yang keras.",
      "id": "Dan tatkala datang azab Kami, Kami selamatkan Huud dan orang-orang yang beriman bersama dia dengan rahmat dari Kami; dan Kami selamatkan (pula) mereka (di akhirat) dari azab yang berat.",
      "ar": "وَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا هُودࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَنَجَّیۡنَـٰهُم مِّنۡ عَذَابٍ غَلِیظࣲ\n"
    }
  },
  {
    "id": 1532,
    "surahId": 11,
    "ayahNumber": 59,
    "arabicText": "وَتِلۡكَ عَادࣱۖ جَحَدُوا۟ بِـَٔایَـٰتِ رَبِّهِمۡ وَعَصَوۡا۟ رُسُلَهُۥ وَٱتَّبَعُوۤا۟ أَمۡرَ كُلِّ جَبَّارٍ عَنِیدࣲ\n",
    "translations": {
      "en": "And that was [the end of the tribe of] `Ad, [who] had rejected their Sustainer's messages, and rebelled against His apostles, and followed the bidding of every arrogant enemy of the truth.",
      "ms": "Dan itulah peristiwa kaum Aad mereka mengingkari ayat-ayat keterangan Tuhan mereka, serta mereka menderhaka kepada Rasul-rasulnya; dan mereka menurut perintah tiap-tiap ketua yang bermaharajalela, lagi degil dalam keingkarannya.",
      "id": "Dan itulah (kisah) kaum 'Ad yang mengingkari tanda-tanda kekuasaan Tuhan mereka, dan mendurhakai rasul-rasul Allah dan mereka menuruti perintah semua penguasa yang sewenang-wenang lagi menentang (kebenaran).",
      "ar": "وَتِلۡكَ عَادࣱۖ جَحَدُوا۟ بِـَٔایَـٰتِ رَبِّهِمۡ وَعَصَوۡا۟ رُسُلَهُۥ وَٱتَّبَعُوۤا۟ أَمۡرَ كُلِّ جَبَّارٍ عَنِیدࣲ\n"
    }
  },
  {
    "id": 1533,
    "surahId": 11,
    "ayahNumber": 60,
    "arabicText": "وَأُتۡبِعُوا۟ فِی هَـٰذِهِ ٱلدُّنۡیَا لَعۡنَةࣰ وَیَوۡمَ ٱلۡقِیَـٰمَةِۗ أَلَاۤ إِنَّ عَادࣰا كَفَرُوا۟ رَبَّهُمۡۗ أَلَا بُعۡدࣰا لِّعَادࣲ قَوۡمِ هُودࣲ\n",
    "translations": {
      "en": "And they were pursued in this world by [God's] rejection, and [shall finally be overtaken by it] on the Day of Resurrection. Oh, verily, [the tribe of] `Ad denied their Sustainer! Oh, away with the `Ad, the people of Hud!",
      "ms": "Dan mereka ditimpa laknat (yang tidak putus-putus) dalam dunia ini dan pada hari kiamat. Ketahuilah Sesungguhnya kaum Aad itu telah kufur ingkar kepada Tuhan mereka ketahuilah! Sesungguhnya kebinasaanlah akhirnya bagi Aad: kaum Nabi Hud.",
      "id": "Dan mereka selalu diikuti dengan kutukan di dunia ini dan (begitu pula) di hari kiamat. Ingatlah, sesungguhnya kaum 'Ad itu kafir kepada Tuhan mereka. Ingatlah kebinasaanlah bagi kaum 'Ad (yaitu) kaum Huud itu.",
      "ar": "وَأُتۡبِعُوا۟ فِی هَـٰذِهِ ٱلدُّنۡیَا لَعۡنَةࣰ وَیَوۡمَ ٱلۡقِیَـٰمَةِۗ أَلَاۤ إِنَّ عَادࣰا كَفَرُوا۟ رَبَّهُمۡۗ أَلَا بُعۡدࣰا لِّعَادࣲ قَوۡمِ هُودࣲ\n"
    }
  },
  {
    "id": 1534,
    "surahId": 11,
    "ayahNumber": 61,
    "arabicText": "۞ وَإِلَىٰ ثَمُودَ أَخَاهُمۡ صَـٰلِحࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۖ هُوَ أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ وَٱسۡتَعۡمَرَكُمۡ فِیهَا فَٱسۡتَغۡفِرُوهُ ثُمَّ تُوبُوۤا۟ إِلَیۡهِۚ إِنَّ رَبِّی قَرِیبࣱ مُّجِیبࣱ\n",
    "translations": {
      "en": "AND UNTO [the tribe of] Thamud [We sent] their brother Salih. He said: \"O my people! Worship God [alone]: you have no deity other than Him. He brought you into being out of the earth, and made you thrive thereon. Ask Him, therefore, to forgive you your sins, and then turn towards Him in repentance-for, verily, my Sustainer is ever-near, responding [to the call of whoever calls unto Him]!\"",
      "ms": "Dan kepada kaum Thamud, kami utuskan saudara mereka: Nabi Soleh. Ia berkata: \"Wahai kaumku! Sembahlah kamu akan Allah! Sebenarnya tiada Tuhan bagi kamu selain daripadaNya. Dia lah yang menjadikan kamu dari bahan-bahan bumi, serta menghendaki kamu memakmurkannya. Oleh itu mintalah ampun kepada Allah dari perbuatan syirik, kemudian kembalilah kepadaNya dengan taat dan tauhid. Sesungguhnya Tuhanku sentiasa dekat, lagi sentiasa memperkenankan permohonan hambaNya\".",
      "id": "Dan kepada Tsamud (Kami utus) saudara mereka Shaleh. Shaleh berkata: \"Hai kaumku, sembahlah Allah, sekali-kali tidak ada bagimu Tuhan selain Dia. Dia telah menciptakan kamu dari bumi (tanah) dan menjadikan kamu pemakmurnya, karena itu mohonlah ampunan-Nya, kemudian bertobatlah kepada-Nya, Sesungguhnya Tuhanku amat dekat (rahmat-Nya) lagi memperkenankan (doa hamba-Nya)\".",
      "ar": "۞ وَإِلَىٰ ثَمُودَ أَخَاهُمۡ صَـٰلِحࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۖ هُوَ أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ وَٱسۡتَعۡمَرَكُمۡ فِیهَا فَٱسۡتَغۡفِرُوهُ ثُمَّ تُوبُوۤا۟ إِلَیۡهِۚ إِنَّ رَبِّی قَرِیبࣱ مُّجِیبࣱ\n"
    }
  },
  {
    "id": 1535,
    "surahId": 11,
    "ayahNumber": 62,
    "arabicText": "قَالُوا۟ یَـٰصَـٰلِحُ قَدۡ كُنتَ فِینَا مَرۡجُوࣰّا قَبۡلَ هَـٰذَاۤۖ أَتَنۡهَىٰنَاۤ أَن نَّعۡبُدَ مَا یَعۡبُدُ ءَابَاۤؤُنَا وَإِنَّنَا لَفِی شَكࣲّ مِّمَّا تَدۡعُونَاۤ إِلَیۡهِ مُرِیبࣲ\n",
    "translations": {
      "en": "They answered: \"O Salih! Great hopes did we place in thee ere this! Wouldst thou forbid us to worship what our forefathers were wont to worship? Because [of this], behold, we are in grave doubt, amounting to suspicion, about [the meaning of] thy call to us!\"",
      "ms": "Mereka menjawab dengan berkata: \"Wahai Soleh, sesungguhnya engkau sebelum ini adalah orang yang diharap dalam kalangan kami (untuk memimpin kami); patutkah engkau melarang kami daripada menyembah apa yang disembah oleh datuk nenek kami? Dan (ketahuilah) sesungguhnya kami berada dalam keadaan ragu-ragu yang merunsingkan tentang apa yang engkau serukan kami kepadanya\".",
      "id": "Kaum Tsamud berkata: \"Hai Shaleh, sesungguhnya kamu sebelum ini adalah seorang di antara kami yang kami harapkan, apakah kamu melarang kami untuk menyembah apa yang disembah oleh bapak-bapak kami? dan sesungguhnya kami betul-betul dalam keraguan yang menggelisahkan terhadap agama yang kamu serukan kepada kami\".",
      "ar": "قَالُوا۟ یَـٰصَـٰلِحُ قَدۡ كُنتَ فِینَا مَرۡجُوࣰّا قَبۡلَ هَـٰذَاۤۖ أَتَنۡهَىٰنَاۤ أَن نَّعۡبُدَ مَا یَعۡبُدُ ءَابَاۤؤُنَا وَإِنَّنَا لَفِی شَكࣲّ مِّمَّا تَدۡعُونَاۤ إِلَیۡهِ مُرِیبࣲ\n"
    }
  },
  {
    "id": 1536,
    "surahId": 11,
    "ayahNumber": 63,
    "arabicText": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَءَاتَىٰنِی مِنۡهُ رَحۡمَةࣰ فَمَن یَنصُرُنِی مِنَ ٱللَّهِ إِنۡ عَصَیۡتُهُۥۖ فَمَا تَزِیدُونَنِی غَیۡرَ تَخۡسِیرࣲ\n",
    "translations": {
      "en": "He retorted: \"O my people! What do you think? If [it be true that] I am taking my stand on a cleat evidence from my Sustainer, who has vouchsafed unto me grace from Himself -[if this be true,] who would shield me from God were I to rebel against Him? Hence, what you are offering me is no more than perdition!\"",
      "ms": "Nabi Soleh berkata: \"Wahai kaumku! Bagaimana fikiran kamu, jika aku berada dalam kebenaran yang berdasarkan bukti yang nyata (mukjzat) dari Tuhanku, dan Ia pula mengurniakan rahmat (pangkat Nabi) kepadaku sebagai pemberian daripadaNya, maka siapakah yang akan menolongku dari azab Allah kalau aku menderhaka kepadaNya? Oleh itu, kamu tidak menambah sesuatu kebaikan pun bagiku selain daripada perkara yang merugikan.",
      "id": "Shaleh berkata: \"Hai kaumku, bagaimana pikiranmu jika aku mempunyai bukti yang nyata dari Tuhanku dan diberi-Nya aku rahmat (kenabian) dari-Nya, maka siapakah yang akan menolong aku dari (azab) Allah jika aku mendurhakai-Nya. Sebab itu kamu tidak menambah apapun kepadaku selain daripada kerugian.",
      "ar": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَءَاتَىٰنِی مِنۡهُ رَحۡمَةࣰ فَمَن یَنصُرُنِی مِنَ ٱللَّهِ إِنۡ عَصَیۡتُهُۥۖ فَمَا تَزِیدُونَنِی غَیۡرَ تَخۡسِیرࣲ\n"
    }
  },
  {
    "id": 1537,
    "surahId": 11,
    "ayahNumber": 64,
    "arabicText": "وَیَـٰقَوۡمِ هَـٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَایَةࣰۖ فَذَرُوهَا تَأۡكُلۡ فِیۤ أَرۡضِ ٱللَّهِۖ وَلَا تَمَسُّوهَا بِسُوۤءࣲ فَیَأۡخُذَكُمۡ عَذَابࣱ قَرِیبࣱ\n",
    "translations": {
      "en": "And [then he said]: \"O my people! This she-camel belonging to God shall be a token for you: so leave her alone to pasture on God's earth, and do her no harm, lest speedy chastisement befall you!\"",
      "ms": "\" Dan wahai kaumku! Ini adalah unta betina dari Allah untuk kamu sebagai tanda (mukjizat) yang membuktikan kebenaranku. Oleh itu, biarkanlah dia mencari makan di bumi Allah dan janganlah kamu menyentuhnya dengan sesuatu yang menyakitinya, (kalau kamu menyakitinya) maka kamu akan ditimpa azab seksa yang dekat masa datangnya\".",
      "id": "Hai kaumku, inilah unta betina dari Allah, sebagai mukjizat (yang menunjukkan kebenaran) untukmu, sebab itu biarkanlah dia makan di bumi Allah, dan janganlah kamu mengganggunya dengan gangguan apapun yang akan menyebabkan kamu ditimpa azab yang dekat\".",
      "ar": "وَیَـٰقَوۡمِ هَـٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَایَةࣰۖ فَذَرُوهَا تَأۡكُلۡ فِیۤ أَرۡضِ ٱللَّهِۖ وَلَا تَمَسُّوهَا بِسُوۤءࣲ فَیَأۡخُذَكُمۡ عَذَابࣱ قَرِیبࣱ\n"
    }
  },
  {
    "id": 1538,
    "surahId": 11,
    "ayahNumber": 65,
    "arabicText": "فَعَقَرُوهَا فَقَالَ تَمَتَّعُوا۟ فِی دَارِكُمۡ ثَلَـٰثَةَ أَیَّامࣲۖ ذَ ٰ⁠لِكَ وَعۡدٌ غَیۡرُ مَكۡذُوبࣲ\n",
    "translations": {
      "en": "But they cruelly slaughtered her. And thereupon [Salih] said: \"[Only] for three days [more] shall you enjoy life in your homes: this is a judgment which will not be belied!\"",
      "ms": "Mereka kemudiannya menyembelih unta itu, lalu berkatalah Nabi Soleh kepada mereka: Bersenang-senanglah kamu di tempat masing-masing selama tiga hari; tempoh yang demikian itu, ialah suatu janji yang tidak dapat didustakan\".",
      "id": "Mereka membunuh unta itu, maka berkata Shaleh: \"Bersukarialah kamu sekalian di rumahmu selama tiga hari, itu adalah janji yang tidak dapat didustakan\".",
      "ar": "فَعَقَرُوهَا فَقَالَ تَمَتَّعُوا۟ فِی دَارِكُمۡ ثَلَـٰثَةَ أَیَّامࣲۖ ذَ ٰ⁠لِكَ وَعۡدٌ غَیۡرُ مَكۡذُوبࣲ\n"
    }
  },
  {
    "id": 1539,
    "surahId": 11,
    "ayahNumber": 66,
    "arabicText": "فَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا صَـٰلِحࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَمِنۡ خِزۡیِ یَوۡمِىِٕذٍۚ إِنَّ رَبَّكَ هُوَ ٱلۡقَوِیُّ ٱلۡعَزِیزُ\n",
    "translations": {
      "en": "And so, when Our judgment came to pass, by Our grace We saved Salih and those who shared his faith; and [We saved them, too,] from the ignominy of [Our rejection on] that Day [of Resurrection]. Verily, thy Sustainer alone is powerful, almighty!",
      "ms": "Maka ketika datang azab kami, kami selamatkan Soleh beserta umatnya yang beriman, dengan rahmat dari Kami, dan Kami selamatkan mereka dari azab serta kehinaan hari itu. Sesungguhnya Tuhanmu, Dia lah Yang Maha Kuat, lagi Maha Kuasa.",
      "id": "Maka tatkala datang azab Kami, Kami selamatkan Shaleh beserta orang-orang yang beriman bersama dia dengan rahmat dari Kami dan dari kehinaan di hari itu. Sesungguhnya Tuhanmu Dia-Lah yang Maha Kuat lagi Maha Perkasa.",
      "ar": "فَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا صَـٰلِحࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَمِنۡ خِزۡیِ یَوۡمِىِٕذٍۚ إِنَّ رَبَّكَ هُوَ ٱلۡقَوِیُّ ٱلۡعَزِیزُ\n"
    }
  },
  {
    "id": 1540,
    "surahId": 11,
    "ayahNumber": 67,
    "arabicText": "وَأَخَذَ ٱلَّذِینَ ظَلَمُوا۟ ٱلصَّیۡحَةُ فَأَصۡبَحُوا۟ فِی دِیَـٰرِهِمۡ جَـٰثِمِینَ\n",
    "translations": {
      "en": "And the blast [of God's punishment] overtook those who had been bent on evildoing: and then they lay lifeless, in their very homes, on the ground,",
      "ms": "Dan orang-orang yang zalim itu, dibinasakan oleh satu letusan suara yang menggempakan bumi, lalu menjadilah mereka mayat-mayat yang tersungkur di tempat tinggal masing-masing.",
      "id": "Dan satu suara keras yang mengguntur menimpa orang-orang yang zalim itu, lalu mereka mati bergelimpangan di rumahnya,",
      "ar": "وَأَخَذَ ٱلَّذِینَ ظَلَمُوا۟ ٱلصَّیۡحَةُ فَأَصۡبَحُوا۟ فِی دِیَـٰرِهِمۡ جَـٰثِمِینَ\n"
    }
  },
  {
    "id": 1541,
    "surahId": 11,
    "ayahNumber": 68,
    "arabicText": "كَأَن لَّمۡ یَغۡنَوۡا۟ فِیهَاۤۗ أَلَاۤ إِنَّ ثَمُودَا۟ كَفَرُوا۟ رَبَّهُمۡۗ أَلَا بُعۡدࣰا لِّثَمُودَ\n",
    "translations": {
      "en": "as though they had never lived there. Oh, verily, [the tribe of] Thamud denied their Sustainer! Oh, away with the Thamud!",
      "ms": "(Mereka punah-ranah) seolah-olah mereka tidak pernah tinggal di situ. Ketahuilah! Sesungguhnya kaum Thamud itu kufurkan Tuhan mereka. Ketahuilah! Sesungguhnya kebinasaanlah akhirnya bagi kaum Thamud.",
      "id": "seolah-olah mereka belum pernah berdiam di tempat itu. Ingatlah, sesungguhnya kaum Tsamud mengingkari Tuhan mereka. Ingatlah, kebinasaanlah bagi kaum Tsamud.",
      "ar": "كَأَن لَّمۡ یَغۡنَوۡا۟ فِیهَاۤۗ أَلَاۤ إِنَّ ثَمُودَا۟ كَفَرُوا۟ رَبَّهُمۡۗ أَلَا بُعۡدࣰا لِّثَمُودَ\n"
    }
  },
  {
    "id": 1542,
    "surahId": 11,
    "ayahNumber": 69,
    "arabicText": "وَلَقَدۡ جَاۤءَتۡ رُسُلُنَاۤ إِبۡرَ ٰ⁠هِیمَ بِٱلۡبُشۡرَىٰ قَالُوا۟ سَلَـٰمࣰاۖ قَالَ سَلَـٰمࣱۖ فَمَا لَبِثَ أَن جَاۤءَ بِعِجۡلٍ حَنِیذࣲ\n",
    "translations": {
      "en": "AND, INDEED, there came unto Abraham Our [heavenly] messengers, bearing a glad tiding. They bade him peace; [and] he answered, \"[And upon you be] peace!\"-and made haste to place before them a roasted calf.",
      "ms": "Dan sesungguhnya telah datang malaikat utusan-utusan kami kepada Nabi Ibrahim, dengan membawa berita yang mengembirakan. Lalu mereka memberi salam dengan berkata: \"Salam sejahtera kepadamu (wahai Ibrahim)\". Nabi Ibrahim menjawab: \"Salam sejahtera kepada kamu\". Maka tidak berapa lama selepas itu, ia membawa jamuan untuk mereka: seekor anak lembu yang dipanggang.",
      "id": "Dan sesungguhnya utusan-utusan Kami (malaikat-malaikat) telah datang kepada lbrahim dengan membawa kabar gembira, mereka mengucapkan: \"Selamat\". Ibrahim menjawab: \"Selamatlah,\" maka tidak lama kemudian Ibrahim menyuguhkan daging anak sapi yang dipanggang.",
      "ar": "وَلَقَدۡ جَاۤءَتۡ رُسُلُنَاۤ إِبۡرَ ٰ⁠هِیمَ بِٱلۡبُشۡرَىٰ قَالُوا۟ سَلَـٰمࣰاۖ قَالَ سَلَـٰمࣱۖ فَمَا لَبِثَ أَن جَاۤءَ بِعِجۡلٍ حَنِیذࣲ\n"
    }
  },
  {
    "id": 1543,
    "surahId": 11,
    "ayahNumber": 70,
    "arabicText": "فَلَمَّا رَءَاۤ أَیۡدِیَهُمۡ لَا تَصِلُ إِلَیۡهِ نَكِرَهُمۡ وَأَوۡجَسَ مِنۡهُمۡ خِیفَةࣰۚ قَالُوا۟ لَا تَخَفۡ إِنَّاۤ أُرۡسِلۡنَاۤ إِلَىٰ قَوۡمِ لُوطࣲ\n",
    "translations": {
      "en": "But when he saw that their hands did not reach out towards it, he deemed their conduct strange and became apprehensive of them. [But] they said: \"Fear not! Behold, we are sent to the people of Lot.",
      "ms": "Maka apabila ia melihat tangan mereka tidak menyentuh hidangan itu, ia merasa pelik akan hal mereka serta merasa takut dari keadaan mereka. (Melihat kecemasannya) mereka berkata: \"Janganlah engkau takut wahai Ibrahim, sebenarnya kami ini diutus kepada kaum Lut (untuk membinasakan mereka)\".",
      "id": "Maka tatkala dilihatnya tangan mereka tidak menjamahnya, Ibrahim memandang aneh perbuatan mereka, dan merasa takut kepada mereka. Malaikat itu berkata: \"Jangan kamu takut, sesungguhnya kami adalah (malaikat-ma]aikat) yang diutus kepada kaum Luth\".",
      "ar": "فَلَمَّا رَءَاۤ أَیۡدِیَهُمۡ لَا تَصِلُ إِلَیۡهِ نَكِرَهُمۡ وَأَوۡجَسَ مِنۡهُمۡ خِیفَةࣰۚ قَالُوا۟ لَا تَخَفۡ إِنَّاۤ أُرۡسِلۡنَاۤ إِلَىٰ قَوۡمِ لُوطࣲ\n"
    }
  },
  {
    "id": 1544,
    "surahId": 11,
    "ayahNumber": 71,
    "arabicText": "وَٱمۡرَأَتُهُۥ قَاۤىِٕمَةࣱ فَضَحِكَتۡ فَبَشَّرۡنَـٰهَا بِإِسۡحَـٰقَ وَمِن وَرَاۤءِ إِسۡحَـٰقَ یَعۡقُوبَ\n",
    "translations": {
      "en": "And his wife, standing [nearby], laughed [with happiness]; whereupon We gave her the glad tiding of [the birth of] Isaac and, after Isaac, of [his son] Jacob.",
      "ms": "Dan isterinya pada ketika itu berdiri (mendengar), lalu ia ketawa (kerana hilang perasaan takutnya). Maka Kami pun memberikan berita yang mengembirakan kepadanya (melalui malaikat itu), bahawa ia akan mendapat seorang anak: Ishak, dan sesudah Ishak, (ia pula akan mendapat seorang cucu): Yaakub.",
      "id": "Dan isterinya berdiri (dibalik tirai) lalu dia tersenyum, maka Kami sampaikan kepadanya berita gembira tentang (kelahiran) Ishak dan dari Ishak (akan lahir puteranya) Ya'qub.",
      "ar": "وَٱمۡرَأَتُهُۥ قَاۤىِٕمَةࣱ فَضَحِكَتۡ فَبَشَّرۡنَـٰهَا بِإِسۡحَـٰقَ وَمِن وَرَاۤءِ إِسۡحَـٰقَ یَعۡقُوبَ\n"
    }
  },
  {
    "id": 1545,
    "surahId": 11,
    "ayahNumber": 72,
    "arabicText": "قَالَتۡ یَـٰوَیۡلَتَىٰۤ ءَأَلِدُ وَأَنَا۠ عَجُوزࣱ وَهَـٰذَا بَعۡلِی شَیۡخًاۖ إِنَّ هَـٰذَا لَشَیۡءٌ عَجِیبࣱ\n",
    "translations": {
      "en": "Said she: \"Oh, woe is me! Shall I bear a child, now that I am an old woman and this husband of mine is an old man? Verily, that would be a strange thing indeed!\"",
      "ms": "Isterinya berkata: \"Sungguh ajaib keadaanku! Adakah aku akan melahirkan anak padahal aku sudah tua dan suamiku ini juga sudah tua? Sesungguhnya kejadian ini suatu perkara yang menghairankan\".",
      "id": "Isterinya berkata: \"Sungguh mengherankan, apakah aku akan melahirkan anak padahal aku adalah seorang perempuan tua, dan ini suamikupun dalam keadaan yang sudah tua pula?. Sesungguhnya ini benar-benar suatu yang sangat aneh\".",
      "ar": "قَالَتۡ یَـٰوَیۡلَتَىٰۤ ءَأَلِدُ وَأَنَا۠ عَجُوزࣱ وَهَـٰذَا بَعۡلِی شَیۡخًاۖ إِنَّ هَـٰذَا لَشَیۡءٌ عَجِیبࣱ\n"
    }
  },
  {
    "id": 1546,
    "surahId": 11,
    "ayahNumber": 73,
    "arabicText": "قَالُوۤا۟ أَتَعۡجَبِینَ مِنۡ أَمۡرِ ٱللَّهِۖ رَحۡمَتُ ٱللَّهِ وَبَرَكَـٰتُهُۥ عَلَیۡكُمۡ أَهۡلَ ٱلۡبَیۡتِۚ إِنَّهُۥ حَمِیدࣱ مَّجِیدࣱ\n",
    "translations": {
      "en": "Answered [the messengers]: \"Dost thou deem it strange that God should decree what He wills? The grace of God and His blessings be upon you, O people of this house! Verily, ever to be praised, sublime is He!\"",
      "ms": "Malaikat-malaikat itu berkata: \"Patutkah engkau merasa hairan tentang perkara yang telah ditetapkan oleh Allah? Memanglah rahmat Allah dan berkatNya melimpah-limpah kepada kamu, wahai ahli rumah ini. Sesungguhnya Allah Maha terpuji, lagi Maha Melimpah kebaikan dan kemurahanNya\".",
      "id": "Para malaikat itu berkata: \"Apakah kamu merasa heran tentang ketetapan Allah? (Itu adalah) rahmat Allah dan keberkatan-Nya, dicurahkan atas kamu, hai ahlulbait! Sesungguhnya Allah Maha Terpuji lagi Maha Pemurah\".",
      "ar": "قَالُوۤا۟ أَتَعۡجَبِینَ مِنۡ أَمۡرِ ٱللَّهِۖ رَحۡمَتُ ٱللَّهِ وَبَرَكَـٰتُهُۥ عَلَیۡكُمۡ أَهۡلَ ٱلۡبَیۡتِۚ إِنَّهُۥ حَمِیدࣱ مَّجِیدࣱ\n"
    }
  },
  {
    "id": 1547,
    "surahId": 11,
    "ayahNumber": 74,
    "arabicText": "فَلَمَّا ذَهَبَ عَنۡ إِبۡرَ ٰ⁠هِیمَ ٱلرَّوۡعُ وَجَاۤءَتۡهُ ٱلۡبُشۡرَىٰ یُجَـٰدِلُنَا فِی قَوۡمِ لُوطٍ\n",
    "translations": {
      "en": "And when the fear had left Abraham, and the glad tiding had been conveyed to him, he began to plead with Us for Lot's people:",
      "ms": "Maka apabila hilang perasaan takut dari hati Nabi Ibrahim, dan sampai kepadanya berita yang mengembirakan itu, (mulailah) ia membantah (utusan-utusan) kami tentang (azab yang akan menimpa) kaum Nabi Lut.",
      "id": "Maka tatkala rasa takut hilang dari Ibrahim dan berita gembira telah datang kepadanya, diapun bersoal jawab dengan (malaikat-malaikat) Kami tentang kaum Luth.",
      "ar": "فَلَمَّا ذَهَبَ عَنۡ إِبۡرَ ٰ⁠هِیمَ ٱلرَّوۡعُ وَجَاۤءَتۡهُ ٱلۡبُشۡرَىٰ یُجَـٰدِلُنَا فِی قَوۡمِ لُوطٍ\n"
    }
  },
  {
    "id": 1548,
    "surahId": 11,
    "ayahNumber": 75,
    "arabicText": "إِنَّ إِبۡرَ ٰ⁠هِیمَ لَحَلِیمٌ أَوَّ ٰ⁠هࣱ مُّنِیبࣱ\n",
    "translations": {
      "en": "for, behold, Abraham was most clement, most tender-hearted, intent upon turning to God again and again.",
      "ms": "Sesungguhnya Nabi Ibrahim, penyabar, lembut hati (bertimbang rasa) lagi suka kembali kepada Allah dengan mengerjakan amal bakti.",
      "id": "Sesungguhnya Ibrahim itu benar-benar seorang yang penyantun lagi penghiba dan suka kembali kepada Allah.",
      "ar": "إِنَّ إِبۡرَ ٰ⁠هِیمَ لَحَلِیمٌ أَوَّ ٰ⁠هࣱ مُّنِیبࣱ\n"
    }
  },
  {
    "id": 1549,
    "surahId": 11,
    "ayahNumber": 76,
    "arabicText": "یَـٰۤإِبۡرَ ٰ⁠هِیمُ أَعۡرِضۡ عَنۡ هَـٰذَاۤۖ إِنَّهُۥ قَدۡ جَاۤءَ أَمۡرُ رَبِّكَۖ وَإِنَّهُمۡ ءَاتِیهِمۡ عَذَابٌ غَیۡرُ مَرۡدُودࣲ\n",
    "translations": {
      "en": "[But God's messengers replied:] \"O Abraham! Desist from this [pleading]! Behold, thy Sustainer's judgment has already gone forth: and, verily, there shall fall upon them a chastisement which none can avert!\"",
      "ms": "(Malaikat-malaikat itu berkata): \"Wahai Ibrahim! Janganlah dihiraukan hal ini. Sesungguhnya telah datang perintah Tuhanmu (menghukum mereka), dan sesungguhnya mereka akan didatangi azab yang tidak akan dapat ditolak (oleh bantahan atau doa permohonan)\".",
      "id": "Hai Ibrahim, tinggalkanlah soal jawab ini, sesungguhnya telah datang ketetapan Tuhanmu, dan sesungguhnya mereka itu akan didatangi azab yang tidak dapat ditolak.",
      "ar": "یَـٰۤإِبۡرَ ٰ⁠هِیمُ أَعۡرِضۡ عَنۡ هَـٰذَاۤۖ إِنَّهُۥ قَدۡ جَاۤءَ أَمۡرُ رَبِّكَۖ وَإِنَّهُمۡ ءَاتِیهِمۡ عَذَابٌ غَیۡرُ مَرۡدُودࣲ\n"
    }
  },
  {
    "id": 1550,
    "surahId": 11,
    "ayahNumber": 77,
    "arabicText": "وَلَمَّا جَاۤءَتۡ رُسُلُنَا لُوطࣰا سِیۤءَ بِهِمۡ وَضَاقَ بِهِمۡ ذَرۡعࣰا وَقَالَ هَـٰذَا یَوۡمٌ عَصِیبࣱ\n",
    "translations": {
      "en": "AND WHEN Our messengers came unto Lot, he was sorely grieved on their account, seeing that it was beyond his power to shield them; and he exclaimed: \"This is a woeful day!\"",
      "ms": "Dan apabila datang utusan-utusan Kami kepada Nabi Lut ia merasa dukacita dengan kedatangan mereka, dan merasa tidak terdaya untuk mengawal mereka (dari gangguan kaumnya), sambil berkata: \"Ini adalah hari yang amat mencemaskan\".",
      "id": "Dan tatkala datang utusan-utusan Kami (para malaikat) itu kepada Luth, dia merasa susah dan merasa sempit dadanya karena kedatangan mereka, dan dia berkata: \"Ini adalah hari yang amat sulit\".",
      "ar": "وَلَمَّا جَاۤءَتۡ رُسُلُنَا لُوطࣰا سِیۤءَ بِهِمۡ وَضَاقَ بِهِمۡ ذَرۡعࣰا وَقَالَ هَـٰذَا یَوۡمٌ عَصِیبࣱ\n"
    }
  },
  {
    "id": 1551,
    "surahId": 11,
    "ayahNumber": 78,
    "arabicText": "وَجَاۤءَهُۥ قَوۡمُهُۥ یُهۡرَعُونَ إِلَیۡهِ وَمِن قَبۡلُ كَانُوا۟ یَعۡمَلُونَ ٱلسَّیِّـَٔاتِۚ قَالَ یَـٰقَوۡمِ هَـٰۤؤُلَاۤءِ بَنَاتِی هُنَّ أَطۡهَرُ لَكُمۡۖ فَٱتَّقُوا۟ ٱللَّهَ وَلَا تُخۡزُونِ فِی ضَیۡفِیۤۖ أَلَیۡسَ مِنكُمۡ رَجُلࣱ رَّشِیدࣱ\n",
    "translations": {
      "en": "And his people came running to him, impelled towards his house [by their desire]: for they had ever been wont to commit [such], abominations. Said [Lot]: \"O my people! [Take instead] these daughters of mine: they are purer for you [than men]! Be, then, conscious of God, and disgrace me not by [assaulting] my guests. Is there not among you even one right-minded man?\"",
      "ms": "Dan kaumnya pun datang meluru kepadanya (dengan tujuan hendak mengganggu tetamunya), sedang mereka sebelum itu sudah biasa melakukan kejahatan. Nabi Lut berkata: \"Wahai kaumku! Di sini ada anak-anak perempuanku mereka lebih suci bagi kamu (maka berkahwinlah dengan mereka). Oleh itu takutlah kamu kepada Allah, dan janganlah kamu memberi malu kepadaku mengenai tetamu-tetamuku. Tidakkah ada di antara kamu seorang lelaki yang bijak berakal (yang dapat memberi nasihat)?\"",
      "id": "Dan datanglah kepadanya kaumnya dengan bergegas-gegas. Dan sejak dahulu mereka selalu melakukan perbuatan-perbuatan yang keji. Luth berkata: \"Hai kaumku, inilah puteri-puteriku, mereka lebih suci bagimu, maka bertakwalah kepada Allah dan janganlah kamu mencemarkan (nama)ku terhadap tamuku ini. Tidak adakah di antaramu seorang yang berakal?\"",
      "ar": "وَجَاۤءَهُۥ قَوۡمُهُۥ یُهۡرَعُونَ إِلَیۡهِ وَمِن قَبۡلُ كَانُوا۟ یَعۡمَلُونَ ٱلسَّیِّـَٔاتِۚ قَالَ یَـٰقَوۡمِ هَـٰۤؤُلَاۤءِ بَنَاتِی هُنَّ أَطۡهَرُ لَكُمۡۖ فَٱتَّقُوا۟ ٱللَّهَ وَلَا تُخۡزُونِ فِی ضَیۡفِیۤۖ أَلَیۡسَ مِنكُمۡ رَجُلࣱ رَّشِیدࣱ\n"
    }
  },
  {
    "id": 1552,
    "surahId": 11,
    "ayahNumber": 79,
    "arabicText": "قَالُوا۟ لَقَدۡ عَلِمۡتَ مَا لَنَا فِی بَنَاتِكَ مِنۡ حَقࣲّ وَإِنَّكَ لَتَعۡلَمُ مَا نُرِیدُ\n",
    "translations": {
      "en": "They answered: \"Thou hast always known that we have no use whatever for thy daughters; and, verily, well dost thou know what we want!\"",
      "ms": "Mereka menjawab: \"Sesungguhnya engkau telahpun mengetahui bahawa kami tidak ada sebarang hajat kepada anak-anak perempuanmu, dan sebenarnya engkau sedia mengetahui akan apa yang kami kehendaki.\"",
      "id": "Mereka menjawab: \"Sesungguhnya kamu telah tahu bahwa kami tidak mempunyai keinginan terhadap puteri-puterimu; dan sesungguhnya kamu tentu mengetahui apa yang sebenarnya kami kehendaki\".",
      "ar": "قَالُوا۟ لَقَدۡ عَلِمۡتَ مَا لَنَا فِی بَنَاتِكَ مِنۡ حَقࣲّ وَإِنَّكَ لَتَعۡلَمُ مَا نُرِیدُ\n"
    }
  },
  {
    "id": 1553,
    "surahId": 11,
    "ayahNumber": 80,
    "arabicText": "قَالَ لَوۡ أَنَّ لِی بِكُمۡ قُوَّةً أَوۡ ءَاوِیۤ إِلَىٰ رُكۡنࣲ شَدِیدࣲ\n",
    "translations": {
      "en": "Exclaimed [Lot]: \"Would that I had the strength to defeat you, or that I could lean upon some mightier support!\"",
      "ms": "Nabi Lut berkata: \"Kalaulah aku ada kekuatan untuk menentang kamu, atau aku dapat bertumpu ke sesuatu tempat bertahan yang kuat (dari penyokong-penyokong, tentulah aku akan membinasakan kamu)\".",
      "id": "Luth berkata: \"Seandainya aku ada mempunyai kekuatan (untuk menolakmu) atau kalau aku dapat berlindung kepada keluarga yang kuat (tentu aku lakukan)\".",
      "ar": "قَالَ لَوۡ أَنَّ لِی بِكُمۡ قُوَّةً أَوۡ ءَاوِیۤ إِلَىٰ رُكۡنࣲ شَدِیدࣲ\n"
    }
  },
  {
    "id": 1554,
    "surahId": 11,
    "ayahNumber": 81,
    "arabicText": "قَالُوا۟ یَـٰلُوطُ إِنَّا رُسُلُ رَبِّكَ لَن یَصِلُوۤا۟ إِلَیۡكَۖ فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعࣲ مِّنَ ٱلَّیۡلِ وَلَا یَلۡتَفِتۡ مِنكُمۡ أَحَدٌ إِلَّا ٱمۡرَأَتَكَۖ إِنَّهُۥ مُصِیبُهَا مَاۤ أَصَابَهُمۡۚ إِنَّ مَوۡعِدَهُمُ ٱلصُّبۡحُۚ أَلَیۡسَ ٱلصُّبۡحُ بِقَرِیبࣲ\n",
    "translations": {
      "en": "[Whereupon the angels] said: \"O Lot! Behold, we are messengers from thy Sustainer! Never shall [thy enemies] attain to thee! Depart, then, with thy household while it is yet night, and let none of you look back; [and take with thee all thy family] with the exception of thy wife: for, behold, that which is to befall these [people of Sodom] shall befall her [as well]. Verily, their appointed time is the morning [and] is not the morning nigh?\"",
      "ms": "(Mendengarkan yang demikian tetamunya berkata: \"Wahai Lut! Sesungguhnya kami (adalah malaikat) utusan Tuhanmu. Kaum engkau yang jahat itu tidak sekali-kali akan dapat melakukan kepadamu (sebarang bencana). Oleh itu, pergilah berundur dari sini bersama-sama dengan keluargamu pada tengah malam, dan janganlah seorangpun di antara kamu menoleh ke belakang. Kecuali isterimu, sesungguhnya ia akan ditimpa azab yang akan menimpa mereka (kerana ia memihak kepada mereka). Sesungguhnya masa yang dijanjikan untuk menimpakan azab kepada mereka ialah waktu subuh; bukankah waktu subuh itu sudah dekat?\"",
      "id": "Para utusan (malaikat) berkata: \"Hai Luth, sesungguhnya kami adalah utusan-utusan Tuhanmu, sekali-kali mereka tidak akan dapat mengganggu kamu, sebab itu pergilah dengan membawa keluarga dan pengikut-pengikut kamu di akhir malam dan janganlah ada seorangpun di antara kamu yang tertinggal, kecuali isterimu. Sesungguhnya dia akan ditimpa azab yang menimpa mereka karena sesungguhnya saat jatuhnya azab kepada mereka ialah di waktu subuh; bukankah subuh itu sudah dekat?\".",
      "ar": "قَالُوا۟ یَـٰلُوطُ إِنَّا رُسُلُ رَبِّكَ لَن یَصِلُوۤا۟ إِلَیۡكَۖ فَأَسۡرِ بِأَهۡلِكَ بِقِطۡعࣲ مِّنَ ٱلَّیۡلِ وَلَا یَلۡتَفِتۡ مِنكُمۡ أَحَدٌ إِلَّا ٱمۡرَأَتَكَۖ إِنَّهُۥ مُصِیبُهَا مَاۤ أَصَابَهُمۡۚ إِنَّ مَوۡعِدَهُمُ ٱلصُّبۡحُۚ أَلَیۡسَ ٱلصُّبۡحُ بِقَرِیبࣲ\n"
    }
  },
  {
    "id": 1555,
    "surahId": 11,
    "ayahNumber": 82,
    "arabicText": "فَلَمَّا جَاۤءَ أَمۡرُنَا جَعَلۡنَا عَـٰلِیَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَیۡهَا حِجَارَةࣰ مِّن سِجِّیلࣲ مَّنضُودࣲ\n",
    "translations": {
      "en": "And so, when Our judgment came to pass, We turned those [sinful towns] upside down, and rained down upon them stone-hard blows of chastisement pre-ordained. one upon another,",
      "ms": "Maka apabila datang (masa perlaksanaan) perintah Kami, Kami jadikan negeri kaum Lut itu diterbalikkan (tertimbus segala yang ada di muka buminya) dan kami menghujaninya dengan batu-batu dari tanah yang dibakar, menimpanya bertalu-talu.",
      "id": "Maka tatkala datang azab Kami, Kami jadikan negeri kaum Luth itu yang di atas ke bawah (Kami balikkan), dan Kami hujani mereka dengan batu dari tanah yang terbakar dengan bertubi-tubi,",
      "ar": "فَلَمَّا جَاۤءَ أَمۡرُنَا جَعَلۡنَا عَـٰلِیَهَا سَافِلَهَا وَأَمۡطَرۡنَا عَلَیۡهَا حِجَارَةࣰ مِّن سِجِّیلࣲ مَّنضُودࣲ\n"
    }
  },
  {
    "id": 1556,
    "surahId": 11,
    "ayahNumber": 83,
    "arabicText": "مُّسَوَّمَةً عِندَ رَبِّكَۖ وَمَا هِیَ مِنَ ٱلظَّـٰلِمِینَ بِبَعِیدࣲ\n",
    "translations": {
      "en": "marked out in thy Sustainer's sight [for the punishment of such as are lost in sin]. And these [blows of God-willed doom] are never far from evildoers",
      "ms": "Batu-batu itu ditandakan di sisi Tuhanmu (untuk membinasakan mereka), dan Ia pula tidaklah jauh dari orang-orang yang zalim itu.",
      "id": "Yang diberi tanda oleh Tuhanmu, dan siksaan itu tiadalah jauh dari orang-orang yang zalim.",
      "ar": "مُّسَوَّمَةً عِندَ رَبِّكَۖ وَمَا هِیَ مِنَ ٱلظَّـٰلِمِینَ بِبَعِیدࣲ\n"
    }
  },
  {
    "id": 1557,
    "surahId": 11,
    "ayahNumber": 84,
    "arabicText": "۞ وَإِلَىٰ مَدۡیَنَ أَخَاهُمۡ شُعَیۡبࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۖ وَلَا تَنقُصُوا۟ ٱلۡمِكۡیَالَ وَٱلۡمِیزَانَۖ إِنِّیۤ أَرَىٰكُم بِخَیۡرࣲ وَإِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمࣲ مُّحِیطࣲ\n",
    "translations": {
      "en": "AND UNTO [the people of] Madyan [We sent] their brother Shu'ayb. He said: \"O my people! Worship God [alone]: you have no deity other than Him; and do not give short measure and weight [in any of your dealings with men]. Behold, I see you [now] in a happy state; but, verily, I dread lest suffering befall you on a Day that will encompass [you with doom]!",
      "ms": "Dan kepada penduduk \"Madyan\" Kami utuskan saudara mereka: Nabi Syuaib. Ia berkata: \"Wahai kaumku! Sembahlah kamu akan Allah! (Sebenarnya) tiada Tuhan bagi kamu selain daripadaNya. Dan janganlah kamu mengurangi sukatan dan timbangan. Sesungguhnya aku melihat kamu berada dalam kemewahan; dan sesungguhnya aku bimbang, kamu akan ditimpa azab hari yang meliputi (orang-orang yang bersalah).",
      "id": "Dan kepada (penduduk) Mad-yan (Kami utus) saudara mereka, Syu'aib. Ia berkata: \"Hai kaumku, sembahlah Allah, sekali-kali tiada Tuhan bagimu selain Dia. Dan janganlah kamu kurangi takaran dan timbangan, sesungguhnya aku melihat kamu dalam keadaan yang baik (mampu) dan sesungguhnya aku khawatir terhadapmu akan azab hari yang membinasakan (kiamat)\".",
      "ar": "۞ وَإِلَىٰ مَدۡیَنَ أَخَاهُمۡ شُعَیۡبࣰاۚ قَالَ یَـٰقَوۡمِ ٱعۡبُدُوا۟ ٱللَّهَ مَا لَكُم مِّنۡ إِلَـٰهٍ غَیۡرُهُۥۖ وَلَا تَنقُصُوا۟ ٱلۡمِكۡیَالَ وَٱلۡمِیزَانَۖ إِنِّیۤ أَرَىٰكُم بِخَیۡرࣲ وَإِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمࣲ مُّحِیطࣲ\n"
    }
  },
  {
    "id": 1558,
    "surahId": 11,
    "ayahNumber": 85,
    "arabicText": "وَیَـٰقَوۡمِ أَوۡفُوا۟ ٱلۡمِكۡیَالَ وَٱلۡمِیزَانَ بِٱلۡقِسۡطِۖ وَلَا تَبۡخَسُوا۟ ٱلنَّاسَ أَشۡیَاۤءَهُمۡ وَلَا تَعۡثَوۡا۟ فِی ٱلۡأَرۡضِ مُفۡسِدِینَ\n",
    "translations": {
      "en": "Hence, O my people, [always] give full measure and weight, with equity, and do not deprive people of what is rightfully theirs, and do not act wickedly on earth by spreading corruption.",
      "ms": "Dan wahai kaumku! Sempurnakanlah sukatan dan timbangan dengan adil dan janganlah kamu kurangkan manusia akan benda-benda yang menjadi haknya, dan janganlah kamu merebakkan bencana kerosakan di muka bumi.",
      "id": "Dan Syu'aib berkata: \"Hai kaumku, cukupkanlah takaran dan timbangan dengan adil, dan janganlah kamu merugikan manusia terhadap hak-hak mereka dan janganlah kamu membuat kejahatan di muka bumi dengan membuat kerusakan.",
      "ar": "وَیَـٰقَوۡمِ أَوۡفُوا۟ ٱلۡمِكۡیَالَ وَٱلۡمِیزَانَ بِٱلۡقِسۡطِۖ وَلَا تَبۡخَسُوا۟ ٱلنَّاسَ أَشۡیَاۤءَهُمۡ وَلَا تَعۡثَوۡا۟ فِی ٱلۡأَرۡضِ مُفۡسِدِینَ\n"
    }
  },
  {
    "id": 1559,
    "surahId": 11,
    "ayahNumber": 86,
    "arabicText": "بَقِیَّتُ ٱللَّهِ خَیۡرࣱ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِینَۚ وَمَاۤ أَنَا۠ عَلَیۡكُم بِحَفِیظࣲ\n",
    "translations": {
      "en": "That which rests with God is best for you, if you but believe [in Him]! However, I am not your keeper.\"",
      "ms": "Limpah kurnia Allah kepada kamu lebih baik bagi kamu (daripada yang kamu ambil secara haram itu), jika betul kamu orang-orang yang beriman. Dan aku bukanlah orang yang menjaga dan mengawas perbuatan kamu\".",
      "id": "Sisa (keuntungan) dari Allah adalah lebih baik bagimu jika kamu orang-orang yang beriman. Dan aku bukanlah seorang penjaga atas dirimu\"",
      "ar": "بَقِیَّتُ ٱللَّهِ خَیۡرࣱ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِینَۚ وَمَاۤ أَنَا۠ عَلَیۡكُم بِحَفِیظࣲ\n"
    }
  },
  {
    "id": 1560,
    "surahId": 11,
    "ayahNumber": 87,
    "arabicText": "قَالُوا۟ یَـٰشُعَیۡبُ أَصَلَوٰتُكَ تَأۡمُرُكَ أَن نَّتۡرُكَ مَا یَعۡبُدُ ءَابَاۤؤُنَاۤ أَوۡ أَن نَّفۡعَلَ فِیۤ أَمۡوَ ٰ⁠لِنَا مَا نَشَـٰۤؤُا۟ۖ إِنَّكَ لَأَنتَ ٱلۡحَلِیمُ ٱلرَّشِیدُ\n",
    "translations": {
      "en": "Said they: \"O Shu'ayb! Does thy [habit of] praying compel thee to demand of us that we give up all that our forefathers were wont to worship, or that we refrain from doing whatever we please with our possessions? Behold, [thou wouldst have us believe that] thou art indeed the only clement, the only right-minded man!\"",
      "ms": "Mereka berkata: \"Wahai Syuaib! Adakah sembahyangmu (yang banyak itu) menyuruhmu perintahkan kami supaya meninggalkan apa yang disembah oleh datuk nenek kami, atau supaya kami lakukannya apa yang kami suka melakukannya dalam menguruskan harta kami? Sesungguhnya engkau (wahai Syuaib) adalah orang yang penyabar, lagi bijak berakal (maka bagaimana pula engkau menyuruh kami melakukan perkara yang bertentangan dengan kebiasaan kami)?\"",
      "id": "Mereka berkata: \"Hai Syu'aib, apakah sembahyangmu menyuruh kamu agar kami meninggalkan apa yang disembah oleh bapak-bapak kami atau melarang kami memperbuat apa yang kami kehendaki tentang harta kami. Sesungguhnya kamu adalah orang yang sangat penyantun lagi berakal\".",
      "ar": "قَالُوا۟ یَـٰشُعَیۡبُ أَصَلَوٰتُكَ تَأۡمُرُكَ أَن نَّتۡرُكَ مَا یَعۡبُدُ ءَابَاۤؤُنَاۤ أَوۡ أَن نَّفۡعَلَ فِیۤ أَمۡوَ ٰ⁠لِنَا مَا نَشَـٰۤؤُا۟ۖ إِنَّكَ لَأَنتَ ٱلۡحَلِیمُ ٱلرَّشِیدُ\n"
    }
  },
  {
    "id": 1561,
    "surahId": 11,
    "ayahNumber": 88,
    "arabicText": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَرَزَقَنِی مِنۡهُ رِزۡقًا حَسَنࣰاۚ وَمَاۤ أُرِیدُ أَنۡ أُخَالِفَكُمۡ إِلَىٰ مَاۤ أَنۡهَىٰكُمۡ عَنۡهُۚ إِنۡ أُرِیدُ إِلَّا ٱلۡإِصۡلَـٰحَ مَا ٱسۡتَطَعۡتُۚ وَمَا تَوۡفِیقِیۤ إِلَّا بِٱللَّهِۚ عَلَیۡهِ تَوَكَّلۡتُ وَإِلَیۡهِ أُنِیبُ\n",
    "translations": {
      "en": "He answered: \"O my people! What do you think? If [it be true that] I am taking my stand on a clear evidence from my Sustainer, who has vouchsafed me goodly sustenance [as a gift] from Himself - [how could I speak to you otherwise than I do]? And yet, I have no desire to do, out of opposition to you, what I am asking you not to do: I desire no more than to set things to rights in so far as it lies within my power; but the achievement of my aim depends on God alone. In Him have I placed my trust, and unto Him do I always turn!",
      "ms": "Nabi Syuaib berkata: \"Wahai kaumku! Bagaimana fikiran kamu, jika aku berdasarkan bukti yang nyata dari Tuhanku, dan Ia pula mengurniakan daku pangkat Nabi sebagai pemberian daripadaNya, (patutkah aku berdiam diri dari melarang kamu) sedang aku tidak bertujuan hendak melakukan sesuatu yang aku melarang kamu daripada melakukannya? Aku hanya bertujuan hendak memperbaiki sedaya upayaku; dan tiadalah aku akan beroleh taufik untuk menjayakannya melainkan dengan pertolongan Allah. Kepada Allah jualah aku berserah diri dan kepadaNyalah aku kembali.",
      "id": "Syu'aib berkata: \"Hai kaumku, bagaimana pikiranmu jika aku mempunyai bukti yang nyata dari Tuhanku dan dianugerahi-Nya aku dari pada-Nya rezeki yang baik (patutkah aku menyalahi perintah-Nya)? Dan aku tidak berkehendak menyalahi kamu (dengan mengerjakan) apa yang aku larang. Aku tidak bermaksud kecuali (mendatangkan) perbaikan selama aku masih berkesanggupan. Dan tidak ada taufik bagiku melainkan dengan (pertolongan) Allah. Hanya kepada Allah aku bertawakkal dan hanya kepada-Nya-lah aku kembali.",
      "ar": "قَالَ یَـٰقَوۡمِ أَرَءَیۡتُمۡ إِن كُنتُ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّی وَرَزَقَنِی مِنۡهُ رِزۡقًا حَسَنࣰاۚ وَمَاۤ أُرِیدُ أَنۡ أُخَالِفَكُمۡ إِلَىٰ مَاۤ أَنۡهَىٰكُمۡ عَنۡهُۚ إِنۡ أُرِیدُ إِلَّا ٱلۡإِصۡلَـٰحَ مَا ٱسۡتَطَعۡتُۚ وَمَا تَوۡفِیقِیۤ إِلَّا بِٱللَّهِۚ عَلَیۡهِ تَوَكَّلۡتُ وَإِلَیۡهِ أُنِیبُ\n"
    }
  },
  {
    "id": 1562,
    "surahId": 11,
    "ayahNumber": 89,
    "arabicText": "وَیَـٰقَوۡمِ لَا یَجۡرِمَنَّكُمۡ شِقَاقِیۤ أَن یُصِیبَكُم مِّثۡلُ مَاۤ أَصَابَ قَوۡمَ نُوحٍ أَوۡ قَوۡمَ هُودٍ أَوۡ قَوۡمَ صَـٰلِحࣲۚ وَمَا قَوۡمُ لُوطࣲ مِّنكُم بِبَعِیدࣲ\n",
    "translations": {
      "en": "\"And, O my people, let not [your] dissent from me drive you into sin, lest there befall you the like of what befell the people of Noah, or the people of Hud. or the people of Salih: and [remember that] the people of Lot lived not very far from you!\"",
      "ms": "Dan wahai kaumku! Janganlah permusuhan kamu terhadapku menyebabkan kamu ditimpa bala bencana sebagaimana yang telah menimpa kaum Nabi Nuh, atau kaum Nabi Hud, atau kaum Nabi Soleh. Dan kaum Nabi Lut pun tidaklah jauh dari kamu (kamu sedia mengetahui apa yang telah menimpa mereka).",
      "id": "Hai kaumku, janganlah hendaknya pertentangan antara aku (dengan kamu) menyebabkan kamu menjadi jahat hingga kamu ditimpa azab seperti yang menimpa kaum Nuh atau kaum Hud atau kaum Shaleh, sedang kaum Luth tidak (pula) jauh (tempatnya) dari kamu.",
      "ar": "وَیَـٰقَوۡمِ لَا یَجۡرِمَنَّكُمۡ شِقَاقِیۤ أَن یُصِیبَكُم مِّثۡلُ مَاۤ أَصَابَ قَوۡمَ نُوحٍ أَوۡ قَوۡمَ هُودٍ أَوۡ قَوۡمَ صَـٰلِحࣲۚ وَمَا قَوۡمُ لُوطࣲ مِّنكُم بِبَعِیدࣲ\n"
    }
  },
  {
    "id": 1563,
    "surahId": 11,
    "ayahNumber": 90,
    "arabicText": "وَٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِۚ إِنَّ رَبِّی رَحِیمࣱ وَدُودࣱ\n",
    "translations": {
      "en": "Hence, ask your Sustainer to forgive you your sins, and then turn towards Him in repentance - for, verily, my Sustainer is a dispenser of grace, a fount of love!\"",
      "ms": "Dan mintalah ampun kepada Tuhan kamu, kemudian kembalilah taat kepadaNya. Sesungguhnya Tuhanku Maha Mengasihani, lagi Maha Pengasih\".",
      "id": "Dan mohonlah ampun kepada Tuhanmu kemudian bertaubatlah kepada-Nya. Sesungguhnya Tuhanku Maha Penyayang lagi Maha Pengasih.",
      "ar": "وَٱسۡتَغۡفِرُوا۟ رَبَّكُمۡ ثُمَّ تُوبُوۤا۟ إِلَیۡهِۚ إِنَّ رَبِّی رَحِیمࣱ وَدُودࣱ\n"
    }
  },
  {
    "id": 1564,
    "surahId": 11,
    "ayahNumber": 91,
    "arabicText": "قَالُوا۟ یَـٰشُعَیۡبُ مَا نَفۡقَهُ كَثِیرࣰا مِّمَّا تَقُولُ وَإِنَّا لَنَرَىٰكَ فِینَا ضَعِیفࣰاۖ وَلَوۡلَا رَهۡطُكَ لَرَجَمۡنَـٰكَۖ وَمَاۤ أَنتَ عَلَیۡنَا بِعَزِیزࣲ\n",
    "translations": {
      "en": "[But his people] said: \"O Shu'ayb! We cannot grasp the purport of much of what thou sayest; on the other hand, behold, we do see clearly how- weak thou art in our midst:\" and were it not for thy family, we would have most certainly stoned thee to death, considering that thou hast no power over us!\"",
      "ms": "Mereka berkata: \"Wahai Syuaib,! kami tidak mengerti kebanyakan dari apa yang engkau katakan itu, dan sesungguhnya kami melihat engkau orang yang lemah dalam kalangan kami; dan kalau tidaklah kerana kaum keluargamu, tentulah kami telah melemparmu (dengan batu hingga mati). Dan engkau pula bukanlah orang yang dipandang mulia dalam kalangan kami!\"",
      "id": "Mereka berkata: \"Hai Syu'aib, kami tidak banyak mengerti tentang apa yang kamu katakan itu dan sesungguhnya kami benar-benar melihat kamu seorang yang lemah di antara kami; kalau tidaklah karena keluargamu tentulah kami telah merajam kamu, sedang kamupun bukanlah seorang yang berwibawa di sisi kami\".",
      "ar": "قَالُوا۟ یَـٰشُعَیۡبُ مَا نَفۡقَهُ كَثِیرࣰا مِّمَّا تَقُولُ وَإِنَّا لَنَرَىٰكَ فِینَا ضَعِیفࣰاۖ وَلَوۡلَا رَهۡطُكَ لَرَجَمۡنَـٰكَۖ وَمَاۤ أَنتَ عَلَیۡنَا بِعَزِیزࣲ\n"
    }
  },
  {
    "id": 1565,
    "surahId": 11,
    "ayahNumber": 92,
    "arabicText": "قَالَ یَـٰقَوۡمِ أَرَهۡطِیۤ أَعَزُّ عَلَیۡكُم مِّنَ ٱللَّهِ وَٱتَّخَذۡتُمُوهُ وَرَاۤءَكُمۡ ظِهۡرِیًّاۖ إِنَّ رَبِّی بِمَا تَعۡمَلُونَ مُحِیطࣱ\n",
    "translations": {
      "en": "Said he: \"O my people! Do you hold my family in greater esteem than God? -for, Him you regard as something that may be cast behind you and be forgotten! Verily, my Sustainer encompasses [with His might] all that you do!",
      "ms": "Nabi Syuaib berkata: \"Wahai kaumku! (Mengapa kamu bersikap demikian)? Patutkah kaum keluargaku kamu pandang lebih mulia dari pada Allah serta kamu pula jadikan perintahNya sebagai sesuatu yang dibuang dan dilupakan di belakang kamu? Sesungguhnya Tuhanku Amat Meliputi pengetahuanNya akan apa yang kamu lakukan.",
      "id": "Syu'aib menjawab: \"Hai kaumku, apakah keluargaku lebih terhormat menurut pandanganmu daripada Allah, sedang Allah kamu jadikan sesuatu yang terbuang di belakangmu?. Sesungguhnya (pengetahuan) Tuhanku meliputi apa yang kamu kerjakan\".",
      "ar": "قَالَ یَـٰقَوۡمِ أَرَهۡطِیۤ أَعَزُّ عَلَیۡكُم مِّنَ ٱللَّهِ وَٱتَّخَذۡتُمُوهُ وَرَاۤءَكُمۡ ظِهۡرِیًّاۖ إِنَّ رَبِّی بِمَا تَعۡمَلُونَ مُحِیطࣱ\n"
    }
  },
  {
    "id": 1566,
    "surahId": 11,
    "ayahNumber": 93,
    "arabicText": "وَیَـٰقَوۡمِ ٱعۡمَلُوا۟ عَلَىٰ مَكَانَتِكُمۡ إِنِّی عَـٰمِلࣱۖ سَوۡفَ تَعۡلَمُونَ مَن یَأۡتِیهِ عَذَابࣱ یُخۡزِیهِ وَمَنۡ هُوَ كَـٰذِبࣱۖ وَٱرۡتَقِبُوۤا۟ إِنِّی مَعَكُمۡ رَقِیبࣱ\n",
    "translations": {
      "en": "Hence, O my people, do [to me] anything that may be within your power, [while] I, behold, shall labour [in God's way]; in time you will come to know which [of us] shall be visited by suffering that will cover him with ignominy, and which [of us] is a liar. Watch, then, [for what is coming:] behold, I shall watch with you!\"",
      "ms": "\" Dan wahai kaumku, buatlah sedaya upaya kamu (untuk menentang ugama Allah yang aku sampaikan itu), sesungguhnya aku juga tetap berusaha dengan bersungguh-sungguh (untuk mengembangkannya). Kamu akan ketahui siapakah yang akan didatangi azab yang menghinakannya, dan siapa pula yang berdusta. Dan tunggulah, sesungguhnya aku juga turut menunggu bersama-sama kamu\".",
      "id": "Dan (dia berkata): \"Hai kaumku, berbuatlah menurut kemampuanmu, sesungguhnya akupun berbuat (pula). Kelak kamu akan mengetahui siapa yang akan ditimpa azab yang menghinakannya dan siapa yang berdusta. Dan tunggulah azab (Tuhan), sesungguhnya akupun menunggu bersama kamu\".",
      "ar": "وَیَـٰقَوۡمِ ٱعۡمَلُوا۟ عَلَىٰ مَكَانَتِكُمۡ إِنِّی عَـٰمِلࣱۖ سَوۡفَ تَعۡلَمُونَ مَن یَأۡتِیهِ عَذَابࣱ یُخۡزِیهِ وَمَنۡ هُوَ كَـٰذِبࣱۖ وَٱرۡتَقِبُوۤا۟ إِنِّی مَعَكُمۡ رَقِیبࣱ\n"
    }
  },
  {
    "id": 1567,
    "surahId": 11,
    "ayahNumber": 94,
    "arabicText": "وَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا شُعَیۡبࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَأَخَذَتِ ٱلَّذِینَ ظَلَمُوا۟ ٱلصَّیۡحَةُ فَأَصۡبَحُوا۟ فِی دِیَـٰرِهِمۡ جَـٰثِمِینَ\n",
    "translations": {
      "en": "And so, when Our judgment came to pass, by Our grace We saved Shu'ayb and those who shared his faith, whereas the blast [of Our punishment] overtook those who had been bent on evildoing: and then they lay lifeless, in their very homes, on the ground,",
      "ms": "Dan ketika datang (masa perlaksanaan) perintah Kami, Kami selamatkan Nabi Syuaib beserta dengan umatnya yang beriman, dengan rahmat dari Kami; dan orang-orang yang zalim itu dibinasakan oleh letusan suara yang menggempakan bumi, lalu menjadilah mereka mayat-mayat yang tersungkur di tempat masing-masing.",
      "id": "Dan tatkala datang azab Kami, Kami selamatkan Syu'aib dan orang-orang yang beriman bersama-sama dengan dia dengan rahmat dari Kami, dan orang-orang yang zalim dibinasakan oleh satu suara yang mengguntur, lalu jadilah mereka mati bergelimpangan di rumahnya.",
      "ar": "وَلَمَّا جَاۤءَ أَمۡرُنَا نَجَّیۡنَا شُعَیۡبࣰا وَٱلَّذِینَ ءَامَنُوا۟ مَعَهُۥ بِرَحۡمَةࣲ مِّنَّا وَأَخَذَتِ ٱلَّذِینَ ظَلَمُوا۟ ٱلصَّیۡحَةُ فَأَصۡبَحُوا۟ فِی دِیَـٰرِهِمۡ جَـٰثِمِینَ\n"
    }
  },
  {
    "id": 1568,
    "surahId": 11,
    "ayahNumber": 95,
    "arabicText": "كَأَن لَّمۡ یَغۡنَوۡا۟ فِیهَاۤۗ أَلَا بُعۡدࣰا لِّمَدۡیَنَ كَمَا بَعِدَتۡ ثَمُودُ\n",
    "translations": {
      "en": "as though they had never lived there. Oh, away with [the people of] Madyan, even as the Thamud have been done away with!",
      "ms": "(Mereka punah-ranah) seolah-olah mereka tidak pernah tinggal di situ. Ketahuilah! kebinasaanlah akhirnya bagi penduduk Madyan, sebagaimana binasanya kaum Thamud.",
      "id": "Seolah-olah mereka belum pernah berdiam di tempat itu. Ingatlah, kebinasaanlah bagi penduduk Mad-yan sebagaimana kaum Tsamud telah binasa.",
      "ar": "كَأَن لَّمۡ یَغۡنَوۡا۟ فِیهَاۤۗ أَلَا بُعۡدࣰا لِّمَدۡیَنَ كَمَا بَعِدَتۡ ثَمُودُ\n"
    }
  },
  {
    "id": 1569,
    "surahId": 11,
    "ayahNumber": 96,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔایَـٰتِنَا وَسُلۡطَـٰنࣲ مُّبِینٍ\n",
    "translations": {
      "en": "AND, INDEED, We sent Moses with Our messages and a manifest authority [from Us]",
      "ms": "Dan sesungguhnya kami telah mengutuskan Nabi Musa dengan membawa ayat-ayat keterangan Kami, dan bukti (mukjizat) yang nyata:",
      "id": "Dan sesungguhnya Kami telah mengutus Musa dengan tanda-tanda (kekuasaan) Kami dan mukjizat yang nyata,",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔایَـٰتِنَا وَسُلۡطَـٰنࣲ مُّبِینٍ\n"
    }
  },
  {
    "id": 1570,
    "surahId": 11,
    "ayahNumber": 97,
    "arabicText": "إِلَىٰ فِرۡعَوۡنَ وَمَلَإِی۟هِۦ فَٱتَّبَعُوۤا۟ أَمۡرَ فِرۡعَوۡنَۖ وَمَاۤ أَمۡرُ فِرۡعَوۡنَ بِرَشِیدࣲ\n",
    "translations": {
      "en": "unto Pharaoh and his great ones: but these followed [only] Pharaoh's bidding - and Pharaoh's bidding led by no means to what is right.",
      "ms": "Kepada Firaun dan kaumnya; lalu kaum Firaun menurut perintah Firaun, sedang perintahnya itu bukanlah perintah yang betul.",
      "id": "kepada Fir'aun dan pemimpin-pemimpin kaumnya, tetapi mereka mengikut perintah Fir'aun, padahal perintah Fir'aun sekali-kali bukanlah (perintah) yang benar.",
      "ar": "إِلَىٰ فِرۡعَوۡنَ وَمَلَإِی۟هِۦ فَٱتَّبَعُوۤا۟ أَمۡرَ فِرۡعَوۡنَۖ وَمَاۤ أَمۡرُ فِرۡعَوۡنَ بِرَشِیدࣲ\n"
    }
  },
  {
    "id": 1571,
    "surahId": 11,
    "ayahNumber": 98,
    "arabicText": "یَقۡدُمُ قَوۡمَهُۥ یَوۡمَ ٱلۡقِیَـٰمَةِ فَأَوۡرَدَهُمُ ٱلنَّارَۖ وَبِئۡسَ ٱلۡوِرۡدُ ٱلۡمَوۡرُودُ\n",
    "translations": {
      "en": "[And so] he shall go before his people on the Day of Resurrection, having led them [in this world] towards the fire [of the life to come]; and vile was the destination towards which they were led -",
      "ms": "Firaun akan mengetuai kaumnya pada hari kiamat kemudian tetaplah ia akan membawa mereka masuk ke neraka. Dan seburuk-buruk tempat yang dimasuki ialah neraka.",
      "id": "Ia berjalan di muka kaumnya di hari kiamat lalu memasukkan mereka ke dalam neraka. Neraka itu seburuk-buruk tempat yang didatangi.",
      "ar": "یَقۡدُمُ قَوۡمَهُۥ یَوۡمَ ٱلۡقِیَـٰمَةِ فَأَوۡرَدَهُمُ ٱلنَّارَۖ وَبِئۡسَ ٱلۡوِرۡدُ ٱلۡمَوۡرُودُ\n"
    }
  },
  {
    "id": 1572,
    "surahId": 11,
    "ayahNumber": 99,
    "arabicText": "وَأُتۡبِعُوا۟ فِی هَـٰذِهِۦ لَعۡنَةࣰ وَیَوۡمَ ٱلۡقِیَـٰمَةِۚ بِئۡسَ ٱلرِّفۡدُ ٱلۡمَرۡفُودُ\n",
    "translations": {
      "en": "seeing that they were pursued by [God's] rejection in this [world], and [shall be finally overtaken by it] on the Day of Resurrection; [and] vile was the gift which they were given!",
      "ms": "Dan mereka diiringi oleh laknat yang tidak putus-putus di dunia ini, dan pada hari kiamat. (Sebenarnya) laknat itu adalah seburuk-buruk pemberian yang diberikan.",
      "id": "Dan mereka selalu diikuti dengan kutukan di dunia ini dan (begitu pula) di hari kiamat. La'nat itu seburuk-buruk pemberian yang diberikan.",
      "ar": "وَأُتۡبِعُوا۟ فِی هَـٰذِهِۦ لَعۡنَةࣰ وَیَوۡمَ ٱلۡقِیَـٰمَةِۚ بِئۡسَ ٱلرِّفۡدُ ٱلۡمَرۡفُودُ\n"
    }
  },
  {
    "id": 1573,
    "surahId": 11,
    "ayahNumber": 100,
    "arabicText": "ذَ ٰ⁠لِكَ مِنۡ أَنۢبَاۤءِ ٱلۡقُرَىٰ نَقُصُّهُۥ عَلَیۡكَۖ مِنۡهَا قَاۤىِٕمࣱ وَحَصِیدࣱ\n",
    "translations": {
      "en": "THIS ACCOUNT of the [fate of those ancient] communities - some of them still remaining, and some [extinct like] a field mown-down - We convey unto thee [as a lesson for mankind]:",
      "ms": "Yang demikian, ialah sebahagian dari khabar berita penduduk negeri-negeri (yang telah dibinasakan), kami ceritakan perihalnya kepadamu (wahai Muhammad). Di antaranya ada yang masih wujud (sisanya yang dapat disaksikan), dan ada pula yang telah hancur lebur (dan hilang lenyap).",
      "id": "Itu adalah sebahagian dan berita-berita negeri (yang telah dibinasakan) yang Kami ceritakan kepadamu (Muhammad); di antara negeri-negeri itu ada yang masih kedapatan bekas-bekasnya dan ada (pula) yang telah musnah.",
      "ar": "ذَ ٰ⁠لِكَ مِنۡ أَنۢبَاۤءِ ٱلۡقُرَىٰ نَقُصُّهُۥ عَلَیۡكَۖ مِنۡهَا قَاۤىِٕمࣱ وَحَصِیدࣱ\n"
    }
  },
  {
    "id": 1574,
    "surahId": 11,
    "ayahNumber": 101,
    "arabicText": "وَمَا ظَلَمۡنَـٰهُمۡ وَلَـٰكِن ظَلَمُوۤا۟ أَنفُسَهُمۡۖ فَمَاۤ أَغۡنَتۡ عَنۡهُمۡ ءَالِهَتُهُمُ ٱلَّتِی یَدۡعُونَ مِن دُونِ ٱللَّهِ مِن شَیۡءࣲ لَّمَّا جَاۤءَ أَمۡرُ رَبِّكَۖ وَمَا زَادُوهُمۡ غَیۡرَ تَتۡبِیبࣲ\n",
    "translations": {
      "en": "for, no wrong did We do to them, but it was they who wronged themselves. And when thy Sustainer's judgment came to pass, those deities of theirs which they had been wont to invoke instead of God proved of no avail whatever to them, and brought them no more than utter perdition.",
      "ms": "Dan tiadalah Kami menganiaya mereka, tetapi merekalah yang menganiaya diri sendiri. Maka berhala-berhala yang mereka sembah selain dari Allah itu tidak dapat menolong mereka sedikitpun pada masa datangnya azab Tuhanmu; dan penyembahan yang mereka lakukan itu hanya menambahkan kerugian sahaja kepada mereka.",
      "id": "Dan Kami tidaklah menganiaya mereka tetapi merekalah yang menganiaya diri mereka sendiri, karena itu tiadalah bermanfaat sedikitpun kepada mereka sembahan-sembahan yang mereka seru selain Allah, di waktu azab Tuhanmu datang. Dan sembahan-sembahan itu tidaklah menambah kepada mereka kecuali kebinasaan belaka.",
      "ar": "وَمَا ظَلَمۡنَـٰهُمۡ وَلَـٰكِن ظَلَمُوۤا۟ أَنفُسَهُمۡۖ فَمَاۤ أَغۡنَتۡ عَنۡهُمۡ ءَالِهَتُهُمُ ٱلَّتِی یَدۡعُونَ مِن دُونِ ٱللَّهِ مِن شَیۡءࣲ لَّمَّا جَاۤءَ أَمۡرُ رَبِّكَۖ وَمَا زَادُوهُمۡ غَیۡرَ تَتۡبِیبࣲ\n"
    }
  },
  {
    "id": 1575,
    "surahId": 11,
    "ayahNumber": 102,
    "arabicText": "وَكَذَ ٰ⁠لِكَ أَخۡذُ رَبِّكَ إِذَاۤ أَخَذَ ٱلۡقُرَىٰ وَهِیَ ظَـٰلِمَةٌۚ إِنَّ أَخۡذَهُۥۤ أَلِیمࣱ شَدِیدٌ\n",
    "translations": {
      "en": "And such is thy Sustainer's punishing grasp whenever He takes to task any community that is given to evildoing: verily, His punishing grasp is grievous, severe!",
      "ms": "Dan demikianlah azab Tuhanmu, apabila ia menimpa (penduduk) negeri-negeri yang berlaku zalim. Sesungguhnya azabNya itu tidak terperi sakitnya, lagi amat keras serangannya.",
      "id": "Dan begitulah azab Tuhanmu, apabila Dia mengazab penduduk negeri-negeri yang berbuat zalim. Sesungguhnya azab-Nya itu adalah sangat pedih lagi keras.",
      "ar": "وَكَذَ ٰ⁠لِكَ أَخۡذُ رَبِّكَ إِذَاۤ أَخَذَ ٱلۡقُرَىٰ وَهِیَ ظَـٰلِمَةٌۚ إِنَّ أَخۡذَهُۥۤ أَلِیمࣱ شَدِیدٌ\n"
    }
  },
  {
    "id": 1576,
    "surahId": 11,
    "ayahNumber": 103,
    "arabicText": "إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّمَنۡ خَافَ عَذَابَ ٱلۡـَٔاخِرَةِۚ ذَ ٰ⁠لِكَ یَوۡمࣱ مَّجۡمُوعࣱ لَّهُ ٱلنَّاسُ وَذَ ٰ⁠لِكَ یَوۡمࣱ مَّشۡهُودࣱ\n",
    "translations": {
      "en": "Herein, behold, lies a message indeed for all who fear the suffering [which may befall them] in the life to come, (and are conscious of the coming of] that Day on which all mankind shall be gathered together-that Day [of Judgment] which shall be witnessed [by all that ever lived],",
      "ms": "Sesungguhnya pada kejadian yang demikian, ada tanda (yang mendatangkan iktibar) bagi orang yang takut kepada azab akhirat, iaitu hari yang dihimpunkan manusia padanya. Dan hari yang demikian ialah hari yang dihadiri oleh sekalian makhluk.",
      "id": "Sesungguhnya pada yang demikian itu benar-benar terdapat pelajaran bagi orang-orang yang takut kepada azab akhirat. Hari kiamat itu adalah suatu hari yang semua manusia dikumpulkan untuk (menghadapi)nya, dan hari itu adalah suatu hari yang disaksikan (oleh segala makhluk).",
      "ar": "إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَةࣰ لِّمَنۡ خَافَ عَذَابَ ٱلۡـَٔاخِرَةِۚ ذَ ٰ⁠لِكَ یَوۡمࣱ مَّجۡمُوعࣱ لَّهُ ٱلنَّاسُ وَذَ ٰ⁠لِكَ یَوۡمࣱ مَّشۡهُودࣱ\n"
    }
  },
  {
    "id": 1577,
    "surahId": 11,
    "ayahNumber": 104,
    "arabicText": "وَمَا نُؤَخِّرُهُۥۤ إِلَّا لِأَجَلࣲ مَّعۡدُودࣲ\n",
    "translations": {
      "en": "and which We shall not delay beyond a term set [by Us].",
      "ms": "Dan tiadalah Kami lambatkan hari kiamat itu melainkan untuk suatu tempoh yang tertentu.",
      "id": "Dan Kami tiadalah mengundurkannya, melainkan sampai waktu yang tertentu.",
      "ar": "وَمَا نُؤَخِّرُهُۥۤ إِلَّا لِأَجَلࣲ مَّعۡدُودࣲ\n"
    }
  },
  {
    "id": 1578,
    "surahId": 11,
    "ayahNumber": 105,
    "arabicText": "یَوۡمَ یَأۡتِ لَا تَكَلَّمُ نَفۡسٌ إِلَّا بِإِذۡنِهِۦۚ فَمِنۡهُمۡ شَقِیࣱّ وَسَعِیدࣱ\n",
    "translations": {
      "en": "When that Day comes, not a soul will speak. unless it be by His leave; and of those [that are gathered together], some will be wretched and some, happy.",
      "ms": "(Pada) masa datangnya (hari kiamat itu), tiadalah seorangpun dapat berkata-kata (untuk membela dirinya atau memohon pertolongan) melainkan dengan izin Allah. Maka di antara mereka ada yang celaka, dan ada pula yang berbahagia.",
      "id": "Di kala datang hari itu, tidak ada seorangun yang berbicara, melainkan dengan izin-Nya; maka di antara mereka ada yang celaka dan ada yang berbahagia.",
      "ar": "یَوۡمَ یَأۡتِ لَا تَكَلَّمُ نَفۡسٌ إِلَّا بِإِذۡنِهِۦۚ فَمِنۡهُمۡ شَقِیࣱّ وَسَعِیدࣱ\n"
    }
  },
  {
    "id": 1579,
    "surahId": 11,
    "ayahNumber": 106,
    "arabicText": "فَأَمَّا ٱلَّذِینَ شَقُوا۟ فَفِی ٱلنَّارِ لَهُمۡ فِیهَا زَفِیرࣱ وَشَهِیقٌ\n",
    "translations": {
      "en": "Now as for those who [by their deeds] will have brought wretchedness upon them-selves, [they shall live] in the fire, where they will have [nothing but] moans and sobs [to relieve their pain],",
      "ms": "Adapun orang-orang yang celaka (disebabkan keingkaran dan maksiatnya), maka di dalam nerakalah tempatnya. Bagi mereka di situ, hanyalah suara memekik-mekik dan mendayu-dayu (seperti suara keldai).",
      "id": "Adapun orang-orang yang celaka, maka (tempatnya) di dalam neraka, di dalamnya mereka mengeluarkan dan menarik nafas (dengan merintih),",
      "ar": "فَأَمَّا ٱلَّذِینَ شَقُوا۟ فَفِی ٱلنَّارِ لَهُمۡ فِیهَا زَفِیرࣱ وَشَهِیقٌ\n"
    }
  },
  {
    "id": 1580,
    "surahId": 11,
    "ayahNumber": 107,
    "arabicText": "خَـٰلِدِینَ فِیهَا مَا دَامَتِ ٱلسَّمَـٰوَ ٰ⁠تُ وَٱلۡأَرۡضُ إِلَّا مَا شَاۤءَ رَبُّكَۚ إِنَّ رَبَّكَ فَعَّالࣱ لِّمَا یُرِیدُ\n",
    "translations": {
      "en": "therein to abide as long as the heavens and the earth endure-unless thy Sustainer wills it otherwise: for, verily, thy Sustainer is a sovereign doer of whatever He wills.",
      "ms": "Mereka kekal di dalamnya selagi ada langit dan bumi kecuali apa yang dikehendaki oleh Tuhanmu. Sesungguhnya Tuhanmu, Maha Kuasa melakukan apa yang dikehendakiNya.",
      "id": "mereka kekal di dalamnya selama ada langit dan bumi, kecuali jika Tuhanmu menghendaki (yang lain). Sesungguhnya Tuhanmu Maha Pelaksana terhadap apa yang Dia kehendaki.",
      "ar": "خَـٰلِدِینَ فِیهَا مَا دَامَتِ ٱلسَّمَـٰوَ ٰ⁠تُ وَٱلۡأَرۡضُ إِلَّا مَا شَاۤءَ رَبُّكَۚ إِنَّ رَبَّكَ فَعَّالࣱ لِّمَا یُرِیدُ\n"
    }
  },
  {
    "id": 1581,
    "surahId": 11,
    "ayahNumber": 108,
    "arabicText": "۞ وَأَمَّا ٱلَّذِینَ سُعِدُوا۟ فَفِی ٱلۡجَنَّةِ خَـٰلِدِینَ فِیهَا مَا دَامَتِ ٱلسَّمَـٰوَ ٰ⁠تُ وَٱلۡأَرۡضُ إِلَّا مَا شَاۤءَ رَبُّكَۖ عَطَاۤءً غَیۡرَ مَجۡذُوذࣲ\n",
    "translations": {
      "en": "But as for those who [by virtue of their past deeds] will have been blest with happiness, [they shall live] in paradise, therein to abide as long as the heavens and the earth endure -unless thy Sustainer wills it otherwise -as a gift unceasing.",
      "ms": "Adapun orang-orang yang berbahagia (disebabkan imannya dan taatnya), maka di dalam Syurgalah tempatnya. Mereka kekal di dalamnya selagi ada langit dan bumi kecuali apa yang dikehendaki oleh Tuhanmu sebagai pemberian nikmat yang tidak putus-putus.",
      "id": "Adapun orang-orang yang berbahagia, maka tempatnya di dalam surga, mereka kekal di dalamnya selama ada langit dan bumi, kecuali jika Tuhanmu menghendaki (yang lain); sebagai karunia yang tiada putus-putusnya.",
      "ar": "۞ وَأَمَّا ٱلَّذِینَ سُعِدُوا۟ فَفِی ٱلۡجَنَّةِ خَـٰلِدِینَ فِیهَا مَا دَامَتِ ٱلسَّمَـٰوَ ٰ⁠تُ وَٱلۡأَرۡضُ إِلَّا مَا شَاۤءَ رَبُّكَۖ عَطَاۤءً غَیۡرَ مَجۡذُوذࣲ\n"
    }
  },
  {
    "id": 1582,
    "surahId": 11,
    "ayahNumber": 109,
    "arabicText": "فَلَا تَكُ فِی مِرۡیَةࣲ مِّمَّا یَعۡبُدُ هَـٰۤؤُلَاۤءِۚ مَا یَعۡبُدُونَ إِلَّا كَمَا یَعۡبُدُ ءَابَاۤؤُهُم مِّن قَبۡلُۚ وَإِنَّا لَمُوَفُّوهُمۡ نَصِیبَهُمۡ غَیۡرَ مَنقُوصࣲ\n",
    "translations": {
      "en": "AND SO, [O Prophet,] be not in doubt about anything that those [misguided people] worship: they but [thoughtlessly] worship as their forefathers worshipped aforetime; and, behold, We shall most certainly give them their full due [for whatever good or evil they have earned], without diminishing aught thereof.",
      "ms": "Maka janganlah engkau (wahai Muhammad) menaruh perasaan ragu-ragu tentang sia-sianya apa yang disembah oleh mereka yang musyrik itu. Mereka tidak menyembah melainkan sama seperti yang disembah oleh datuk nenek mereka yang musyrik dahulu. Dan sesungguhnya Kami akan menyempurnakan bagi mereka bahagian mereka (dari azab yang telah ditentukan) dengan tidak dikurangi.",
      "id": "Maka janganlah kamu berada dalam keragu-raguan tentang apa yang disembah oleh mereka. Mereka tidak menyembah melainkan sebagaimana nenek moyang mereka menyembah dahulu. Dan sesungguhnya Kami pasti akan menyempurnakan dengan secukup-cukupnya pembalasan (terhadap) mereka dengan tidak dikurangi sedikitpun.",
      "ar": "فَلَا تَكُ فِی مِرۡیَةࣲ مِّمَّا یَعۡبُدُ هَـٰۤؤُلَاۤءِۚ مَا یَعۡبُدُونَ إِلَّا كَمَا یَعۡبُدُ ءَابَاۤؤُهُم مِّن قَبۡلُۚ وَإِنَّا لَمُوَفُّوهُمۡ نَصِیبَهُمۡ غَیۡرَ مَنقُوصࣲ\n"
    }
  },
  {
    "id": 1583,
    "surahId": 11,
    "ayahNumber": 110,
    "arabicText": "وَلَقَدۡ ءَاتَیۡنَا مُوسَى ٱلۡكِتَـٰبَ فَٱخۡتُلِفَ فِیهِۚ وَلَوۡلَا كَلِمَةࣱ سَبَقَتۡ مِن رَّبِّكَ لَقُضِیَ بَیۡنَهُمۡۚ وَإِنَّهُمۡ لَفِی شَكࣲّ مِّنۡهُ مُرِیبࣲ\n",
    "translations": {
      "en": "And, indeed, [similar was the case when] We vouchsafed the divine writ unto Moses, and some of his people set their own views against it; and had it not been for a decree that had already gone forth from thy Sustainer, judgment would indeed have been passed on them [then and there]: for, behold, they were in grave doubt, amounting to suspicion, about him [who called them unto God].",
      "ms": "(Janganlah engkau merasa bimbang wahai Muhammad tentang keingkaran kaummu) kerana sesungguhnya Kami telah memberikan kepada Nabi Musa Kitab Taurat, lalu berlaku pertentangan mengenainya. Dan kalau tidaklah kerana telah terdahulu kalimah ketetapan dari Tuhanmu (untuk menangguhkan hukuman hingga ke suatu masa yang tertentu), tentulah dijatuhkan hukuman azab dengan serta-merta kepada mereka. Dan sesungguhnya mereka masih menaruh perasaan ragu-ragu tentang (kebenaran Al-Quran) itu.",
      "id": "Dan sesungguhnya Kami telah memberikan Kitab (Taurat) kepada Musa, lalu diperselisihkan tentang Kitab itu. Dan seandainya tidak ada ketetapan yang telah terdahulu dari Tuhanmu, niscaya telah ditetapkan hukuman di antara mereka. Dan sesungguhnya mereka (orang-orang kafir Mekah) dalam keraguan yang menggelisahkan terhadap Al Quran.",
      "ar": "وَلَقَدۡ ءَاتَیۡنَا مُوسَى ٱلۡكِتَـٰبَ فَٱخۡتُلِفَ فِیهِۚ وَلَوۡلَا كَلِمَةࣱ سَبَقَتۡ مِن رَّبِّكَ لَقُضِیَ بَیۡنَهُمۡۚ وَإِنَّهُمۡ لَفِی شَكࣲّ مِّنۡهُ مُرِیبࣲ\n"
    }
  },
  {
    "id": 1584,
    "surahId": 11,
    "ayahNumber": 111,
    "arabicText": "وَإِنَّ كُلࣰّا لَّمَّا لَیُوَفِّیَنَّهُمۡ رَبُّكَ أَعۡمَـٰلَهُمۡۚ إِنَّهُۥ بِمَا یَعۡمَلُونَ خَبِیرࣱ\n",
    "translations": {
      "en": "And, verily, unto each and all will thy Sustainer give their full due for whatever [good or evil] they may have done: behold, He is aware of all that they do!",
      "ms": "Dan sesungguhnya tiap-tiap seorang akan disempurnakan oleh Tuhanmu balasan amal mereka; sesungguhnya Allah Amat Mendalam pengetahuanNya tentang apa yang mereka kerjakan.",
      "id": "Dan sesungguhnya kepada masing-masing (mereka yang berselisih itu) pasti Tuhanmu akan menyempurnakan dengan cukup, (balasan) pekerjaan mereka. Sesungguhnya Dia Maha Mengetahui apa yang mereka kerjakan.",
      "ar": "وَإِنَّ كُلࣰّا لَّمَّا لَیُوَفِّیَنَّهُمۡ رَبُّكَ أَعۡمَـٰلَهُمۡۚ إِنَّهُۥ بِمَا یَعۡمَلُونَ خَبِیرࣱ\n"
    }
  },
  {
    "id": 1585,
    "surahId": 11,
    "ayahNumber": 112,
    "arabicText": "فَٱسۡتَقِمۡ كَمَاۤ أُمِرۡتَ وَمَن تَابَ مَعَكَ وَلَا تَطۡغَوۡا۟ۚ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِیرࣱ\n",
    "translations": {
      "en": "Pursue, then, the right course, as thou hast been bidden [by God], together with all who, with thee, have turned unto Him; and let none of you behave in an overweening manner: for, verily, He sees all that you do.",
      "ms": "Oleh itu, hendaklah engkau (wahai Muhammad) sentiasa tetap teguh di atas jalan yang betul sebagaimana yang diperintahkan kepadamu, dan hendaklah orang-orang yang rujuk kembali kepada kebenaran mengikutmu berbuat demikian; dan janganlah kamu melampaui batas hukum-hukum Allah; sesungguhnya Allah Maha Melihat akan apa yang kamu kerjakan.",
      "id": "Maka tetaplah kamu pada jalan yang benar, sebagaimana diperintahkan kepadamu dan (juga) orang yang telah taubat beserta kamu dan janganlah kamu melampaui batas. Sesungguhnya Dia Maha Melihat apa yang kamu kerjakan.",
      "ar": "فَٱسۡتَقِمۡ كَمَاۤ أُمِرۡتَ وَمَن تَابَ مَعَكَ وَلَا تَطۡغَوۡا۟ۚ إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِیرࣱ\n"
    }
  },
  {
    "id": 1586,
    "surahId": 11,
    "ayahNumber": 113,
    "arabicText": "وَلَا تَرۡكَنُوۤا۟ إِلَى ٱلَّذِینَ ظَلَمُوا۟ فَتَمَسَّكُمُ ٱلنَّارُ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِیَاۤءَ ثُمَّ لَا تُنصَرُونَ\n",
    "translations": {
      "en": "And do not incline towards, nor rely upon, those who are bent on evildoing lest the fire [of the hereafter] touch you: for [then] you would have none to protect you from God, nor would you ever be succoured [by Him].",
      "ms": "Dan janganlah kamu cenderung kepada orang-orang yang berlaku zalim maka (kalau kamu berlaku demikian), api neraka akan membakar kamu, sedang kamu tidak ada sebarang penolong pun yang lain dari Allah. Kemudian (dengan sebab kecenderungan kamu itu) kamu tidak akan mendapat pertolongan.",
      "id": "Dan janganlah kamu cenderung kepada orang-orang yang zalim yang menyebabkan kamu disentuh api neraka, dan sekali-kali kamu tiada mempunyai seorang penolongpun selain daripada Allah, kemudian kamu tidak akan diberi pertolongan.",
      "ar": "وَلَا تَرۡكَنُوۤا۟ إِلَى ٱلَّذِینَ ظَلَمُوا۟ فَتَمَسَّكُمُ ٱلنَّارُ وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِیَاۤءَ ثُمَّ لَا تُنصَرُونَ\n"
    }
  },
  {
    "id": 1587,
    "surahId": 11,
    "ayahNumber": 114,
    "arabicText": "وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَیِ ٱلنَّهَارِ وَزُلَفࣰا مِّنَ ٱلَّیۡلِۚ إِنَّ ٱلۡحَسَنَـٰتِ یُذۡهِبۡنَ ٱلسَّیِّـَٔاتِۚ ذَ ٰ⁠لِكَ ذِكۡرَىٰ لِلذَّ ٰ⁠كِرِینَ\n",
    "translations": {
      "en": "And be constant in praying at the beginning and the end of the day, as well as during the early watches of the night: for, verily, good deeds drive away evil deeds: this is a reminder to all who bear [God] in mind.",
      "ms": "Dan dirikanlah sembahyang (wahai Muhammad, engkau dan umatmu), pada dua bahagian siang (pagi dan petang), dan pada waktu-waktu yang berhampiran dengannya dari waktu malam. Sesungguhnya amal-amal kebajikan (terutama sembahyang) itu menghapuskan kejahatan. Perintah-perintah Allah yang demikian adalah menjadi peringatan bagi orang-orang yang mahu beringat.",
      "id": "Dan dirikanlah sembahyang itu pada kedua tepi siang (pagi dan petang) dan pada bahagian permulaan daripada malam. Sesungguhnya perbuatan-perbuatan yang baik itu menghapuskan (dosa) perbuatan-perbuatan yang buruk. Itulah peringatan bagi orang-orang yang ingat.",
      "ar": "وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَیِ ٱلنَّهَارِ وَزُلَفࣰا مِّنَ ٱلَّیۡلِۚ إِنَّ ٱلۡحَسَنَـٰتِ یُذۡهِبۡنَ ٱلسَّیِّـَٔاتِۚ ذَ ٰ⁠لِكَ ذِكۡرَىٰ لِلذَّ ٰ⁠كِرِینَ\n"
    }
  },
  {
    "id": 1588,
    "surahId": 11,
    "ayahNumber": 115,
    "arabicText": "وَٱصۡبِرۡ فَإِنَّ ٱللَّهَ لَا یُضِیعُ أَجۡرَ ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "And be patient in adversity: for, verily,. God does not fail to requite the doers of good!",
      "ms": "Dan sabarlah (wahai Muhammad, engkau dan umatmu, dalam mengerjakan suruhan Allah), kerana sesungguhnya Allah tidak akan menghilangkan pahala orang-orang yang berbuat kebaikan.",
      "id": "Dan bersabarlah, karena sesungguhnya Allah tiada menyia-nyiakan pahala orang-orang yang berbuat kebaikan.",
      "ar": "وَٱصۡبِرۡ فَإِنَّ ٱللَّهَ لَا یُضِیعُ أَجۡرَ ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 1589,
    "surahId": 11,
    "ayahNumber": 116,
    "arabicText": "فَلَوۡلَا كَانَ مِنَ ٱلۡقُرُونِ مِن قَبۡلِكُمۡ أُو۟لُوا۟ بَقِیَّةࣲ یَنۡهَوۡنَ عَنِ ٱلۡفَسَادِ فِی ٱلۡأَرۡضِ إِلَّا قَلِیلࣰا مِّمَّنۡ أَنجَیۡنَا مِنۡهُمۡۗ وَٱتَّبَعَ ٱلَّذِینَ ظَلَمُوا۟ مَاۤ أُتۡرِفُوا۟ فِیهِ وَكَانُوا۟ مُجۡرِمِینَ\n",
    "translations": {
      "en": "BUT, ALAS, among those generations [whom We destroyed] before your time there were no people endowed with any virtue - [people] who would speak out against the [spread of] corruption on earth -except the few of them whom We saved [because of their righteousness], whereas those who were bent on evildoing only pursued pleasures which corrupted their whole being, and so lost themselves in sinning.",
      "ms": "Maka sepatutnya ada di antara umat yang telah dibinasakan dahulu daripada kamu itu, orang-orang yang berkelebihan akal fikiran yang melarang kaumnya dari perbuatan-perbuatan jahat di muka bumi tetapi sayang! Tidak ada yang melarang melainkan sedikit sahaja, iaitu orang-orang yang Kami telah selamatkan di antara mereka. Dan orang-orang yang tidak melarang itu telah menitik beratkan segala kemewahan yang diberikan kepada mereka dan menjadilah mereka orang-orang yang berdosa.",
      "id": "Maka mengapa tidak ada dari umat-umat yang sebelum kamu orang-orang yang mempunyai keutamaan yang melarang daripada (mengerjakan) kerusakan di muka bumi, kecuali sebahagian kecil di antara orang-orang yang telah Kami selamatkan di antara mereka, dan orang-orang yang zalim hanya mementingkan kenikmatan yang mewah yang ada pada mereka, dan mereka adalah orang-orang yang berdosa.",
      "ar": "فَلَوۡلَا كَانَ مِنَ ٱلۡقُرُونِ مِن قَبۡلِكُمۡ أُو۟لُوا۟ بَقِیَّةࣲ یَنۡهَوۡنَ عَنِ ٱلۡفَسَادِ فِی ٱلۡأَرۡضِ إِلَّا قَلِیلࣰا مِّمَّنۡ أَنجَیۡنَا مِنۡهُمۡۗ وَٱتَّبَعَ ٱلَّذِینَ ظَلَمُوا۟ مَاۤ أُتۡرِفُوا۟ فِیهِ وَكَانُوا۟ مُجۡرِمِینَ\n"
    }
  },
  {
    "id": 1590,
    "surahId": 11,
    "ayahNumber": 117,
    "arabicText": "وَمَا كَانَ رَبُّكَ لِیُهۡلِكَ ٱلۡقُرَىٰ بِظُلۡمࣲ وَأَهۡلُهَا مُصۡلِحُونَ\n",
    "translations": {
      "en": "For, never would thy Sustainer destroy a community for wrong [beliefs alone] so long as its people behave righteously [towards one another].",
      "ms": "Dan Tuhanmu tidak sekali-kali hendak membinasakan mana-mana negeri dengan sebab kezaliman penduduknya, selagi mereka sentiasa memperbaiki keadaan sesama sendiri.",
      "id": "Dan Tuhanmu sekali-kali tidak akan membinasakan negeri-negeri secara zalim, sedang penduduknya orang-orang yang berbuat kebaikan.",
      "ar": "وَمَا كَانَ رَبُّكَ لِیُهۡلِكَ ٱلۡقُرَىٰ بِظُلۡمࣲ وَأَهۡلُهَا مُصۡلِحُونَ\n"
    }
  },
  {
    "id": 1591,
    "surahId": 11,
    "ayahNumber": 118,
    "arabicText": "وَلَوۡ شَاۤءَ رَبُّكَ لَجَعَلَ ٱلنَّاسَ أُمَّةࣰ وَ ٰ⁠حِدَةࣰۖ وَلَا یَزَالُونَ مُخۡتَلِفِینَ\n",
    "translations": {
      "en": "And had thy Sustainer so willed, He could surely have made all mankind one single community: but [He willed it otherwise, and so] they continue to hold divergent views'",
      "ms": "Dan kalaulah Tuhanmu (wahai Muhammad) menghendaki, tentulah Ia menjadikan umat manusia semuanya menurut ugama yang satu. (Tetapi Ia tidak berbuat demikian) dan kerana itulah mereka terus-menerus berselisihan.",
      "id": "Jikalau Tuhanmu menghendaki, tentu Dia menjadikan manusia umat yang satu, tetapi mereka senantiasa berselisih pendapat,",
      "ar": "وَلَوۡ شَاۤءَ رَبُّكَ لَجَعَلَ ٱلنَّاسَ أُمَّةࣰ وَ ٰ⁠حِدَةࣰۖ وَلَا یَزَالُونَ مُخۡتَلِفِینَ\n"
    }
  },
  {
    "id": 1592,
    "surahId": 11,
    "ayahNumber": 119,
    "arabicText": "إِلَّا مَن رَّحِمَ رَبُّكَۚ وَلِذَ ٰ⁠لِكَ خَلَقَهُمۡۗ وَتَمَّتۡ كَلِمَةُ رَبِّكَ لَأَمۡلَأَنَّ جَهَنَّمَ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ أَجۡمَعِینَ\n",
    "translations": {
      "en": "[all of them,] save those upon whom thy Sustainer has bestowed His grace. And to this end has He created them [all. But [as for those who refuse to avail themselves of divine guidance,] that word of thy Sustainer shall be fulfilled: \"Most certainly will I fill hell with invisible beings as well as with humans, all together!\"",
      "ms": "Tetapi orang-orang yang telah diberi rahmat oleh Tuhanmu, (mereka bersatu di dalam ugama Allah)); dan untuk (perselisihan dan rahmat) itulah Allah menjadikan manusia. Dan dengan yang demikian sempurnalah janji Tuhanmu: \"Sesungguhnya Aku akan memenuhi neraka jahannam dengan sekalian jin dan manusia (yang berdosa)\".",
      "id": "kecuali orang-orang yang diberi rahmat oleh Tuhanmu. Dan untuk itulah Allah menciptakan mereka. Kalimat Tuhanmu (keputusan-Nya) telah ditetapkan: sesungguhnya Aku akan memenuhi neraka Jahannam dengan jin dan manusia (yang durhaka) semuanya.",
      "ar": "إِلَّا مَن رَّحِمَ رَبُّكَۚ وَلِذَ ٰ⁠لِكَ خَلَقَهُمۡۗ وَتَمَّتۡ كَلِمَةُ رَبِّكَ لَأَمۡلَأَنَّ جَهَنَّمَ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 1593,
    "surahId": 11,
    "ayahNumber": 120,
    "arabicText": "وَكُلࣰّا نَّقُصُّ عَلَیۡكَ مِنۡ أَنۢبَاۤءِ ٱلرُّسُلِ مَا نُثَبِّتُ بِهِۦ فُؤَادَكَۚ وَجَاۤءَكَ فِی هَـٰذِهِ ٱلۡحَقُّ وَمَوۡعِظَةࣱ وَذِكۡرَىٰ لِلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "AND [remember:] out of all the accounts relating to the [earlier] apostles We convey unto thee [only] that wherewith We [aim to] make firm thy heart: for through these [accounts] comes the truth unto thee, as well as an admonition and a reminder unto all believers.",
      "ms": "Dan tiap-tiap berita dari berita Rasul-rasul itu, kami ceritakan kepadamu (wahai Muhammad), untuk menguatkan hatimu dengannya. Dan telah datang kepadamu dalam berita ini kebenaran dan pengajaran serta peringatan bagi orang-orang yang beriman.",
      "id": "Dan semua kisah dari rasul-rasul Kami ceritakan kepadamu, ialah kisah-kisah yang dengannya Kami teguhkan hatimu; dan dalam surat ini telah datang kepadamu kebenaran serta pengajaran dan peringatan bagi orang-orang yang beriman.",
      "ar": "وَكُلࣰّا نَّقُصُّ عَلَیۡكَ مِنۡ أَنۢبَاۤءِ ٱلرُّسُلِ مَا نُثَبِّتُ بِهِۦ فُؤَادَكَۚ وَجَاۤءَكَ فِی هَـٰذِهِ ٱلۡحَقُّ وَمَوۡعِظَةࣱ وَذِكۡرَىٰ لِلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 1594,
    "surahId": 11,
    "ayahNumber": 121,
    "arabicText": "وَقُل لِّلَّذِینَ لَا یُؤۡمِنُونَ ٱعۡمَلُوا۟ عَلَىٰ مَكَانَتِكُمۡ إِنَّا عَـٰمِلُونَ\n",
    "translations": {
      "en": "And say unto those who will not believe: \"Do anything that may be within your power, [while] we, behold, shall labour [in God's way];",
      "ms": "Dan katakanlah kepada orang-orang yang tidak beriman: \"Buatlah apa yang kamu sanggup melakukannya (dari perbuatan ingkar itu). Sesungguhnya kami juga tetap mengerjakan (nasihat pengajaran yang Tuhan berikan kepada kami).",
      "id": "Dan katakanlah kepada orang-orang yang tidak beriman: \"Berbuatlah menurut kemampuanmu; sesungguhnya Kami-pun berbuat (pula)\".",
      "ar": "وَقُل لِّلَّذِینَ لَا یُؤۡمِنُونَ ٱعۡمَلُوا۟ عَلَىٰ مَكَانَتِكُمۡ إِنَّا عَـٰمِلُونَ\n"
    }
  },
  {
    "id": 1595,
    "surahId": 11,
    "ayahNumber": 122,
    "arabicText": "وَٱنتَظِرُوۤا۟ إِنَّا مُنتَظِرُونَ\n",
    "translations": {
      "en": "and wait [for what is coming]: behold, we too are waiting!\"",
      "ms": "Dan tunggulah (akibat yang buruk yang akan menimpa kamu)! Sesungguhnya kami juga menunggu (akan kemenangan dan kejayaan yang dijanjikan oleh Allah kepada kami)\".",
      "id": "Dan tunggulah (akibat perbuatanmu); sesungguhnya kamipun menunggu (pula)\".",
      "ar": "وَٱنتَظِرُوۤا۟ إِنَّا مُنتَظِرُونَ\n"
    }
  },
  {
    "id": 1596,
    "surahId": 11,
    "ayahNumber": 123,
    "arabicText": "وَلِلَّهِ غَیۡبُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَإِلَیۡهِ یُرۡجَعُ ٱلۡأَمۡرُ كُلُّهُۥ فَٱعۡبُدۡهُ وَتَوَكَّلۡ عَلَیۡهِۚ وَمَا رَبُّكَ بِغَـٰفِلٍ عَمَّا تَعۡمَلُونَ\n",
    "translations": {
      "en": "And God alone comprehends the hidden reality of the heavens and the earth: for, all that exists goes back to Him [as its source]. Worship Him, then, and place thy trust in Him alone: for thy Sustainer is not unaware of what you do.",
      "ms": "Dan Allah jualah yang mengetahui rahsia langit dan bumi dan kepadaNyalah dikembalikan segala urusan. Oleh itu, sembahlah akan Dia serta berserahlah kepadaNya. Dan (ingatlah), Tuhanmu tidak sekali-kali lalai akan apa yang kamu lakukan.",
      "id": "Dan kepunyaan Allah-lah apa yang ghaib di langit dan di bumi dan kepada-Nya-lah dikembalikan urusan-urusan semuanya, maka sembahlah Dia, dan bertawakkallah kepada-Nya. Dan sekali-kali Tuhanmu tidak lalai dari apa yang kamu kerjakan.",
      "ar": "وَلِلَّهِ غَیۡبُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَإِلَیۡهِ یُرۡجَعُ ٱلۡأَمۡرُ كُلُّهُۥ فَٱعۡبُدۡهُ وَتَوَكَّلۡ عَلَیۡهِۚ وَمَا رَبُّكَ بِغَـٰفِلٍ عَمَّا تَعۡمَلُونَ\n"
    }
  }
]