[
  {
    "id": 3789,
    "surahId": 37,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ وَٱلصَّـٰۤفَّـٰتِ صَفࣰّا\n",
    "translations": {
      "en": "CONSIDER these [messages] ranged in serried ranks,",
      "ms": "Demi (hamba-hambaKu) yang berbaris dengan berderet-deret -",
      "id": "Demi (rombongan) yang ber shaf-shaf dengan sebenar-benarnya],",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ وَٱلصَّـٰۤفَّـٰتِ صَفࣰّا\n"
    }
  },
  {
    "id": 3790,
    "surahId": 37,
    "ayahNumber": 2,
    "arabicText": "فَٱلزَّ ٰ⁠جِرَ ٰ⁠تِ زَجۡرࣰا\n",
    "translations": {
      "en": "and restraining [from evil] by a call to restraint,",
      "ms": "(Hamba-hambaKu) yang melarang (dari kejahatan) dengan sesungguh-sungguhnya -",
      "id": "dan demi (rombongan) yang melarang dengan sebenar-benarnya (dari perbuatan-perbuatan maksiat),",
      "ar": "فَٱلزَّ ٰ⁠جِرَ ٰ⁠تِ زَجۡرࣰا\n"
    }
  },
  {
    "id": 3791,
    "surahId": 37,
    "ayahNumber": 3,
    "arabicText": "فَٱلتَّـٰلِیَـٰتِ ذِكۡرًا\n",
    "translations": {
      "en": "and conveying [to all the world] a reminder:",
      "ms": "(Hamba-hambaKu) yang membaca kandungan Kitab Suci;",
      "id": "dan demi (rombongan) yang membacakan pelajaran,",
      "ar": "فَٱلتَّـٰلِیَـٰتِ ذِكۡرًا\n"
    }
  },
  {
    "id": 3792,
    "surahId": 37,
    "ayahNumber": 4,
    "arabicText": "إِنَّ إِلَـٰهَكُمۡ لَوَ ٰ⁠حِدࣱ\n",
    "translations": {
      "en": "Verily, most surely, your God is One –",
      "ms": "(Sumpah demi sumpah) sesungguhnya Tuhan kamu hanyalah Satu -",
      "id": "Sesungguhnya Tuhanmu benar-benar Esa.",
      "ar": "إِنَّ إِلَـٰهَكُمۡ لَوَ ٰ⁠حِدࣱ\n"
    }
  },
  {
    "id": 3793,
    "surahId": 37,
    "ayahNumber": 5,
    "arabicText": "رَّبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَمَا بَیۡنَهُمَا وَرَبُّ ٱلۡمَشَـٰرِقِ\n",
    "translations": {
      "en": "the Sustainer of the heavens and the earth and of all that is between them, and the Sustainer of all the points of sunrise!",
      "ms": "Tuhan (yang mencipta serta mentadbirkan) langit dan bumi dan segala yang ada di antara keduanya, dan Tuhan (yang mengatur) tempat-tempat terbit matahari.",
      "id": "Tuhan langit dan bumi dan apa yang berada di antara keduanya dan Tuhan tempat-tempat terbit matahari.",
      "ar": "رَّبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَمَا بَیۡنَهُمَا وَرَبُّ ٱلۡمَشَـٰرِقِ\n"
    }
  },
  {
    "id": 3794,
    "surahId": 37,
    "ayahNumber": 6,
    "arabicText": "إِنَّا زَیَّنَّا ٱلسَّمَاۤءَ ٱلدُّنۡیَا بِزِینَةٍ ٱلۡكَوَاكِبِ\n",
    "translations": {
      "en": "Behold, We have adorned the skies nearest to the earth with the beauty of stars,",
      "ms": "Sesungguhnya Kami telah menghiasi langit yang dekat (pada penglihatan penduduk bumi) dengan hiasan bintang-bintang.",
      "id": "Sesungguhnya Kami telah menghias langit yang terdekat dengan hiasan, yaitu bintang-bintang,",
      "ar": "إِنَّا زَیَّنَّا ٱلسَّمَاۤءَ ٱلدُّنۡیَا بِزِینَةٍ ٱلۡكَوَاكِبِ\n"
    }
  },
  {
    "id": 3795,
    "surahId": 37,
    "ayahNumber": 7,
    "arabicText": "وَحِفۡظࣰا مِّن كُلِّ شَیۡطَـٰنࣲ مَّارِدࣲ\n",
    "translations": {
      "en": "and have made them secure against every rebellious, satanic force,",
      "ms": "Dan (Kami pelihara urusan langit itu) dengan serapi-rapi kawalan dari (masuk campur) tiap-tiap Syaitan yang derhaka;",
      "id": "dan telah memeliharanya (sebenar-benarnya) dari setiap syaitan yang sangat durhaka,",
      "ar": "وَحِفۡظࣰا مِّن كُلِّ شَیۡطَـٰنࣲ مَّارِدࣲ\n"
    }
  },
  {
    "id": 3796,
    "surahId": 37,
    "ayahNumber": 8,
    "arabicText": "لَّا یَسَّمَّعُونَ إِلَى ٱلۡمَلَإِ ٱلۡأَعۡلَىٰ وَیُقۡذَفُونَ مِن كُلِّ جَانِبࣲ\n",
    "translations": {
      "en": "[so that] they [who seek to learn the unknowable] should not be able to overhear the host on high, but shall be repelled from all sides,",
      "ms": "(Dengan itu) mereka tidak dapat memasang telinga mendengar (percakapan malaikat) penduduk langit, dan mereka pula direjam (dengan api) dari segala arah dan penjuru,",
      "id": "syaitan syaitan itu tidak dapat mendengar-dengarkan (pembicaraan) para malaikat dan mereka dilempari dari segala penjuru.",
      "ar": "لَّا یَسَّمَّعُونَ إِلَى ٱلۡمَلَإِ ٱلۡأَعۡلَىٰ وَیُقۡذَفُونَ مِن كُلِّ جَانِبࣲ\n"
    }
  },
  {
    "id": 3797,
    "surahId": 37,
    "ayahNumber": 9,
    "arabicText": "دُحُورࣰاۖ وَلَهُمۡ عَذَابࣱ وَاصِبٌ\n",
    "translations": {
      "en": "cast out [from all grace], with lasting suffering in store for them [in the life to come];",
      "ms": "Untuk mengusir mereka; dan mereka pula beroleh azab seksa yang tidak putus-putus.",
      "id": "Untuk mengusir mereka dan bagi mereka siksaan yang kekal,",
      "ar": "دُحُورࣰاۖ وَلَهُمۡ عَذَابࣱ وَاصِبٌ\n"
    }
  },
  {
    "id": 3798,
    "surahId": 37,
    "ayahNumber": 10,
    "arabicText": "إِلَّا مَنۡ خَطِفَ ٱلۡخَطۡفَةَ فَأَتۡبَعَهُۥ شِهَابࣱ ثَاقِبࣱ\n",
    "translations": {
      "en": "but if anyone does succeed in snatching a glimpse [of such knowledge], he is [henceforth] pursued by a piercing flame.",
      "ms": "Kecuali sesiapa di antara Syaitan-syaitan itu yang curi mendengar mana-mana percakapan (malaikat), maka ia diburu dan diikuti (dengan rejaman) api yang menjulang lagi menembusi.",
      "id": "akan tetapi barangsiapa (di antara mereka) yang mencuri-curi (pembicaraan); maka ia dikejar oleh suluh api yang cemerlang.",
      "ar": "إِلَّا مَنۡ خَطِفَ ٱلۡخَطۡفَةَ فَأَتۡبَعَهُۥ شِهَابࣱ ثَاقِبࣱ\n"
    }
  },
  {
    "id": 3799,
    "surahId": 37,
    "ayahNumber": 11,
    "arabicText": "فَٱسۡتَفۡتِهِمۡ أَهُمۡ أَشَدُّ خَلۡقًا أَم مَّنۡ خَلَقۡنَاۤۚ إِنَّا خَلَقۡنَـٰهُم مِّن طِینࣲ لَّازِبِۭ\n",
    "translations": {
      "en": "AND NOW ask those [who deny the truth] to enlight­en thee: Were they more difficult to create than all those [untold marvels] that We have created? - for, behold, them have We created out of [mere] clay commingled with water!",
      "ms": "(Setelah nyata kekuasaan Kami) maka bertanyalah (wahai Muhammad) kepada mereka (yang ingkarkan hidupnya semula orang-orang mati): Adakah diri mereka lebih sukar hendak diciptakan, atau makhluk-makhluk lain yang Kami telah ciptakan? Sesungguhnya Kami telah mencipta mereka dari tanah liat (yang senang diubah dan diciptakan semula).",
      "id": "Maka tanyakanlah kepada mereka (musyrik Mekah): \"Apakah mereka yang lebih kukuh kejadiannya ataukah apa yang telah Kami ciptakan itu?\" Sesungguhnya Kami telah menciptakan mereka dari tanah liat.",
      "ar": "فَٱسۡتَفۡتِهِمۡ أَهُمۡ أَشَدُّ خَلۡقًا أَم مَّنۡ خَلَقۡنَاۤۚ إِنَّا خَلَقۡنَـٰهُم مِّن طِینࣲ لَّازِبِۭ\n"
    }
  },
  {
    "id": 3800,
    "surahId": 37,
    "ayahNumber": 12,
    "arabicText": "بَلۡ عَجِبۡتَ وَیَسۡخَرُونَ\n",
    "translations": {
      "en": "Nay, but whereas thou dost marvel, they [only] scoff;",
      "ms": "(Pertanyaan itu tidak juga berfaedah kepada mereka) bahkan engkau merasa hairan (terhadap keingkaran mereka), dan sebaliknya mereka mengejek-ejek (peneranganmu).",
      "id": "Bahkan kamu menjadi heran (terhadap keingkaran mereka) dan mereka menghinakan kamu.",
      "ar": "بَلۡ عَجِبۡتَ وَیَسۡخَرُونَ\n"
    }
  },
  {
    "id": 3801,
    "surahId": 37,
    "ayahNumber": 13,
    "arabicText": "وَإِذَا ذُكِّرُوا۟ لَا یَذۡكُرُونَ\n",
    "translations": {
      "en": "and when they are reminded [of the truth], they refuse to take it to heart;",
      "ms": "Dan apabila diperingatkan, mereka tetap tidak mahu menerima peringatan itu.",
      "id": "Dan apabila mereka diberi pelajaran mereka tiada mengingatnya.",
      "ar": "وَإِذَا ذُكِّرُوا۟ لَا یَذۡكُرُونَ\n"
    }
  },
  {
    "id": 3802,
    "surahId": 37,
    "ayahNumber": 14,
    "arabicText": "وَإِذَا رَأَوۡا۟ ءَایَةࣰ یَسۡتَسۡخِرُونَ\n",
    "translations": {
      "en": "and when they become aware of a [divine] message, they turn it to ridicule",
      "ms": "Dan apabila mereka melihat sesuatu tanda (yang membuktikan kekuasaan Kami dan kebenaranmu), mereka mencari-cari jalan memperolok-olokkannya, -",
      "id": "Dan apabila mereka melihat sesuatu tanda kebesaran Allah, mereka sangat menghinakan.",
      "ar": "وَإِذَا رَأَوۡا۟ ءَایَةࣰ یَسۡتَسۡخِرُونَ\n"
    }
  },
  {
    "id": 3803,
    "surahId": 37,
    "ayahNumber": 15,
    "arabicText": "وَقَالُوۤا۟ إِنۡ هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّبِینٌ\n",
    "translations": {
      "en": "and say: “This is clearly nothing but [a mortal’s] spellbinding eloquence!",
      "ms": "Serta mereka berkata: \"Ini tidak lain hanyalah sihir yang nyata.",
      "id": "Dan mereka berkata \"Ini tiada lain hanyalah sihir yang nyata.",
      "ar": "وَقَالُوۤا۟ إِنۡ هَـٰذَاۤ إِلَّا سِحۡرࣱ مُّبِینٌ\n"
    }
  },
  {
    "id": 3804,
    "surahId": 37,
    "ayahNumber": 16,
    "arabicText": "أَءِذَا مِتۡنَا وَكُنَّا تُرَابࣰا وَعِظَـٰمًا أَءِنَّا لَمَبۡعُوثُونَ\n",
    "translations": {
      "en": "Why - after we have died and become mere dust and bones, shall we, forsooth, be raised from the dead? –",
      "ms": "\"Adakah sesudah kita mati serta menjadi tanah dan tulang, adakah kita akan dibangkitkan hidup semula?",
      "id": "Apakah apabila kami telah mati dan telah menjadi tanah serta menjadi tulang belulang, apakah benar-benar kami akan dibangkitkan (kembali)?",
      "ar": "أَءِذَا مِتۡنَا وَكُنَّا تُرَابࣰا وَعِظَـٰمًا أَءِنَّا لَمَبۡعُوثُونَ\n"
    }
  },
  {
    "id": 3805,
    "surahId": 37,
    "ayahNumber": 17,
    "arabicText": "أَوَءَابَاۤؤُنَا ٱلۡأَوَّلُونَ\n",
    "translations": {
      "en": "and perhaps also our forebears of old?”",
      "ms": "\"Dan adakah juga datuk nenek kita yang telah lalu (akan dibangkitkan hidup semula)?\"",
      "id": "Dan apakah bapak-bapak kami yang telah terdahulu (akan dibangkitkan pula)\"?",
      "ar": "أَوَءَابَاۤؤُنَا ٱلۡأَوَّلُونَ\n"
    }
  },
  {
    "id": 3806,
    "surahId": 37,
    "ayahNumber": 18,
    "arabicText": "قُلۡ نَعَمۡ وَأَنتُمۡ دَ ٰ⁠خِرُونَ\n",
    "translations": {
      "en": "Say: “Yea, indeed - and most abject will you then be!” –",
      "ms": "Jawablah (wahai Muhammad): \"Ya, benar !(Kamu semua akan dibangkitkan) dengan keadaan hina-dina \".",
      "id": "Katakanlah: \"Ya, dan kamu akan terhina\"",
      "ar": "قُلۡ نَعَمۡ وَأَنتُمۡ دَ ٰ⁠خِرُونَ\n"
    }
  },
  {
    "id": 3807,
    "surahId": 37,
    "ayahNumber": 19,
    "arabicText": "فَإِنَّمَا هِیَ زَجۡرَةࣱ وَ ٰ⁠حِدَةࣱ فَإِذَا هُمۡ یَنظُرُونَ\n",
    "translations": {
      "en": "for that [resurrection which they deride] will be [upon them of a sudden, as if it were] but a single accusing cry - and then, lo! they will begin to see [the truth]",
      "ms": "(Kebangkitan ini mudah) kerana sesungguhnya ia boleh berlaku hanyalah dengan suara sahaja, maka dengan serta mereka semuanya (bangkit) melihat (apa yang akan jadi).",
      "id": "Maka sesungguhnya kebangkitan itu hanya dengan satu teriakan saja; maka tiba-tiba mereka meIihatnya.",
      "ar": "فَإِنَّمَا هِیَ زَجۡرَةࣱ وَ ٰ⁠حِدَةࣱ فَإِذَا هُمۡ یَنظُرُونَ\n"
    }
  },
  {
    "id": 3808,
    "surahId": 37,
    "ayahNumber": 20,
    "arabicText": "وَقَالُوا۟ یَـٰوَیۡلَنَا هَـٰذَا یَوۡمُ ٱلدِّینِ\n",
    "translations": {
      "en": "and will say: “Oh, woe unto us! This is the Day of Judgment!”",
      "ms": "Dan (pada saat itu) mereka berkata:\" Wahai celakanya kami, ini ialah hari balasan!\"",
      "id": "Dan mereka berkata: \"Aduhai celakalah kita!\" Inilah hari pembalasan.",
      "ar": "وَقَالُوا۟ یَـٰوَیۡلَنَا هَـٰذَا یَوۡمُ ٱلدِّینِ\n"
    }
  },
  {
    "id": 3809,
    "surahId": 37,
    "ayahNumber": 21,
    "arabicText": "هَـٰذَا یَوۡمُ ٱلۡفَصۡلِ ٱلَّذِی كُنتُم بِهِۦ تُكَذِّبُونَ\n",
    "translations": {
      "en": "[And they will be told:] “This is the Day of Distinction [between the true and the false - the Day] which you were wont to call a lie!”",
      "ms": "(Lalu malaikat berkata kepada mereka): \" Ini ialah hari memutuskan hukum untuk memberi balasan yang dahulu kamu mendustakannya \".",
      "id": "Inilah hari keputusan yang kamu selalu mendustakannya.",
      "ar": "هَـٰذَا یَوۡمُ ٱلۡفَصۡلِ ٱلَّذِی كُنتُم بِهِۦ تُكَذِّبُونَ\n"
    }
  },
  {
    "id": 3810,
    "surahId": 37,
    "ayahNumber": 22,
    "arabicText": "۞ ٱحۡشُرُوا۟ ٱلَّذِینَ ظَلَمُوا۟ وَأَزۡوَ ٰ⁠جَهُمۡ وَمَا كَانُوا۟ یَعۡبُدُونَ\n",
    "translations": {
      "en": "[And God will thus command:] “Assemble all those who were bent on evildoing, together with others of their ilk and [with] all that they were wont to worship",
      "ms": "(Allah berfirman kepada malaikat):\" Himpunkanlah orang-orang yang zalim itu, dan orang-orang yang berkeadaan seperti mereka, serta benda-benda yang mereka sembah -",
      "id": "(kepada malaikat diperintahkan): \"Kumpulkanlah orang-orang yang zalim beserta teman sejawat mereka dan sembahan-sembahan yang selalu mereka sembah,",
      "ar": "۞ ٱحۡشُرُوا۟ ٱلَّذِینَ ظَلَمُوا۟ وَأَزۡوَ ٰ⁠جَهُمۡ وَمَا كَانُوا۟ یَعۡبُدُونَ\n"
    }
  },
  {
    "id": 3811,
    "surahId": 37,
    "ayahNumber": 23,
    "arabicText": "مِن دُونِ ٱللَّهِ فَٱهۡدُوهُمۡ إِلَىٰ صِرَ ٰ⁠طِ ٱلۡجَحِیمِ\n",
    "translations": {
      "en": "instead of God, and lead them all onto the way to the blazing fire,",
      "ms": "\"Yang lain dari Allah serta hadapkanlah mereka ke jalan yang membawa ke neraka.",
      "id": "selain Allah; maka tunjukkanlah kepada mereka jalan ke neraka.",
      "ar": "مِن دُونِ ٱللَّهِ فَٱهۡدُوهُمۡ إِلَىٰ صِرَ ٰ⁠طِ ٱلۡجَحِیمِ\n"
    }
  },
  {
    "id": 3812,
    "surahId": 37,
    "ayahNumber": 24,
    "arabicText": "وَقِفُوهُمۡۖ إِنَّهُم مَّسۡـُٔولُونَ\n",
    "translations": {
      "en": "and halt them [there]!” [And then,] behold, they shall be asked,",
      "ms": "\"Dan hentikanlah mereka (menunggu), kerana sesungguhnya mereka akan disoal:",
      "id": "Dan tahanlah mereka (di tempat perhentian) karena sesungguhnya mereka akan ditanya:",
      "ar": "وَقِفُوهُمۡۖ إِنَّهُم مَّسۡـُٔولُونَ\n"
    }
  },
  {
    "id": 3813,
    "surahId": 37,
    "ayahNumber": 25,
    "arabicText": "مَا لَكُمۡ لَا تَنَاصَرُونَ\n",
    "translations": {
      "en": "“How is it that [now] you cannot succour one another?”",
      "ms": "\"Mengapa kamu tidak bertolong-tolongan (sebagaimana yang kamu dakwakan dahulu?\"",
      "id": "\"Kenapa kamu tidak tolong menolong?\"",
      "ar": "مَا لَكُمۡ لَا تَنَاصَرُونَ\n"
    }
  },
  {
    "id": 3814,
    "surahId": 37,
    "ayahNumber": 26,
    "arabicText": "بَلۡ هُمُ ٱلۡیَوۡمَ مُسۡتَسۡلِمُونَ\n",
    "translations": {
      "en": "Nay, but on that Day they would willingly surrender [to God];",
      "ms": "(Mereka pada ketika itu tidak dapat berbuat apa-apa) bahkan mereka pada hari itu menyerah diri dengan hina (untuk diadili);",
      "id": "Bahkan mereka pada hari itu menyerah diri.",
      "ar": "بَلۡ هُمُ ٱلۡیَوۡمَ مُسۡتَسۡلِمُونَ\n"
    }
  },
  {
    "id": 3815,
    "surahId": 37,
    "ayahNumber": 27,
    "arabicText": "وَأَقۡبَلَ بَعۡضُهُمۡ عَلَىٰ بَعۡضࣲ یَتَسَاۤءَلُونَ\n",
    "translations": {
      "en": "but [since it will be too late,] they will turn upon one another, demanding of each other [to relieve them of the burden of their past sins].",
      "ms": "Dan masing-masing pun mengadap satu sama lain, sambil kata mengata dan cela mencela.",
      "id": "Sebahagian dan mereka menghadap kepada sebahagian yang lain berbantah-bantahan.",
      "ar": "وَأَقۡبَلَ بَعۡضُهُمۡ عَلَىٰ بَعۡضࣲ یَتَسَاۤءَلُونَ\n"
    }
  },
  {
    "id": 3816,
    "surahId": 37,
    "ayahNumber": 28,
    "arabicText": "قَالُوۤا۟ إِنَّكُمۡ كُنتُمۡ تَأۡتُونَنَا عَنِ ٱلۡیَمِینِ\n",
    "translations": {
      "en": "Some [of them] will say: “Behold, you were wont to approach us [deceptively] from the right!”",
      "ms": "Pengikut-pengikut berkata (kepada ketuanya):\" Sesungguhnya kamu dahulu selalu datang menyekat kami (daripada beriman) dengan menggunakan kuasa kamu\".",
      "id": "Pengikut-pengikut mereka berkata (kepada pemimpin-pemimpin mereka): \"Sesungguhnya kamulah yang datang kepada kami dan kanan.",
      "ar": "قَالُوۤا۟ إِنَّكُمۡ كُنتُمۡ تَأۡتُونَنَا عَنِ ٱلۡیَمِینِ\n"
    }
  },
  {
    "id": 3817,
    "surahId": 37,
    "ayahNumber": 29,
    "arabicText": "قَالُوا۟ بَل لَّمۡ تَكُونُوا۟ مُؤۡمِنِینَ\n",
    "translations": {
      "en": "[To which] the others will reply: “Nay, you yourselves were bereft of all faith!",
      "ms": "Ketua-ketuanya menjawab: \" (Tidak!) Bahkan kamulah sendiri tidak mahu menjadi orang-orang yang beriman!",
      "id": "Pemimpin-pemimpin mereka menjawab: \"Sebenarnya kamulah yang tidak beriman\".",
      "ar": "قَالُوا۟ بَل لَّمۡ تَكُونُوا۟ مُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 3818,
    "surahId": 37,
    "ayahNumber": 30,
    "arabicText": "وَمَا كَانَ لَنَا عَلَیۡكُم مِّن سُلۡطَـٰنِۭۖ بَلۡ كُنتُمۡ قَوۡمࣰا طَـٰغِینَ\n",
    "translations": {
      "en": "Moreover, we had no power at all over you: nay, you were people filled with overweening arrogance!",
      "ms": "\"Dan kami (selain daripada mengajak kamu (tidak mempunyai sebarang kuasa memerintah kamu, bahkan kamu sememangnya kaum yang melampaui batas.",
      "id": "Dan sekali-kali kami tidak berkuasa terhadapmu, bahkan kamulah kaum yang melampaui batas.",
      "ar": "وَمَا كَانَ لَنَا عَلَیۡكُم مِّن سُلۡطَـٰنِۭۖ بَلۡ كُنتُمۡ قَوۡمࣰا طَـٰغِینَ\n"
    }
  },
  {
    "id": 3819,
    "surahId": 37,
    "ayahNumber": 31,
    "arabicText": "فَحَقَّ عَلَیۡنَا قَوۡلُ رَبِّنَاۤۖ إِنَّا لَذَاۤىِٕقُونَ\n",
    "translations": {
      "en": "But now our Sustainer’s word has come true against us [as well]: verily, we are bound to taste [the fruit of our sins].",
      "ms": "(Dengan keadaan diri kita yang sedemikian) maka tetaplah di atas kita janji seksa (yang dijanjikan) oleh Tuhan kita, bahawa kita semua tentu akan merasai (azab itu).",
      "id": "Maka pastilah putusan (azab) Tuhan kita menimpa atas kita; sesungguhnya kita akan merasakan (azab itu).",
      "ar": "فَحَقَّ عَلَیۡنَا قَوۡلُ رَبِّنَاۤۖ إِنَّا لَذَاۤىِٕقُونَ\n"
    }
  },
  {
    "id": 3820,
    "surahId": 37,
    "ayahNumber": 32,
    "arabicText": "فَأَغۡوَیۡنَـٰكُمۡ إِنَّا كُنَّا غَـٰوِینَ\n",
    "translations": {
      "en": "So then, [if it be true that] we have caused you to err grievously - behold, we ourselves had been lost in grievous error!”",
      "ms": "\"(Dengan sebab ketentuan yang tersebut) maka kami pun mengajak kamu menjadi sesat, kerana sebenarnya kami adalah orang-orang sesat\"",
      "id": "Maka kami telah menyesatkan kamu, sesungguhnya kami adalah orang-orang yang sesat.",
      "ar": "فَأَغۡوَیۡنَـٰكُمۡ إِنَّا كُنَّا غَـٰوِینَ\n"
    }
  },
  {
    "id": 3821,
    "surahId": 37,
    "ayahNumber": 33,
    "arabicText": "فَإِنَّهُمۡ یَوۡمَىِٕذࣲ فِی ٱلۡعَذَابِ مُشۡتَرِكُونَ\n",
    "translations": {
      "en": "And, verily, on that Day they all will share in their common suffering.",
      "ms": "Maka sesungguhnya mereka semua pada hari itu, menderita azab bersama.",
      "id": "Maka sesungguhnya mereka pada hari itu bersama-sama dalam azab.",
      "ar": "فَإِنَّهُمۡ یَوۡمَىِٕذࣲ فِی ٱلۡعَذَابِ مُشۡتَرِكُونَ\n"
    }
  },
  {
    "id": 3822,
    "surahId": 37,
    "ayahNumber": 34,
    "arabicText": "إِنَّا كَذَ ٰ⁠لِكَ نَفۡعَلُ بِٱلۡمُجۡرِمِینَ\n",
    "translations": {
      "en": "Verily, thus shall We deal with all who were lost in sin:",
      "ms": "Sesungguhnya demikianlah Kami melakukan kepada orang-orang yang berdosa.",
      "id": "Sesungguhnya demikianlah Kami berbuat terhadap orang-orang yang berbuat jahat.",
      "ar": "إِنَّا كَذَ ٰ⁠لِكَ نَفۡعَلُ بِٱلۡمُجۡرِمِینَ\n"
    }
  },
  {
    "id": 3823,
    "surahId": 37,
    "ayahNumber": 35,
    "arabicText": "إِنَّهُمۡ كَانُوۤا۟ إِذَا قِیلَ لَهُمۡ لَاۤ إِلَـٰهَ إِلَّا ٱللَّهُ یَسۡتَكۡبِرُونَ\n",
    "translations": {
      "en": "for, behold, whenever they were told, “There is no deity save God,” they would glory in their arrogance",
      "ms": "Sebenarnya mereka dahulu apabila dikatakan kepadanya;\" (ketahuilah, bahawa) tiada Tuhan yang sebenar-benarnya melainkan Allah\" - mereka bersikap takbur mengingkarinya, -",
      "id": "Sesungguhnya mereka dahulu apabila dikatakan kepada mereka: \"Laa ilaaha illallah\" (Tiada Tuhan yang berhak disembah melainkan Allah) mereka menyombongkan diri,",
      "ar": "إِنَّهُمۡ كَانُوۤا۟ إِذَا قِیلَ لَهُمۡ لَاۤ إِلَـٰهَ إِلَّا ٱللَّهُ یَسۡتَكۡبِرُونَ\n"
    }
  },
  {
    "id": 3824,
    "surahId": 37,
    "ayahNumber": 36,
    "arabicText": "وَیَقُولُونَ أَىِٕنَّا لَتَارِكُوۤا۟ ءَالِهَتِنَا لِشَاعِرࣲ مَّجۡنُونِۭ\n",
    "translations": {
      "en": "and would say, “Shall we, then, give up our deities at the bidding of a mad poet?”",
      "ms": "Serta mereka berkata: \" Patutkah kami mesti meninggalkan tuhan-tuhan yang kami sembah, kerana mendengar ajakan seorang penyair gila?\"",
      "id": "dan mereka berkata: \"Apakah sesungguhnya kami harus meninggalkan sembahan-sembahan kami karena seorang penyair gila?\"",
      "ar": "وَیَقُولُونَ أَىِٕنَّا لَتَارِكُوۤا۟ ءَالِهَتِنَا لِشَاعِرࣲ مَّجۡنُونِۭ\n"
    }
  },
  {
    "id": 3825,
    "surahId": 37,
    "ayahNumber": 37,
    "arabicText": "بَلۡ جَاۤءَ بِٱلۡحَقِّ وَصَدَّقَ ٱلۡمُرۡسَلِینَ\n",
    "translations": {
      "en": "Nay, but he [whom you call a mad poet] has brought the truth; and he confirms the truth of [what the earlier of God’s] message-bearers [have taught].",
      "ms": "(Tidak! Nabi Muhammad bukan penyair dan bukan pula seorang gila) bahkan ia telah membawa kebenaran (tauhid), dan mengesahkan kebenaran (tauhid) yang dibawa oleh Rasul-rasul (yang terdahulu daripadanya).",
      "id": "Sebenarnya dia (Muhammad) telah datang membawa kebenaran dan membenarkan rasul-rasul (sebelumnya).",
      "ar": "بَلۡ جَاۤءَ بِٱلۡحَقِّ وَصَدَّقَ ٱلۡمُرۡسَلِینَ\n"
    }
  },
  {
    "id": 3826,
    "surahId": 37,
    "ayahNumber": 38,
    "arabicText": "إِنَّكُمۡ لَذَاۤىِٕقُوا۟ ٱلۡعَذَابِ ٱلۡأَلِیمِ\n",
    "translations": {
      "en": "Behold, you will indeed taste grievous suffering [in the life to come],",
      "ms": "Sesungguhnya kamu (wahai orang-orang musyrik) akan merasai azab seksa yang tidak terperi sakitnya.",
      "id": "Sesungguhnya kamu pasti akan merasakan azab yang pedih.",
      "ar": "إِنَّكُمۡ لَذَاۤىِٕقُوا۟ ٱلۡعَذَابِ ٱلۡأَلِیمِ\n"
    }
  },
  {
    "id": 3827,
    "surahId": 37,
    "ayahNumber": 39,
    "arabicText": "وَمَا تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ\n",
    "translations": {
      "en": "although you shall not be requited for aught but what you were wont to do.",
      "ms": "Dan kamu tidak dibalas melainkan (dengan balasan yang sepadan) dengan apa yang kamu telah kerjakan;",
      "id": "Dan kamu tidak diberi pembalasan melainkan terhadap kejahatan yang telah kamu kerjakan,",
      "ar": "وَمَا تُجۡزَوۡنَ إِلَّا مَا كُنتُمۡ تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 3828,
    "surahId": 37,
    "ayahNumber": 40,
    "arabicText": "إِلَّا عِبَادَ ٱللَّهِ ٱلۡمُخۡلَصِینَ\n",
    "translations": {
      "en": "Not so, however, God’s true servants:",
      "ms": "Kecuali hamba-hamba Allah yang dibersihkan dari sebarang syirik,",
      "id": "tetapi hamba-hamba Allah yang dibersihkan (dari dosa).",
      "ar": "إِلَّا عِبَادَ ٱللَّهِ ٱلۡمُخۡلَصِینَ\n"
    }
  },
  {
    "id": 3829,
    "surahId": 37,
    "ayahNumber": 41,
    "arabicText": "أُو۟لَـٰۤىِٕكَ لَهُمۡ رِزۡقࣱ مَّعۡلُومࣱ\n",
    "translations": {
      "en": "[in the hereafter,] theirs shall be a sustenance which they will recognize",
      "ms": "Mereka itu beroleh limpah kurnia yang termaklum,",
      "id": "Mereka itu memperoleh rezeki yang tertentu,",
      "ar": "أُو۟لَـٰۤىِٕكَ لَهُمۡ رِزۡقࣱ مَّعۡلُومࣱ\n"
    }
  },
  {
    "id": 3830,
    "surahId": 37,
    "ayahNumber": 42,
    "arabicText": "فَوَ ٰ⁠كِهُ وَهُم مُّكۡرَمُونَ\n",
    "translations": {
      "en": "as the fruits [of their life on earth]; and honoured shall they be",
      "ms": "Iaitu buah-buahan (yang lazat), serta mereka mendapat penghormatan,",
      "id": "yaitu buah-buahan. Dan mereka adalah orang-orang yang dimuliakan,",
      "ar": "فَوَ ٰ⁠كِهُ وَهُم مُّكۡرَمُونَ\n"
    }
  },
  {
    "id": 3831,
    "surahId": 37,
    "ayahNumber": 43,
    "arabicText": "فِی جَنَّـٰتِ ٱلنَّعِیمِ\n",
    "translations": {
      "en": "in gardens of bliss,",
      "ms": "Di dalam syurga-syurga yang penuh melimpah dengan berjenis-jenis nikmat.",
      "id": "di dalam surga-surga yang penuh nikmat.",
      "ar": "فِی جَنَّـٰتِ ٱلنَّعِیمِ\n"
    }
  },
  {
    "id": 3832,
    "surahId": 37,
    "ayahNumber": 44,
    "arabicText": "عَلَىٰ سُرُرࣲ مُّتَقَـٰبِلِینَ\n",
    "translations": {
      "en": "facing one another [in love] upon thrones of happiness.",
      "ms": "Mereka duduk berhadap-hadapan di atas pelamin-pelamin kebesaran;",
      "id": "di atas takhta-takhta kebesaran berhadap-hadapan.",
      "ar": "عَلَىٰ سُرُرࣲ مُّتَقَـٰبِلِینَ\n"
    }
  },
  {
    "id": 3833,
    "surahId": 37,
    "ayahNumber": 45,
    "arabicText": "یُطَافُ عَلَیۡهِم بِكَأۡسࣲ مِّن مَّعِینِۭ\n",
    "translations": {
      "en": "A cup will be passed round among them [with a drink] from unsullied springs,",
      "ms": "Diedarkan kepada mereka piala yang berisi arak (yang diambil) dari sungainya yang mengalir,",
      "id": "Diedarkan kepada mereka gelas yang berisi khamar dari sungai yang mengalir.",
      "ar": "یُطَافُ عَلَیۡهِم بِكَأۡسࣲ مِّن مَّعِینِۭ\n"
    }
  },
  {
    "id": 3834,
    "surahId": 37,
    "ayahNumber": 46,
    "arabicText": "بَیۡضَاۤءَ لَذَّةࣲ لِّلشَّـٰرِبِینَ\n",
    "translations": {
      "en": "clear, delightful to those who drink it:",
      "ms": "Minuman itu putih bersih, lagi lazat rasanya, bagi orang-orang yang meminumnya,",
      "id": "(Warnanya) putih bersih, sedap rasanya bagi orang-orang yang minum.",
      "ar": "بَیۡضَاۤءَ لَذَّةࣲ لِّلشَّـٰرِبِینَ\n"
    }
  },
  {
    "id": 3835,
    "surahId": 37,
    "ayahNumber": 47,
    "arabicText": "لَا فِیهَا غَوۡلࣱ وَلَا هُمۡ عَنۡهَا یُنزَفُونَ\n",
    "translations": {
      "en": "no headiness will be in it, and they will not get drunk thereon.",
      "ms": "Ia tidak mengandungi sesuatu yang membahayakan, dan tidak pula mereka mabuk kerana menikmatinya.",
      "id": "Tidak ada dalam khamar itu alkohol dan mereka tiada mabuk karenanya.",
      "ar": "لَا فِیهَا غَوۡلࣱ وَلَا هُمۡ عَنۡهَا یُنزَفُونَ\n"
    }
  },
  {
    "id": 3836,
    "surahId": 37,
    "ayahNumber": 48,
    "arabicText": "وَعِندَهُمۡ قَـٰصِرَ ٰ⁠تُ ٱلطَّرۡفِ عِینࣱ\n",
    "translations": {
      "en": "And with them will be mates of modest gaze, most beautiful of eye,",
      "ms": "Sedang di sisi mereka ada pula bidadari-bidadari yang tidak menumpukan pandangannya melainkan kepada mereka, lagi yang amat indah luas matanya;",
      "id": "Di sisi mereka ada bidadari-bidadari yang tidak liar pandangannya dan jelita matanya,",
      "ar": "وَعِندَهُمۡ قَـٰصِرَ ٰ⁠تُ ٱلطَّرۡفِ عِینࣱ\n"
    }
  },
  {
    "id": 3837,
    "surahId": 37,
    "ayahNumber": 49,
    "arabicText": "كَأَنَّهُنَّ بَیۡضࣱ مَّكۡنُونࣱ\n",
    "translations": {
      "en": "[as free of faults] as if they were hidden [ostrich] eggs.",
      "ms": "(Putih kekuning-kuningan) seolah-olah mereka telur (burung kasuari) yang tersimpan dengan sebaik-baiknya.",
      "id": "seakan-akan mereka adalah telur (burung unta) yang tersimpan dengan baik.",
      "ar": "كَأَنَّهُنَّ بَیۡضࣱ مَّكۡنُونࣱ\n"
    }
  },
  {
    "id": 3838,
    "surahId": 37,
    "ayahNumber": 50,
    "arabicText": "فَأَقۡبَلَ بَعۡضُهُمۡ عَلَىٰ بَعۡضࣲ یَتَسَاۤءَلُونَ\n",
    "translations": {
      "en": "And they will all turn to one another, asking each other [about their past lives].",
      "ms": "(Tinggalah penduduk Syurga itu menikmati kesenangan), lalu setengahnya mengadap yang lain, sambil berbincang dan bertanya-tanyaan.",
      "id": "Lalu sebahagian mereka menghadap kepada sebahagian yang lain sambil bercakap-cakap.",
      "ar": "فَأَقۡبَلَ بَعۡضُهُمۡ عَلَىٰ بَعۡضࣲ یَتَسَاۤءَلُونَ\n"
    }
  },
  {
    "id": 3839,
    "surahId": 37,
    "ayahNumber": 51,
    "arabicText": "قَالَ قَاۤىِٕلࣱ مِّنۡهُمۡ إِنِّی كَانَ لِی قَرِینࣱ\n",
    "translations": {
      "en": "One of them speaks thus: “Behold, I had [on earth] a close companion",
      "ms": "Seorang di antaranya berkata: \" Sesungguhnya aku (di dunia) dahulu, ada seorang rakan (yang menempelak daku).",
      "id": "Berkatalah salah seorang di antara mereka: \"Sesungguhnya aku dahulu (di dunia) mempunyai seorang teman,",
      "ar": "قَالَ قَاۤىِٕلࣱ مِّنۡهُمۡ إِنِّی كَانَ لِی قَرِینࣱ\n"
    }
  },
  {
    "id": 3840,
    "surahId": 37,
    "ayahNumber": 52,
    "arabicText": "یَقُولُ أَءِنَّكَ لَمِنَ ٱلۡمُصَدِّقِینَ\n",
    "translations": {
      "en": "who was wont to ask [me], ‘Why - art thou really one of those who believe it to be true",
      "ms": "\"katanya: Adakah engkau juga salah seorang dari golongan yang mengakui benarnya (kebangkitan orang-orang mati pada hari akhirat)?",
      "id": "yang berkata: \"Apakah kamu sungguh-sungguh termasuk orang-orang yang membenarkan (hari berbangkit)?",
      "ar": "یَقُولُ أَءِنَّكَ لَمِنَ ٱلۡمُصَدِّقِینَ\n"
    }
  },
  {
    "id": 3841,
    "surahId": 37,
    "ayahNumber": 53,
    "arabicText": "أَءِذَا مِتۡنَا وَكُنَّا تُرَابࣰا وَعِظَـٰمًا أَءِنَّا لَمَدِینُونَ\n",
    "translations": {
      "en": "[that] after we have died and become mere dust and bones we shall, forsooth, be brought to judgment?”’",
      "ms": "\"Adakah sesudah kita mati dan menjadi tanah dan tulang, adakah kita akan (dihidupkan semula serta) dibalas apa yang telah kita lakukan? \" '",
      "id": "Apakah bila kita telah mati dan kita telah menjadi tanah dan tulang belulang, apakah sesungguhnya kita benar-benar (akan dibangkitkan) untuk diberi pembalasan?\"",
      "ar": "أَءِذَا مِتۡنَا وَكُنَّا تُرَابࣰا وَعِظَـٰمًا أَءِنَّا لَمَدِینُونَ\n"
    }
  },
  {
    "id": 3842,
    "surahId": 37,
    "ayahNumber": 54,
    "arabicText": "قَالَ هَلۡ أَنتُم مُّطَّلِعُونَ\n",
    "translations": {
      "en": "[And] he adds: “Would you like to look [and see him]?” –",
      "ms": "(Setelah menceritakan perihal rakannya itu) ia berkata lagi: \" Adakah kamu hendak melihat (keadaan rakanku yang ingkar itu)?\"",
      "id": "Berkata pulalah ia: \"Maukah kamu meninjau (temanku itu)?\"",
      "ar": "قَالَ هَلۡ أَنتُم مُّطَّلِعُونَ\n"
    }
  },
  {
    "id": 3843,
    "surahId": 37,
    "ayahNumber": 55,
    "arabicText": "فَٱطَّلَعَ فَرَءَاهُ فِی سَوَاۤءِ ٱلۡجَحِیمِ\n",
    "translations": {
      "en": "and then he looks and sees that [companion of his] in the midst of the blazing fire,",
      "ms": "Maka ia pun memandang (ke arah neraka), lalu dilihatnya rakannya itu berada ditengah-tengah neraka yang menjulang-julang.",
      "id": "Maka ia meninjaunya, lalu dia melihat temannya itu di tengah-tengah neraka menyala-nyala.",
      "ar": "فَٱطَّلَعَ فَرَءَاهُ فِی سَوَاۤءِ ٱلۡجَحِیمِ\n"
    }
  },
  {
    "id": 3844,
    "surahId": 37,
    "ayahNumber": 56,
    "arabicText": "قَالَ تَٱللَّهِ إِن كِدتَّ لَتُرۡدِینِ\n",
    "translations": {
      "en": "and says: “By God! Verily, thou hast almost destroyed me [too, O my erstwhile companion]",
      "ms": "Ia pun (menempelaknya dengan) berkata:\" Demi Allah! Nyaris-nyaris engkau menceburkan daku dalam kebinasaan.",
      "id": "Ia berkata (pula): \"Demi Allah, sesungguhnya kamu benar-benar hampir mencelakakanku,",
      "ar": "قَالَ تَٱللَّهِ إِن كِدتَّ لَتُرۡدِینِ\n"
    }
  },
  {
    "id": 3845,
    "surahId": 37,
    "ayahNumber": 57,
    "arabicText": "وَلَوۡلَا نِعۡمَةُ رَبِّی لَكُنتُ مِنَ ٱلۡمُحۡضَرِینَ\n",
    "translations": {
      "en": "for had it not been for my Sustainer’s favour, I would surely be [now] among those who are given over [to suffering]!",
      "ms": "\"Dan kalaulah tidak disebabkan nikmat pemberian Tuhanku (dengan hidayah petunjuk), nescaya akan menjadilah daku dari orang-orang yang dibawa hadir (untuk menerima balasan azab) \".",
      "id": "jikalau tidaklah karena nikmat Tuhanku pastilah aku termasuk orang-orang yang diseret (ke neraka).",
      "ar": "وَلَوۡلَا نِعۡمَةُ رَبِّی لَكُنتُ مِنَ ٱلۡمُحۡضَرِینَ\n"
    }
  },
  {
    "id": 3846,
    "surahId": 37,
    "ayahNumber": 58,
    "arabicText": "أَفَمَا نَحۡنُ بِمَیِّتِینَ\n",
    "translations": {
      "en": "But then, [O my friends in paradise,] is it [really] so that we are not to die",
      "ms": "(Kemudian ia berkata kepada rakan-rakanya yang sedang menikmati kesenangan di Syurga bersama): \" Bukankah kita (setelah mendapat nikmat-nikmat ini) tidak akan mati lagi, -",
      "id": "Maka apakah kita tidak akan mati?,",
      "ar": "أَفَمَا نَحۡنُ بِمَیِّتِینَ\n"
    }
  },
  {
    "id": 3847,
    "surahId": 37,
    "ayahNumber": 59,
    "arabicText": "إِلَّا مَوۡتَتَنَا ٱلۡأُولَىٰ وَمَا نَحۡنُ بِمُعَذَّبِینَ\n",
    "translations": {
      "en": "[again,] beyond our previous death, and that we shall never [again] be made to suffer?",
      "ms": "\"Selain dari kematian kita yang dahulu, dan kita juga tidak akan terkena seksa?\"",
      "id": "melainkan hanya kematian kita yang pertama saja (di dunia), dan kita tidak akan disiksa (di akhirat ini)?",
      "ar": "إِلَّا مَوۡتَتَنَا ٱلۡأُولَىٰ وَمَا نَحۡنُ بِمُعَذَّبِینَ\n"
    }
  },
  {
    "id": 3848,
    "surahId": 37,
    "ayahNumber": 60,
    "arabicText": "إِنَّ هَـٰذَا لَهُوَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n",
    "translations": {
      "en": "Verily, this - this indeed - is the triumph supreme!”",
      "ms": "Sesungguhnya (nikmat-nikmat kesenangan Syurga) yang demikian, ialah sebenar-benar pendapatan dan kemenangan yang besar.",
      "id": "Sesungguhnya ini benar-benar kemenangan yang besar.",
      "ar": "إِنَّ هَـٰذَا لَهُوَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n"
    }
  },
  {
    "id": 3849,
    "surahId": 37,
    "ayahNumber": 61,
    "arabicText": "لِمِثۡلِ هَـٰذَا فَلۡیَعۡمَلِ ٱلۡعَـٰمِلُونَ\n",
    "translations": {
      "en": "For the like of this, then, let them labour, those who labour [in God’s way]!",
      "ms": "Untuk memperoleh (kejayaan) yang seperti inilah hendaknya orang-orang yang beramal melakukan amal usahanya dengan bersungguh-sungguh (di dunia).",
      "id": "Untuk kemenangan serupa ini hendaklah berusaha orang-orang yang bekerja\"",
      "ar": "لِمِثۡلِ هَـٰذَا فَلۡیَعۡمَلِ ٱلۡعَـٰمِلُونَ\n"
    }
  },
  {
    "id": 3850,
    "surahId": 37,
    "ayahNumber": 62,
    "arabicText": "أَذَ ٰ⁠لِكَ خَیۡرࣱ نُّزُلًا أَمۡ شَجَرَةُ ٱلزَّقُّومِ\n",
    "translations": {
      "en": "Is such [a paradise] the better welcome - or the [hellish] tree of deadly fruit?",
      "ms": "Manakah yang lebih baik, limpah kurniaan yang termaklum itu atau pokok zaqqum?",
      "id": "(Makanan surga) itukah hidangan yang lebih baik ataukah pohon zaqqum.",
      "ar": "أَذَ ٰ⁠لِكَ خَیۡرࣱ نُّزُلًا أَمۡ شَجَرَةُ ٱلزَّقُّومِ\n"
    }
  },
  {
    "id": 3851,
    "surahId": 37,
    "ayahNumber": 63,
    "arabicText": "إِنَّا جَعَلۡنَـٰهَا فِتۡنَةࣰ لِّلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "Verily, We have caused it to be a trial for evildoers:",
      "ms": "Sesungguhnya Kami jadikan pokok zaqqum itu satu ujian bagi orang-orang yang zalim (di dunia dan azab seksa bagi mereka di akhirat).",
      "id": "Sesungguhnya Kami menjadikan pohon zaqqum itu sebagai siksaan bagi orang-orang yang zalim.",
      "ar": "إِنَّا جَعَلۡنَـٰهَا فِتۡنَةࣰ لِّلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 3852,
    "surahId": 37,
    "ayahNumber": 64,
    "arabicText": "إِنَّهَا شَجَرَةࣱ تَخۡرُجُ فِیۤ أَصۡلِ ٱلۡجَحِیمِ\n",
    "translations": {
      "en": "for, behold, it is a tree that grows in the very heart of the blazing fire [of hell],",
      "ms": "Sebenarnya ia sebatang pohon yang tumbuh di dasar neraka yang marak menjulang;",
      "id": "Sesungguhnya dia adalah sebatang pohon yang ke luar dan dasar neraka yang menyala.",
      "ar": "إِنَّهَا شَجَرَةࣱ تَخۡرُجُ فِیۤ أَصۡلِ ٱلۡجَحِیمِ\n"
    }
  },
  {
    "id": 3853,
    "surahId": 37,
    "ayahNumber": 65,
    "arabicText": "طَلۡعُهَا كَأَنَّهُۥ رُءُوسُ ٱلشَّیَـٰطِینِ\n",
    "translations": {
      "en": "its fruit [as repulsive] as satans’ heads;",
      "ms": "Buahnya seolah-olah kepala Syaitan-syaitan;",
      "id": "mayangnya seperti kepala syaitan-syaitan.",
      "ar": "طَلۡعُهَا كَأَنَّهُۥ رُءُوسُ ٱلشَّیَـٰطِینِ\n"
    }
  },
  {
    "id": 3854,
    "surahId": 37,
    "ayahNumber": 66,
    "arabicText": "فَإِنَّهُمۡ لَـَٔاكِلُونَ مِنۡهَا فَمَالِـُٔونَ مِنۡهَا ٱلۡبُطُونَ\n",
    "translations": {
      "en": "and they [who are lost in evil] are indeed bound to eat thereof, and to fill their bellies therewith.",
      "ms": "Maka sudah tentu mereka akan makan dari buahnya (sekalipun pahit dan busuk), sehingga mereka memenuhi perut darinya.",
      "id": "Maka sesungguhnya mereka benar-benar memakan sebagian dari buah pohon itu, maka mereka memenuhi perutnya dengan buah zaqqum itu.",
      "ar": "فَإِنَّهُمۡ لَـَٔاكِلُونَ مِنۡهَا فَمَالِـُٔونَ مِنۡهَا ٱلۡبُطُونَ\n"
    }
  },
  {
    "id": 3855,
    "surahId": 37,
    "ayahNumber": 67,
    "arabicText": "ثُمَّ إِنَّ لَهُمۡ عَلَیۡهَا لَشَوۡبࣰا مِّنۡ حَمِیمࣲ\n",
    "translations": {
      "en": "And, behold, above all this they will be confounded with burning des­pair!",
      "ms": "Kemudian, sesungguhnya mereka akan beroleh lagi - selain itu- satu minuman campuran dari air panas yang menggelegak.",
      "id": "Kemudian sesudah makan buah pohon zaqqum itu pasti mereka mendapat minuman yang bercampur dengan air yang sangat panas.",
      "ar": "ثُمَّ إِنَّ لَهُمۡ عَلَیۡهَا لَشَوۡبࣰا مِّنۡ حَمِیمࣲ\n"
    }
  },
  {
    "id": 3856,
    "surahId": 37,
    "ayahNumber": 68,
    "arabicText": "ثُمَّ إِنَّ مَرۡجِعَهُمۡ لَإِلَى ٱلۡجَحِیمِ\n",
    "translations": {
      "en": "And once again: Verily, the blazing fire is their ultimate goal –",
      "ms": "Setelah (mereka dibawa minum) maka tempat kembali mereka tetaplah ke dalam neraka yang menjulang-julang.",
      "id": "Kemudian sesungguhnya tempat kembali mereka benar-benar ke neraka Jahim.",
      "ar": "ثُمَّ إِنَّ مَرۡجِعَهُمۡ لَإِلَى ٱلۡجَحِیمِ\n"
    }
  },
  {
    "id": 3857,
    "surahId": 37,
    "ayahNumber": 69,
    "arabicText": "إِنَّهُمۡ أَلۡفَوۡا۟ ءَابَاۤءَهُمۡ ضَاۤلِّینَ\n",
    "translations": {
      "en": "for, behold, they found their forebears on a wrong way,",
      "ms": "Sebenarnya mereka telah mendapati datuk nenek mereka berada dalam kesesatan;",
      "id": "Karena sesungguhnya mereka mendapati bapak-bapak mereka dalam Keadaaan sesat.",
      "ar": "إِنَّهُمۡ أَلۡفَوۡا۟ ءَابَاۤءَهُمۡ ضَاۤلِّینَ\n"
    }
  },
  {
    "id": 3858,
    "surahId": 37,
    "ayahNumber": 70,
    "arabicText": "فَهُمۡ عَلَىٰۤ ءَاثَـٰرِهِمۡ یُهۡرَعُونَ\n",
    "translations": {
      "en": "and [now] they make haste to follow in their footsteps!",
      "ms": "Lalu mereka terburu-buru menurut jejak langkah datuk neneknya.",
      "id": "Lalu mereka sangat tergesa-gesa mengikuti jejak orang-orang tua mereka itu.",
      "ar": "فَهُمۡ عَلَىٰۤ ءَاثَـٰرِهِمۡ یُهۡرَعُونَ\n"
    }
  },
  {
    "id": 3859,
    "surahId": 37,
    "ayahNumber": 71,
    "arabicText": "وَلَقَدۡ ضَلَّ قَبۡلَهُمۡ أَكۡثَرُ ٱلۡأَوَّلِینَ\n",
    "translations": {
      "en": "Thus, indeed, most of the people of old went astray before them,",
      "ms": "Dan demi sesungguhnya, telah sesat juga - sebelum kaummu (wahai Muhammad) - kebanyakan kaum-kaum yang telah lalu.",
      "id": "Dan sesungguhnya telah sesat sebelum mereka (Quraisy) sebagian besar dari orang-orang yang dahulu,",
      "ar": "وَلَقَدۡ ضَلَّ قَبۡلَهُمۡ أَكۡثَرُ ٱلۡأَوَّلِینَ\n"
    }
  },
  {
    "id": 3860,
    "surahId": 37,
    "ayahNumber": 72,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا فِیهِم مُّنذِرِینَ\n",
    "translations": {
      "en": "although, verily, We had sent warners unto them:",
      "ms": "Pada hal, demi sesungguhnya, Kami telahpun mengutus dalam kalangan kaum-kaum itu, Rasul-rasul pemberi amaran.",
      "id": "dan sesungguhnya telah Kami utus pemberi-pemberi peringatan (rasul-rasul) di kalangan mereka.",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا فِیهِم مُّنذِرِینَ\n"
    }
  },
  {
    "id": 3861,
    "surahId": 37,
    "ayahNumber": 73,
    "arabicText": "فَٱنظُرۡ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلۡمُنذَرِینَ\n",
    "translations": {
      "en": "and behold what happened in the end to those that had been warned [to no avail]!",
      "ms": "Maka lihatlah bagaimana kesudahan orang-orang (yang mendustakan Rasul-rasul Kami) setelah diberi amaran, -",
      "id": "Maka perhatikanlah bagaimana kesudahan orang-orang yang diberi peringatan itu.",
      "ar": "فَٱنظُرۡ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلۡمُنذَرِینَ\n"
    }
  },
  {
    "id": 3862,
    "surahId": 37,
    "ayahNumber": 74,
    "arabicText": "إِلَّا عِبَادَ ٱللَّهِ ٱلۡمُخۡلَصِینَ\n",
    "translations": {
      "en": "EXCEPT for God’s true servants, [most people are apt to go astray.]",
      "ms": "Kecuali hamba-hamba Allah yang dibersihkan dari sebarang syirik (maka mereka akan terselamat dan mendapat sebaik-baik balasan).",
      "id": "Tetapi hamba-hamba Allah yang bersihkan (dari dosa tidak akan diazab).",
      "ar": "إِلَّا عِبَادَ ٱللَّهِ ٱلۡمُخۡلَصِینَ\n"
    }
  },
  {
    "id": 3863,
    "surahId": 37,
    "ayahNumber": 75,
    "arabicText": "وَلَقَدۡ نَادَىٰنَا نُوحࣱ فَلَنِعۡمَ ٱلۡمُجِیبُونَ\n",
    "translations": {
      "en": "And, indeed, [it was for this reason that] Noah cried unto Us - and how excellent was Our response:",
      "ms": "Dan demi sesungguhnya, Nabi Nuh telah berdoa merayu kepada Kami (memohon pertolongan), maka Kami adalah sebaik-baik yang kabulkan doa permohonan.",
      "id": "Sesungguhnya Nuh telah menyeru Kami: maka sesungguhnya sebaik-baik yang memperkenankan (adalah Kami).",
      "ar": "وَلَقَدۡ نَادَىٰنَا نُوحࣱ فَلَنِعۡمَ ٱلۡمُجِیبُونَ\n"
    }
  },
  {
    "id": 3864,
    "surahId": 37,
    "ayahNumber": 76,
    "arabicText": "وَنَجَّیۡنَـٰهُ وَأَهۡلَهُۥ مِنَ ٱلۡكَرۡبِ ٱلۡعَظِیمِ\n",
    "translations": {
      "en": "for We saved him and his household from that awesome calamity,",
      "ms": "Dan Kami telah selamatkan dia bersama-sama dengan keluarga dan pengikut-pengikutnya, dari kesusahan yang besar.",
      "id": "Dan Kami telah menyelamatkannya dan pengikutnya dari bencana yang besar.",
      "ar": "وَنَجَّیۡنَـٰهُ وَأَهۡلَهُۥ مِنَ ٱلۡكَرۡبِ ٱلۡعَظِیمِ\n"
    }
  },
  {
    "id": 3865,
    "surahId": 37,
    "ayahNumber": 77,
    "arabicText": "وَجَعَلۡنَا ذُرِّیَّتَهُۥ هُمُ ٱلۡبَاقِینَ\n",
    "translations": {
      "en": "and caused his offspring to endure [on earth];",
      "ms": "Dan Kami jadikan zuriat keturunannya sahaja orang-orang yang tinggal hidup (setelah Kami binasakan kaumnya yang ingkar).",
      "id": "Dan Kami jadikan anak cucunya orang-orang yang melanjutkan keturunan.",
      "ar": "وَجَعَلۡنَا ذُرِّیَّتَهُۥ هُمُ ٱلۡبَاقِینَ\n"
    }
  },
  {
    "id": 3866,
    "surahId": 37,
    "ayahNumber": 78,
    "arabicText": "وَتَرَكۡنَا عَلَیۡهِ فِی ٱلۡـَٔاخِرِینَ\n",
    "translations": {
      "en": "and We left him thus to be remembered among later generations:",
      "ms": "Dan Kami kekalkan baginya (nama yang harum) dalam kalangan orang-orang yang datang kemudian:",
      "id": "Dan Kami abadikan untuk Nuh itu (pujian yang baik) di kalangan orang-orang yang datang kemudian;",
      "ar": "وَتَرَكۡنَا عَلَیۡهِ فِی ٱلۡـَٔاخِرِینَ\n"
    }
  },
  {
    "id": 3867,
    "surahId": 37,
    "ayahNumber": 79,
    "arabicText": "سَلَـٰمٌ عَلَىٰ نُوحࣲ فِی ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "“Peace be upon Noah throughout all the worlds!”",
      "ms": "\"Salam sejahtera kepada Nabi Nuh dalam kalangan penduduk seluruh alam ! \"",
      "id": "\"Kesejahteraan dilimpahkan atas Nuh di seluruh alam\".",
      "ar": "سَلَـٰمٌ عَلَىٰ نُوحࣲ فِی ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 3868,
    "surahId": 37,
    "ayahNumber": 80,
    "arabicText": "إِنَّا كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "Verily, thus do We reward the doers of good –",
      "ms": "Demikianlah sebenarnya Kami membalas orang-orang yang berusaha mengerjakan amal-amal yang baik.",
      "id": "Sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.",
      "ar": "إِنَّا كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 3869,
    "surahId": 37,
    "ayahNumber": 81,
    "arabicText": "إِنَّهُۥ مِنۡ عِبَادِنَا ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "for he was truly one of our believing servants:",
      "ms": "Sesungguhnya Nabi Nuh itu dari hamba-hamba Kami yang beriman.",
      "id": "Sesungguhnya dia termasuk di antara hamba-hamba Kami yang beriman.",
      "ar": "إِنَّهُۥ مِنۡ عِبَادِنَا ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 3870,
    "surahId": 37,
    "ayahNumber": 82,
    "arabicText": "ثُمَّ أَغۡرَقۡنَا ٱلۡـَٔاخَرِینَ\n",
    "translations": {
      "en": "[and so We saved him and those who followed him] and then We caused the others to drown.",
      "ms": "Kemudian Kami tenggelamkan golongan yang lain (yang mendustakannya).",
      "id": "Kemudian Kami tenggelamkan orang-orang yang lain.",
      "ar": "ثُمَّ أَغۡرَقۡنَا ٱلۡـَٔاخَرِینَ\n"
    }
  },
  {
    "id": 3871,
    "surahId": 37,
    "ayahNumber": 83,
    "arabicText": "۞ وَإِنَّ مِن شِیعَتِهِۦ لَإِبۡرَ ٰ⁠هِیمَ\n",
    "translations": {
      "en": "AND, BEHOLD, of his persuasion was Abraham, too,",
      "ms": "Dan sesungguhnya di antara orang-orang yang menegakkan (ajaran yang dibawa oleh) Nabi Nuh ialah Nabi Ibrahim.",
      "id": "Dan sesungguhnya Ibrahim benar-benar termasuk golongannya (Nuh).",
      "ar": "۞ وَإِنَّ مِن شِیعَتِهِۦ لَإِبۡرَ ٰ⁠هِیمَ\n"
    }
  },
  {
    "id": 3872,
    "surahId": 37,
    "ayahNumber": 84,
    "arabicText": "إِذۡ جَاۤءَ رَبَّهُۥ بِقَلۡبࣲ سَلِیمٍ\n",
    "translations": {
      "en": "when he turned to his Sustainer with a heart free of evil,",
      "ms": "Ketika ia mematuhi perintah tuhannya dengan hati yang suci murni.",
      "id": "(lngatlah) ketika ia datang kepada Tuhannya dengan hati yang suci:",
      "ar": "إِذۡ جَاۤءَ رَبَّهُۥ بِقَلۡبࣲ سَلِیمٍ\n"
    }
  },
  {
    "id": 3873,
    "surahId": 37,
    "ayahNumber": 85,
    "arabicText": "إِذۡ قَالَ لِأَبِیهِ وَقَوۡمِهِۦ مَاذَا تَعۡبُدُونَ\n",
    "translations": {
      "en": "and [thus] spoke to his father and his people: “What is it that you worship?",
      "ms": "Ketika ia berkata kepada bapanya dan kaumnya: \" Apa yang kamu sembah?",
      "id": "(Ingatlah) ketika ia berkata kepada bapaknya dan kaumnya: \"Apakah yang kamu sembah itu?",
      "ar": "إِذۡ قَالَ لِأَبِیهِ وَقَوۡمِهِۦ مَاذَا تَعۡبُدُونَ\n"
    }
  },
  {
    "id": 3874,
    "surahId": 37,
    "ayahNumber": 86,
    "arabicText": "أَىِٕفۡكًا ءَالِهَةࣰ دُونَ ٱللَّهِ تُرِیدُونَ\n",
    "translations": {
      "en": "Do you want [to bow down before] a lie - [before] deities other than God?",
      "ms": "\"Patutkah kamu menyembah tuhan-tuhan yang lain dari Allah, kerana kamu memutar belitkan kebenaran semata-mata (bukan kerana benarnya)?",
      "id": "Apakah kamu menghendaki sembahan-sembahan selain Allah dengan jalan berbohong?",
      "ar": "أَىِٕفۡكًا ءَالِهَةࣰ دُونَ ٱللَّهِ تُرِیدُونَ\n"
    }
  },
  {
    "id": 3875,
    "surahId": 37,
    "ayahNumber": 87,
    "arabicText": "فَمَا ظَنُّكُم بِرَبِّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "What, then, do you think of the Sustainer of all the worlds?”",
      "ms": "\"Maka bagaimana fikiran kamu pula terhadap Allah Tuhan sekalian alam?\"",
      "id": "Maka apakah anggapanmu terhadap Tuhan semesta alam?\"",
      "ar": "فَمَا ظَنُّكُم بِرَبِّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 3876,
    "surahId": 37,
    "ayahNumber": 88,
    "arabicText": "فَنَظَرَ نَظۡرَةࣰ فِی ٱلنُّجُومِ\n",
    "translations": {
      "en": "Then he cast a glance at the stars,",
      "ms": "Kemudian ia memandang dengan satu renungan kepada bintang-bintang (yang bertaburan di langit),",
      "id": "Lalu ia memandang sekali pandang ke bintang-bintang.",
      "ar": "فَنَظَرَ نَظۡرَةࣰ فِی ٱلنُّجُومِ\n"
    }
  },
  {
    "id": 3877,
    "surahId": 37,
    "ayahNumber": 89,
    "arabicText": "فَقَالَ إِنِّی سَقِیمࣱ\n",
    "translations": {
      "en": "and said, “Verily, I am sick [at heart]!”",
      "ms": "Lalu berkata: \"Sesungguhnya aku merasa sakit (tak dapat turut berhari raya sama)\".",
      "id": "Kemudian ia berkata: \"Sesungguhnya aku sakit\".",
      "ar": "فَقَالَ إِنِّی سَقِیمࣱ\n"
    }
  },
  {
    "id": 3878,
    "surahId": 37,
    "ayahNumber": 90,
    "arabicText": "فَتَوَلَّوۡا۟ عَنۡهُ مُدۡبِرِینَ\n",
    "translations": {
      "en": "and at that they turned their backs on him and went away.",
      "ms": "Setelah (mendengar kata-katanya) itu, mereka berpaling meninggalkan dia.",
      "id": "Lalu mereka berpaling daripadanya dengan membelakang.",
      "ar": "فَتَوَلَّوۡا۟ عَنۡهُ مُدۡبِرِینَ\n"
    }
  },
  {
    "id": 3879,
    "surahId": 37,
    "ayahNumber": 91,
    "arabicText": "فَرَاغَ إِلَىٰۤ ءَالِهَتِهِمۡ فَقَالَ أَلَا تَأۡكُلُونَ\n",
    "translations": {
      "en": "Thereupon he approached their gods stealthily and said, “What! You do not eat [of the offerings placed before you]?",
      "ms": "Lalu ia pergi kepada berhala-berhala mereka secara bersembunyi, serta ia bertanya (kepada berhala-berhala itu, secara mengejek-ejek): \"Mengapa kamu tidak makan?",
      "id": "Kemudian ia pergi dengan diam-diam kepada berhala-berhala mereka; lalu ia berkata: \"Apakah kamu tidak makan?",
      "ar": "فَرَاغَ إِلَىٰۤ ءَالِهَتِهِمۡ فَقَالَ أَلَا تَأۡكُلُونَ\n"
    }
  },
  {
    "id": 3880,
    "surahId": 37,
    "ayahNumber": 92,
    "arabicText": "مَا لَكُمۡ لَا تَنطِقُونَ\n",
    "translations": {
      "en": "What is amiss with you that you do not speak?”",
      "ms": "\"Mengapa kamu tidak menjawab?\"",
      "id": "Kenapa kamu tidak menjawab?\"",
      "ar": "مَا لَكُمۡ لَا تَنطِقُونَ\n"
    }
  },
  {
    "id": 3881,
    "surahId": 37,
    "ayahNumber": 93,
    "arabicText": "فَرَاغَ عَلَیۡهِمۡ ضَرۡبَۢا بِٱلۡیَمِینِ\n",
    "translations": {
      "en": "And then he fell upon them, smiting them with his right hand.",
      "ms": "Lalu ia memukul berhala-berhala itu dengan tangan kanannya (sehingga pecah berketul-ketul).",
      "id": "Lalu dihadapinya berhala-berhala itu sambil memukulnya dengan tangan kanannya (dengan kuat).",
      "ar": "فَرَاغَ عَلَیۡهِمۡ ضَرۡبَۢا بِٱلۡیَمِینِ\n"
    }
  },
  {
    "id": 3882,
    "surahId": 37,
    "ayahNumber": 94,
    "arabicText": "فَأَقۡبَلُوۤا۟ إِلَیۡهِ یَزِفُّونَ\n",
    "translations": {
      "en": "[But] then the others came towards him hur­riedly [and accused him of his deed].",
      "ms": "(Setelah kaumnya mengetahui hal itu) maka datanglah mereka beramai-ramai kepadanya.",
      "id": "Kemudian kaumnya datang kepadanya dengan bergegas.",
      "ar": "فَأَقۡبَلُوۤا۟ إِلَیۡهِ یَزِفُّونَ\n"
    }
  },
  {
    "id": 3883,
    "surahId": 37,
    "ayahNumber": 95,
    "arabicText": "قَالَ أَتَعۡبُدُونَ مَا تَنۡحِتُونَ\n",
    "translations": {
      "en": "He answered: “Do you worship something that you [yourselves] have carved,",
      "ms": "(Bagi menjawab bantahan mereka), ia berkata: \"Patutkah kamu menyembah benda-benda yang kamu pahat?",
      "id": "Ibrahim berkata: \"Apakah kamu menyembah patung-patung yang kamu pahat itu?",
      "ar": "قَالَ أَتَعۡبُدُونَ مَا تَنۡحِتُونَ\n"
    }
  },
  {
    "id": 3884,
    "surahId": 37,
    "ayahNumber": 96,
    "arabicText": "وَٱللَّهُ خَلَقَكُمۡ وَمَا تَعۡمَلُونَ\n",
    "translations": {
      "en": "the while it is God who has created you and all your handiwork?”",
      "ms": "\"Padahal Allah yang mencipta kamu dan benda-benda yang kamu buat itu!\"",
      "id": "Padahal Allah-lah yang menciptakan kamu dan apa yang kamu perbuat itu\".",
      "ar": "وَٱللَّهُ خَلَقَكُمۡ وَمَا تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 3885,
    "surahId": 37,
    "ayahNumber": 97,
    "arabicText": "قَالُوا۟ ٱبۡنُوا۟ لَهُۥ بُنۡیَـٰنࣰا فَأَلۡقُوهُ فِی ٱلۡجَحِیمِ\n",
    "translations": {
      "en": "They exclaimed: “Build a pyre for him, and cast him into the blazing fire!”",
      "ms": "(Setelah tak dapat berhujah lagi, ketua-ketua) mereka berkata: \"Binalah untuk Ibrahim sebuah tempat (untuk membakarnya), kemudian campakkan dia ke dalam api yang menjulang-julang itu\".",
      "id": "Mereka berkata: \"Dirikanlah suatu bangunan untuk (membakar) Ibrahim; lalu lemparkanlah dia ke dalam api yang menyala-nyala itu\".",
      "ar": "قَالُوا۟ ٱبۡنُوا۟ لَهُۥ بُنۡیَـٰنࣰا فَأَلۡقُوهُ فِی ٱلۡجَحِیمِ\n"
    }
  },
  {
    "id": 3886,
    "surahId": 37,
    "ayahNumber": 98,
    "arabicText": "فَأَرَادُوا۟ بِهِۦ كَیۡدࣰا فَجَعَلۡنَـٰهُمُ ٱلۡأَسۡفَلِینَ\n",
    "translations": {
      "en": "But whereas they sought to do evil unto him, We [frustrated their designs, and thus] brought them low?",
      "ms": "Maka mereka (dengan perbuatan membakar Nabi Ibrahim itu) hendak melakukan angkara yang menyakitinya, lalu Kami jadikan mereka orang-orang yang terkebawah (yang tidak berjaya maksudnya).",
      "id": "Mereka hendak melakukan tipu muslihat kepadanya, maka Kami jadikan mereka orang-orang yang hina.",
      "ar": "فَأَرَادُوا۟ بِهِۦ كَیۡدࣰا فَجَعَلۡنَـٰهُمُ ٱلۡأَسۡفَلِینَ\n"
    }
  },
  {
    "id": 3887,
    "surahId": 37,
    "ayahNumber": 99,
    "arabicText": "وَقَالَ إِنِّی ذَاهِبٌ إِلَىٰ رَبِّی سَیَهۡدِینِ\n",
    "translations": {
      "en": "And [Abraham] said: “Verily, I shall [leave this land and] go wherever my Sustainer will guide me!”",
      "ms": "Dan Nabi Ibrahim pula berkata: \"Aku hendak (meninggalkan kamu) pergi kepada Tuhanku, Ia akan memimpinku (ke jalan yang benar).",
      "id": "Dan Ibrahim berkata: \"Sesungguhnya aku pergi menghadap kepada Tuhanku, dan Dia akan memberi petunjuk kepadaku.",
      "ar": "وَقَالَ إِنِّی ذَاهِبٌ إِلَىٰ رَبِّی سَیَهۡدِینِ\n"
    }
  },
  {
    "id": 3888,
    "surahId": 37,
    "ayahNumber": 100,
    "arabicText": "رَبِّ هَبۡ لِی مِنَ ٱلصَّـٰلِحِینَ\n",
    "translations": {
      "en": "[And he prayed:] “O my Sustainer! Bestow upon me the gift of [a son who shall be] one of the righteous!” –",
      "ms": "\" Wahai Tuhanku! Kurniakanlah kepadaku anak yang terhitung dari orang-orang yang soleh!\"",
      "id": "Ya Tuhanku, anugrahkanlah kepadaku (seorang anak) yang termasuk orang-orang yang saleh.",
      "ar": "رَبِّ هَبۡ لِی مِنَ ٱلصَّـٰلِحِینَ\n"
    }
  },
  {
    "id": 3889,
    "surahId": 37,
    "ayahNumber": 101,
    "arabicText": "فَبَشَّرۡنَـٰهُ بِغُلَـٰمٍ حَلِیمࣲ\n",
    "translations": {
      "en": "whereupon We gave him the glad tiding of a boy-child gentle [like himself]?",
      "ms": "Lalu Kami berikan kepadanya berita yang mengembirakan, bahawa ia akan beroleh seorang anak yang penyabar.",
      "id": "Maka Kami beri dia khabar gembira dengan seorang anak yang amat sabar.",
      "ar": "فَبَشَّرۡنَـٰهُ بِغُلَـٰمٍ حَلِیمࣲ\n"
    }
  },
  {
    "id": 3890,
    "surahId": 37,
    "ayahNumber": 102,
    "arabicText": "فَلَمَّا بَلَغَ مَعَهُ ٱلسَّعۡیَ قَالَ یَـٰبُنَیَّ إِنِّیۤ أَرَىٰ فِی ٱلۡمَنَامِ أَنِّیۤ أَذۡبَحُكَ فَٱنظُرۡ مَاذَا تَرَىٰۚ قَالَ یَـٰۤأَبَتِ ٱفۡعَلۡ مَا تُؤۡمَرُۖ سَتَجِدُنِیۤ إِن شَاۤءَ ٱللَّهُ مِنَ ٱلصَّـٰبِرِینَ\n",
    "translations": {
      "en": "And [one day,] when [the child] had become old enough to share in his [father’s] endeavours, the latter said: “O my dear son! I have seen in a dream that I should sacrifice thee: consider, then, what would be thy view!” [Ishmael] answered: “O my father! Do as thou art bidden: thou wilt find me, if God so wills, among those who are patient in adversity!”",
      "ms": "Maka ketika anaknya itu sampai (ke peringkat umur yang membolehkan dia) berusaha bersama-sama dengannya, Nabi Ibrahim berkata: \"Wahai anak kesayanganku! Sesungguhnya aku melihat dalam mimpi bahawa aku akan menyembelihmu; maka fikirkanlah apa pendapatmu?\". Anaknya menjawab: \"Wahai ayah, jalankanlah apa yang diperintahkan kepadamu; Insya Allah, ayah akan mendapati daku dari orang-orang yang sabar\".",
      "id": "Maka tatkala anak itu sampai (pada umur sanggup) berusaha bersama-sama Ibrahim, Ibrahim berkata: \"Hai anakku sesungguhnya aku melihat dalam mimpi bahwa aku menyembelihmu. Maka fikirkanlah apa pendapatmu!\" Ia menjawab: \"Hai bapakku, kerjakanlah apa yang diperintahkan kepadamu; insya Allah kamu akan mendapatiku termasuk orang-orang yang sabar\".",
      "ar": "فَلَمَّا بَلَغَ مَعَهُ ٱلسَّعۡیَ قَالَ یَـٰبُنَیَّ إِنِّیۤ أَرَىٰ فِی ٱلۡمَنَامِ أَنِّیۤ أَذۡبَحُكَ فَٱنظُرۡ مَاذَا تَرَىٰۚ قَالَ یَـٰۤأَبَتِ ٱفۡعَلۡ مَا تُؤۡمَرُۖ سَتَجِدُنِیۤ إِن شَاۤءَ ٱللَّهُ مِنَ ٱلصَّـٰبِرِینَ\n"
    }
  },
  {
    "id": 3891,
    "surahId": 37,
    "ayahNumber": 103,
    "arabicText": "فَلَمَّاۤ أَسۡلَمَا وَتَلَّهُۥ لِلۡجَبِینِ\n",
    "translations": {
      "en": "But as soon as the two had surrendered themselves to [what they thought to be] the will of God, and [Abraham] had laid him down on his face,",
      "ms": "Setelah keduanya berserah bulat-bulat (menjunjung perintah Allah itu), dan Nabi Ibrahim merebahkan anaknya dengan meletakkan iringan mukanya di atas tompok tanah, (Kami sifatkan Ibrahim - dengan kesungguhan azamnya itu telah menjalankan perintah Kami),",
      "id": "Tatkala keduanya telah berserah diri dan Ibrahim membaringkan anaknya atas pelipis(nya), (nyatalah kesabaran keduanya).",
      "ar": "فَلَمَّاۤ أَسۡلَمَا وَتَلَّهُۥ لِلۡجَبِینِ\n"
    }
  },
  {
    "id": 3892,
    "surahId": 37,
    "ayahNumber": 104,
    "arabicText": "وَنَـٰدَیۡنَـٰهُ أَن یَـٰۤإِبۡرَ ٰ⁠هِیمُ\n",
    "translations": {
      "en": "We called out to him: “O Abraham,",
      "ms": "Serta Kami menyerunya: \"Wahai Ibrahim!",
      "id": "Dan Kami panggillah dia: \"Hai Ibrahim,",
      "ar": "وَنَـٰدَیۡنَـٰهُ أَن یَـٰۤإِبۡرَ ٰ⁠هِیمُ\n"
    }
  },
  {
    "id": 3893,
    "surahId": 37,
    "ayahNumber": 105,
    "arabicText": "قَدۡ صَدَّقۡتَ ٱلرُّءۡیَاۤۚ إِنَّا كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "thou hast already fulfilled [the purpose of] that dream- vision!” Thus, verily, do We reward the doers of good:",
      "ms": "\"Engkau telah menyempurnakan maksud mimpi yang engkau lihat itu\". Demikianlah sebenarnya Kami membalas orang-orang yang berusaha mengerjakan kebaikan.",
      "id": "sesungguhnya kamu telah membenarkan mimpi itu sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.",
      "ar": "قَدۡ صَدَّقۡتَ ٱلرُّءۡیَاۤۚ إِنَّا كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 3894,
    "surahId": 37,
    "ayahNumber": 106,
    "arabicText": "إِنَّ هَـٰذَا لَهُوَ ٱلۡبَلَـٰۤؤُا۟ ٱلۡمُبِینُ\n",
    "translations": {
      "en": "for, behold, all this was indeed a trial, clear in itself.",
      "ms": "Sesungguhnya perintah ini adalah satu ujian yang nyata;",
      "id": "Sesungguhnya ini benar-benar suatu ujian yang nyata.",
      "ar": "إِنَّ هَـٰذَا لَهُوَ ٱلۡبَلَـٰۤؤُا۟ ٱلۡمُبِینُ\n"
    }
  },
  {
    "id": 3895,
    "surahId": 37,
    "ayahNumber": 107,
    "arabicText": "وَفَدَیۡنَـٰهُ بِذِبۡحٍ عَظِیمࣲ\n",
    "translations": {
      "en": "And We ransomed him with a tremendous sacrifice,",
      "ms": "Dan Kami tebus anaknya itu dengan seekor binatang sembelihan yang besar;",
      "id": "Dan Kami tebus anak itu dengan seekor sembelihan yang besar.",
      "ar": "وَفَدَیۡنَـٰهُ بِذِبۡحٍ عَظِیمࣲ\n"
    }
  },
  {
    "id": 3896,
    "surahId": 37,
    "ayahNumber": 108,
    "arabicText": "وَتَرَكۡنَا عَلَیۡهِ فِی ٱلۡـَٔاخِرِینَ\n",
    "translations": {
      "en": "and left him thus to be remembered among later generations:",
      "ms": "Dan Kami kekalkan baginya (nama yang harum) dalam kalangan orang-orang yang datang kemudian:",
      "id": "Kami abadikan untuk Ibrahim itu (pujian yang baik) di kalangan orang-orang yang datang kemudian,",
      "ar": "وَتَرَكۡنَا عَلَیۡهِ فِی ٱلۡـَٔاخِرِینَ\n"
    }
  },
  {
    "id": 3897,
    "surahId": 37,
    "ayahNumber": 109,
    "arabicText": "سَلَـٰمٌ عَلَىٰۤ إِبۡرَ ٰ⁠هِیمَ\n",
    "translations": {
      "en": "“Peace be upon Abraham!”",
      "ms": "\"Salam sejahtera kepada Nabi Ibrahim!\".",
      "id": "(yaitu)\"Kesejahteraan dilimpahkan atas Ibrahim\".",
      "ar": "سَلَـٰمٌ عَلَىٰۤ إِبۡرَ ٰ⁠هِیمَ\n"
    }
  },
  {
    "id": 3898,
    "surahId": 37,
    "ayahNumber": 110,
    "arabicText": "كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "Thus do We reward the doers of good –",
      "ms": "Demikianlah Kami membalas orang-orang yang berusaha mengerjakan kebaikan.",
      "id": "Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.",
      "ar": "كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 3899,
    "surahId": 37,
    "ayahNumber": 111,
    "arabicText": "إِنَّهُۥ مِنۡ عِبَادِنَا ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "for he was truly one of our believing servants.",
      "ms": "Sesungguhnya Nabi Ibrahim itu dari hamba-hamba Kami yang beriman.",
      "id": "Sesungguhnya ia termasuk hamba-hamba Kami yang beriman.",
      "ar": "إِنَّهُۥ مِنۡ عِبَادِنَا ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 3900,
    "surahId": 37,
    "ayahNumber": 112,
    "arabicText": "وَبَشَّرۡنَـٰهُ بِإِسۡحَـٰقَ نَبِیࣰّا مِّنَ ٱلصَّـٰلِحِینَ\n",
    "translations": {
      "en": "And [in time] We gave him the glad tiding of Isaac, [who, too, would be] a prophet, one of the righteous;",
      "ms": "Dan Kami pula berikan kepadanya berita yang mengembirakan, bahawa ia akan beroleh (seorang anak): Ishak, yang akan menjadi Nabi, yang terhitung dari orang-orang yang soleh.",
      "id": "Dan Kami beri dia kabar gembira dengan (kelahiran) Ishaq seorang nabi yang termasuk orang-orang yang saleh.",
      "ar": "وَبَشَّرۡنَـٰهُ بِإِسۡحَـٰقَ نَبِیࣰّا مِّنَ ٱلصَّـٰلِحِینَ\n"
    }
  },
  {
    "id": 3901,
    "surahId": 37,
    "ayahNumber": 113,
    "arabicText": "وَبَـٰرَكۡنَا عَلَیۡهِ وَعَلَىٰۤ إِسۡحَـٰقَۚ وَمِن ذُرِّیَّتِهِمَا مُحۡسِنࣱ وَظَالِمࣱ لِّنَفۡسِهِۦ مُبِینࣱ\n",
    "translations": {
      "en": "and We blessed him and Isaac: but among the offspring of these two there were [des­tined] to be both doers of good and such as would glaringly sin against themselves.",
      "ms": "Dan Kami limpahi berkat kepadanya dan kepada (anaknya): Ishak; dan di antara zuriat keturunan keduanya ada yang mengerjakan kebaikan, dan ada pula yang berlaku zalim dengan nyata, terhadap dirinya sendiri.",
      "id": "Kami limpahkan keberkatan atasnya dan atas Ishaq. Dan diantara anak cucunya ada yang berbuat baik dan ada (pula) yang Zalim terhadap dirinya sendiri dengan nyata.",
      "ar": "وَبَـٰرَكۡنَا عَلَیۡهِ وَعَلَىٰۤ إِسۡحَـٰقَۚ وَمِن ذُرِّیَّتِهِمَا مُحۡسِنࣱ وَظَالِمࣱ لِّنَفۡسِهِۦ مُبِینࣱ\n"
    }
  },
  {
    "id": 3902,
    "surahId": 37,
    "ayahNumber": 114,
    "arabicText": "وَلَقَدۡ مَنَنَّا عَلَىٰ مُوسَىٰ وَهَـٰرُونَ\n",
    "translations": {
      "en": "THUS, INDEED, did We bestow Our favour upon Moses and Aaron;",
      "ms": "Dan demi sesungguhnya! kami telah melimpahkan nikmat pemberian kepada Nabi Musa dan Nabi Harun.",
      "id": "Dan sesungguhnya Kami telah melimpahkan nikmat atas Musa dan Harun.",
      "ar": "وَلَقَدۡ مَنَنَّا عَلَىٰ مُوسَىٰ وَهَـٰرُونَ\n"
    }
  },
  {
    "id": 3903,
    "surahId": 37,
    "ayahNumber": 115,
    "arabicText": "وَنَجَّیۡنَـٰهُمَا وَقَوۡمَهُمَا مِنَ ٱلۡكَرۡبِ ٱلۡعَظِیمِ\n",
    "translations": {
      "en": "and We saved them and their people from the awesome calamity [of bondage],",
      "ms": "Dan Kami selamatkan keduanya dan kaumnya dari kesusahan yang besar;",
      "id": "Dan Kami selamatkan keduanya dan kaumnya dari bencana yang besar.",
      "ar": "وَنَجَّیۡنَـٰهُمَا وَقَوۡمَهُمَا مِنَ ٱلۡكَرۡبِ ٱلۡعَظِیمِ\n"
    }
  },
  {
    "id": 3904,
    "surahId": 37,
    "ayahNumber": 116,
    "arabicText": "وَنَصَرۡنَـٰهُمۡ فَكَانُوا۟ هُمُ ٱلۡغَـٰلِبِینَ\n",
    "translations": {
      "en": "and succoured them, so that [in the end] it was they who achieved victory.",
      "ms": "Dan Kami menolong mereka sehingga menjadilah mereka orang-orang yang berjaya mengalahkan (lawannya);",
      "id": "Dan Kami tolong mereka, maka jadilah mereka orang-orang yang menang.",
      "ar": "وَنَصَرۡنَـٰهُمۡ فَكَانُوا۟ هُمُ ٱلۡغَـٰلِبِینَ\n"
    }
  },
  {
    "id": 3905,
    "surahId": 37,
    "ayahNumber": 117,
    "arabicText": "وَءَاتَیۡنَـٰهُمَا ٱلۡكِتَـٰبَ ٱلۡمُسۡتَبِینَ\n",
    "translations": {
      "en": "And We gave them the divine writ that made [right and wrong] distinct,",
      "ms": "Dan Kami berikan kepada keduanya Kitab Suci yang amat jelas keterangannya;",
      "id": "Dan Kami berikan kepada keduanya kitab yang sangat jelas.",
      "ar": "وَءَاتَیۡنَـٰهُمَا ٱلۡكِتَـٰبَ ٱلۡمُسۡتَبِینَ\n"
    }
  },
  {
    "id": 3906,
    "surahId": 37,
    "ayahNumber": 118,
    "arabicText": "وَهَدَیۡنَـٰهُمَا ٱلصِّرَ ٰ⁠طَ ٱلۡمُسۡتَقِیمَ\n",
    "translations": {
      "en": "and guided them the straight way,",
      "ms": "Dan Kami berikan hidayah petunjuk kepada keduanya ke jalan yang lurus.",
      "id": "Dan Kami tunjuki keduanya ke jalan yang lurus.",
      "ar": "وَهَدَیۡنَـٰهُمَا ٱلصِّرَ ٰ⁠طَ ٱلۡمُسۡتَقِیمَ\n"
    }
  },
  {
    "id": 3907,
    "surahId": 37,
    "ayahNumber": 119,
    "arabicText": "وَتَرَكۡنَا عَلَیۡهِمَا فِی ٱلۡـَٔاخِرِینَ\n",
    "translations": {
      "en": "and left them thus to be remem­bered among later generations:",
      "ms": "Dan Kami kekalkan bagi keduanya (nama yang harum) dalam kalangan orang-orang yang datang kemudian:",
      "id": "Dan Kami abadikan untuk keduanya (pujian yang baik) dikalangan orang-orang yang datang kemudian;",
      "ar": "وَتَرَكۡنَا عَلَیۡهِمَا فِی ٱلۡـَٔاخِرِینَ\n"
    }
  },
  {
    "id": 3908,
    "surahId": 37,
    "ayahNumber": 120,
    "arabicText": "سَلَـٰمٌ عَلَىٰ مُوسَىٰ وَهَـٰرُونَ\n",
    "translations": {
      "en": "“Peace be upon Moses and Aaron!”",
      "ms": "\"Salam sejahtera kepada Nabi Musa dan Nabi Harun!\"",
      "id": "(yaitu): \"Kesejahteraan dilimpahkan atas Musa dan Harun\".",
      "ar": "سَلَـٰمٌ عَلَىٰ مُوسَىٰ وَهَـٰرُونَ\n"
    }
  },
  {
    "id": 3909,
    "surahId": 37,
    "ayahNumber": 121,
    "arabicText": "إِنَّا كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "Thus do We reward the doers of good –",
      "ms": "Demikianlah sebenarnya Kami membalas orang-orang yang berusaha mengerjakan kebaikan.",
      "id": "Sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.",
      "ar": "إِنَّا كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 3910,
    "surahId": 37,
    "ayahNumber": 122,
    "arabicText": "إِنَّهُمَا مِنۡ عِبَادِنَا ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "for those two were truly among Our believing ser­vants.",
      "ms": "Sesungguhnya mereka berdua adalah dari hamba-hamba Kami yang beriman.",
      "id": "Sesungguhnya keduanya termasuk hamba-hamba Kami yang beriman.",
      "ar": "إِنَّهُمَا مِنۡ عِبَادِنَا ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 3911,
    "surahId": 37,
    "ayahNumber": 123,
    "arabicText": "وَإِنَّ إِلۡیَاسَ لَمِنَ ٱلۡمُرۡسَلِینَ\n",
    "translations": {
      "en": "AND, BEHOLD, Elijah [too] was indeed one of Our message-bearers",
      "ms": "Dan sesungguhnya Nabi Ilyas adalah dari Rasul-rasul (Kami) yang diutus.",
      "id": "Dan sesungguhnya Ilyas benar-benar termasuk salah seorang rasul-rasul.",
      "ar": "وَإِنَّ إِلۡیَاسَ لَمِنَ ٱلۡمُرۡسَلِینَ\n"
    }
  },
  {
    "id": 3912,
    "surahId": 37,
    "ayahNumber": 124,
    "arabicText": "إِذۡ قَالَ لِقَوۡمِهِۦۤ أَلَا تَتَّقُونَ\n",
    "translations": {
      "en": "when he spoke [thus] to his people: “Will you not remain conscious of God?",
      "ms": "(Ingatkanlah peristiwa) ketika ia berkata kepada kaumnya: \"Hendaklah kamu mematuhi suruhan Allah dan menjauhi laranganNya.",
      "id": "(ingatlah) ketika ia berkata kepada kaumnya: \"Mengapa kamu tidak bertakwa?",
      "ar": "إِذۡ قَالَ لِقَوۡمِهِۦۤ أَلَا تَتَّقُونَ\n"
    }
  },
  {
    "id": 3913,
    "surahId": 37,
    "ayahNumber": 125,
    "arabicText": "أَتَدۡعُونَ بَعۡلࣰا وَتَذَرُونَ أَحۡسَنَ ٱلۡخَـٰلِقِینَ\n",
    "translations": {
      "en": "Will you invoke Baal and forsake [God,] the best of artisans -",
      "ms": "\"Patutkah kamu menyembah berhala Ba'la, dan kamu meninggalkan (ibadat kepada) sebijak-bijak pencipta?",
      "id": "Patutkah kamu menyembah Ba'l dan kamu tinggalkan sebaik-baik Pencipta,",
      "ar": "أَتَدۡعُونَ بَعۡلࣰا وَتَذَرُونَ أَحۡسَنَ ٱلۡخَـٰلِقِینَ\n"
    }
  },
  {
    "id": 3914,
    "surahId": 37,
    "ayahNumber": 126,
    "arabicText": "ٱللَّهَ رَبَّكُمۡ وَرَبَّ ءَابَاۤىِٕكُمُ ٱلۡأَوَّلِینَ\n",
    "translations": {
      "en": "God, your Sustainer and the Sustainer of your forebears of old?”",
      "ms": "\"Iaitu Allah Tuhan kamu, dan Tuhan datuk nenek kamu yang telah lalu!\"",
      "id": "(yaitu) Allah Tuhanmu dan Tuhan bapak-bapakmu yang terdahulu?\"",
      "ar": "ٱللَّهَ رَبَّكُمۡ وَرَبَّ ءَابَاۤىِٕكُمُ ٱلۡأَوَّلِینَ\n"
    }
  },
  {
    "id": 3915,
    "surahId": 37,
    "ayahNumber": 127,
    "arabicText": "فَكَذَّبُوهُ فَإِنَّهُمۡ لَمُحۡضَرُونَ\n",
    "translations": {
      "en": "But they gave him the lie: and therefore they will most surely be arraigned [on Judgment Day],",
      "ms": "Maka mereka mendustakannya; akibatnya mereka tetap akan dibawa hadir (untuk diseksa),",
      "id": "Maka mereka mendustakannya, karena itu mereka akan diseret (ke neraka),",
      "ar": "فَكَذَّبُوهُ فَإِنَّهُمۡ لَمُحۡضَرُونَ\n"
    }
  },
  {
    "id": 3916,
    "surahId": 37,
    "ayahNumber": 128,
    "arabicText": "إِلَّا عِبَادَ ٱللَّهِ ٱلۡمُخۡلَصِینَ\n",
    "translations": {
      "en": "excepting only [those who were] God’s true servants;",
      "ms": "Kecuali hamba-hamba Allah yang dibersihkan dari sebarang syirik (maka mereka akan terselamat, dan mendapat sebaik-baik balasan).",
      "id": "kecuali hamba-hamba Allah yang dibersihkan (dari dosa).",
      "ar": "إِلَّا عِبَادَ ٱللَّهِ ٱلۡمُخۡلَصِینَ\n"
    }
  },
  {
    "id": 3917,
    "surahId": 37,
    "ayahNumber": 129,
    "arabicText": "وَتَرَكۡنَا عَلَیۡهِ فِی ٱلۡـَٔاخِرِینَ\n",
    "translations": {
      "en": "and him We left thus to be remem­bered among later generations:",
      "ms": "Dan Kami kekalkan bagi Nabi Ilyas (nama yang harum) dalam kalangan orang-orang yang datang kemudian:",
      "id": "Dan Kami abadikan untuk Ilyas (pujian yang baik) di kalangan orang-orang yang datang kemudian.",
      "ar": "وَتَرَكۡنَا عَلَیۡهِ فِی ٱلۡـَٔاخِرِینَ\n"
    }
  },
  {
    "id": 3918,
    "surahId": 37,
    "ayahNumber": 130,
    "arabicText": "سَلَـٰمٌ عَلَىٰۤ إِلۡ یَاسِینَ\n",
    "translations": {
      "en": "“Peace be upon Elijah and his followers!”",
      "ms": "\"Salam sejahtera kepada Nabi Ilyas!\"",
      "id": "(yaitu): \"Kesejahteraan dilimpahkan atas Ilyas?\"",
      "ar": "سَلَـٰمٌ عَلَىٰۤ إِلۡ یَاسِینَ\n"
    }
  },
  {
    "id": 3919,
    "surahId": 37,
    "ayahNumber": 131,
    "arabicText": "إِنَّا كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "Verily, thus do We reward the doers of good –",
      "ms": "Demikianlah sebenarnya Kami membalas orang-orang yang berusaha mengerjakan kebaikan.",
      "id": "Sesungguhnya demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik.",
      "ar": "إِنَّا كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 3920,
    "surahId": 37,
    "ayahNumber": 132,
    "arabicText": "إِنَّهُۥ مِنۡ عِبَادِنَا ٱلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "for he was truly one of Our believing servants!",
      "ms": "Sesungguhnya Nabi Ilyas itu dari hamba-hamba Kami yang beriman.",
      "id": "Sesungguhnya dia termasuk hamba-hamba Kami yang beriman.",
      "ar": "إِنَّهُۥ مِنۡ عِبَادِنَا ٱلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 3921,
    "surahId": 37,
    "ayahNumber": 133,
    "arabicText": "وَإِنَّ لُوطࣰا لَّمِنَ ٱلۡمُرۡسَلِینَ\n",
    "translations": {
      "en": "AND, BEHOLD, Lot was indeed one of Our mes­sage-bearers;",
      "ms": "Dan sesungguhnya Nabi Lut adalah dari Rasul-rasul (Kami) yang diutus.",
      "id": "Sesungguhnya Luth benar-benar salah seorang rasul.",
      "ar": "وَإِنَّ لُوطࣰا لَّمِنَ ٱلۡمُرۡسَلِینَ\n"
    }
  },
  {
    "id": 3922,
    "surahId": 37,
    "ayahNumber": 134,
    "arabicText": "إِذۡ نَجَّیۡنَـٰهُ وَأَهۡلَهُۥۤ أَجۡمَعِینَ\n",
    "translations": {
      "en": "[and so,] when [We decreed the doom of his sinful town,] We saved him and his household,",
      "ms": "(ingatkanlah peristiwa) ketika kami selamatkan dia dan keluarga serta pengikut-pengikutnya semuanya,",
      "id": "(Ingatlah) ketika Kami selamatkan dia dan keluarganya (pengikut-pengikutnya) semua,",
      "ar": "إِذۡ نَجَّیۡنَـٰهُ وَأَهۡلَهُۥۤ أَجۡمَعِینَ\n"
    }
  },
  {
    "id": 3923,
    "surahId": 37,
    "ayahNumber": 135,
    "arabicText": "إِلَّا عَجُوزࣰا فِی ٱلۡغَـٰبِرِینَ\n",
    "translations": {
      "en": "except an old woman who was among those that stayed behind;",
      "ms": "Kecuali seorang perempuan tua tertinggal dalam golongan yang dibinasakan.",
      "id": "kecuali seorang perempuan tua (isterinya yang berada) bersama-sama orang yang tinggal.",
      "ar": "إِلَّا عَجُوزࣰا فِی ٱلۡغَـٰبِرِینَ\n"
    }
  },
  {
    "id": 3924,
    "surahId": 37,
    "ayahNumber": 136,
    "arabicText": "ثُمَّ دَمَّرۡنَا ٱلۡـَٔاخَرِینَ\n",
    "translations": {
      "en": "and then We utterly destroyed the others:",
      "ms": "Kemudian Kami hancurkan yang lain (dari pengikut-pengikut Nabi Lut).",
      "id": "Kemudian Kami binasakan orang-orang yang lain.",
      "ar": "ثُمَّ دَمَّرۡنَا ٱلۡـَٔاخَرِینَ\n"
    }
  },
  {
    "id": 3925,
    "surahId": 37,
    "ayahNumber": 137,
    "arabicText": "وَإِنَّكُمۡ لَتَمُرُّونَ عَلَیۡهِم مُّصۡبِحِینَ\n",
    "translations": {
      "en": "and, verily, [to this day] you pass by the remnants of their dwellings at morning-time",
      "ms": "Dan sesungguhnya kamu (yang menentang Nabi Muhammad): berulang-alik (melalui bekas-bekas tempat tinggal) mereka, semasa kamu berada pada waktu pagi.",
      "id": "Dan sesungguhnya kamu (hai penduduk Mekah) benar-benar akan melalui (bekas-bekas) mereka di waktu pagi,",
      "ar": "وَإِنَّكُمۡ لَتَمُرُّونَ عَلَیۡهِم مُّصۡبِحِینَ\n"
    }
  },
  {
    "id": 3926,
    "surahId": 37,
    "ayahNumber": 138,
    "arabicText": "وَبِٱلَّیۡلِۚ أَفَلَا تَعۡقِلُونَ\n",
    "translations": {
      "en": "and by night. Will you not, then, use your reason?",
      "ms": "Dan juga pada waktu malam; maka mengapa kamu tidak mahu memikirkannya?.",
      "id": "dan di waktu malam. Maka apakah kamu tidak memikirkan?",
      "ar": "وَبِٱلَّیۡلِۚ أَفَلَا تَعۡقِلُونَ\n"
    }
  },
  {
    "id": 3927,
    "surahId": 37,
    "ayahNumber": 139,
    "arabicText": "وَإِنَّ یُونُسَ لَمِنَ ٱلۡمُرۡسَلِینَ\n",
    "translations": {
      "en": "AND, BEHOLD, Jonah was indeed one of Our mes­sage-bearers",
      "ms": "Dan sesungguhnya Nabi Yunus adalah dari Rasul-rasul (Kami) yang diutus.",
      "id": "Sesungguhnya Yunus benar-benar salah seorang rasul,",
      "ar": "وَإِنَّ یُونُسَ لَمِنَ ٱلۡمُرۡسَلِینَ\n"
    }
  },
  {
    "id": 3928,
    "surahId": 37,
    "ayahNumber": 140,
    "arabicText": "إِذۡ أَبَقَ إِلَى ٱلۡفُلۡكِ ٱلۡمَشۡحُونِ\n",
    "translations": {
      "en": "when he fled like a runaway slave onto a laden ship.",
      "ms": "(Ingatkanlah peristiwa) ketika ia melarikan diri ke kapal yang penuh sarat.",
      "id": "(ingatlah) ketika ia lari, ke kapal yang penuh muatan,",
      "ar": "إِذۡ أَبَقَ إِلَى ٱلۡفُلۡكِ ٱلۡمَشۡحُونِ\n"
    }
  },
  {
    "id": 3929,
    "surahId": 37,
    "ayahNumber": 141,
    "arabicText": "فَسَاهَمَ فَكَانَ مِنَ ٱلۡمُدۡحَضِینَ\n",
    "translations": {
      "en": "And then they cast lots, and he was the one who lost;",
      "ms": "(Dengan satu keadaan yang memaksa) maka dia pun turut mengundi, lalu menjadilah ia dari orang-orang yang kalah yang digelunsurkan (ke laut).",
      "id": "kemudian ia ikut berundi lalu dia termasuk orang-orang yang kalah dalam undian.",
      "ar": "فَسَاهَمَ فَكَانَ مِنَ ٱلۡمُدۡحَضِینَ\n"
    }
  },
  {
    "id": 3930,
    "surahId": 37,
    "ayahNumber": 142,
    "arabicText": "فَٱلۡتَقَمَهُ ٱلۡحُوتُ وَهُوَ مُلِیمࣱ\n",
    "translations": {
      "en": "[and they cast him into the sea,] whereupon the great fish swallowed him, for he had been blameworthy.",
      "ms": "Setelah itu ia ditelan oleh ikan besar, sedang ia berhak ditempelak.",
      "id": "Maka ia ditelan oleh ikan besar dalam keadaan tercela.",
      "ar": "فَٱلۡتَقَمَهُ ٱلۡحُوتُ وَهُوَ مُلِیمࣱ\n"
    }
  },
  {
    "id": 3931,
    "surahId": 37,
    "ayahNumber": 143,
    "arabicText": "فَلَوۡلَاۤ أَنَّهُۥ كَانَ مِنَ ٱلۡمُسَبِّحِینَ\n",
    "translations": {
      "en": "And had he not been of those who [even in the deep darkness of their distress are able to] extol God’s limitless glory,",
      "ms": "Maka kalaulah ia bukan dari orang-orang yang sentiasa mengingati Allah (dengan zikir dan tasbih),",
      "id": "Maka kalau sekiranya dia tidak termasuk orang-orang yang banyak mengingat Allah,",
      "ar": "فَلَوۡلَاۤ أَنَّهُۥ كَانَ مِنَ ٱلۡمُسَبِّحِینَ\n"
    }
  },
  {
    "id": 3932,
    "surahId": 37,
    "ayahNumber": 144,
    "arabicText": "لَلَبِثَ فِی بَطۡنِهِۦۤ إِلَىٰ یَوۡمِ یُبۡعَثُونَ\n",
    "translations": {
      "en": "he would indeed have remained in its belly till the Day when all shall be raised from the dead:",
      "ms": "Tentulah ia akan tinggal di dalam perut ikan itu hingga ke hari manusia dibangkitkan keluar dari kubur.",
      "id": "niscaya ia akan tetap tinggal di perut ikan itu sampai hari berbangkit.",
      "ar": "لَلَبِثَ فِی بَطۡنِهِۦۤ إِلَىٰ یَوۡمِ یُبۡعَثُونَ\n"
    }
  },
  {
    "id": 3933,
    "surahId": 37,
    "ayahNumber": 145,
    "arabicText": "۞ فَنَبَذۡنَـٰهُ بِٱلۡعَرَاۤءِ وَهُوَ سَقِیمࣱ\n",
    "translations": {
      "en": "but We caused him to be cast forth on a desert shore, sick [at heart] as he was,",
      "ms": "Oleh itu Kami campakkan dia keluar (dari perut ikan) ke tanah yang tandus (di tepi pantai), sedang ia berkeadaan sakit.",
      "id": "Kemudian Kami lemparkan dia ke daerah yang tandus, sedang ia dalam keadaan sakit.",
      "ar": "۞ فَنَبَذۡنَـٰهُ بِٱلۡعَرَاۤءِ وَهُوَ سَقِیمࣱ\n"
    }
  },
  {
    "id": 3934,
    "surahId": 37,
    "ayahNumber": 146,
    "arabicText": "وَأَنۢبَتۡنَا عَلَیۡهِ شَجَرَةࣰ مِّن یَقۡطِینࣲ\n",
    "translations": {
      "en": "and caused a creeping plant to grow over him [out of the barren soil].",
      "ms": "Dan Kami tumbuhkan (untuk melindunginya) sebatang pokok yang berdaun lebar.",
      "id": "Dan Kami tumbuhkan untuk dia sebatang pohon dari jenis labu.",
      "ar": "وَأَنۢبَتۡنَا عَلَیۡهِ شَجَرَةࣰ مِّن یَقۡطِینࣲ\n"
    }
  },
  {
    "id": 3935,
    "surahId": 37,
    "ayahNumber": 147,
    "arabicText": "وَأَرۡسَلۡنَـٰهُ إِلَىٰ مِا۟ئَةِ أَلۡفٍ أَوۡ یَزِیدُونَ\n",
    "translations": {
      "en": "And [then] We sent him [once again] to [his people,] a hundred thousand [souls] or more:",
      "ms": "Dan (Nabi Yunus yang tersebut kisahnya itu) Kami utuskan kepada (kaumnya yang seramai) seratus ribu atau lebih.",
      "id": "Dan Kami utus dia kepada seratus ribu orang atau lebih.",
      "ar": "وَأَرۡسَلۡنَـٰهُ إِلَىٰ مِا۟ئَةِ أَلۡفٍ أَوۡ یَزِیدُونَ\n"
    }
  },
  {
    "id": 3936,
    "surahId": 37,
    "ayahNumber": 148,
    "arabicText": "فَـَٔامَنُوا۟ فَمَتَّعۡنَـٰهُمۡ إِلَىٰ حِینࣲ\n",
    "translations": {
      "en": "and [this time] they believed [in him] and so We allowed them to enjoy their life during the time allotted to them?",
      "ms": "(Setelah berlaku apa yang berlaku) maka mereka pun beriman, lalu Kami biarkan mereka menikmati kesenangan hidup hingga ke suatu masa (yang ditetapkan bagi masing-masing).",
      "id": "Lalu mereka beriman, karena itu Kami anugerahkan kenikmatan hidup kepada mereka hingga waktu yang tertentu.",
      "ar": "فَـَٔامَنُوا۟ فَمَتَّعۡنَـٰهُمۡ إِلَىٰ حِینࣲ\n"
    }
  },
  {
    "id": 3937,
    "surahId": 37,
    "ayahNumber": 149,
    "arabicText": "فَٱسۡتَفۡتِهِمۡ أَلِرَبِّكَ ٱلۡبَنَاتُ وَلَهُمُ ٱلۡبَنُونَ\n",
    "translations": {
      "en": "AND NOW ask them to enlighten thee: Has thy Sustainer daughters, whereas they would have [only] sons?",
      "ms": "(Oleh sebab ada di antara kaum musyrik Arab yang mendakwa bahawa malaikat itu anak-anak perempuan Allah) maka bertanyalah (wahai Muhammad) kepada mereka itu: Adilkah mereka membahagi untuk Tuhanmu anak-anak perempuan, dan untuk mereka anak-anak lelaki?",
      "id": "Tanyakanlah (ya Muhammad) kepada mereka (orang-orang kafir Mekah): \"Apakah untuk Tuhanmu anak-anak perempuan dan untuk mereka anak laki-laki,",
      "ar": "فَٱسۡتَفۡتِهِمۡ أَلِرَبِّكَ ٱلۡبَنَاتُ وَلَهُمُ ٱلۡبَنُونَ\n"
    }
  },
  {
    "id": 3938,
    "surahId": 37,
    "ayahNumber": 150,
    "arabicText": "أَمۡ خَلَقۡنَا ٱلۡمَلَـٰۤىِٕكَةَ إِنَـٰثࣰا وَهُمۡ شَـٰهِدُونَ\n",
    "translations": {
      "en": "- or is it that We have created the angels female, and they [who believe them to be divine] have witnessed [that act of creation]?",
      "ms": "Atau adakah mereka hadir sendiri menyaksikan Kami mencipta malaikat-malaikat itu - perempuan?",
      "id": "atau apakah Kami menciptakan malaikat-malaikat berupa perempuan dan mereka menyaksikan(nya)?",
      "ar": "أَمۡ خَلَقۡنَا ٱلۡمَلَـٰۤىِٕكَةَ إِنَـٰثࣰا وَهُمۡ شَـٰهِدُونَ\n"
    }
  },
  {
    "id": 3939,
    "surahId": 37,
    "ayahNumber": 151,
    "arabicText": "أَلَاۤ إِنَّهُم مِّنۡ إِفۡكِهِمۡ لَیَقُولُونَ\n",
    "translations": {
      "en": "Oh, verily, it is out of their own [inclination to] falsehood that some people assert,",
      "ms": "Ketahuilah! Bahawa sesungguhnya, dengan sebab terpesongnya dari kebenaran, mereka berkata:",
      "id": "Ketahuilah bahwa sesungguhnya mereka dengan kebohongannya benar-benar mengatakan:",
      "ar": "أَلَاۤ إِنَّهُم مِّنۡ إِفۡكِهِمۡ لَیَقُولُونَ\n"
    }
  },
  {
    "id": 3940,
    "surahId": 37,
    "ayahNumber": 152,
    "arabicText": "وَلَدَ ٱللَّهُ وَإِنَّهُمۡ لَكَـٰذِبُونَ\n",
    "translations": {
      "en": "“God has begotten [a son]”; and, verily, they are lying [too, when they say],",
      "ms": "\"Allah beranak\"; sedang mereka, sesungguhnya adalah orang-orang yang berdusta!",
      "id": "\"Allah beranak\". Dan sesungguhnya mereka benar-benar orang yang berdusta.",
      "ar": "وَلَدَ ٱللَّهُ وَإِنَّهُمۡ لَكَـٰذِبُونَ\n"
    }
  },
  {
    "id": 3941,
    "surahId": 37,
    "ayahNumber": 153,
    "arabicText": "أَصۡطَفَى ٱلۡبَنَاتِ عَلَى ٱلۡبَنِینَ\n",
    "translations": {
      "en": "“He has chosen daughters in preference to sons”!",
      "ms": "(Patutkah kamu mendakwa bahawa Tuhan mempunyai anak, dan anak itu pula ialah anak-anak perempuan yang kamu tidak sukai?) Adakah Tuhan memilih serta mengutamakan anak-anak perempuan dari anak-anak lelaki (sedang kedua-dua jenis itu Dia lah yang menciptakannya)?",
      "id": "Apakah Tuhan memilih (mengutamakan) anak-anak perempuan daripada anak laki-laki?",
      "ar": "أَصۡطَفَى ٱلۡبَنَاتِ عَلَى ٱلۡبَنِینَ\n"
    }
  },
  {
    "id": 3942,
    "surahId": 37,
    "ayahNumber": 154,
    "arabicText": "مَا لَكُمۡ كَیۡفَ تَحۡكُمُونَ\n",
    "translations": {
      "en": "What is amiss with you and your judgment?",
      "ms": "Apa sudah jadi kamu? Bagaimana kamu menetapkan hukum (yang terang-terang salahnya itu)?",
      "id": "Apakah yang terjadi padamu? Bagaimana (caranya) kamu menetapkan?",
      "ar": "مَا لَكُمۡ كَیۡفَ تَحۡكُمُونَ\n"
    }
  },
  {
    "id": 3943,
    "surahId": 37,
    "ayahNumber": 155,
    "arabicText": "أَفَلَا تَذَكَّرُونَ\n",
    "translations": {
      "en": "Will you not, then, bethink yourselves?",
      "ms": "Setelah ditegur, maka tidakkah kamu mahu berusaha mengingatkan (bahawa Allah mustahil bagiNya anak-pinak)?",
      "id": "Maka apakah kamu tidak memikirkan?",
      "ar": "أَفَلَا تَذَكَّرُونَ\n"
    }
  },
  {
    "id": 3944,
    "surahId": 37,
    "ayahNumber": 156,
    "arabicText": "أَمۡ لَكُمۡ سُلۡطَـٰنࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "Or have you, perchance, a clear evidence [for your assertions]?",
      "ms": "Atau adakah kamu mempunyai sebarang bukti yang nyata (menerangkan bahawa malaikat itu anak-anak perempuan Allah)?",
      "id": "Atau apakah kamu mempunyai bukti yang nyata?",
      "ar": "أَمۡ لَكُمۡ سُلۡطَـٰنࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 3945,
    "surahId": 37,
    "ayahNumber": 157,
    "arabicText": "فَأۡتُوا۟ بِكِتَـٰبِكُمۡ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "Produce, then, that divine writ of yours, if you are speaking the truth!",
      "ms": "(Kiranya ada) maka bawalah kitab kamu (yang menerangkan demikian), jika betul kamu orang-orang yang benar.",
      "id": "Maka bawalah kitabmu jika kamu memang orang-orang yang benar.",
      "ar": "فَأۡتُوا۟ بِكِتَـٰبِكُمۡ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 3946,
    "surahId": 37,
    "ayahNumber": 158,
    "arabicText": "وَجَعَلُوا۟ بَیۡنَهُۥ وَبَیۡنَ ٱلۡجِنَّةِ نَسَبࣰاۚ وَلَقَدۡ عَلِمَتِ ٱلۡجِنَّةُ إِنَّهُمۡ لَمُحۡضَرُونَ\n",
    "translations": {
      "en": "And some people have invented a kinship between Him and all manner of invisible forces although [even] these invisible forces know well that, verily, they [who thus blaspheme against God] shall indeed be arraigned [before Him on Judgment Day: for]",
      "ms": "(Mereka telah mengatakan perkara yang mustahil) serta mengadakan pertalian kerabat di antara Allah dan malaikat, padahal demi sesungguhnya malaikat itu sedia mengetahui bahawa sebenarnya orang-orang yang melakukan demikian akan dibawa hadir (ke dalam azab pada hari akhirat).",
      "id": "Dan mereka adakan (hubungan) nasab antara Allah dan antara jin. Dan sesungguhnya jin mengetahui bahwa mereka benar-benar akan diseret (ke neraka),",
      "ar": "وَجَعَلُوا۟ بَیۡنَهُۥ وَبَیۡنَ ٱلۡجِنَّةِ نَسَبࣰاۚ وَلَقَدۡ عَلِمَتِ ٱلۡجِنَّةُ إِنَّهُمۡ لَمُحۡضَرُونَ\n"
    }
  },
  {
    "id": 3947,
    "surahId": 37,
    "ayahNumber": 159,
    "arabicText": "سُبۡحَـٰنَ ٱللَّهِ عَمَّا یَصِفُونَ\n",
    "translations": {
      "en": "limitless is God in His glory, above anything that men may devise by way of definition!",
      "ms": "Maha Suci Allah dari apa yang mereka katakan itu!",
      "id": "Maha Suci Allah dari apa yang mereka sifatkan,",
      "ar": "سُبۡحَـٰنَ ٱللَّهِ عَمَّا یَصِفُونَ\n"
    }
  },
  {
    "id": 3948,
    "surahId": 37,
    "ayahNumber": 160,
    "arabicText": "إِلَّا عِبَادَ ٱللَّهِ ٱلۡمُخۡلَصِینَ\n",
    "translations": {
      "en": "Not thus, however, [behave] God’s true ser­vants:",
      "ms": "Kecuali hamba-hamba Allah yang dibersihkan dari sebarang syirik, (maka mereka akan terselamat, dan akan mendapat sebaik-baik balasan).",
      "id": "Kecuali hamba-hamba Allah yang dibersihkan dari (dosa).",
      "ar": "إِلَّا عِبَادَ ٱللَّهِ ٱلۡمُخۡلَصِینَ\n"
    }
  },
  {
    "id": 3949,
    "surahId": 37,
    "ayahNumber": 161,
    "arabicText": "فَإِنَّكُمۡ وَمَا تَعۡبُدُونَ\n",
    "translations": {
      "en": "for, verily, neither you [blasphemers] nor the objects of your worship",
      "ms": "Maka sebenarnya kamu (wahai orang-orang musyrik), dan apa yang kamu sembah itu.",
      "id": "Maka sesungguhnya kamu dan apa-apa yang kamu sembah itu,",
      "ar": "فَإِنَّكُمۡ وَمَا تَعۡبُدُونَ\n"
    }
  },
  {
    "id": 3950,
    "surahId": 37,
    "ayahNumber": 162,
    "arabicText": "مَاۤ أَنتُمۡ عَلَیۡهِ بِفَـٰتِنِینَ\n",
    "translations": {
      "en": "can cause anyone to fall prey to your temptation",
      "ms": "Tidak akan dapat merosakkan perhubungan seseorang dengan Tuhannya,",
      "id": "Sekali-kali tidak dapat menyesatkan (seseorang) terhadap Allah,",
      "ar": "مَاۤ أَنتُمۡ عَلَیۡهِ بِفَـٰتِنِینَ\n"
    }
  },
  {
    "id": 3951,
    "surahId": 37,
    "ayahNumber": 163,
    "arabicText": "إِلَّا مَنۡ هُوَ صَالِ ٱلۡجَحِیمِ\n",
    "translations": {
      "en": "unless it be such as rushes towards the blazing fire [of his own accord]!",
      "ms": "kecuali orang-orang yang telah ditetapkan bahawa dia akan dibakar di dalam neraka yang menjulang-julang.",
      "id": "kecuali orang-orang yang akan masuk neraka yang menyala.",
      "ar": "إِلَّا مَنۡ هُوَ صَالِ ٱلۡجَحِیمِ\n"
    }
  },
  {
    "id": 3952,
    "surahId": 37,
    "ayahNumber": 164,
    "arabicText": "وَمَا مِنَّاۤ إِلَّا لَهُۥ مَقَامࣱ مَّعۡلُومࣱ\n",
    "translations": {
      "en": "[All forces of nature praise God and say:] “Among us, too, there is none but has a place assigned to it [by Him];",
      "ms": "(Malaikat pula menegaskan pendirian mereka dengan berkata): \"Dan tiada sesiapapun dari kalangan kami melainkan ada baginya darjat kedudukan yang tertentu (dalam menyempurnakan tugasnya);",
      "id": "Tiada seorangpun di antara kami (malaikat) melainkan mempunyai kedudukan yang tertentu,",
      "ar": "وَمَا مِنَّاۤ إِلَّا لَهُۥ مَقَامࣱ مَّعۡلُومࣱ\n"
    }
  },
  {
    "id": 3953,
    "surahId": 37,
    "ayahNumber": 165,
    "arabicText": "وَإِنَّا لَنَحۡنُ ٱلصَّاۤفُّونَ\n",
    "translations": {
      "en": "and, verily, we too are ranged [before Him in worship];",
      "ms": "\"Dan sesungguhnya kamilah yang sentiasa berbaris (menjunjung perintah dan beribadat),",
      "id": "dan sesungguhnya kami benar-benar bershaf-shaf (dalam menunaikan perintah Allah).",
      "ar": "وَإِنَّا لَنَحۡنُ ٱلصَّاۤفُّونَ\n"
    }
  },
  {
    "id": 3954,
    "surahId": 37,
    "ayahNumber": 166,
    "arabicText": "وَإِنَّا لَنَحۡنُ ٱلۡمُسَبِّحُونَ\n",
    "translations": {
      "en": "and, verily, we too extol His limitless glory!”",
      "ms": "\"Dan sesungguhnya kamilah yang sentiasa bertasbih (mensucikan Allah dari sebarang sifat kekurangan)!\"",
      "id": "Dan sesungguhnya kami benar-benar bertasbih (kepada Allah).",
      "ar": "وَإِنَّا لَنَحۡنُ ٱلۡمُسَبِّحُونَ\n"
    }
  },
  {
    "id": 3955,
    "surahId": 37,
    "ayahNumber": 167,
    "arabicText": "وَإِن كَانُوا۟ لَیَقُولُونَ\n",
    "translations": {
      "en": "AND, INDEED, they [who deny the truth] have always been wont to say,",
      "ms": "Dan sebenarnya mereka (yang musyrik) itu dahulu pernah berkata:",
      "id": "Sesungguhnya mereka benar-benar akan berkata:",
      "ar": "وَإِن كَانُوا۟ لَیَقُولُونَ\n"
    }
  },
  {
    "id": 3956,
    "surahId": 37,
    "ayahNumber": 168,
    "arabicText": "لَوۡ أَنَّ عِندَنَا ذِكۡرࣰا مِّنَ ٱلۡأَوَّلِینَ\n",
    "translations": {
      "en": "“If only we had a tradition [to this effect] from our forebears,",
      "ms": "\"Kalaulah ada di sisi kami Kitab Suci dari (bawaan Rasul-rasul) yang telah lalu",
      "id": "\"Kalau sekiranya di sksi kami ada sebuah kitab dari (kitab-kitab yang diturunkan) kepada orang-orang dahulu,",
      "ar": "لَوۡ أَنَّ عِندَنَا ذِكۡرࣰا مِّنَ ٱلۡأَوَّلِینَ\n"
    }
  },
  {
    "id": 3957,
    "surahId": 37,
    "ayahNumber": 169,
    "arabicText": "لَكُنَّا عِبَادَ ٱللَّهِ ٱلۡمُخۡلَصِینَ\n",
    "translations": {
      "en": "we would certainly be true servants of God.”",
      "ms": "\"Tentulah kami akan menjadi hamba-hamba Allah yang dibersihkan dari sebarang syirik!\"",
      "id": "benar-benar kami akan jadi hamba Allah yang dibersihkan (dari dosa)\".",
      "ar": "لَكُنَّا عِبَادَ ٱللَّهِ ٱلۡمُخۡلَصِینَ\n"
    }
  },
  {
    "id": 3958,
    "surahId": 37,
    "ayahNumber": 170,
    "arabicText": "فَكَفَرُوا۟ بِهِۦۖ فَسَوۡفَ یَعۡلَمُونَ\n",
    "translations": {
      "en": "And yet, [now that this divine writ has been placed before them,] they refuse to acknowledge it as true! In time, however, they will come to know [what it was that they had rejected]:",
      "ms": "(Setelah Al-Quran diturunkan kepada mereka) mereka mengingkarinya; oleh itu mereka akan mengetahui kelak (akibat kekufurannya).",
      "id": "Tetapi mereka mengingkarinya (Al Quran); maka kelak mereka akan mengetahui (akibat keingkarannya itu).",
      "ar": "فَكَفَرُوا۟ بِهِۦۖ فَسَوۡفَ یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 3959,
    "surahId": 37,
    "ayahNumber": 171,
    "arabicText": "وَلَقَدۡ سَبَقَتۡ كَلِمَتُنَا لِعِبَادِنَا ٱلۡمُرۡسَلِینَ\n",
    "translations": {
      "en": "for, long ago has Our word gone forth unto Our servants, the message- bearers,",
      "ms": "Dan demi sesungguhnya! Telah ada semenjak dahulu lagi, ketetapan Kami, bagi hamba-hamba Kami yang diutus menjadi Rasul -",
      "id": "Dan sesungguhnya telah tetap janji Kami kepada hamba-hamba Kami yang menjadi rasul,",
      "ar": "وَلَقَدۡ سَبَقَتۡ كَلِمَتُنَا لِعِبَادِنَا ٱلۡمُرۡسَلِینَ\n"
    }
  },
  {
    "id": 3960,
    "surahId": 37,
    "ayahNumber": 172,
    "arabicText": "إِنَّهُمۡ لَهُمُ ٱلۡمَنصُورُونَ\n",
    "translations": {
      "en": "that, verily, they - they indeed - would be succoured,",
      "ms": "Bahawa sesungguhnya merekalah orang-orang yang diberikan pertolongan mencapai kemenangan",
      "id": "(yaitu) sesungguhnya mereka itulah yang pasti mendapat pertolongan.",
      "ar": "إِنَّهُمۡ لَهُمُ ٱلۡمَنصُورُونَ\n"
    }
  },
  {
    "id": 3961,
    "surahId": 37,
    "ayahNumber": 173,
    "arabicText": "وَإِنَّ جُندَنَا لَهُمُ ٱلۡغَـٰلِبُونَ\n",
    "translations": {
      "en": "and that, verily, Our hosts - they indeed - would [in the end] be victorious!",
      "ms": "Dan bahawasanya tentera Kami (pengikut-pengikut Rasul), merekalah orang-orang yang mengalahkan (golongan yang menentang kebenaran).",
      "id": "Dan sesungguhnya tentara Kami itulah yang pasti menang,",
      "ar": "وَإِنَّ جُندَنَا لَهُمُ ٱلۡغَـٰلِبُونَ\n"
    }
  },
  {
    "id": 3962,
    "surahId": 37,
    "ayahNumber": 174,
    "arabicText": "فَتَوَلَّ عَنۡهُمۡ حَتَّىٰ حِینࣲ\n",
    "translations": {
      "en": "Hence, turn thou aside for a while from those [who deny the truth],",
      "ms": "Oleh itu berpalinglah (wahai Muhammad) dari mereka, (jangan hiraukan celaan mereka serta bersabarlah) hingga ke suatu masa.",
      "id": "Maka berpalinglah kamu (Muhammad) dari mereka sampai suatu ketika.",
      "ar": "فَتَوَلَّ عَنۡهُمۡ حَتَّىٰ حِینࣲ\n"
    }
  },
  {
    "id": 3963,
    "surahId": 37,
    "ayahNumber": 175,
    "arabicText": "وَأَبۡصِرۡهُمۡ فَسَوۡفَ یُبۡصِرُونَ\n",
    "translations": {
      "en": "and see them [for what they are]; and in time they [too] will come to see [what they do not see now].",
      "ms": "Dan lihat (apa yang akan menimpa) mereka; tidak lama kemudian mereka akan melihat (kemenangan yang telah Kami tetapkan untukmu).",
      "id": "Dan lihatlah mereka, maka kelak mereka akan melihat (azab itu).",
      "ar": "وَأَبۡصِرۡهُمۡ فَسَوۡفَ یُبۡصِرُونَ\n"
    }
  },
  {
    "id": 3964,
    "surahId": 37,
    "ayahNumber": 176,
    "arabicText": "أَفَبِعَذَابِنَا یَسۡتَعۡجِلُونَ\n",
    "translations": {
      "en": "Do they, then, [really] wish that Our chas­tisement be hastened on?",
      "ms": "Maka tidaklah patut mereka meminta disegerakan azab (yang telah ditetapkan oleh) Kami!",
      "id": "Maka apakah mereka meminta supaya siksa Kami disegerakan?",
      "ar": "أَفَبِعَذَابِنَا یَسۡتَعۡجِلُونَ\n"
    }
  },
  {
    "id": 3965,
    "surahId": 37,
    "ayahNumber": 177,
    "arabicText": "فَإِذَا نَزَلَ بِسَاحَتِهِمۡ فَسَاۤءَ صَبَاحُ ٱلۡمُنذَرِینَ\n",
    "translations": {
      "en": "But then, once it alights upon them, hapless will be the awakening of those who were warned [to no avail]!",
      "ms": "Kerana apabila azab itu turun dalam daerah dan kawasan mereka, sudah tentu buruklah hari orang-orang yang tidak mengindahkan amaran yang telah diberikan.",
      "id": "Maka apabila siksaan itu turun dihalaman mereka, maka amat buruklah pagi hari yang dialami oleh orang-orang yang diperingatkan itu.",
      "ar": "فَإِذَا نَزَلَ بِسَاحَتِهِمۡ فَسَاۤءَ صَبَاحُ ٱلۡمُنذَرِینَ\n"
    }
  },
  {
    "id": 3966,
    "surahId": 37,
    "ayahNumber": 178,
    "arabicText": "وَتَوَلَّ عَنۡهُمۡ حَتَّىٰ حِینࣲ\n",
    "translations": {
      "en": "Hence, turn thou aside for a while from them,",
      "ms": "Dan berpalinglah (wahai Muhammad) dari mereka, (jangan hiraukan celaan mereka serta bersabarlah) hingga ke suatu masa.",
      "id": "Dan berpalinglah kamu dari mereka hingga suatu ketika.",
      "ar": "وَتَوَلَّ عَنۡهُمۡ حَتَّىٰ حِینࣲ\n"
    }
  },
  {
    "id": 3967,
    "surahId": 37,
    "ayahNumber": 179,
    "arabicText": "وَأَبۡصِرۡ فَسَوۡفَ یُبۡصِرُونَ\n",
    "translations": {
      "en": "and see [them for what they are]; and n time they [too] will come to see [what they do not see now].",
      "ms": "Dan lihatlah (apa yang akan jadi); tidak lama kemudian, mereka pun akan melihat juga.",
      "id": "Dan lihatlah, maka kelak mereka juga akan melihat.",
      "ar": "وَأَبۡصِرۡ فَسَوۡفَ یُبۡصِرُونَ\n"
    }
  },
  {
    "id": 3968,
    "surahId": 37,
    "ayahNumber": 180,
    "arabicText": "سُبۡحَـٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا یَصِفُونَ\n",
    "translations": {
      "en": "LIMITLESS in His glory is thy Sustainer, the Lord of almightiness, [exalted] above anything that men may devise by way of definition!",
      "ms": "Akuilah kesucian Tuhanmu, - Tuhan yang mempunyai keagungan dan kekuasaan, - dari apa yang mereka katakan!",
      "id": "Maha Suci Tuhanmu Yang mempunyai keperkasaan dari apa yang mereka katakan.",
      "ar": "سُبۡحَـٰنَ رَبِّكَ رَبِّ ٱلۡعِزَّةِ عَمَّا یَصِفُونَ\n"
    }
  },
  {
    "id": 3969,
    "surahId": 37,
    "ayahNumber": 181,
    "arabicText": "وَسَلَـٰمٌ عَلَى ٱلۡمُرۡسَلِینَ\n",
    "translations": {
      "en": "And peace be upon all His message-bearers!",
      "ms": "Dan (ucaplah) salam sejahtera kepada sekalian Rasul.",
      "id": "Dan kesejahteraan dilimpahkan atas para rasul.",
      "ar": "وَسَلَـٰمٌ عَلَى ٱلۡمُرۡسَلِینَ\n"
    }
  },
  {
    "id": 3970,
    "surahId": 37,
    "ayahNumber": 182,
    "arabicText": "وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "And all praise is due to God alone, the Sus­tainer of all the worlds!",
      "ms": "Serta (ingatlah bahawa) segala puji tertentu bagi Allah, Tuhan yang memelihara dan mentadbirkan seluruh alam.",
      "id": "Dan segala puji bagi Allah Tuhan seru sekalian alam.",
      "ar": "وَٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَـٰلَمِینَ\n"
    }
  }
]