[
  {
    "id": 1751,
    "surahId": 14,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ كِتَـٰبٌ أَنزَلۡنَـٰهُ إِلَیۡكَ لِتُخۡرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ بِإِذۡنِ رَبِّهِمۡ إِلَىٰ صِرَ ٰ⁠طِ ٱلۡعَزِیزِ ٱلۡحَمِیدِ\n",
    "translations": {
      "en": "Alif. Lam. Ra. A DIVINE WRIT [is this -a revelation] which We have bestowed upon thee from on high in order that thou might bring forth all mankind, by their Sustainer's leave, out of the depths of darkness into the light: onto the way that leads to the Almighty, the One to whom all praise is due -",
      "ms": "Alif, Laam, Raa'. Ini ialah Kitab (Al-Quran) Kami turunkan dia kepadamu (wahai Muhammad), supaya engkau mengeluarkan umat manusia seluruhnya dari gelap-gelita kufur kepada cahaya iman - dengan izin Tuhan mereka - ke jalan Allah Yang Maha Kuasa lagi Maha Terpuji.",
      "id": "Alif, laam raa. (Ini adalah) Kitab yang Kami turunkan kepadamu supaya kamu mengeluarkan manusia dari gelap gulita kepada cahaya terang benderang dengan izin Tuhan mereka, (yaitu) menuju jalan Tuhan Yang Maha Perkasa lagi Maha Terpuji.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤرۚ كِتَـٰبٌ أَنزَلۡنَـٰهُ إِلَیۡكَ لِتُخۡرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ بِإِذۡنِ رَبِّهِمۡ إِلَىٰ صِرَ ٰ⁠طِ ٱلۡعَزِیزِ ٱلۡحَمِیدِ\n"
    }
  },
  {
    "id": 1752,
    "surahId": 14,
    "ayahNumber": 2,
    "arabicText": "ٱللَّهِ ٱلَّذِی لَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ وَوَیۡلࣱ لِّلۡكَـٰفِرِینَ مِنۡ عَذَابࣲ شَدِیدٍ\n",
    "translations": {
      "en": "to God, unto whom all that is in the heavens and all that is on earth belongs. But woe unto those who deny the truth: for suffering severe",
      "ms": "Allah jua yang memiliki segala yang ada di langit serta yang ada di bumi; dan kecelakaan besar bagi orang-orang yang kufur ingkar (terhadap Al-Quran) dari azab yang amat berat (yang akan menimpa mereka kelak).",
      "id": "Allah-lah yang memiliki segala apa yang di langit dan di bumi. Dan kecelakaanlah bagi orang-orang kafir karena siksaan yang sangat pedih,",
      "ar": "ٱللَّهِ ٱلَّذِی لَهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ وَوَیۡلࣱ لِّلۡكَـٰفِرِینَ مِنۡ عَذَابࣲ شَدِیدٍ\n"
    }
  },
  {
    "id": 1753,
    "surahId": 14,
    "ayahNumber": 3,
    "arabicText": "ٱلَّذِینَ یَسۡتَحِبُّونَ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا عَلَى ٱلۡـَٔاخِرَةِ وَیَصُدُّونَ عَن سَبِیلِ ٱللَّهِ وَیَبۡغُونَهَا عِوَجًاۚ أُو۟لَـٰۤىِٕكَ فِی ضَلَـٰلِۭ بَعِیدࣲ\n",
    "translations": {
      "en": "awaits those who choose the life of this world as the sole object of their love, preferring it to [all thought of] the life to come, and who turn others away from the path of God and try to make it appear crooked. Such as these have indeed gone far astray!",
      "ms": "Orang-orang yang mengutamakan dunia lebih daripada akhirat, dan menghalangi manusia dari jalan ugama Allah, serta menghendaki jalan itu menjadi bengkok terpesong, mereka itulah orang-orang yang terjerumus ke dalam kesesatan yang jauh terpesongnya.",
      "id": "(yaitu) orang-orang yang lebih menyukai kehidupan dunia dari pada kehidupan akhirat, dan menghalang-halangi (manusia) dari jalan Allah dan menginginkan agar jalan Allah itu bengkok. Mereka itu berada dalam kesesatan yang jauh.",
      "ar": "ٱلَّذِینَ یَسۡتَحِبُّونَ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا عَلَى ٱلۡـَٔاخِرَةِ وَیَصُدُّونَ عَن سَبِیلِ ٱللَّهِ وَیَبۡغُونَهَا عِوَجًاۚ أُو۟لَـٰۤىِٕكَ فِی ضَلَـٰلِۭ بَعِیدࣲ\n"
    }
  },
  {
    "id": 1754,
    "surahId": 14,
    "ayahNumber": 4,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوۡمِهِۦ لِیُبَیِّنَ لَهُمۡۖ فَیُضِلُّ ٱللَّهُ مَن یَشَاۤءُ وَیَهۡدِی مَن یَشَاۤءُۚ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n",
    "translations": {
      "en": "AND NEVER have We sent forth any apostle otherwise than [with a message] in his own people's tongue, so that he might make [the truth] clear unto them; but God lets go astray him that wills [to go astray], and guides him that wills [to be guided] -for He alone is almighty, truly wise.",
      "ms": "Dan Kami tidak mengutuskan seseorang Rasul melainkan dengan bahasa kaumnya supaya ia menjelaskan (hukum-hukum Allah) kepada mereka. Maka Allah menyesatkan sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya), juga memberi hidayah petunjuk kepada sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya); dan Dia lah jua Yang Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Kami tidak mengutus seorang rasulpun, melainkan dengan bahasa kaumnya, supaya ia dapat memberi penjelasan dengan terang kepada mereka. Maka Allah menyesatkan siapa yang Dia kehendaki, dan memberi petunjuk kepada siapa yang Dia kehendaki. Dan Dialah Tuhan Yang Maha Kuasa lagi Maha Bijaksana.",
      "ar": "وَمَاۤ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوۡمِهِۦ لِیُبَیِّنَ لَهُمۡۖ فَیُضِلُّ ٱللَّهُ مَن یَشَاۤءُ وَیَهۡدِی مَن یَشَاۤءُۚ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n"
    }
  },
  {
    "id": 1755,
    "surahId": 14,
    "ayahNumber": 5,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔایَـٰتِنَاۤ أَنۡ أَخۡرِجۡ قَوۡمَكَ مِنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ وَذَكِّرۡهُم بِأَیَّىٰمِ ٱللَّهِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّكُلِّ صَبَّارࣲ شَكُورࣲ\n",
    "translations": {
      "en": "And [thus], indeed, have We sent forth Moses with Our messages [and this Our command]: \"Lead thy people out of the depths of darkness into the light, and remind them of the Days of God!\" Verily, in this [reminder] there are messages indeed for all who are wholly patient in adversity and deeply grateful [to God].",
      "ms": "Dan sesungguhnya Kami telah mengutuskan Nabi Musa (pada masa yang lalu) dengan membawa mukjizat-mukjizat Kami sambil Kami berfirman: \"Hendaklah engkau mengeluarkan kaummu dari gelap-gelita kufur kepada cahaya iman; dan ingatkanlah mereka dengan Hari-hari Allah. \"Sesungguhnya yang demikian itu, mengandungi tanda-tanda yang menunjukkan kekuasaan Allah bagi tiap-tiap seorang yang kuat bersabar, lagi kuat bersyukur.",
      "id": "Dan sesungguhnya Kami telah mengutus Musa dengan membawa ayat-ayat Kami, (dan Kami perintahkan kepadanya): \"Keluarkanlah kaummu dari gelap gulita kepada cahaya terang benderang dan ingatkanlah mereka kepada hari-hari Allah\". Sesunguhnya pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi setiap orang penyabar dan banyak bersyukur.",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ بِـَٔایَـٰتِنَاۤ أَنۡ أَخۡرِجۡ قَوۡمَكَ مِنَ ٱلظُّلُمَـٰتِ إِلَى ٱلنُّورِ وَذَكِّرۡهُم بِأَیَّىٰمِ ٱللَّهِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّكُلِّ صَبَّارࣲ شَكُورࣲ\n"
    }
  },
  {
    "id": 1756,
    "surahId": 14,
    "ayahNumber": 6,
    "arabicText": "وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِ ٱذۡكُرُوا۟ نِعۡمَةَ ٱللَّهِ عَلَیۡكُمۡ إِذۡ أَنجَىٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ یَسُومُونَكُمۡ سُوۤءَ ٱلۡعَذَابِ وَیُذَبِّحُونَ أَبۡنَاۤءَكُمۡ وَیَسۡتَحۡیُونَ نِسَاۤءَكُمۡۚ وَفِی ذَ ٰ⁠لِكُم بَلَاۤءࣱ مِّن رَّبِّكُمۡ عَظِیمࣱ\n",
    "translations": {
      "en": "And, lo Moses spoke [thus] unto his people: \"Remember the blessings which God bestowed upon you when He saved you from Pharaoh's people who afflicted you with cruel suffering, and slaughtered your sons, and spared [only] your women -which was an awesome trial from your Sustainer.",
      "ms": "Dan (ingatlah) ketika Nabi Musa berkata kepada kaumnya: \"Kenanglah nikmat Allah kepada kamu, semasa Ia menyelamatkan kamu dari Firaun dan orang-orangnya yang sentiasa menyeksa kamu dengan berbagai seksa yang buruk dan mereka pula menyembelih anak-anak lelaki kamu dan membiarkan hidup anak-anak perempuan kamu; dan kejadian yang demikian itu mengandungi bala bencana dan cubaan yang besar dari Tuhan kamu\".",
      "id": "Dan (ingatlah), ketika Musa berkata kepada kaumnya: \"Ingatlah nikmat Allah atasmu ketika Dia menyelamatkan kamu dari (Fir'aun dan) pengikut-pengikutnya, mereka menyiksa kamu dengan siksa yang pedih, mereka menyembelih anak-anak laki-lakimu, membiarkan hidup anak-anak perempuanmu; dan pada yang demikian itu ada cobaan yang besar dari Tuhanmu\".",
      "ar": "وَإِذۡ قَالَ مُوسَىٰ لِقَوۡمِهِ ٱذۡكُرُوا۟ نِعۡمَةَ ٱللَّهِ عَلَیۡكُمۡ إِذۡ أَنجَىٰكُم مِّنۡ ءَالِ فِرۡعَوۡنَ یَسُومُونَكُمۡ سُوۤءَ ٱلۡعَذَابِ وَیُذَبِّحُونَ أَبۡنَاۤءَكُمۡ وَیَسۡتَحۡیُونَ نِسَاۤءَكُمۡۚ وَفِی ذَ ٰ⁠لِكُم بَلَاۤءࣱ مِّن رَّبِّكُمۡ عَظِیمࣱ\n"
    }
  },
  {
    "id": 1757,
    "surahId": 14,
    "ayahNumber": 7,
    "arabicText": "وَإِذۡ تَأَذَّنَ رَبُّكُمۡ لَىِٕن شَكَرۡتُمۡ لَأَزِیدَنَّكُمۡۖ وَلَىِٕن كَفَرۡتُمۡ إِنَّ عَذَابِی لَشَدِیدࣱ\n",
    "translations": {
      "en": "And [remember the time] when your Sustainer made [this promise] known: 'If you are grateful [to Me], I shall most certainly give you more and more; but if you are ungrateful, verily, My chastisement will be severe indeed!\"'",
      "ms": "Dan (ingatlah) ketika Tuhan kamu memberitahu: \"Demi sesungguhnya! Jika kamu bersyukur nescaya Aku akan tambahi nikmatKu kepada kamu, dan demi sesungguhnya, jika kamu kufur ingkar sesungguhnya azabKu amatlah keras\".",
      "id": "Dan (ingatlah juga), tatkala Tuhanmu memaklumkan; \"Sesungguhnya jika kamu bersyukur, pasti Kami akan menambah (nikmat) kepadamu, dan jika kamu mengingkari (nikmat-Ku), maka sesungguhnya azab-Ku sangat pedih\".",
      "ar": "وَإِذۡ تَأَذَّنَ رَبُّكُمۡ لَىِٕن شَكَرۡتُمۡ لَأَزِیدَنَّكُمۡۖ وَلَىِٕن كَفَرۡتُمۡ إِنَّ عَذَابِی لَشَدِیدࣱ\n"
    }
  },
  {
    "id": 1758,
    "surahId": 14,
    "ayahNumber": 8,
    "arabicText": "وَقَالَ مُوسَىٰۤ إِن تَكۡفُرُوۤا۟ أَنتُمۡ وَمَن فِی ٱلۡأَرۡضِ جَمِیعࣰا فَإِنَّ ٱللَّهَ لَغَنِیٌّ حَمِیدٌ\n",
    "translations": {
      "en": "And Moses added: \"If you should [ever] deny the truth-you and whoever else lives on earth, all of you-[know that,] verily, God is indeed self-sufficient, ever to be praised!\"",
      "ms": "Dan Nabi Musa berkata: \"Kalau kamu dan sesiapa jua yang ada di muka bumi seluruhnya berlaku kufur ingkar, maka (hal yang demikian tidak merugikan Allah), kerana sesungguhnya Allah adalah Maha Kaya, lagi Maha Terpuji.",
      "id": "Dan Musa berkata: \"Jika kamu dan orang-orang yang ada di muka bumi semuanya mengingkari (nikmat Allah) maka sesungguhnya Allah Maha Kaya lagi Maha Terpuji\".",
      "ar": "وَقَالَ مُوسَىٰۤ إِن تَكۡفُرُوۤا۟ أَنتُمۡ وَمَن فِی ٱلۡأَرۡضِ جَمِیعࣰا فَإِنَّ ٱللَّهَ لَغَنِیٌّ حَمِیدٌ\n"
    }
  },
  {
    "id": 1759,
    "surahId": 14,
    "ayahNumber": 9,
    "arabicText": "أَلَمۡ یَأۡتِكُمۡ نَبَؤُا۟ ٱلَّذِینَ مِن قَبۡلِكُمۡ قَوۡمِ نُوحࣲ وَعَادࣲ وَثَمُودَ وَٱلَّذِینَ مِنۢ بَعۡدِهِمۡ لَا یَعۡلَمُهُمۡ إِلَّا ٱللَّهُۚ جَاۤءَتۡهُمۡ رُسُلُهُم بِٱلۡبَیِّنَـٰتِ فَرَدُّوۤا۟ أَیۡدِیَهُمۡ فِیۤ أَفۡوَ ٰ⁠هِهِمۡ وَقَالُوۤا۟ إِنَّا كَفَرۡنَا بِمَاۤ أُرۡسِلۡتُم بِهِۦ وَإِنَّا لَفِی شَكࣲّ مِّمَّا تَدۡعُونَنَاۤ إِلَیۡهِ مُرِیبࣲ\n",
    "translations": {
      "en": "HAVE THE STORIES of those [deniers of the truth] who lived before you never yet come within your ken - [the stories of] the people of Noah, and of [the tribes of] `Ad and Thamud, and of those who came after them? None knows them [now] save God. There came unto them their apostles with all evidence of the truth -but they covered their mouths with their hands and answered: \"Behold, we refuse to regard as true the message with which you [claim to] have been entrusted; and, behold, we are in grave doubt, amounting to suspicion, about [the meaning of] your call to us!\"",
      "ms": "(Mengapa kamu masih berdegil) bukankah telah datang kepada kamu khabar berita orang-orang yang terdahulu daripada kamu, iaitu kaum Nabi Nuh, dan Aad juga Thamud serta orang-orang yang kemudian daripada mereka ? Tiada sesiapapun yang mengetahui bilangan mereka melainkan Allah. Mereka telah didatangi oleh rasul-rasul mereka dengan membawa keterangan-keterangan yang nyata, lalu mereka meletakkan tangan mereka ke mulut mereka sambil berkata: \"Sesungguhnya kami kufur ingkarkan apa yang - mengikut dakwaan kamu - kamu diutus membawanya, dan sesungguhnya kami adalah dalam keadaan yang meragukan terhadap iman dan tauhid yang kamu ajak kami kepadanya\".",
      "id": "Belumkah sampai kepadamu berita orang-orang sebelum kamu (yaitu) kaum Nuh, 'Ad, Tsamud dan orang-orang sesudah mereka. Tidak ada yang mengetahui mereka selain Allah. Telah datang rasul-rasul kepada mereka (membawa) bukti-bukti yang nyata lalu mereka menutupkan tangannya ke mulutnya (karena kebencian), dan berkata: \"Sesungguhnya kami mengingkari apa yang kamu disuruh menyampaikannya (kepada kami), dan sesungguhnya kami benar-benar dalam keragu-raguan yang menggelisahkan terhadap apa yang kamu ajak kami kepadanya\".",
      "ar": "أَلَمۡ یَأۡتِكُمۡ نَبَؤُا۟ ٱلَّذِینَ مِن قَبۡلِكُمۡ قَوۡمِ نُوحࣲ وَعَادࣲ وَثَمُودَ وَٱلَّذِینَ مِنۢ بَعۡدِهِمۡ لَا یَعۡلَمُهُمۡ إِلَّا ٱللَّهُۚ جَاۤءَتۡهُمۡ رُسُلُهُم بِٱلۡبَیِّنَـٰتِ فَرَدُّوۤا۟ أَیۡدِیَهُمۡ فِیۤ أَفۡوَ ٰ⁠هِهِمۡ وَقَالُوۤا۟ إِنَّا كَفَرۡنَا بِمَاۤ أُرۡسِلۡتُم بِهِۦ وَإِنَّا لَفِی شَكࣲّ مِّمَّا تَدۡعُونَنَاۤ إِلَیۡهِ مُرِیبࣲ\n"
    }
  },
  {
    "id": 1760,
    "surahId": 14,
    "ayahNumber": 10,
    "arabicText": "۞ قَالَتۡ رُسُلُهُمۡ أَفِی ٱللَّهِ شَكࣱّ فَاطِرِ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ یَدۡعُوكُمۡ لِیَغۡفِرَ لَكُم مِّن ذُنُوبِكُمۡ وَیُؤَخِّرَكُمۡ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّىۚ قَالُوۤا۟ إِنۡ أَنتُمۡ إِلَّا بَشَرࣱ مِّثۡلُنَا تُرِیدُونَ أَن تَصُدُّونَا عَمَّا كَانَ یَعۡبُدُ ءَابَاۤؤُنَا فَأۡتُونَا بِسُلۡطَـٰنࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "Said the apostles sent unto them: \"Can there be any doubt about [the existence and oneness of] God, the Originator of the heavens and the earth? It is He who calls unto you, so that He may forgive you [whatever is past] of your sins and grant you respite until a term [set by Him is fulfilled].\" [But] they replied: \"You are nothing but mortal men like ourselves! You want to turn us away from what our forefathers were wont to worship: well, then, bring us a clear proof [of your being God's message-bearers]!\"",
      "ms": "Rasul-rasul mereka bertanya: \"Patutkah berlakunya sebarang keraguan tentang wujudnya Allah, yang menciptakan langit dan bumi? Ia menyeru kamu beriman kerana hendak membersih dan melepaskan kamu dari dosa-dosa kamu, dan memberi tempoh kepada kamu hingga ke suatu masa yang tertentu. Mereka menjawab: \"Kamu tidak lain hanyalah manusia seperti kami. Kamu bertujuan hendak menyekat kami daripada menyembah apa yang telah disembah oleh datuk nenek kami. Oleh itu, bawalah kepada kami satu bukti yang jelas nyata\".",
      "id": "Berkata rasul-rasul mereka: \"Apakah ada keragu-raguan terhadap Allah, Pencipta langit dan bumi? Dia menyeru kamu untuk memberi ampunan kepadamu dari dosa-dosamu dan menangguhkan (siksaan)mu sampai masa yang ditentukan?\" Mereka berkata: \"Kamu tidak lain hanyalah manusia seperti kami juga. Kamu menghendaki untuk menghalang-halangi (membelokkan) kami dari apa yang selalu disembah nenek moyang kami, karena itu datangkanlah kepada kami, bukti yang nyata\".",
      "ar": "۞ قَالَتۡ رُسُلُهُمۡ أَفِی ٱللَّهِ شَكࣱّ فَاطِرِ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ یَدۡعُوكُمۡ لِیَغۡفِرَ لَكُم مِّن ذُنُوبِكُمۡ وَیُؤَخِّرَكُمۡ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّىۚ قَالُوۤا۟ إِنۡ أَنتُمۡ إِلَّا بَشَرࣱ مِّثۡلُنَا تُرِیدُونَ أَن تَصُدُّونَا عَمَّا كَانَ یَعۡبُدُ ءَابَاۤؤُنَا فَأۡتُونَا بِسُلۡطَـٰنࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 1761,
    "surahId": 14,
    "ayahNumber": 11,
    "arabicText": "قَالَتۡ لَهُمۡ رُسُلُهُمۡ إِن نَّحۡنُ إِلَّا بَشَرࣱ مِّثۡلُكُمۡ وَلَـٰكِنَّ ٱللَّهَ یَمُنُّ عَلَىٰ مَن یَشَاۤءُ مِنۡ عِبَادِهِۦۖ وَمَا كَانَ لَنَاۤ أَن نَّأۡتِیَكُم بِسُلۡطَـٰنٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡیَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ\n",
    "translations": {
      "en": "Their apostles answered them: \"True, we are nothing but mortal men like yourselves: but God bestows His favour upon whomever He wills of His servants. Withal, it is not within our power to bring you a proof [of our mission], unless it be by God's leave-and [so] it is in God that all believers must place their trust.",
      "ms": "Rasul-rasul mereka berkata kepada mereka: \"Kami ini tidak lain hanyalah manusia seperti kamu juga, tetapi Allah melimpahkan kurniaNya kepada sesiapa yang dikehendakiNya dari hamba-hambaNya; dan kami tiadalah berkuasa membawa kepada kamu sebarang bukti (mukjizat) melainkan dengan izin Allah. Dan dengan yang demikian maka kepada Allah jualah hendaknya orang-orang yang beriman berserah diri.",
      "id": "Rasul-rasul mereka berkata kepada mereka: \"Kami tidak lain hanyalah manusia seperti kamu, akan tetapi Allah memberi karunia kepada siapa yang Dia kehendaki di antara hamba-hamba-Nya. Dan tidak patut bagi kami mendatangkan suatu bukti kepada kamu melainkan dengan izin Allah. Dan hanya kepada Allah sajalah hendaknya orang-orang mukmin bertawakkal.",
      "ar": "قَالَتۡ لَهُمۡ رُسُلُهُمۡ إِن نَّحۡنُ إِلَّا بَشَرࣱ مِّثۡلُكُمۡ وَلَـٰكِنَّ ٱللَّهَ یَمُنُّ عَلَىٰ مَن یَشَاۤءُ مِنۡ عِبَادِهِۦۖ وَمَا كَانَ لَنَاۤ أَن نَّأۡتِیَكُم بِسُلۡطَـٰنٍ إِلَّا بِإِذۡنِ ٱللَّهِۚ وَعَلَى ٱللَّهِ فَلۡیَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 1762,
    "surahId": 14,
    "ayahNumber": 12,
    "arabicText": "وَمَا لَنَاۤ أَلَّا نَتَوَكَّلَ عَلَى ٱللَّهِ وَقَدۡ هَدَىٰنَا سُبُلَنَاۚ وَلَنَصۡبِرَنَّ عَلَىٰ مَاۤ ءَاذَیۡتُمُونَاۚ وَعَلَى ٱللَّهِ فَلۡیَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ\n",
    "translations": {
      "en": "And how could we not place our trust in God, seeing that it is He who has shown us the path which we are to follow? \"Hence, we shall certainly bear with patience whatever hurt you may do us: for, all who have trust [in His existence] must place their trust in God [alone]!\"",
      "ms": "\"Dan mengapa pula kami tidak berserah diri kepada Allah padahal Ia telah menunjukkan jalan untuk tiap-tiap seorang dari kami menjalaninya? Dan demi sesungguhnya, kami akan bersabar terhadap segala perbuatan kamu menyakiti kami. Dan dengan yang demikian, maka kepada Allah jualah hendaknya berserah diri orang-orang yang mahu berserah\".",
      "id": "Mengapa kami tidak akan bertawakkal kepada Allah padahal Dia telah menunjukkan jalan kepada kami, dan kami sungguh-sungguh akan bersabar terhadap gangguan-gangguan yang kamu lakukan kepada kami. Dan hanya kepada Allah saja orang-orang yang bertawakkal itu, berserah diri\".",
      "ar": "وَمَا لَنَاۤ أَلَّا نَتَوَكَّلَ عَلَى ٱللَّهِ وَقَدۡ هَدَىٰنَا سُبُلَنَاۚ وَلَنَصۡبِرَنَّ عَلَىٰ مَاۤ ءَاذَیۡتُمُونَاۚ وَعَلَى ٱللَّهِ فَلۡیَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ\n"
    }
  },
  {
    "id": 1763,
    "surahId": 14,
    "ayahNumber": 13,
    "arabicText": "وَقَالَ ٱلَّذِینَ كَفَرُوا۟ لِرُسُلِهِمۡ لَنُخۡرِجَنَّكُم مِّنۡ أَرۡضِنَاۤ أَوۡ لَتَعُودُنَّ فِی مِلَّتِنَاۖ فَأَوۡحَىٰۤ إِلَیۡهِمۡ رَبُّهُمۡ لَنُهۡلِكَنَّ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "But they who denied the truth spoke [thus] unto their apostles: \"We shall most certainly expel you from our land, unless you return forthwith to our ways. Whereupon their Sustainer revealed this to His apostles: \"Most certainly shall We destroy these evildoers,",
      "ms": "Dan berkatalah pula orang-orang yang kafir itu kepada Rasul-rasul mereka: \"Demi sesungguhnya, kami akan mengeluarkan kamu dari negeri kami atau kamu menjadi seugama dengan kami\". Lalu Tuhan wahyukan, kepada Rasul-rasulNya: \"Demi sesungguhnya! Kami akan membinasakan orang-orang yang zalim.",
      "id": "Orang-orang kafir berkata kepada Rasul-rasul mereka: \"Kami sungguh-sungguh akan mengusir kamu dari negeri kami atau kamu kembali kepada agama kami\". Maka Tuhan mewahyukan kepada mereka: \"Kami pasti akan membinasakan orang-orang yang zalim itu,",
      "ar": "وَقَالَ ٱلَّذِینَ كَفَرُوا۟ لِرُسُلِهِمۡ لَنُخۡرِجَنَّكُم مِّنۡ أَرۡضِنَاۤ أَوۡ لَتَعُودُنَّ فِی مِلَّتِنَاۖ فَأَوۡحَىٰۤ إِلَیۡهِمۡ رَبُّهُمۡ لَنُهۡلِكَنَّ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 1764,
    "surahId": 14,
    "ayahNumber": 14,
    "arabicText": "وَلَنُسۡكِنَنَّكُمُ ٱلۡأَرۡضَ مِنۢ بَعۡدِهِمۡۚ ذَ ٰ⁠لِكَ لِمَنۡ خَافَ مَقَامِی وَخَافَ وَعِیدِ\n",
    "translations": {
      "en": "and most certainly shall We cause you to dwell on earth [long] after they have passed away: this is [My promise] unto all who stand in awe of My presence, and stand in awe of My warning!\"",
      "ms": "\"Dan demi sesungguhnya! kami akan tempatkan kamu di negeri itu sesudah binasanya kaum yang zalim itu; balasan baik yang demikian, adalah bagi orang-orang yang takut akan sikap keadilanKu (menghitung amalnya), dan takut akan janji-janji azabKu\".",
      "id": "dan Kami pasti akan menempatkan kamu di negeri-negeri itu sesudah mereka. Yang demikian itu (adalah untuk) orang-orang yang takut (akan menghadap) kehadirat-Ku dan yang takut kepada ancaman-Ku\".",
      "ar": "وَلَنُسۡكِنَنَّكُمُ ٱلۡأَرۡضَ مِنۢ بَعۡدِهِمۡۚ ذَ ٰ⁠لِكَ لِمَنۡ خَافَ مَقَامِی وَخَافَ وَعِیدِ\n"
    }
  },
  {
    "id": 1765,
    "surahId": 14,
    "ayahNumber": 15,
    "arabicText": "وَٱسۡتَفۡتَحُوا۟ وَخَابَ كُلُّ جَبَّارٍ عَنِیدࣲ\n",
    "translations": {
      "en": "And they prayed [to God] that the truth be made to triumph. And [thus it is:] every arrogant enemy of the truth shall be undone [in the life to come],",
      "ms": "Dan (Rasul-rasul serta umatnya yang beriman) memohon pertolongan (kepada Allah, untuk mendapat kemenangan); dan terkecewalah tiap-tiap orang yang sombong takbur, lagi bersikap degil (dalam keingkarannya).",
      "id": "Dan mereka memohon kemenangan (atas musuh-musuh mereka) dan binasalah semua orang yang berlaku sewenang-wenang lagi keras kepala,",
      "ar": "وَٱسۡتَفۡتَحُوا۟ وَخَابَ كُلُّ جَبَّارٍ عَنِیدࣲ\n"
    }
  },
  {
    "id": 1766,
    "surahId": 14,
    "ayahNumber": 16,
    "arabicText": "مِّن وَرَاۤىِٕهِۦ جَهَنَّمُ وَیُسۡقَىٰ مِن مَّاۤءࣲ صَدِیدࣲ\n",
    "translations": {
      "en": "with hell awaiting him; and he shall be made to drink of the water of most bitter distress,",
      "ms": "Di belakangnya disediakan neraka Jahannam, dan ia akan diberi minum dari air danur (yang keluar dari tubuh ahli neraka).",
      "id": "di hadapannya ada Jahannam dan dia akan diberi minuman dengan air nanah,",
      "ar": "مِّن وَرَاۤىِٕهِۦ جَهَنَّمُ وَیُسۡقَىٰ مِن مَّاۤءࣲ صَدِیدࣲ\n"
    }
  },
  {
    "id": 1767,
    "surahId": 14,
    "ayahNumber": 17,
    "arabicText": "یَتَجَرَّعُهُۥ وَلَا یَكَادُ یُسِیغُهُۥ وَیَأۡتِیهِ ٱلۡمَوۡتُ مِن كُلِّ مَكَانࣲ وَمَا هُوَ بِمَیِّتࣲۖ وَمِن وَرَاۤىِٕهِۦ عَذَابٌ غَلِیظࣱ\n",
    "translations": {
      "en": "gulping it [unceasingly,] little by little, and yet hardly able to swallow it. And death will beset him from every quarter - but he shall not die: for [yet more] severe suffering lies ahead of him.",
      "ms": "Ia meminumnya dengan terpaksa dan hampir-hampir tidak dapat diterima oleh tekaknya (kerana busuknya), dan ia didatangi (penderitaan) maut dari segala arah, sedang ia tidak pula mati (supaya terlepas dari azab seksa itu); dan selain dari itu, ada lagi azab seksa yang lebih berat.",
      "id": "diminumnnya air nanah itu dan hampir dia tidak bisa menelannya dan datanglah (bahaya) maut kepadanya dari segenap penjuru, tetapi dia tidak juga mati, dan dihadapannya masih ada azab yang berat.",
      "ar": "یَتَجَرَّعُهُۥ وَلَا یَكَادُ یُسِیغُهُۥ وَیَأۡتِیهِ ٱلۡمَوۡتُ مِن كُلِّ مَكَانࣲ وَمَا هُوَ بِمَیِّتࣲۖ وَمِن وَرَاۤىِٕهِۦ عَذَابٌ غَلِیظࣱ\n"
    }
  },
  {
    "id": 1768,
    "surahId": 14,
    "ayahNumber": 18,
    "arabicText": "مَّثَلُ ٱلَّذِینَ كَفَرُوا۟ بِرَبِّهِمۡۖ أَعۡمَـٰلُهُمۡ كَرَمَادٍ ٱشۡتَدَّتۡ بِهِ ٱلرِّیحُ فِی یَوۡمٍ عَاصِفࣲۖ لَّا یَقۡدِرُونَ مِمَّا كَسَبُوا۟ عَلَىٰ شَیۡءࣲۚ ذَ ٰ⁠لِكَ هُوَ ٱلضَّلَـٰلُ ٱلۡبَعِیدُ\n",
    "translations": {
      "en": "[This, then, is] the parable of those who are bent on denying their Sustainer: all their works are as ashes which the wind blows about fiercely on a stormy day: [in the life to come,] they cannot achieve any benefit whatever from all [the good] that they may have wrought: for this [denial of God] is indeed the farthest one can go astray.",
      "ms": "Bandingan (segala kebaikan amal dan usaha) orang-orang yang kufur ingkar terhadap Tuhannya ialah seperti abu yang diterbangkan angin pada hari ribut yang kencang; mereka tidak memperoleh sesuatu faedah pun dari apa yang mereka telah usahakan itu. Sia-sianya amalan itu ialah kesan kesesatan yang jauh dari dasar kebenaran.",
      "id": "Orang-orang yang kafir kepada Tuhannya, amalan-amalan mereka adalah seperti abu yang ditiup angin dengan keras pada suatu hari yang berangin kencang. Mereka tidak dapat mengambil manfaat sedikitpun dari apa yang telah mereka usahakan (di dunia). Yang demikian itu adalah kesesatan yang jauh.",
      "ar": "مَّثَلُ ٱلَّذِینَ كَفَرُوا۟ بِرَبِّهِمۡۖ أَعۡمَـٰلُهُمۡ كَرَمَادٍ ٱشۡتَدَّتۡ بِهِ ٱلرِّیحُ فِی یَوۡمٍ عَاصِفࣲۖ لَّا یَقۡدِرُونَ مِمَّا كَسَبُوا۟ عَلَىٰ شَیۡءࣲۚ ذَ ٰ⁠لِكَ هُوَ ٱلضَّلَـٰلُ ٱلۡبَعِیدُ\n"
    }
  },
  {
    "id": 1769,
    "surahId": 14,
    "ayahNumber": 19,
    "arabicText": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ إِن یَشَأۡ یُذۡهِبۡكُمۡ وَیَأۡتِ بِخَلۡقࣲ جَدِیدࣲ\n",
    "translations": {
      "en": "ART THOU NOT aware that God has created the heavens and the earth in accordance with [an inner] truth? He can, if He so wills, do away with you and bring forth a new mankind [in your stead]:",
      "ms": "Tidakkah engkau telah nampak dan mengetahui bahawa Allah telah menciptakan langit dan bumi dengan cara yang sungguh layak dan berhikmat? Jika Ia kehendaki nescaya dibinasakanNya kamu (dengan sebab kekufuran kamu) dan didatangkan pula dengan makhluk-makhluk yang baharu.",
      "id": "Tidakkah kamu perhatikan, bahwa sesungguhnya Allah telah menciptakan langit dan bumi dengan hak? Jika Dia menghendaki, niscaya Dia membinasakan kamu dan mengganti(mu) dengan makhluk yang baru,",
      "ar": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ بِٱلۡحَقِّۚ إِن یَشَأۡ یُذۡهِبۡكُمۡ وَیَأۡتِ بِخَلۡقࣲ جَدِیدࣲ\n"
    }
  },
  {
    "id": 1770,
    "surahId": 14,
    "ayahNumber": 20,
    "arabicText": "وَمَا ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ بِعَزِیزࣲ\n",
    "translations": {
      "en": "nor is this difficult for God.",
      "ms": "Dan yang demikian itu tidaklah sukar bagi Allah melakukannya.",
      "id": "dan yang demikian itu sekali-kali tidak sukar bagi Allah.",
      "ar": "وَمَا ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ بِعَزِیزࣲ\n"
    }
  },
  {
    "id": 1771,
    "surahId": 14,
    "ayahNumber": 21,
    "arabicText": "وَبَرَزُوا۟ لِلَّهِ جَمِیعࣰا فَقَالَ ٱلضُّعَفَـٰۤؤُا۟ لِلَّذِینَ ٱسۡتَكۡبَرُوۤا۟ إِنَّا كُنَّا لَكُمۡ تَبَعࣰا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا مِنۡ عَذَابِ ٱللَّهِ مِن شَیۡءࣲۚ قَالُوا۟ لَوۡ هَدَىٰنَا ٱللَّهُ لَهَدَیۡنَـٰكُمۡۖ سَوَاۤءٌ عَلَیۡنَاۤ أَجَزِعۡنَاۤ أَمۡ صَبَرۡنَا مَا لَنَا مِن مَّحِیصࣲ\n",
    "translations": {
      "en": "And all [mankind] will appear before God [on the Day of Judgment]; and then the weak will say unto those who had gloried in their arrogance: \"Behold, We were but your followers: can you, then, relieve us of something of God's chastisement?\" [And the others] will answer: \"If God would but show us the way [to salvation], we would indeed guide you [towards it]. It is [now] all one, as far as we are concerned, whether we grieve impatiently or endure [our lot] with patience: there is no escape for us!\"",
      "ms": "Dan mereka sekalian tetap akan berhimpun mengadap Allah (untuk dihisab pada hari kiamat); kemudian orang-orang yang lemah (yang menjadi pengikut) kepada orang-orang yang sombong takbur itu akan berkata kepada mereka (yang menjadi pemimpinnya): \"Sesungguhnya kami telah menjadi pengikut kamu; maka adakah kamu dapat menolak daripada kami sedikit dari azab Allah? \" Mereka menjawab: \"Kalaulah Allah menunjukkan jalan selamat kepada kami, tentulah kami tunjukkan jalan itu kepada kamu. (Sekarang) sama sahaja kepada kita, sama ada kita menggelisah dan mengeluh atau kita bersabar, tiadalah sebarang jalan bagi kita untuk melepaskan diri (dari azab itu)\".",
      "id": "Dan mereka semuanya (di padang Mahsyar) akan berkumpul menghadap ke hadirat Allah, lalu berkatalah orang-orang yang lemah kepada orang-orang yang sombong: \"Sesungguhnya kami dahulu adalah pengikut-pengikutmu, maka dapatkah kamu menghindarkan daripada kami azab Allah (walaupun) sedikit saja? Mereka menjawab: \"Seandainya Allah memberi petunjuk kepada kami, niscaya kami dapat memberi petunjuk kepadamu. Sama saja bagi kita, apakah kita mengeluh ataukah bersabar. Sekali-kali kita tidak mempunyai tempat untuk melarikan diri\".",
      "ar": "وَبَرَزُوا۟ لِلَّهِ جَمِیعࣰا فَقَالَ ٱلضُّعَفَـٰۤؤُا۟ لِلَّذِینَ ٱسۡتَكۡبَرُوۤا۟ إِنَّا كُنَّا لَكُمۡ تَبَعࣰا فَهَلۡ أَنتُم مُّغۡنُونَ عَنَّا مِنۡ عَذَابِ ٱللَّهِ مِن شَیۡءࣲۚ قَالُوا۟ لَوۡ هَدَىٰنَا ٱللَّهُ لَهَدَیۡنَـٰكُمۡۖ سَوَاۤءٌ عَلَیۡنَاۤ أَجَزِعۡنَاۤ أَمۡ صَبَرۡنَا مَا لَنَا مِن مَّحِیصࣲ\n"
    }
  },
  {
    "id": 1772,
    "surahId": 14,
    "ayahNumber": 22,
    "arabicText": "وَقَالَ ٱلشَّیۡطَـٰنُ لَمَّا قُضِیَ ٱلۡأَمۡرُ إِنَّ ٱللَّهَ وَعَدَكُمۡ وَعۡدَ ٱلۡحَقِّ وَوَعَدتُّكُمۡ فَأَخۡلَفۡتُكُمۡۖ وَمَا كَانَ لِیَ عَلَیۡكُم مِّن سُلۡطَـٰنٍ إِلَّاۤ أَن دَعَوۡتُكُمۡ فَٱسۡتَجَبۡتُمۡ لِیۖ فَلَا تَلُومُونِی وَلُومُوۤا۟ أَنفُسَكُمۖ مَّاۤ أَنَا۠ بِمُصۡرِخِكُمۡ وَمَاۤ أَنتُم بِمُصۡرِخِیَّ إِنِّی كَفَرۡتُ بِمَاۤ أَشۡرَكۡتُمُونِ مِن قَبۡلُۗ إِنَّ ٱلظَّـٰلِمِینَ لَهُمۡ عَذَابٌ أَلِیمࣱ\n",
    "translations": {
      "en": "And when everything will have been decided, Satan will say: \"Behold, God promised you something that was bound to come true! I, too, held out [all manner of] promises to you -but I deceived you. Yet I had no power at all over you: I but called you-and you responded unto me. Hence, blame not me, but blame yourselves. It is not for me to respond to your cries, nor for you to respond to mine: for, behold, I have [always] refused to admit that there was any truth in your erstwhile belief that I had a share in God's divinity.\" Verily, for all evildoers there is grievous suffering in store.",
      "ms": "Dan berkatalah pula Syaitan setelah selesai perkara itu: \"Sesungguhnya Allah telah menjanjikan kamu dengan janji yang benar dan aku telah menjanjikan kamu lalu aku mungkiri janjiku itu kepada kamu; dan tiadalah bagiku sebarang alasan dan kuasa mempengaruhi kamu selain daripada aku telah mengajak kamu lalu kamu terburu-buru menurut ajakanku itu; maka janganlah kamu salahkan daku tetapi salahkan diri kamu sendiri. Aku tidak dapat menyelamatkan kamu dan kamu juga tidak dapat menyelamatkan daku. Sesungguhnya dari dahulu lagi aku telah kufur ingkarkan (perintah Tuhan) yang kamu sekutukan daku denganNya\". Sesungguhnya orang-orang yang zalim (yang meletakkan sesuatu pada bukan tempatnya) beroleh azab yang tidak terperi sakitnya.",
      "id": "Dan berkatalah syaitan tatkala perkara (hisab) telah diselesaikan: \"Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan akupun telah menjanjikan kepadamu tetapi aku menyalahinya. Sekali-kali tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku akan tetapi cercalah dirimu sendiri. Aku sekali-kali tidak dapat menolongmu dan kamupun sekali-kali tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu\". Sesungguhnya orang-orang yang zalim itu mendapat siksaan yang pedih.",
      "ar": "وَقَالَ ٱلشَّیۡطَـٰنُ لَمَّا قُضِیَ ٱلۡأَمۡرُ إِنَّ ٱللَّهَ وَعَدَكُمۡ وَعۡدَ ٱلۡحَقِّ وَوَعَدتُّكُمۡ فَأَخۡلَفۡتُكُمۡۖ وَمَا كَانَ لِیَ عَلَیۡكُم مِّن سُلۡطَـٰنٍ إِلَّاۤ أَن دَعَوۡتُكُمۡ فَٱسۡتَجَبۡتُمۡ لِیۖ فَلَا تَلُومُونِی وَلُومُوۤا۟ أَنفُسَكُمۖ مَّاۤ أَنَا۠ بِمُصۡرِخِكُمۡ وَمَاۤ أَنتُم بِمُصۡرِخِیَّ إِنِّی كَفَرۡتُ بِمَاۤ أَشۡرَكۡتُمُونِ مِن قَبۡلُۗ إِنَّ ٱلظَّـٰلِمِینَ لَهُمۡ عَذَابٌ أَلِیمࣱ\n"
    }
  },
  {
    "id": 1773,
    "surahId": 14,
    "ayahNumber": 23,
    "arabicText": "وَأُدۡخِلَ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَا بِإِذۡنِ رَبِّهِمۡۖ تَحِیَّتُهُمۡ فِیهَا سَلَـٰمٌ\n",
    "translations": {
      "en": "But those who shall have attained to faith and done righteous deeds will be brought into gardens through which running waters flow, therein to abide by their Sustainer's leave, and will be welcomed with the greeting, \"Peace!\"",
      "ms": "Dan dimasukkanlah orang-orang yang beriman dan beramal soleh, ke dalam Syurga-syurga yang mengalir di bawahnya beberapa sungai; mereka kekal di dalamnya dengan izin Tuhan mereka; ucapan selamat sentiasa mereka dapati (dari malaikat) di dalam Syurga-syurga itu.",
      "id": "Dan dimasukkanlah orang-orang yang beriman dan beramal saleh ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya dengan seizin Tuhan mereka. Ucapan penghormatan mereka dalam surga itu ialah \"salaam\".",
      "ar": "وَأُدۡخِلَ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَا بِإِذۡنِ رَبِّهِمۡۖ تَحِیَّتُهُمۡ فِیهَا سَلَـٰمٌ\n"
    }
  },
  {
    "id": 1774,
    "surahId": 14,
    "ayahNumber": 24,
    "arabicText": "أَلَمۡ تَرَ كَیۡفَ ضَرَبَ ٱللَّهُ مَثَلࣰا كَلِمَةࣰ طَیِّبَةࣰ كَشَجَرَةࣲ طَیِّبَةٍ أَصۡلُهَا ثَابِتࣱ وَفَرۡعُهَا فِی ٱلسَّمَاۤءِ\n",
    "translations": {
      "en": "ART THOU NOT aware how God sets forth the parable of a good word? [It is] like a good tree, firmly rooted, [reaching out] with its branches towards the sky,",
      "ms": "Tidakkah engkau melihat (wahai Muhammad) bagaimana Allah mengemukakan satu perbandingan, iaitu: kalimah yang baik adalah sebagai sebatang pohon yang baik, yang pangkalnya (akar tunjangnya) tetap teguh, dan cabang pucuknya menjulang ke langit.",
      "id": "Tidakkah kamu perhatikan bagaimana Allah telah membuat perumpamaan kalimat yang baik seperti pohon yang baik, akarnya teguh dan cabangnya (menjulang) ke langit,",
      "ar": "أَلَمۡ تَرَ كَیۡفَ ضَرَبَ ٱللَّهُ مَثَلࣰا كَلِمَةࣰ طَیِّبَةࣰ كَشَجَرَةࣲ طَیِّبَةٍ أَصۡلُهَا ثَابِتࣱ وَفَرۡعُهَا فِی ٱلسَّمَاۤءِ\n"
    }
  },
  {
    "id": 1775,
    "surahId": 14,
    "ayahNumber": 25,
    "arabicText": "تُؤۡتِیۤ أُكُلَهَا كُلَّ حِینِۭ بِإِذۡنِ رَبِّهَاۗ وَیَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ لِلنَّاسِ لَعَلَّهُمۡ یَتَذَكَّرُونَ\n",
    "translations": {
      "en": "yielding its fruit at all times by its Sustainer's leave. And [thus it is that] God propounds parables unto men,' so that they might bethink themselves [of the truth].",
      "ms": "Dia mengeluarkan buahnya pada tiap-tiap masa dengan izin Tuhannya. Dan Allah mengemukakan perbandingan-perbandingan itu untuk manusia, supaya mereka beringat (mendapat pelajaran).",
      "id": "pohon itu memberikan buahnya pada setiap musim dengan seizin Tuhannya. Allah membuat perumpamaan-perumpamaan itu untuk manusia supaya mereka selalu ingat.",
      "ar": "تُؤۡتِیۤ أُكُلَهَا كُلَّ حِینِۭ بِإِذۡنِ رَبِّهَاۗ وَیَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ لِلنَّاسِ لَعَلَّهُمۡ یَتَذَكَّرُونَ\n"
    }
  },
  {
    "id": 1776,
    "surahId": 14,
    "ayahNumber": 26,
    "arabicText": "وَمَثَلُ كَلِمَةٍ خَبِیثَةࣲ كَشَجَرَةٍ خَبِیثَةٍ ٱجۡتُثَّتۡ مِن فَوۡقِ ٱلۡأَرۡضِ مَا لَهَا مِن قَرَارࣲ\n",
    "translations": {
      "en": "And the parable of a corrupt word is that of a corrupt tree, torn up [from its roots] onto the face of the earth, wholly unable to endure.",
      "ms": "Dan bandingan Kalimah yang jahat dan buruk samalah seperti sebatang pohon yang tidak berguna yang mudah tercabut akar-akarnya dari muka bumi; tidak ada tapak baginya untuk tetap hidup.",
      "id": "Dan perumpamaan kalimat yang buruk seperti pohon yang buruk, yang telah dicabut dengan akar-akarnya dari permukaan bumi; tidak dapat tetap (tegak) sedikitpun.",
      "ar": "وَمَثَلُ كَلِمَةٍ خَبِیثَةࣲ كَشَجَرَةٍ خَبِیثَةٍ ٱجۡتُثَّتۡ مِن فَوۡقِ ٱلۡأَرۡضِ مَا لَهَا مِن قَرَارࣲ\n"
    }
  },
  {
    "id": 1777,
    "surahId": 14,
    "ayahNumber": 27,
    "arabicText": "یُثَبِّتُ ٱللَّهُ ٱلَّذِینَ ءَامَنُوا۟ بِٱلۡقَوۡلِ ٱلثَّابِتِ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَفِی ٱلۡـَٔاخِرَةِۖ وَیُضِلُّ ٱللَّهُ ٱلظَّـٰلِمِینَۚ وَیَفۡعَلُ ٱللَّهُ مَا یَشَاۤءُ\n",
    "translations": {
      "en": "[Thus,] God grants firmness unto those who have attained to faith through the word that is unshakably true in the life of this world as well as in the life to come; but the wrongdoers He lets go astray: for God does whatever He wills.",
      "ms": "Allah menetapkan (pendirian) orang-orang yang beriman dengan kalimah yang tetap teguh dalam kehidupan dunia dan akhirat; dan Allah menyesatkan orang-orang yang berlaku zalim (kepada diri mereka sendiri); dan Allah berkuasa melakukan apa yang dikehendakiNya.",
      "id": "Allah meneguhkan (iman) orang-orang yang beriman dengan ucapan yang teguh itu dalam kehidupan di dunia dan di akhirat; dan Allah menyesatkan orang-orang yang zalim dan memperbuat apa yang Dia kehendaki.",
      "ar": "یُثَبِّتُ ٱللَّهُ ٱلَّذِینَ ءَامَنُوا۟ بِٱلۡقَوۡلِ ٱلثَّابِتِ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَفِی ٱلۡـَٔاخِرَةِۖ وَیُضِلُّ ٱللَّهُ ٱلظَّـٰلِمِینَۚ وَیَفۡعَلُ ٱللَّهُ مَا یَشَاۤءُ\n"
    }
  },
  {
    "id": 1778,
    "surahId": 14,
    "ayahNumber": 28,
    "arabicText": "۞ أَلَمۡ تَرَ إِلَى ٱلَّذِینَ بَدَّلُوا۟ نِعۡمَتَ ٱللَّهِ كُفۡرࣰا وَأَحَلُّوا۟ قَوۡمَهُمۡ دَارَ ٱلۡبَوَارِ\n",
    "translations": {
      "en": "ART THOU NOT aware of those who have preferred a denial of the truth to God's blessings, and [thereby] invited their people to alight in that abode of utter desolation",
      "ms": "Tidakkah engkau melihat (dan merasa ajaib) terhadap orang-orang kafir yang telah menukar kesyukuran nikmat Allah dengan kekufuran, dan yang telah menempatkan kaum mereka dalam kebinasaan?",
      "id": "Tidakkah kamu perhatikan orang-orang yang telah menukar nikmat Allah dengan kekafiran dan menjatuhkan kaumnya ke lembah kebinasaan?,",
      "ar": "۞ أَلَمۡ تَرَ إِلَى ٱلَّذِینَ بَدَّلُوا۟ نِعۡمَتَ ٱللَّهِ كُفۡرࣰا وَأَحَلُّوا۟ قَوۡمَهُمۡ دَارَ ٱلۡبَوَارِ\n"
    }
  },
  {
    "id": 1779,
    "surahId": 14,
    "ayahNumber": 29,
    "arabicText": "جَهَنَّمَ یَصۡلَوۡنَهَاۖ وَبِئۡسَ ٱلۡقَرَارُ\n",
    "translations": {
      "en": "- hell - which they [themselves] will ' have to endure? And how vile a state to settle in!",
      "ms": "(Iaitu) neraka Jahannam yang mereka akan menderita bakarannya; dan (ingatlah), seburuk-buruk tempat tetap ialah neraka Jahannam.",
      "id": "yaitu neraka jahannam; mereka masuk kedalamnya; dan itulah seburuk-buruk tempat kediaman.",
      "ar": "جَهَنَّمَ یَصۡلَوۡنَهَاۖ وَبِئۡسَ ٱلۡقَرَارُ\n"
    }
  },
  {
    "id": 1780,
    "surahId": 14,
    "ayahNumber": 30,
    "arabicText": "وَجَعَلُوا۟ لِلَّهِ أَندَادࣰا لِّیُضِلُّوا۟ عَن سَبِیلِهِۦۗ قُلۡ تَمَتَّعُوا۟ فَإِنَّ مَصِیرَكُمۡ إِلَى ٱلنَّارِ\n",
    "translations": {
      "en": "For, they claimed that there are powers that could rival God, and so they strayed from His path. Say: \"Enjoy yourselves [in this world], but, verily, the fire will be your journey's end!\"",
      "ms": "Dan mereka mengadakan sekutu-sekutu bagi Allah untuk menyesatkan manusia dari jalanNya. Katakanlah (wahai Muhammad): \"Bersenang-senanglah kamu (bagi sementara di dunia), kerana sesungguhnya kesudahan kamu ke neraka\".",
      "id": "Orang-orang kafir itu telah menjadikan sekutu-sekutu bagi Allah supaya mereka menyesatkan (manusia) dari jalan-Nya. Katakanlah: \"Bersenang-senanglah kamu, karena sesungguhnya tempat kembalimu ialah neraka\".",
      "ar": "وَجَعَلُوا۟ لِلَّهِ أَندَادࣰا لِّیُضِلُّوا۟ عَن سَبِیلِهِۦۗ قُلۡ تَمَتَّعُوا۟ فَإِنَّ مَصِیرَكُمۡ إِلَى ٱلنَّارِ\n"
    }
  },
  {
    "id": 1781,
    "surahId": 14,
    "ayahNumber": 31,
    "arabicText": "قُل لِّعِبَادِیَ ٱلَّذِینَ ءَامَنُوا۟ یُقِیمُوا۟ ٱلصَّلَوٰةَ وَیُنفِقُوا۟ مِمَّا رَزَقۡنَـٰهُمۡ سِرࣰّا وَعَلَانِیَةࣰ مِّن قَبۡلِ أَن یَأۡتِیَ یَوۡمࣱ لَّا بَیۡعࣱ فِیهِ وَلَا خِلَـٰلٌ\n",
    "translations": {
      "en": "[And] tell [those of] My servants who have attained to faith that they should be constant in prayer and spend [in Our way], secretly and openly, out of what We provide for them as sustenance, ere there come a Day when there will be no bargaining, and no mutual befriending.",
      "ms": "Katakanlah kepada hamba-hambaKu yang beriman hendaklah mereka mendirikan sembahyang dan mendermakan dari apa yang kami kurniakan kepada mereka, sama ada dengan merahsiakan pemberiannya itu atau dengan terbuka; sebelum datangnya hari yang tidak ada jual beli padanya, dan tidak ada sahabat handai (yang dapat memberikan pertolongan).",
      "id": "Katakanlah kepada hamba-hamba-Ku yang telah beriman: \"Hendaklah mereka mendirikan shalat, menafkahkan sebahagian rezeki yang Kami berikan kepada mereka secara sembunyi ataupun terang-terangan sebelum datang hari (kiamat) yang pada bari itu tidak ada jual beli dan persahabatan.",
      "ar": "قُل لِّعِبَادِیَ ٱلَّذِینَ ءَامَنُوا۟ یُقِیمُوا۟ ٱلصَّلَوٰةَ وَیُنفِقُوا۟ مِمَّا رَزَقۡنَـٰهُمۡ سِرࣰّا وَعَلَانِیَةࣰ مِّن قَبۡلِ أَن یَأۡتِیَ یَوۡمࣱ لَّا بَیۡعࣱ فِیهِ وَلَا خِلَـٰلٌ\n"
    }
  },
  {
    "id": 1782,
    "surahId": 14,
    "ayahNumber": 32,
    "arabicText": "ٱللَّهُ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَأَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَخۡرَجَ بِهِۦ مِنَ ٱلثَّمَرَ ٰ⁠تِ رِزۡقࣰا لَّكُمۡۖ وَسَخَّرَ لَكُمُ ٱلۡفُلۡكَ لِتَجۡرِیَ فِی ٱلۡبَحۡرِ بِأَمۡرِهِۦۖ وَسَخَّرَ لَكُمُ ٱلۡأَنۡهَـٰرَ\n",
    "translations": {
      "en": "[And remember that] it is God who has created the heavens and the earth, and who sends down water from the sky and thereby brings forth [all manner] of fruits for your sustenance; and who has made ships subservient to. you, so that they may sail through the sea at His behest; and has made the rivers subservient [to His laws, so that they be of use] to you;",
      "ms": "Allah jualah yang menciptakan langit dan bumi, dan menurunkan hujan dari langit lalu mengeluarkan dengan air hujan itu buah-buahan untuk menjadi makanan bagi kamu; dan Ia yang memberi kemudahan kepada kamu menggunakan kapal-kapal untuk belayar di laut dengan perintahNya, juga yang memudahkan sungai-sungai untuk kamu (mengambil manfaat darinya).",
      "id": "Allah-lah yang telah menciptakan langit dan bumi dan menurunkan air hujan dari langit, kemudian Dia mengeluarkan dengan air hujan itu berbagai buah-buahan menjadi rezeki untukmu; dan Dia telah menundukkan bahtera bagimu supaya bahtera itu, berlayar di lautan dengan kehendak-Nya, dan Dia telah menundukkan (pula) bagimu sungai-sungai.",
      "ar": "ٱللَّهُ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَأَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَخۡرَجَ بِهِۦ مِنَ ٱلثَّمَرَ ٰ⁠تِ رِزۡقࣰا لَّكُمۡۖ وَسَخَّرَ لَكُمُ ٱلۡفُلۡكَ لِتَجۡرِیَ فِی ٱلۡبَحۡرِ بِأَمۡرِهِۦۖ وَسَخَّرَ لَكُمُ ٱلۡأَنۡهَـٰرَ\n"
    }
  },
  {
    "id": 1783,
    "surahId": 14,
    "ayahNumber": 33,
    "arabicText": "وَسَخَّرَ لَكُمُ ٱلشَّمۡسَ وَٱلۡقَمَرَ دَاۤىِٕبَیۡنِۖ وَسَخَّرَ لَكُمُ ٱلَّیۡلَ وَٱلنَّهَارَ\n",
    "translations": {
      "en": "and has made the sun and the moon, both of them constant upon their courses, subservient [to His laws, so that they be of use] to you; and has made the night and the day subservient [to His laws, so that they be of use] to you.",
      "ms": "Dan Ia juga yang menjadikan matahari dan bulan sentiasa beredar, untuk kepentingan kemudahan kamu, dan yang menjadikan malam dan siang bagi faedah hidup kamu.",
      "id": "Dan Dia telah menundukkan (pula) bagimu matahari dan bulan yang terus menerus beredar (dalam orbitnya); dan telah menundukkan bagimu malam dan siang.",
      "ar": "وَسَخَّرَ لَكُمُ ٱلشَّمۡسَ وَٱلۡقَمَرَ دَاۤىِٕبَیۡنِۖ وَسَخَّرَ لَكُمُ ٱلَّیۡلَ وَٱلنَّهَارَ\n"
    }
  },
  {
    "id": 1784,
    "surahId": 14,
    "ayahNumber": 34,
    "arabicText": "وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلۡتُمُوهُۚ وَإِن تَعُدُّوا۟ نِعۡمَتَ ٱللَّهِ لَا تُحۡصُوهَاۤۗ إِنَّ ٱلۡإِنسَـٰنَ لَظَلُومࣱ كَفَّارࣱ\n",
    "translations": {
      "en": "And [always] does He give you something out of what you may be asking of Him; and should you try to count God's blessings, you could never compute them. [And yet,] behold, man is indeed most persistent in wrongdoing, stubbornly ingrate!",
      "ms": "Dan Ia telah memberi kepada kamu sebahagian dari tiap-tiap apa jua yang kamu hajati. Dan jika kamu menghitung nikmat Allah nescaya lemahlah kamu menentukan bilangannya. Sesungguhnya manusia (yang ingkar) sangat suka menempatkan sesuatu pada bukan tempatnya lagi sangat tidak menghargai nikmat Tuhannya.",
      "id": "Dan Dia telah memberikan kepadamu (keperluanmu) dan segala apa yang kamu mohonkan kepadanya. Dan jika kamu menghitung nikmat Allah, tidaklah dapat kamu menghinggakannya. Sesungguhnya manusia itu, sangat zalim dan sangat mengingkari (nikmat Allah).",
      "ar": "وَءَاتَىٰكُم مِّن كُلِّ مَا سَأَلۡتُمُوهُۚ وَإِن تَعُدُّوا۟ نِعۡمَتَ ٱللَّهِ لَا تُحۡصُوهَاۤۗ إِنَّ ٱلۡإِنسَـٰنَ لَظَلُومࣱ كَفَّارࣱ\n"
    }
  },
  {
    "id": 1785,
    "surahId": 14,
    "ayahNumber": 35,
    "arabicText": "وَإِذۡ قَالَ إِبۡرَ ٰ⁠هِیمُ رَبِّ ٱجۡعَلۡ هَـٰذَا ٱلۡبَلَدَ ءَامِنࣰا وَٱجۡنُبۡنِی وَبَنِیَّ أَن نَّعۡبُدَ ٱلۡأَصۡنَامَ\n",
    "translations": {
      "en": "AND [remember the time] when Abraham spoke [thus]: \"O my Sustainer! Make this land secure, and preserve me and my children from ever worshipping idols -",
      "ms": "Dan (ingatlah) ketika Nabi Ibrahim berdoa dengan berkata: \"Wahai Tuhanku! jadikanlah negeri Makkah ini negeri yang aman, dan jauhkanlah daku dan anak-anakku dari perbuatan menyembah berhala.",
      "id": "Dan (ingatlah), ketika Ibrahim berkata: \"Ya Tuhanku, jadikanlah negeri ini (Mekah), negeri yang aman, dan jauhkanlah aku beserta anak cucuku daripada menyembah berhala-berhala.",
      "ar": "وَإِذۡ قَالَ إِبۡرَ ٰ⁠هِیمُ رَبِّ ٱجۡعَلۡ هَـٰذَا ٱلۡبَلَدَ ءَامِنࣰا وَٱجۡنُبۡنِی وَبَنِیَّ أَن نَّعۡبُدَ ٱلۡأَصۡنَامَ\n"
    }
  },
  {
    "id": 1786,
    "surahId": 14,
    "ayahNumber": 36,
    "arabicText": "رَبِّ إِنَّهُنَّ أَضۡلَلۡنَ كَثِیرࣰا مِّنَ ٱلنَّاسِۖ فَمَن تَبِعَنِی فَإِنَّهُۥ مِنِّیۖ وَمَنۡ عَصَانِی فَإِنَّكَ غَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "for, verily, O my Sustainer, these [false objects of worship] have led many people astray! \"Hence, [only] he who follows me [in this my faith] ~ is truly of me; and as for him who disobeys me - Thou art, verily, much-forgiving, a dispenser of grace!",
      "ms": "Wahai Tuhanku, berhala-berhala itu telah menyebabkan sesat banyak di antara umat manusia. Oleh itu, sesiapa yang menurutku (dalam Islam yang menjadi peganganku) maka ia adalah dari golonganku; dan sesiapa yang menderhaka kepadaku (dengan menyalahi ugamaku), maka sesungguhnya engkau Maha Pengampun, lagi Maha Mengasihani (kiranya ia insaf dan bertaubat).",
      "id": "Ya Tuhanku, sesungguhnya berhala-berhala itu telah menyesatkan kebanyakan daripada manusia, maka barangsiapa yang mengikutiku, maka sesungguhnya orang itu termasuk golonganku, dan barangsiapa yang mendurhakai aku, maka sesungguhnya Engkau, Maha Pengampun lagi Maha Penyayang.",
      "ar": "رَبِّ إِنَّهُنَّ أَضۡلَلۡنَ كَثِیرࣰا مِّنَ ٱلنَّاسِۖ فَمَن تَبِعَنِی فَإِنَّهُۥ مِنِّیۖ وَمَنۡ عَصَانِی فَإِنَّكَ غَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 1787,
    "surahId": 14,
    "ayahNumber": 37,
    "arabicText": "رَّبَّنَاۤ إِنِّیۤ أَسۡكَنتُ مِن ذُرِّیَّتِی بِوَادٍ غَیۡرِ ذِی زَرۡعٍ عِندَ بَیۡتِكَ ٱلۡمُحَرَّمِ رَبَّنَا لِیُقِیمُوا۟ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡـِٔدَةࣰ مِّنَ ٱلنَّاسِ تَهۡوِیۤ إِلَیۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَ ٰ⁠تِ لَعَلَّهُمۡ یَشۡكُرُونَ\n",
    "translations": {
      "en": "\"O our Sustainer! Behold, I have settled some of my offspring in a valley in which there is no arable land, close to Thy sanctified Temple, so that, O our Sustainer, they might devote themselves to prayer: cause Thou, therefore, people's hearts to incline towards them and grant them fruitful sustenance, so that they might have cause to be grateful.",
      "ms": "\"Wahai Tuhan kami! Sesungguhnya aku telah menempatkan sebahagian dari zuriat keturunanku di sebuah lembah (Tanah Suci Makkah) yang tidak tanaman padanya, di sisi rumahMu yang diharamkan mencerobohinya. Wahai Tuhan kami, (mereka ditempatkan di situ) supaya mereka mendirikan sembahyang (dan memakmurkannya dengan ibadat). Oleh itu, jadikanlah hati sebahagian dari manusia tertarik gemar kepada mereka, (supaya datang beramai-ramai ke situ), dan kurniakanlah rezeki kepada mereka dari berbagai jenis buah-buahan dan hasil tanaman, semoga mereka bersyukur.",
      "id": "Ya Tuhan kami, sesungguhnya aku telah menempatkan sebahagian keturunanku di lembah yang tidak mempunyai tanam-tanaman di dekat rumah Engkau (Baitullah) yang dihormati, ya Tuhan kami (yang demikian itu) agar mereka mendirikan shalat, maka jadikanlah hati sebagian manusia cenderung kepada mereka dan beri rezekilah mereka dari buah-buahan, mudah-mudahan mereka bersyukur.",
      "ar": "رَّبَّنَاۤ إِنِّیۤ أَسۡكَنتُ مِن ذُرِّیَّتِی بِوَادٍ غَیۡرِ ذِی زَرۡعٍ عِندَ بَیۡتِكَ ٱلۡمُحَرَّمِ رَبَّنَا لِیُقِیمُوا۟ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡـِٔدَةࣰ مِّنَ ٱلنَّاسِ تَهۡوِیۤ إِلَیۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَ ٰ⁠تِ لَعَلَّهُمۡ یَشۡكُرُونَ\n"
    }
  },
  {
    "id": 1788,
    "surahId": 14,
    "ayahNumber": 38,
    "arabicText": "رَبَّنَاۤ إِنَّكَ تَعۡلَمُ مَا نُخۡفِی وَمَا نُعۡلِنُۗ وَمَا یَخۡفَىٰ عَلَى ٱللَّهِ مِن شَیۡءࣲ فِی ٱلۡأَرۡضِ وَلَا فِی ٱلسَّمَاۤءِ\n",
    "translations": {
      "en": "\"O our Sustainer! Thou truly knowest all that we may hide [in our hearts] as well as all that we bring into the open:' for nothing whatever, be it on earth or in heaven, remains hidden from God.",
      "ms": "\"Wahai Tuhan kami! Sesungguhnya Engkau mengetahui akan apa yang kami sembunyikan dan apa yang kami zahirkan; dan tiada sesuatupun di langit dan di bumi, yang tersembunyi kepada Allah!",
      "id": "Ya Tuhan kami, sesungguhnya Engkau mengetahui apa yang kami sembunyikan dan apa yang kami lahirkan; dan tidak ada sesuatupun yang tersembunyi bagi Allah, baik yang ada di bumi maupun yang ada di langit.",
      "ar": "رَبَّنَاۤ إِنَّكَ تَعۡلَمُ مَا نُخۡفِی وَمَا نُعۡلِنُۗ وَمَا یَخۡفَىٰ عَلَى ٱللَّهِ مِن شَیۡءࣲ فِی ٱلۡأَرۡضِ وَلَا فِی ٱلسَّمَاۤءِ\n"
    }
  },
  {
    "id": 1789,
    "surahId": 14,
    "ayahNumber": 39,
    "arabicText": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِی وَهَبَ لِی عَلَى ٱلۡكِبَرِ إِسۡمَـٰعِیلَ وَإِسۡحَـٰقَۚ إِنَّ رَبِّی لَسَمِیعُ ٱلدُّعَاۤءِ\n",
    "translations": {
      "en": "\"All praise is due to God, who has bestowed upon me, in my old age, Ishmael and Isaac! Behold, my Sustainer hears indeed all prayer:",
      "ms": "\"Segala puji tertentu bagi Allah Yang telah mengurniakan kepadaku semasa aku tua: Ismail dan Ishak. Sesungguhnya Tuhanku Maha Mendengar dan Memperkenan doa permohonan.",
      "id": "Segala puji bagi Allah yang telah menganugerahkan kepadaku di hari tua(ku) Ismail dan Ishaq. Sesungguhnya Tuhanku, benar-benar Maha Mendengar (memperkenankan) doa.",
      "ar": "ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِی وَهَبَ لِی عَلَى ٱلۡكِبَرِ إِسۡمَـٰعِیلَ وَإِسۡحَـٰقَۚ إِنَّ رَبِّی لَسَمِیعُ ٱلدُّعَاۤءِ\n"
    }
  },
  {
    "id": 1790,
    "surahId": 14,
    "ayahNumber": 40,
    "arabicText": "رَبِّ ٱجۡعَلۡنِی مُقِیمَ ٱلصَّلَوٰةِ وَمِن ذُرِّیَّتِیۚ رَبَّنَا وَتَقَبَّلۡ دُعَاۤءِ\n",
    "translations": {
      "en": "[hence,] O my Sustainer, cause me and [some] of my offspring to remain constant in prayer! \"And, O our Sustainer, accept this my prayer:",
      "ms": "\"Wahai Tuhanku! Jadikanlah daku orang yang mendirikan sembahyang dan demikianlah juga zuriat keturunanku. Wahai Tuhan kami, perkenankanlah doa permohonanku.",
      "id": "Ya Tuhanku, jadikanlah aku dan anak cucuku orang-orang yang tetap mendirikan shalat, ya Tuhan kami, perkenankanlah doaku.",
      "ar": "رَبِّ ٱجۡعَلۡنِی مُقِیمَ ٱلصَّلَوٰةِ وَمِن ذُرِّیَّتِیۚ رَبَّنَا وَتَقَبَّلۡ دُعَاۤءِ\n"
    }
  },
  {
    "id": 1791,
    "surahId": 14,
    "ayahNumber": 41,
    "arabicText": "رَبَّنَا ٱغۡفِرۡ لِی وَلِوَ ٰ⁠لِدَیَّ وَلِلۡمُؤۡمِنِینَ یَوۡمَ یَقُومُ ٱلۡحِسَابُ\n",
    "translations": {
      "en": "Grant Thy forgiveness unto me, and my parents, and all the believers, on the Day on which the [last] reckoning will come to pass!\"",
      "ms": "\"Wahai Tuhan kami! Berilah ampun bagiku dan bagi kedua ibu bapaku serta bagi orang-orang yang beriman, pada masa berlakunya hitungan amal dan pembalasan\"",
      "id": "Ya Tuhan kami, beri ampunlah aku dan kedua ibu bapaku dan sekalian orang-orang mukmin pada hari terjadinya hisab (hari kiamat)\".",
      "ar": "رَبَّنَا ٱغۡفِرۡ لِی وَلِوَ ٰ⁠لِدَیَّ وَلِلۡمُؤۡمِنِینَ یَوۡمَ یَقُومُ ٱلۡحِسَابُ\n"
    }
  },
  {
    "id": 1792,
    "surahId": 14,
    "ayahNumber": 42,
    "arabicText": "وَلَا تَحۡسَبَنَّ ٱللَّهَ غَـٰفِلًا عَمَّا یَعۡمَلُ ٱلظَّـٰلِمُونَۚ إِنَّمَا یُؤَخِّرُهُمۡ لِیَوۡمࣲ تَشۡخَصُ فِیهِ ٱلۡأَبۡصَـٰرُ\n",
    "translations": {
      "en": "AND DO NOT think that God is unaware of what the evildoers are doing: He but grants them respite until the Day when their eyes will stare in horror,",
      "ms": "Dan janganlah engkau (wahai Muhammad) menyangka Allah lalai akan apa yang dilakukan oleh orang-orang yang zalim; sesungguhnya Ia hanya melambatkan balasan mereka hingga ke suatu hari yang padanya terbeliak kaku pemandangan mereka, (kerana gerun gementar melihat keadaan yang berlaku).",
      "id": "Dan janganlah sekali-kali kamu (Muhammad) mengira, bahwa Allah lalai dari apa yang diperbuat oleh orang-orang yang zalim. Sesungguhnya Allah memberi tangguh kepada mereka sampai hari yang pada waktu itu mata (mereka) terbelalak,",
      "ar": "وَلَا تَحۡسَبَنَّ ٱللَّهَ غَـٰفِلًا عَمَّا یَعۡمَلُ ٱلظَّـٰلِمُونَۚ إِنَّمَا یُؤَخِّرُهُمۡ لِیَوۡمࣲ تَشۡخَصُ فِیهِ ٱلۡأَبۡصَـٰرُ\n"
    }
  },
  {
    "id": 1793,
    "surahId": 14,
    "ayahNumber": 43,
    "arabicText": "مُهۡطِعِینَ مُقۡنِعِی رُءُوسِهِمۡ لَا یَرۡتَدُّ إِلَیۡهِمۡ طَرۡفُهُمۡۖ وَأَفۡـِٔدَتُهُمۡ هَوَاۤءࣱ\n",
    "translations": {
      "en": "the while they will be running confusedly to and fro, with their heads upraised [in supplication], unable to look away from what they shall behold, and their hearts an abysmal void.",
      "ms": "(Dalam pada itu) mereka terburu-buru (menyahut panggilan ke padang Mahsyar) sambil mendongakkan kepala mereka dengan mata tidak berkelip, dan hati mereka tidak bersemangat (kerana bingung dan cemas).",
      "id": "mereka datang bergegas-gegas memenuhi panggilan dengan mangangkat kepalanya, sedang mata mereka tidak berkedip-kedip dan hati mereka kosong.",
      "ar": "مُهۡطِعِینَ مُقۡنِعِی رُءُوسِهِمۡ لَا یَرۡتَدُّ إِلَیۡهِمۡ طَرۡفُهُمۡۖ وَأَفۡـِٔدَتُهُمۡ هَوَاۤءࣱ\n"
    }
  },
  {
    "id": 1794,
    "surahId": 14,
    "ayahNumber": 44,
    "arabicText": "وَأَنذِرِ ٱلنَّاسَ یَوۡمَ یَأۡتِیهِمُ ٱلۡعَذَابُ فَیَقُولُ ٱلَّذِینَ ظَلَمُوا۟ رَبَّنَاۤ أَخِّرۡنَاۤ إِلَىٰۤ أَجَلࣲ قَرِیبࣲ نُّجِبۡ دَعۡوَتَكَ وَنَتَّبِعِ ٱلرُّسُلَۗ أَوَلَمۡ تَكُونُوۤا۟ أَقۡسَمۡتُم مِّن قَبۡلُ مَا لَكُم مِّن زَوَالࣲ\n",
    "translations": {
      "en": "Hence, warn men of the Day when this suffering may befall them, and when those who did wrong [in their lifetime] will exclaim: \"O our Sustainer! Grant us respite for a short while, so that we might respond to Thy call and follow the apostles!\" [But God will answer:] \"Why - were you not aforetime wont to swear that no kind of resurrection and retribution awaited you?",
      "ms": "Dan berilah amaran (wahai Muhammad) kepada manusia yang ingkar itu jangan mereka lupakan hari kiamat yang padanya mereka akan didatangi azab, kerana pada saat itu, orang-orang yang berlaku zalim akan merayu dengan berkata: \"Wahai Tuhan kami, (kembalikanlah kami ke dunia dan) berilah tempoh kepada kami hingga ke suatu masa yang dekat, supaya kami menyahut seruanMu (untuk mengesakanMu dan mentaati perintahMu), dan supaya kami menurut ugama yang disampaikan oleh Rasul-rasul itu\". Dan (rayuan mereka akan ditolak dengan dikatakan kepada mereka): \"Tidakkah kamu telah diberikan tempoh untuk berbuat demikian, dan bukankah kamu telah bersumpah (semasa kamu dalam dunia) dahulu, bahawa keadaan kamu tidak akan mengalami sebarang perubahan?",
      "id": "Dan berikanlah peringatan kepada manusia terhadap hari (yang pada waktu itu) datang azab kepada mereka, maka berkatalah orang-orang yang zalim: \"Ya Tuhan kami, beri tangguhlah kami (kembalikanlah kami ke dunia) walaupun dalam waktu yang sedikit, niscaya kami akan mematuhi seruan Engkau dan akan mengikuti rasul-rasul\". (Kepada mereka dikatakan): \"Bukankah kamu telah bersumpah dahulu (di dunia) bahwa sekali-kali kamu tidak akan binasa?",
      "ar": "وَأَنذِرِ ٱلنَّاسَ یَوۡمَ یَأۡتِیهِمُ ٱلۡعَذَابُ فَیَقُولُ ٱلَّذِینَ ظَلَمُوا۟ رَبَّنَاۤ أَخِّرۡنَاۤ إِلَىٰۤ أَجَلࣲ قَرِیبࣲ نُّجِبۡ دَعۡوَتَكَ وَنَتَّبِعِ ٱلرُّسُلَۗ أَوَلَمۡ تَكُونُوۤا۟ أَقۡسَمۡتُم مِّن قَبۡلُ مَا لَكُم مِّن زَوَالࣲ\n"
    }
  },
  {
    "id": 1795,
    "surahId": 14,
    "ayahNumber": 45,
    "arabicText": "وَسَكَنتُمۡ فِی مَسَـٰكِنِ ٱلَّذِینَ ظَلَمُوۤا۟ أَنفُسَهُمۡ وَتَبَیَّنَ لَكُمۡ كَیۡفَ فَعَلۡنَا بِهِمۡ وَضَرَبۡنَا لَكُمُ ٱلۡأَمۡثَالَ\n",
    "translations": {
      "en": "And yet, you dwelt in the dwelling-places of those who had sinned against their own selves [before your time], and it was made obvious to you how We had dealt with them: for We have set forth unto you many a parable [of sin, resurrection and divine retribution].\"",
      "ms": "\"Padahal kamu telah mendiami tempat-tempat tinggal orang-orang yang berlaku zalim kepada diri mereka sendiri, serta telah ternyata kepada kamu dengan bukti-buKti yang jelas bagaimana Kami telah mengubah keadaan mereka (dengan menimpakan mereka berbagai bencana), dan Kami pula telah nyatakan kepada kamu berbagai contoh perbandingan (di dalam Al-Quran dan melalui sabda Rasul)\".",
      "id": "dan kamu telah berdiam di tempat-tempat kediaman orang-orang yang menganiaya diri mereka sendiri, dan telah nyata bagimu bagaimana Kami telah berbuat terhadap mereka dan telah Kami berikan kepadamu beberapa perumpamaan\".",
      "ar": "وَسَكَنتُمۡ فِی مَسَـٰكِنِ ٱلَّذِینَ ظَلَمُوۤا۟ أَنفُسَهُمۡ وَتَبَیَّنَ لَكُمۡ كَیۡفَ فَعَلۡنَا بِهِمۡ وَضَرَبۡنَا لَكُمُ ٱلۡأَمۡثَالَ\n"
    }
  },
  {
    "id": 1796,
    "surahId": 14,
    "ayahNumber": 46,
    "arabicText": "وَقَدۡ مَكَرُوا۟ مَكۡرَهُمۡ وَعِندَ ٱللَّهِ مَكۡرُهُمۡ وَإِن كَانَ مَكۡرُهُمۡ لِتَزُولَ مِنۡهُ ٱلۡجِبَالُ\n",
    "translations": {
      "en": "And [this retribution will befall all evildoers because] they devise that false imagery of theirs - and all their false imagery is within God's knowledge. [And never can the blasphemers prevail against the truth - not] even if their false imagery were so (well devised and so powerful] that mountains could be moved thereby.",
      "ms": "Dan sesungguhnya mereka telah menjalankan rancangan jahat mereka (untuk menentang Islam), sedang di sisi Allah ada balasan bagi rancangan jahat mereka, walau rancangan jahat mereka itu, dapat melenyapkan gunung-ganang sekalipun.",
      "id": "Dan sesungguhnya mereka telah membuat makar yang besar padahal di sisi Allah-lah (balasan) makar mereka itu. Dan sesungguhnya makar mereka itu (amat besar) sehingga gunung-gunung dapat lenyap karenanya.",
      "ar": "وَقَدۡ مَكَرُوا۟ مَكۡرَهُمۡ وَعِندَ ٱللَّهِ مَكۡرُهُمۡ وَإِن كَانَ مَكۡرُهُمۡ لِتَزُولَ مِنۡهُ ٱلۡجِبَالُ\n"
    }
  },
  {
    "id": 1797,
    "surahId": 14,
    "ayahNumber": 47,
    "arabicText": "فَلَا تَحۡسَبَنَّ ٱللَّهَ مُخۡلِفَ وَعۡدِهِۦ رُسُلَهُۥۤۚ إِنَّ ٱللَّهَ عَزِیزࣱ ذُو ٱنتِقَامࣲ\n",
    "translations": {
      "en": "HENCE, do not think that God will fail to fulfil the promise which He gave to His apostles: verily, God is almighty, an avenger of evil!",
      "ms": "Oleh itu, janganlah engkau menyangka Allah memungkiri janjiNya kepada Rasul-rasulNya; sesungguhnya Allah Maha Kuasa, lagi Sedia Membalas (orang-orang yang menderhaka kepadaNya).",
      "id": "Karena itu janganlah sekali-kali kamu mengira Allah akan menyalahi janji-Nya kepada rasul-raaul-Nya; sesungguhnya Allah Maha Perkasa, lagi mempunyai pembalasan.",
      "ar": "فَلَا تَحۡسَبَنَّ ٱللَّهَ مُخۡلِفَ وَعۡدِهِۦ رُسُلَهُۥۤۚ إِنَّ ٱللَّهَ عَزِیزࣱ ذُو ٱنتِقَامࣲ\n"
    }
  },
  {
    "id": 1798,
    "surahId": 14,
    "ayahNumber": 48,
    "arabicText": "یَوۡمَ تُبَدَّلُ ٱلۡأَرۡضُ غَیۡرَ ٱلۡأَرۡضِ وَٱلسَّمَـٰوَ ٰ⁠تُۖ وَبَرَزُوا۟ لِلَّهِ ٱلۡوَ ٰ⁠حِدِ ٱلۡقَهَّارِ\n",
    "translations": {
      "en": "[His promise will be fulfilled] on the Day when the earth shall be changed into another earth, as shall be the heavens and when [all men] shall appear before God, the One who holds absolute sway over all that exists.",
      "ms": "(Ingatlah) masa hari bumi ini diganti dengan yang lain, demikian juga langit; dan manusia semuanya keluar berhimpun mengadap Allah, Yang Maha Esa, lagi Maha Kuasa.",
      "id": "(Yaitu) pada hari (ketika) bumi diganti dengan bumi yang lain dan (demikian pula) langit, dan meraka semuanya (di padang Mahsyar) berkumpul menghadap ke hadirat Allah yang Maha Esa lagi Maha Perkasa.",
      "ar": "یَوۡمَ تُبَدَّلُ ٱلۡأَرۡضُ غَیۡرَ ٱلۡأَرۡضِ وَٱلسَّمَـٰوَ ٰ⁠تُۖ وَبَرَزُوا۟ لِلَّهِ ٱلۡوَ ٰ⁠حِدِ ٱلۡقَهَّارِ\n"
    }
  },
  {
    "id": 1799,
    "surahId": 14,
    "ayahNumber": 49,
    "arabicText": "وَتَرَى ٱلۡمُجۡرِمِینَ یَوۡمَىِٕذࣲ مُّقَرَّنِینَ فِی ٱلۡأَصۡفَادِ\n",
    "translations": {
      "en": "For on that Day thou wilt see all who were lost in sin linked together in fetters,",
      "ms": "Dan engkau akan melihat orang-orang yang berdosa pada ketika itu diberkas dengan belenggu.",
      "id": "Dan kamu akan melihat orang-orang yang berdosa pada hari itu diikat bersama-sama dengan belenggu.",
      "ar": "وَتَرَى ٱلۡمُجۡرِمِینَ یَوۡمَىِٕذࣲ مُّقَرَّنِینَ فِی ٱلۡأَصۡفَادِ\n"
    }
  },
  {
    "id": 1800,
    "surahId": 14,
    "ayahNumber": 50,
    "arabicText": "سَرَابِیلُهُم مِّن قَطِرَانࣲ وَتَغۡشَىٰ وُجُوهَهُمُ ٱلنَّارُ\n",
    "translations": {
      "en": "clothed in garments of black pitch, with fire veiling their faces.",
      "ms": "Pakaian mereka dari belangkin (minyak tar), dan muka (serta seluruh badan) mereka diliputi oleh jilatan api neraka.",
      "id": "Pakaian mereka adalah dari pelangkin (ter) dan muka mereka ditutup oleh api neraka,",
      "ar": "سَرَابِیلُهُم مِّن قَطِرَانࣲ وَتَغۡشَىٰ وُجُوهَهُمُ ٱلنَّارُ\n"
    }
  },
  {
    "id": 1801,
    "surahId": 14,
    "ayahNumber": 51,
    "arabicText": "لِیَجۡزِیَ ٱللَّهُ كُلَّ نَفۡسࣲ مَّا كَسَبَتۡۚ إِنَّ ٱللَّهَ سَرِیعُ ٱلۡحِسَابِ\n",
    "translations": {
      "en": "[And all shall be judged on that Day,] so that God may requite every human being for all that he has earned [in life]: verily, God is swift in reckoning!",
      "ms": "(Keluarnya manusia dari kubur masing-masing itu ialah) kerana Allah akan membalas tiap-tiap seorang apa yang ia telah usahakan; sesungguhnya Allah amat cepat hitungan hisabNya.",
      "id": "agar Allah memberi pembalasan kepada tiap-tiap orang terhadap apa yang ia usahakan. Sesungguhnya Allah Maha cepat hisab-Nya.",
      "ar": "لِیَجۡزِیَ ٱللَّهُ كُلَّ نَفۡسࣲ مَّا كَسَبَتۡۚ إِنَّ ٱللَّهَ سَرِیعُ ٱلۡحِسَابِ\n"
    }
  },
  {
    "id": 1802,
    "surahId": 14,
    "ayahNumber": 52,
    "arabicText": "هَـٰذَا بَلَـٰغࣱ لِّلنَّاسِ وَلِیُنذَرُوا۟ بِهِۦ وَلِیَعۡلَمُوۤا۟ أَنَّمَا هُوَ إِلَـٰهࣱ وَ ٰ⁠حِدࣱ وَلِیَذَّكَّرَ أُو۟لُوا۟ ٱلۡأَلۡبَـٰبِ\n",
    "translations": {
      "en": "THIS IS A MESSAGE unto all mankind. Hence, let them be warned thereby, and let them know that He is the One and Only God; and let those who are endowed with insight take this to heart!",
      "ms": "(Al-Quran) ini disampaikan kepada manusia supaya mereka diberi ingat dan diberi nasihat dengannya; dan supaya mereka mengetahui (dengan hujjah-hujjah yang tersebut di dalamnya) bahawa sesungguhnya Allah ialah Tuhan Yang Maha Esa; dan supaya orang-orang yang mempunyai fikiran, beringat dan insaf.",
      "id": "(Al Quran) ini adalah penjelasan yang sempurna bagi manusia, dan supaya mereka diberi peringatan dengan-Nya, dan supaya mereka mengetahui bahwasanya Dia adalah Tuhan Yang Maha Esa dan agar orang-orang yang berakal mengambil pelajaran.",
      "ar": "هَـٰذَا بَلَـٰغࣱ لِّلنَّاسِ وَلِیُنذَرُوا۟ بِهِۦ وَلِیَعۡلَمُوۤا۟ أَنَّمَا هُوَ إِلَـٰهࣱ وَ ٰ⁠حِدࣱ وَلِیَذَّكَّرَ أُو۟لُوا۟ ٱلۡأَلۡبَـٰبِ\n"
    }
  }
]