[
  {
    "id": 494,
    "surahId": 4,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ یَـٰۤأَیُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمُ ٱلَّذِی خَلَقَكُم مِّن نَّفۡسࣲ وَ ٰ⁠حِدَةࣲ وَخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالࣰا كَثِیرࣰا وَنِسَاۤءࣰۚ وَٱتَّقُوا۟ ٱللَّهَ ٱلَّذِی تَسَاۤءَلُونَ بِهِۦ وَٱلۡأَرۡحَامَۚ إِنَّ ٱللَّهَ كَانَ عَلَیۡكُمۡ رَقِیبࣰا\n",
    "translations": {
      "en": "O MANKIND! Be conscious of your Sustainer, who has created you out of one living entity, and out of it created its mate, and out of the two spread abroad a multitude of men and women. And remain conscious of God, in whose name you demand [your rights] from one another, and of these ties of kinship. Verily, God is ever watchful over you!",
      "ms": "Wahai sekalian manusia! Bertaqwalah kepada Tuhan kamu yang telah menjadikan kamu (bermula) dari diri yang satu (Adam), dan yang menjadikan daripada (Adam) itu pasangannya (isterinya - Hawa), dan juga yang membiakkan dari keduanya - zuriat keturunan - lelaki dan perempuan yang ramai. Dan bertaqwalah kepada Allah yang kamu selalu meminta dengan menyebut-yebut namaNya, serta peliharalah hubungan (silaturrahim) kaum kerabat; kerana sesungguhnya Allah sentiasa memerhati (mengawas) kamu.",
      "id": "Hai sekalian manusia, bertakwalah kepada Tuhan-mu yang telah menciptakan kamu dari seorang diri, dan dari padanya Allah menciptakan isterinya; dan dari pada keduanya Allah memperkembang biakkan laki-laki dan perempuan yang banyak. Dan bertakwalah kepada Allah yang dengan (mempergunakan) nama-Nya kamu saling meminta satu sama lain, dan (peliharalah) hubungan silaturrahim. Sesungguhnya Allah selalu menjaga dan mengawasi kamu.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ یَـٰۤأَیُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمُ ٱلَّذِی خَلَقَكُم مِّن نَّفۡسࣲ وَ ٰ⁠حِدَةࣲ وَخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالࣰا كَثِیرࣰا وَنِسَاۤءࣰۚ وَٱتَّقُوا۟ ٱللَّهَ ٱلَّذِی تَسَاۤءَلُونَ بِهِۦ وَٱلۡأَرۡحَامَۚ إِنَّ ٱللَّهَ كَانَ عَلَیۡكُمۡ رَقِیبࣰا\n"
    }
  },
  {
    "id": 495,
    "surahId": 4,
    "ayahNumber": 2,
    "arabicText": "وَءَاتُوا۟ ٱلۡیَتَـٰمَىٰۤ أَمۡوَ ٰ⁠لَهُمۡۖ وَلَا تَتَبَدَّلُوا۟ ٱلۡخَبِیثَ بِٱلطَّیِّبِۖ وَلَا تَأۡكُلُوۤا۟ أَمۡوَ ٰ⁠لَهُمۡ إِلَىٰۤ أَمۡوَ ٰ⁠لِكُمۡۚ إِنَّهُۥ كَانَ حُوبࣰا كَبِیرࣰا\n",
    "translations": {
      "en": "Hence, render unto the orphans their posses­sions, and do not substitute bad things [of your own] for the good things [that belong to them], and do not consume their possessions together with your own: this, verily, is a great crime.",
      "ms": "Dan berikanlah kepada anak-anak yatim (yang telah baligh) itu harta mereka, dan janganlah kamu tukar-gantikan yang baik dengan yang buruk; dan janganlah kamu makan harta mereka (dengan menghimpunkannya) dengan harta kamu; kerana sesungguhnya (yang demikian) itu adalah dosa yang besar.",
      "id": "Dan berikanlah kepada anak-anak yatim (yang sudah balig) harta mereka, jangan kamu menukar yang baik dengan yang buruk dan jangan kamu makan harta mereka bersama hartamu. Sesungguhnya tindakan-tindakan (menukar dan memakan) itu, adalah dosa yang besar.",
      "ar": "وَءَاتُوا۟ ٱلۡیَتَـٰمَىٰۤ أَمۡوَ ٰ⁠لَهُمۡۖ وَلَا تَتَبَدَّلُوا۟ ٱلۡخَبِیثَ بِٱلطَّیِّبِۖ وَلَا تَأۡكُلُوۤا۟ أَمۡوَ ٰ⁠لَهُمۡ إِلَىٰۤ أَمۡوَ ٰ⁠لِكُمۡۚ إِنَّهُۥ كَانَ حُوبࣰا كَبِیرࣰا\n"
    }
  },
  {
    "id": 496,
    "surahId": 4,
    "ayahNumber": 3,
    "arabicText": "وَإِنۡ خِفۡتُمۡ أَلَّا تُقۡسِطُوا۟ فِی ٱلۡیَتَـٰمَىٰ فَٱنكِحُوا۟ مَا طَابَ لَكُم مِّنَ ٱلنِّسَاۤءِ مَثۡنَىٰ وَثُلَـٰثَ وَرُبَـٰعَۖ فَإِنۡ خِفۡتُمۡ أَلَّا تَعۡدِلُوا۟ فَوَ ٰ⁠حِدَةً أَوۡ مَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۚ ذَ ٰ⁠لِكَ أَدۡنَىٰۤ أَلَّا تَعُولُوا۟\n",
    "translations": {
      "en": "And if you have reason to fear that you might not act equitably towards orphans, then marry from among [other] women such as are lawful to you - [even] two, or three, or four: but if you have reason to fear that you might not be able to treat them with equal fairness, then [only] one - or [from among] those whom you rightfully possess. This will make it more likely that you will not deviate from the right course.",
      "ms": "Dan jika kamu takut tidak berlaku adil terhadap perempuan-perempuan yatim (apabila kamu berkahwin dengan mereka), maka berkahwinlah dengan sesiapa yang kamu berkenan dari perempuan-perempuan (lain): dua, tiga atau empat. Kemudian jika kamu bimbang tidak akan berlaku adil (di antara isteri-isteri kamu) maka (berkahwinlah dengan) seorang sahaja, atau (pakailah) hamba-hamba perempuan yang kamu miliki. Yang demikian itu adalah lebih dekat (untuk mencegah) supaya kamu tidak melakukan kezaliman.",
      "id": "Dan jika kamu takut tidak akan dapat berlaku adil terhadap (hak-hak) perempuan yang yatim (bilamana kamu mengawininya), maka kawinilah wanita-wanita (lain) yang kamu senangi: dua, tiga atau empat. Kemudian jika kamu takut tidak akan dapat berlaku adil, maka (kawinilah) seorang saja, atau budak-budak yang kamu miliki. Yang demikian itu adalah lebih dekat kepada tidak berbuat aniaya.",
      "ar": "وَإِنۡ خِفۡتُمۡ أَلَّا تُقۡسِطُوا۟ فِی ٱلۡیَتَـٰمَىٰ فَٱنكِحُوا۟ مَا طَابَ لَكُم مِّنَ ٱلنِّسَاۤءِ مَثۡنَىٰ وَثُلَـٰثَ وَرُبَـٰعَۖ فَإِنۡ خِفۡتُمۡ أَلَّا تَعۡدِلُوا۟ فَوَ ٰ⁠حِدَةً أَوۡ مَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۚ ذَ ٰ⁠لِكَ أَدۡنَىٰۤ أَلَّا تَعُولُوا۟\n"
    }
  },
  {
    "id": 497,
    "surahId": 4,
    "ayahNumber": 4,
    "arabicText": "وَءَاتُوا۟ ٱلنِّسَاۤءَ صَدُقَـٰتِهِنَّ نِحۡلَةࣰۚ فَإِن طِبۡنَ لَكُمۡ عَن شَیۡءࣲ مِّنۡهُ نَفۡسࣰا فَكُلُوهُ هَنِیۤـࣰٔا مَّرِیۤـࣰٔا\n",
    "translations": {
      "en": "And give unto women their marriage portions in the spirit of a gift; but if they, of their own accord, give up unto you aught thereof, then enjoy it with pleasure and good cheer.",
      "ms": "Dan berikanlah kepada perempuan-perempuan itu maskahwin-maskahwin mereka sebagai pemberian yang wajib. Kemudian jika mereka dengan suka hatinya memberikan kepada kamu sebahagian dari maskahwinnya maka makanlah (gunakanlah) pemberian (yang halal) itu sebagai nikmat yang lazat, lagi baik kesudahannya.",
      "id": "Berikanlah maskawin (mahar) kepada wanita (yang kamu nikahi) sebagai pemberian dengan penuh kerelaan. Kemudian jika mereka menyerahkan kepada kamu sebagian dari maskawin itu dengan senang hati, maka makanlah (ambillah) pemberian itu (sebagai makanan) yang sedap lagi baik akibatnya.",
      "ar": "وَءَاتُوا۟ ٱلنِّسَاۤءَ صَدُقَـٰتِهِنَّ نِحۡلَةࣰۚ فَإِن طِبۡنَ لَكُمۡ عَن شَیۡءࣲ مِّنۡهُ نَفۡسࣰا فَكُلُوهُ هَنِیۤـࣰٔا مَّرِیۤـࣰٔا\n"
    }
  },
  {
    "id": 498,
    "surahId": 4,
    "ayahNumber": 5,
    "arabicText": "وَلَا تُؤۡتُوا۟ ٱلسُّفَهَاۤءَ أَمۡوَ ٰ⁠لَكُمُ ٱلَّتِی جَعَلَ ٱللَّهُ لَكُمۡ قِیَـٰمࣰا وَٱرۡزُقُوهُمۡ فِیهَا وَٱكۡسُوهُمۡ وَقُولُوا۟ لَهُمۡ قَوۡلࣰا مَّعۡرُوفࣰا\n",
    "translations": {
      "en": "And do not entrust to those who are weak of judgment the possessions which God has placed in your charge for [their] support; but let them have their sustenance therefrom, and clothe them, and speak unto them in a kindly way.",
      "ms": "Dan janganlah kamu berikan (serahkan) kepada orang-orang yang belum sempurna akalnya akan harta (mereka yang ada dalam jagaan) kamu, (harta) yang Allah telah menjadikannya untuk kamu semua sebagai asas pembangunan kehidupan kamu; dan berilah mereka belanja dan pakaian dari pendapatan hartanya (yang kamu niagakan), dan juga berkatalah kepada mereka dengan kata-kata yang baik.",
      "id": "Dan janganlah kamu serahkan kepada orang-orang yang belum sempurna akalnya, harta (mereka yang ada dalam kekuasaanmu) yang dijadikan Allah sebagai pokok kehidupan. Berilah mereka belanja dan pakaian (dari hasil harta itu) dan ucapkanlah kepada mereka kata-kata yang baik.",
      "ar": "وَلَا تُؤۡتُوا۟ ٱلسُّفَهَاۤءَ أَمۡوَ ٰ⁠لَكُمُ ٱلَّتِی جَعَلَ ٱللَّهُ لَكُمۡ قِیَـٰمࣰا وَٱرۡزُقُوهُمۡ فِیهَا وَٱكۡسُوهُمۡ وَقُولُوا۟ لَهُمۡ قَوۡلࣰا مَّعۡرُوفࣰا\n"
    }
  },
  {
    "id": 499,
    "surahId": 4,
    "ayahNumber": 6,
    "arabicText": "وَٱبۡتَلُوا۟ ٱلۡیَتَـٰمَىٰ حَتَّىٰۤ إِذَا بَلَغُوا۟ ٱلنِّكَاحَ فَإِنۡ ءَانَسۡتُم مِّنۡهُمۡ رُشۡدࣰا فَٱدۡفَعُوۤا۟ إِلَیۡهِمۡ أَمۡوَ ٰ⁠لَهُمۡۖ وَلَا تَأۡكُلُوهَاۤ إِسۡرَافࣰا وَبِدَارًا أَن یَكۡبَرُوا۟ۚ وَمَن كَانَ غَنِیࣰّا فَلۡیَسۡتَعۡفِفۡۖ وَمَن كَانَ فَقِیرࣰا فَلۡیَأۡكُلۡ بِٱلۡمَعۡرُوفِۚ فَإِذَا دَفَعۡتُمۡ إِلَیۡهِمۡ أَمۡوَ ٰ⁠لَهُمۡ فَأَشۡهِدُوا۟ عَلَیۡهِمۡۚ وَكَفَىٰ بِٱللَّهِ حَسِیبࣰا\n",
    "translations": {
      "en": "And test the orphans [in your charge] until they reach a marriage­able age; then, if you find them to be mature of mind, hand over to them their possessions; and do not consume them by wasteful spending, and in haste, ere they grow up. And let him who is rich abstain entirely [from his ward's property]; and let him who is poor partake thereof in a fair manner. And when you hand over to them their possessions, let there be witnesses on their behalf - although none can take count as God does.",
      "ms": "Dan ujilah anak-anak yatim itu (sebelum baligh) sehingga mereka cukup umur (dewasa). Kemudian jika kamu nampak dari keadaan mereka (tanda-tanda yang menunjukkan bahawa mereka) telah cerdik dan berkebolehan menjaga hartanya, maka serahkanlah kepada mereka hartanya; dan janganlah kamu makan harta anak-anak yatim itu secara yang melampaui batas dan secara terburu-buru (merebut peluang) sebelum mereka dewasa. Dan sesiapa (di antara penjaga harta anak-anak yatim itu) yang kaya maka hendaklah ia menahan diri (dari memakannya); dan sesiapa yang miskin maka bolehlah ia memakannya dengan cara yang sepatutnya. Kemudian apabila kamu menyerahkan kepada mereka hartanya, maka hendaklah kamu adakan saksi-saksi (yang menyaksikan penerimaan) mereka. Dan cukuplah Allah sebagai Pengawas (akan segala yang kamu lakukan).",
      "id": "Dan ujilah anak yatim itu sampai mereka cukup umur untuk kawin. Kemudian jika menurut pendapatmu mereka telah cerdas (pandai memelihara harta), maka serahkanlah kepada mereka harta-hartanya. Dan janganlah kamu makan harta anak yatim lebih dari batas kepatutan dan (janganlah kamu) tergesa-gesa (membelanjakannya) sebelum mereka dewasa. Barang siapa (di antara pemelihara itu) mampu, maka hendaklah ia menahan diri (dari memakan harta anak yatim itu) dan barangsiapa yang miskin, maka bolehlah ia makan harta itu menurut yang patut. Kemudian apabila kamu menyerahkan harta kepada mereka, maka hendaklah kamu adakan saksi-saksi (tentang penyerahan itu) bagi mereka. Dan cukuplah Allah sebagai Pengawas (atas persaksian itu).",
      "ar": "وَٱبۡتَلُوا۟ ٱلۡیَتَـٰمَىٰ حَتَّىٰۤ إِذَا بَلَغُوا۟ ٱلنِّكَاحَ فَإِنۡ ءَانَسۡتُم مِّنۡهُمۡ رُشۡدࣰا فَٱدۡفَعُوۤا۟ إِلَیۡهِمۡ أَمۡوَ ٰ⁠لَهُمۡۖ وَلَا تَأۡكُلُوهَاۤ إِسۡرَافࣰا وَبِدَارًا أَن یَكۡبَرُوا۟ۚ وَمَن كَانَ غَنِیࣰّا فَلۡیَسۡتَعۡفِفۡۖ وَمَن كَانَ فَقِیرࣰا فَلۡیَأۡكُلۡ بِٱلۡمَعۡرُوفِۚ فَإِذَا دَفَعۡتُمۡ إِلَیۡهِمۡ أَمۡوَ ٰ⁠لَهُمۡ فَأَشۡهِدُوا۟ عَلَیۡهِمۡۚ وَكَفَىٰ بِٱللَّهِ حَسِیبࣰا\n"
    }
  },
  {
    "id": 500,
    "surahId": 4,
    "ayahNumber": 7,
    "arabicText": "لِّلرِّجَالِ نَصِیبࣱ مِّمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَ وَلِلنِّسَاۤءِ نَصِیبࣱ مِّمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَ مِمَّا قَلَّ مِنۡهُ أَوۡ كَثُرَۚ نَصِیبࣰا مَّفۡرُوضࣰا\n",
    "translations": {
      "en": "MEN SHALL have a share in what parents and kinsfolk leave behind, and women shall have a share in what parents and kinsfolk leave behind, whether it be little or much - a share ordained [by God].",
      "ms": "Orang-orang lelaki ada bahagian pusaka dari peninggalan ibu bapa dan kerabat, dan orang-orang perempuan pula ada bahagian pusaka dari peninggalan ibu bapa dan kerabat, sama ada sedikit atau banyak dari harta yang ditinggalkan itu; iaitu bahagian yang telah diwajibkan (dan ditentukan oleh Allah).",
      "id": "Bagi orang laki-laki ada hak bagian dari harta peninggalan ibu-bapa dan kerabatnya, dan bagi orang wanita ada hak bagian (pula) dari harta peninggalan ibu-bapa dan kerabatnya, baik sedikit atau banyak menurut bahagian yang telah ditetapkan.",
      "ar": "لِّلرِّجَالِ نَصِیبࣱ مِّمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَ وَلِلنِّسَاۤءِ نَصِیبࣱ مِّمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَ مِمَّا قَلَّ مِنۡهُ أَوۡ كَثُرَۚ نَصِیبࣰا مَّفۡرُوضࣰا\n"
    }
  },
  {
    "id": 501,
    "surahId": 4,
    "ayahNumber": 8,
    "arabicText": "وَإِذَا حَضَرَ ٱلۡقِسۡمَةَ أُو۟لُوا۟ ٱلۡقُرۡبَىٰ وَٱلۡیَتَـٰمَىٰ وَٱلۡمَسَـٰكِینُ فَٱرۡزُقُوهُم مِّنۡهُ وَقُولُوا۟ لَهُمۡ قَوۡلࣰا مَّعۡرُوفࣰا\n",
    "translations": {
      "en": "And when [other] near of kin and orphans and needy persons are present at the distribution [of inheritance], give them something thereof for their sustenance, and speak unto them in a kindly way.",
      "ms": "Dan apabila kerabat (yang tidak berhak mendapat pusaka), dan anak-anak yatim serta orang-orang miskin hadir ketika pembahagian (harta pusaka) itu, maka berikanlah kepada mereka sedikit daripadanya, dan berkatalah kepada mereka dengan kata-kata yang baik.",
      "id": "Dan apabila sewaktu pembagian itu hadir kerabat, anak yatim dan orang miskin, maka berilah mereka dari harta itu (sekedarnya) dan ucapkanlah kepada mereka perkataan yang baik.",
      "ar": "وَإِذَا حَضَرَ ٱلۡقِسۡمَةَ أُو۟لُوا۟ ٱلۡقُرۡبَىٰ وَٱلۡیَتَـٰمَىٰ وَٱلۡمَسَـٰكِینُ فَٱرۡزُقُوهُم مِّنۡهُ وَقُولُوا۟ لَهُمۡ قَوۡلࣰا مَّعۡرُوفࣰا\n"
    }
  },
  {
    "id": 502,
    "surahId": 4,
    "ayahNumber": 9,
    "arabicText": "وَلۡیَخۡشَ ٱلَّذِینَ لَوۡ تَرَكُوا۟ مِنۡ خَلۡفِهِمۡ ذُرِّیَّةࣰ ضِعَـٰفًا خَافُوا۟ عَلَیۡهِمۡ فَلۡیَتَّقُوا۟ ٱللَّهَ وَلۡیَقُولُوا۟ قَوۡلࣰا سَدِیدًا\n",
    "translations": {
      "en": "And let them stand in awe [of God], those [legal heirs] - who, if they [themselves] had to leave behind weak offspring, would feel fear on their account - and let them remain conscious of God, and let them speak [to the poor] in a just manner.",
      "ms": "Dan hendaklah takut (kepada Allah daripada melakukan aniaya kepada anak-anak yatim oleh) orang-orang (yang menjadi penjaganya), yang jika ditakdirkan mereka pula meninggalkan anak-anak yang daif (yatim) di belakang mereka, (tentulah) mereka akan merasa bimbang terhadap (masa depan dan keselamatan) anak-anak mereka; oleh itu hendaklah mereka bertaqwa kepada Allah, dan hendaklah mereka mengatakan perkataan yang betul (menepati kebenaran).",
      "id": "Dan hendaklah takut kepada Allah orang-orang yang seandainya meninggalkan dibelakang mereka anak-anak yang lemah, yang mereka khawatir terhadap (kesejahteraan) mereka. Oleh sebab itu hendaklah mereka bertakwa kepada Allah dan hendaklah mereka mengucapkan perkataan yang benar.",
      "ar": "وَلۡیَخۡشَ ٱلَّذِینَ لَوۡ تَرَكُوا۟ مِنۡ خَلۡفِهِمۡ ذُرِّیَّةࣰ ضِعَـٰفًا خَافُوا۟ عَلَیۡهِمۡ فَلۡیَتَّقُوا۟ ٱللَّهَ وَلۡیَقُولُوا۟ قَوۡلࣰا سَدِیدًا\n"
    }
  },
  {
    "id": 503,
    "surahId": 4,
    "ayahNumber": 10,
    "arabicText": "إِنَّ ٱلَّذِینَ یَأۡكُلُونَ أَمۡوَ ٰ⁠لَ ٱلۡیَتَـٰمَىٰ ظُلۡمًا إِنَّمَا یَأۡكُلُونَ فِی بُطُونِهِمۡ نَارࣰاۖ وَسَیَصۡلَوۡنَ سَعِیرࣰا\n",
    "translations": {
      "en": "Behold, those who sinfully devour the posses­sions of orphans but fill their bellies with fire: for [in the life to come] they will have to endure a blazing flame!",
      "ms": "Sesungguhnya orang-orang yang memakan harta anak-anak yatim secara zalim, sebenarnya mereka itu hanyalah menelan api ke dalam perut mereka; dan mereka pula akan masuk ke dalam api neraka yang menyala-nyala.",
      "id": "Sesungguhnya orang-orang yang memakan harta anak yatim secara zalim, sebenarnya mereka itu menelan api sepenuh perutnya dan mereka akan masuk ke dalam api yang menyala-nyala (neraka).",
      "ar": "إِنَّ ٱلَّذِینَ یَأۡكُلُونَ أَمۡوَ ٰ⁠لَ ٱلۡیَتَـٰمَىٰ ظُلۡمًا إِنَّمَا یَأۡكُلُونَ فِی بُطُونِهِمۡ نَارࣰاۖ وَسَیَصۡلَوۡنَ سَعِیرࣰا\n"
    }
  },
  {
    "id": 504,
    "surahId": 4,
    "ayahNumber": 11,
    "arabicText": "یُوصِیكُمُ ٱللَّهُ فِیۤ أَوۡلَـٰدِكُمۡۖ لِلذَّكَرِ مِثۡلُ حَظِّ ٱلۡأُنثَیَیۡنِۚ فَإِن كُنَّ نِسَاۤءࣰ فَوۡقَ ٱثۡنَتَیۡنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَۖ وَإِن كَانَتۡ وَ ٰ⁠حِدَةࣰ فَلَهَا ٱلنِّصۡفُۚ وَلِأَبَوَیۡهِ لِكُلِّ وَ ٰ⁠حِدࣲ مِّنۡهُمَا ٱلسُّدُسُ مِمَّا تَرَكَ إِن كَانَ لَهُۥ وَلَدࣱۚ فَإِن لَّمۡ یَكُن لَّهُۥ وَلَدࣱ وَوَرِثَهُۥۤ أَبَوَاهُ فَلِأُمِّهِ ٱلثُّلُثُۚ فَإِن كَانَ لَهُۥۤ إِخۡوَةࣱ فَلِأُمِّهِ ٱلسُّدُسُۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصِی بِهَاۤ أَوۡ دَیۡنٍۗ ءَابَاۤؤُكُمۡ وَأَبۡنَاۤؤُكُمۡ لَا تَدۡرُونَ أَیُّهُمۡ أَقۡرَبُ لَكُمۡ نَفۡعࣰاۚ فَرِیضَةࣰ مِّنَ ٱللَّهِۗ إِنَّ ٱللَّهَ كَانَ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "CONCERNING [the inheritance of] your children, God enjoins [this] upon you: The male shall have the equal of two females’ share; but if there are more than two females, they shall have two-thirds of what [their parents] leave behind; and if there is only one daughter, she shall have one-half thereof. And as for the parents [of the deceased], each of them shall have one-sixth of what he leaves behind, in the event of his having [left] a child; but if he has left no child and his parents are his [only] heirs, then his mother shall have one-third; and if he has brothers and sisters, then his mother shall have one-sixth after [the deduction of] any bequest he may have made, or any debt [he may have incurred]. As for your parents and your children - you know not which of them is more deserving of benefit from you: [therefore this] ordinance from God. Verily, God is all-knowing, wise.",
      "ms": "Allah perintahkan kamu mengenai (pembahagian harta pusaka untuk) anak-anak kamu, iaitu bahagian seorang anak lelaki menyamai bahagian dua orang anak perempuan. Tetapi jika anak-anak perempuan itu lebih dari dua, maka bahagian mereka ialah dua pertiga dari harta yang ditinggalkan oleh si mati. Dan jika anak perempuan itu seorang sahaja, maka bahagiannya ialah satu perdua (separuh) harta itu. Dan bagi ibu bapa (si mati), tiap-tiap seorang dari keduanya: satu perenam dari harta yang ditinggalkan oleh si mati, jika si mati itu mempunyai anak. Tetapi jika si mati tidak mempunyai anak, sedang yang mewarisinya hanyalah kedua ibu bapanya, maka bahagian ibunya ialah satu pertiga. Kalau pula si mati itu mempunyai beberapa orang saudara (adik-beradik), maka bahagian ibunya ialah satu perenam. (Pembahagian itu) ialah sesudah diselesaikan wasiat yang telah diwasiatkan oleh si mati, dan sesudah dibayarkan hutangnya. lbu-bapa kamu dan anak-anak kamu, kamu tidak mengetahui siapa di antaranya yang lebih dekat serta banyak manfaatnya kepada kamu (Pembahagian harta pusaka dan penentuan bahagian masing-masing seperti yang diterangkan itu ialah) ketetapan dari Allah; sesungguhnya Allah adalah Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "Allah mensyari'atkan bagimu tentang (pembagian pusaka untuk) anak-anakmu. Yaitu: bahagian seorang anak lelaki sama dengan bagahian dua orang anak perempuan; dan jika anak itu semuanya perempuan lebih dari dua, maka bagi mereka dua pertiga dari harta yang ditinggalkan; jika anak perempuan itu seorang saja, maka ia memperoleh separo harta. Dan untuk dua orang ibu-bapa, bagi masing-masingnya seperenam dari harta yang ditinggalkan, jika yang meninggal itu mempunyai anak; jika orang yang meninggal tidak mempunyai anak dan ia diwarisi oleh ibu-bapanya (saja), maka ibunya mendapat sepertiga; jika yang meninggal itu mempunyai beberapa saudara, maka ibunya mendapat seperenam. (Pembagian-pembagian tersebut di atas) sesudah dipenuhi wasiat yang ia buat atau (dan) sesudah dibayar hutangnya. (Tentang) orang tuamu dan anak-anakmu, kamu tidak mengetahui siapa di antara mereka yang lebih dekat (banyak) manfaatnya bagimu. Ini adalah ketetapan dari Allah. Sesungguhnya Allah Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "یُوصِیكُمُ ٱللَّهُ فِیۤ أَوۡلَـٰدِكُمۡۖ لِلذَّكَرِ مِثۡلُ حَظِّ ٱلۡأُنثَیَیۡنِۚ فَإِن كُنَّ نِسَاۤءࣰ فَوۡقَ ٱثۡنَتَیۡنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَۖ وَإِن كَانَتۡ وَ ٰ⁠حِدَةࣰ فَلَهَا ٱلنِّصۡفُۚ وَلِأَبَوَیۡهِ لِكُلِّ وَ ٰ⁠حِدࣲ مِّنۡهُمَا ٱلسُّدُسُ مِمَّا تَرَكَ إِن كَانَ لَهُۥ وَلَدࣱۚ فَإِن لَّمۡ یَكُن لَّهُۥ وَلَدࣱ وَوَرِثَهُۥۤ أَبَوَاهُ فَلِأُمِّهِ ٱلثُّلُثُۚ فَإِن كَانَ لَهُۥۤ إِخۡوَةࣱ فَلِأُمِّهِ ٱلسُّدُسُۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصِی بِهَاۤ أَوۡ دَیۡنٍۗ ءَابَاۤؤُكُمۡ وَأَبۡنَاۤؤُكُمۡ لَا تَدۡرُونَ أَیُّهُمۡ أَقۡرَبُ لَكُمۡ نَفۡعࣰاۚ فَرِیضَةࣰ مِّنَ ٱللَّهِۗ إِنَّ ٱللَّهَ كَانَ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 505,
    "surahId": 4,
    "ayahNumber": 12,
    "arabicText": "۞ وَلَكُمۡ نِصۡفُ مَا تَرَكَ أَزۡوَ ٰ⁠جُكُمۡ إِن لَّمۡ یَكُن لَّهُنَّ وَلَدࣱۚ فَإِن كَانَ لَهُنَّ وَلَدࣱ فَلَكُمُ ٱلرُّبُعُ مِمَّا تَرَكۡنَۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصِینَ بِهَاۤ أَوۡ دَیۡنࣲۚ وَلَهُنَّ ٱلرُّبُعُ مِمَّا تَرَكۡتُمۡ إِن لَّمۡ یَكُن لَّكُمۡ وَلَدࣱۚ فَإِن كَانَ لَكُمۡ وَلَدࣱ فَلَهُنَّ ٱلثُّمُنُ مِمَّا تَرَكۡتُمۚ مِّنۢ بَعۡدِ وَصِیَّةࣲ تُوصُونَ بِهَاۤ أَوۡ دَیۡنࣲۗ وَإِن كَانَ رَجُلࣱ یُورَثُ كَلَـٰلَةً أَوِ ٱمۡرَأَةࣱ وَلَهُۥۤ أَخٌ أَوۡ أُخۡتࣱ فَلِكُلِّ وَ ٰ⁠حِدࣲ مِّنۡهُمَا ٱلسُّدُسُۚ فَإِن كَانُوۤا۟ أَكۡثَرَ مِن ذَ ٰ⁠لِكَ فَهُمۡ شُرَكَاۤءُ فِی ٱلثُّلُثِۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصَىٰ بِهَاۤ أَوۡ دَیۡنٍ غَیۡرَ مُضَاۤرࣲّۚ وَصِیَّةࣰ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِیمٌ حَلِیمࣱ\n",
    "translations": {
      "en": "And you shall inherit one-half of what your wives leave behind, provided they have left no child; but if they have left a child, then you shall have one-quarter of what they leave behind, after [the deduction of] any bequest they may have made, or any debt [they may have incurred]. And your widows shall have one-quarter of what you leave behind, provided you have left no child; but if you have left a child, then they shall have one-eighth of what you leave behind, after [the deduction of] any bequest you may have made, or any debt [you may have incurred]. And if a man or a woman has no heir in the direct line, but has a brother or a sister, then each of these two shall inherit one-sixth; but if there are more than two, then they shall share in one-third [of the inheritance], after [the deduction of] any bequest that may have been made, or any debt [that may have been incurred], neither of which having been intended to harm [the heirs]. [This is] an injunction from God: and God is all-knowing, forbearing.",
      "ms": "Dan bagi kamu satu perdua dari harta yang ditinggalkan oleh isteri-isteri kamu jika mereka tidak mempunyai anak. Tetapi jika mereka mempunyai anak maka kamu beroleh satu perempat dari harta yang mereka tinggalkan, sesudah ditunaikan wasiat yang mereka wasiatkan dan sesudah dibayarkan hutangnya. Dan bagi mereka (isteri-isteri) pula satu perempat dari harta yang kamu tinggalkan, jika kamu tidak mempunyai anak. Tetapi kalau kamu mempunyai anak maka bahagian mereka (isteri-isteri kamu) ialah satu perlapan dari harta yang kamu tinggalkan, sesudah ditunaikan wasiat yang kamu wasiatkan, dan sesudah dibayarkan hutang kamu. Dan jika si mati yang diwarisi itu, lelaki atau perempuan, yang tidak meninggalkan anak atau bapa, dan ada meninggalkan seorang saudara lelaki (seibu) atau saudara perempuan (seibu) maka bagi tiap-tiap seorang dari keduanya ialah satu perenam. Kalau pula mereka (saudara-saudara yang seibu itu) lebih dari seorang, maka mereka bersekutu pada satu pertiga (dengan mendapat sama banyak lelaki dengan perempuan), sesudah ditunaikan wasiat yang diwasiatkan oleh si mati, dan sesudah dibayarkan hutangnya; wasiat-wasiat yang tersebut hendaknya tidak mendatangkan mudarat (kepada waris-waris). (Tiap-tiap satu hukum itu) ialah ketetapan dari Allah. Dan (ingatlah) Allah Maha Mengetahui, lagi Maha Penyabar.",
      "id": "Dan bagimu (suami-suami) seperdua dari harta yang ditinggalkan oleh isteri-isterimu, jika mereka tidak mempunyai anak. Jika isteri-isterimu itu mempunyai anak, maka kamu mendapat seperempat dari harta yang ditinggalkannya sesudah dipenuhi wasiat yang mereka buat atau (dan) seduah dibayar hutangnya. Para isteri memperoleh seperempat harta yang kamu tinggalkan jika kamu tidak mempunyai anak. Jika kamu mempunyai anak, maka para isteri memperoleh seperdelapan dari harta yang kamu tinggalkan sesudah dipenuhi wasiat yang kamu buat atau (dan) sesudah dibayar hutang-hutangmu. Jika seseorang mati, baik laki-laki maupun perempuan yang tidak meninggalkan ayah dan tidak meninggalkan anak, tetapi mempunyai seorang saudara laki-laki (seibu saja) atau seorang saudara perempuan (seibu saja), maka bagi masing-masing dari kedua jenis saudara itu seperenam harta. Tetapi jika saudara-saudara seibu itu lebih dari seorang, maka mereka bersekutu dalam yang sepertiga itu, sesudah dipenuhi wasiat yang dibuat olehnya atau sesudah dibayar hutangnya dengan tidak memberi mudharat (kepada ahli waris). (Allah menetapkan yang demikian itu sebagai) syari'at yang benar-benar dari Allah, dan Allah Maha Mengetahui lagi Maha Penyantun.",
      "ar": "۞ وَلَكُمۡ نِصۡفُ مَا تَرَكَ أَزۡوَ ٰ⁠جُكُمۡ إِن لَّمۡ یَكُن لَّهُنَّ وَلَدࣱۚ فَإِن كَانَ لَهُنَّ وَلَدࣱ فَلَكُمُ ٱلرُّبُعُ مِمَّا تَرَكۡنَۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصِینَ بِهَاۤ أَوۡ دَیۡنࣲۚ وَلَهُنَّ ٱلرُّبُعُ مِمَّا تَرَكۡتُمۡ إِن لَّمۡ یَكُن لَّكُمۡ وَلَدࣱۚ فَإِن كَانَ لَكُمۡ وَلَدࣱ فَلَهُنَّ ٱلثُّمُنُ مِمَّا تَرَكۡتُمۚ مِّنۢ بَعۡدِ وَصِیَّةࣲ تُوصُونَ بِهَاۤ أَوۡ دَیۡنࣲۗ وَإِن كَانَ رَجُلࣱ یُورَثُ كَلَـٰلَةً أَوِ ٱمۡرَأَةࣱ وَلَهُۥۤ أَخٌ أَوۡ أُخۡتࣱ فَلِكُلِّ وَ ٰ⁠حِدࣲ مِّنۡهُمَا ٱلسُّدُسُۚ فَإِن كَانُوۤا۟ أَكۡثَرَ مِن ذَ ٰ⁠لِكَ فَهُمۡ شُرَكَاۤءُ فِی ٱلثُّلُثِۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصَىٰ بِهَاۤ أَوۡ دَیۡنٍ غَیۡرَ مُضَاۤرࣲّۚ وَصِیَّةࣰ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِیمٌ حَلِیمࣱ\n"
    }
  },
  {
    "id": 506,
    "surahId": 4,
    "ayahNumber": 13,
    "arabicText": "تِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن یُطِعِ ٱللَّهَ وَرَسُولَهُۥ یُدۡخِلۡهُ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۚ وَذَ ٰ⁠لِكَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n",
    "translations": {
      "en": "These are the bounds set by God. And whoever pays heed unto God and His Apostle, him will He bring into gardens through which running waters flow, therein to abide: and this is a triumph supreme.",
      "ms": "Segala hukum yang tersebut adalah batas-batas (Syariat) Allah. Dan sesiapa yang taat kepada Allah dan RasulNya, akan dimasukkan oleh Allah ke dalam Syurga yang mengalir dari bawahnya beberapa sungai, mereka kekal di dalamnya; dan itulah kejayaan yang amat besar.",
      "id": "(Hukum-hukum tersebut) itu adalah ketentuan-ketentuan dari Allah. Barangsiapa taat kepada Allah dan Rasul-Nya, niscaya Allah memasukkannya kedalam surga yang mengalir didalamnya sungai-sungai, sedang mereka kekal di dalamnya; dan itulah kemenangan yang besar.",
      "ar": "تِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن یُطِعِ ٱللَّهَ وَرَسُولَهُۥ یُدۡخِلۡهُ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۚ وَذَ ٰ⁠لِكَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n"
    }
  },
  {
    "id": 507,
    "surahId": 4,
    "ayahNumber": 14,
    "arabicText": "وَمَن یَعۡصِ ٱللَّهَ وَرَسُولَهُۥ وَیَتَعَدَّ حُدُودَهُۥ یُدۡخِلۡهُ نَارًا خَـٰلِدࣰا فِیهَا وَلَهُۥ عَذَابࣱ مُّهِینࣱ\n",
    "translations": {
      "en": "And whoever rebels against God and His Apostle and transgresses His bounds, him will He commit unto fire, therein to abide; and shameful suffering awaits him.",
      "ms": "Dan sesiapa yang derhaka kepada Allah dan RasulNya, dan melampaui batas-batas SyariatNya, akan dimasukkan oleh Allah ke dalam api neraka, kekalah dia di dalamnya, dan baginya azab seksa yang amat menghina.",
      "id": "Dan barangsiapa yang mendurhakai Allah dan Rasul-Nya dan melanggar ketentuan-ketentuan-Nya, niscaya Allah memasukkannya ke dalam api neraka sedang ia kekal di dalamnya; dan baginya siksa yang menghinakan.",
      "ar": "وَمَن یَعۡصِ ٱللَّهَ وَرَسُولَهُۥ وَیَتَعَدَّ حُدُودَهُۥ یُدۡخِلۡهُ نَارًا خَـٰلِدࣰا فِیهَا وَلَهُۥ عَذَابࣱ مُّهِینࣱ\n"
    }
  },
  {
    "id": 508,
    "surahId": 4,
    "ayahNumber": 15,
    "arabicText": "وَٱلَّـٰتِی یَأۡتِینَ ٱلۡفَـٰحِشَةَ مِن نِّسَاۤىِٕكُمۡ فَٱسۡتَشۡهِدُوا۟ عَلَیۡهِنَّ أَرۡبَعَةࣰ مِّنكُمۡۖ فَإِن شَهِدُوا۟ فَأَمۡسِكُوهُنَّ فِی ٱلۡبُیُوتِ حَتَّىٰ یَتَوَفَّىٰهُنَّ ٱلۡمَوۡتُ أَوۡ یَجۡعَلَ ٱللَّهُ لَهُنَّ سَبِیلࣰا\n",
    "translations": {
      "en": "AND AS FOR those of your women who become guilty of immoral conduct, call upon four from among you who have witnessed their guilt; and if these bear witness thereto, confine the guilty women to their houses until death takes them away or God opens for them a way [through repentance].",
      "ms": "Dan sesiapa yang melakukan perbuatan keji (zina) di antara perempuan-perempuan kamu, maka carilah empat orang lelaki di antara kamu yang menjadi saksi terhadap perbuatan mereka. Kemudian kalau keterangan-keterangan saksi itu mengesahkan perbuatan tersebut, maka kurunglah mereka (perempuan yang berzina itu) dalam rumah hingga mereka sampai ajal matinya, atau hingga Allah mengadakan untuk mereka jalan keluar (dari hukuman itu).",
      "id": "Dan (terhadap) para wanita yang mengerjakan perbuatan keji, hendaklah ada empat orang saksi diantara kamu (yang menyaksikannya). Kemudian apabila mereka telah memberi persaksian, maka kurunglah mereka (wanita-wanita itu) dalam rumah sampai mereka menemui ajalnya, atau sampai Allah memberi jalan lain kepadanya.",
      "ar": "وَٱلَّـٰتِی یَأۡتِینَ ٱلۡفَـٰحِشَةَ مِن نِّسَاۤىِٕكُمۡ فَٱسۡتَشۡهِدُوا۟ عَلَیۡهِنَّ أَرۡبَعَةࣰ مِّنكُمۡۖ فَإِن شَهِدُوا۟ فَأَمۡسِكُوهُنَّ فِی ٱلۡبُیُوتِ حَتَّىٰ یَتَوَفَّىٰهُنَّ ٱلۡمَوۡتُ أَوۡ یَجۡعَلَ ٱللَّهُ لَهُنَّ سَبِیلࣰا\n"
    }
  },
  {
    "id": 509,
    "surahId": 4,
    "ayahNumber": 16,
    "arabicText": "وَٱلَّذَانِ یَأۡتِیَـٰنِهَا مِنكُمۡ فَـَٔاذُوهُمَاۖ فَإِن تَابَا وَأَصۡلَحَا فَأَعۡرِضُوا۟ عَنۡهُمَاۤۗ إِنَّ ٱللَّهَ كَانَ تَوَّابࣰا رَّحِیمًا\n",
    "translations": {
      "en": "And punish [thus] both of the guilty parties; but if they both repent and mend their ways, leave them alone: for, behold, God is an acceptor of repentance, a dispenser of grace.",
      "ms": "Dan (mana-mana) dua orang di antara kamu yang melakukan perbuatan yang keji itu, (setelah sabit kesalahannya) maka hendaklah kamu menyakiti keduanya; kemudian jika mereka bertaubat dan memperbaiki keadaan diri mereka (yang buruk itu), maka biarkanlah mereka; kerana sesungguhnya Allah adalah sentiasa Menerima taubat, lagi Maha Luas rahmatNya.",
      "id": "Dan terhadap dua orang yang melakukan perbuatan keji di antara kamu, maka berilah hukuman kepada keduanya, kemudian jika keduanya bertaubat dan memperbaiki diri, maka biarkanlah mereka. Sesungguhnya Allah Maha Penerima taubat lagi Maha Penyayang.",
      "ar": "وَٱلَّذَانِ یَأۡتِیَـٰنِهَا مِنكُمۡ فَـَٔاذُوهُمَاۖ فَإِن تَابَا وَأَصۡلَحَا فَأَعۡرِضُوا۟ عَنۡهُمَاۤۗ إِنَّ ٱللَّهَ كَانَ تَوَّابࣰا رَّحِیمًا\n"
    }
  },
  {
    "id": 510,
    "surahId": 4,
    "ayahNumber": 17,
    "arabicText": "إِنَّمَا ٱلتَّوۡبَةُ عَلَى ٱللَّهِ لِلَّذِینَ یَعۡمَلُونَ ٱلسُّوۤءَ بِجَهَـٰلَةࣲ ثُمَّ یَتُوبُونَ مِن قَرِیبࣲ فَأُو۟لَـٰۤىِٕكَ یَتُوبُ ٱللَّهُ عَلَیۡهِمۡۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "Verily, God's acceptance of repentance relates only to those who do evil out of ignorance and then repent before their time runs out: and it is they unto whom God will turn again in His mercy - for God is all-knowing, wise;",
      "ms": "Sesungguhnya penerimaan taubat itu disanggup oleh Allah hanya bagi orang-orang yang melakukan kejahatan disebabkan (sifat) kejahilan kemudian mereka segera bertaubat, maka (dengan adanya dua sebab itu) mereka diterima Allah taubatnya; dan (ingatlah) Allah Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "Sesungguhnya taubat di sisi Allah hanyalah taubat bagi orang-orang yang mengerjakan kejahatan lantaran kejahilan, yang kemudian mereka bertaubat dengan segera, maka mereka itulah yang diterima Allah taubatnya; dan Allah Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "إِنَّمَا ٱلتَّوۡبَةُ عَلَى ٱللَّهِ لِلَّذِینَ یَعۡمَلُونَ ٱلسُّوۤءَ بِجَهَـٰلَةࣲ ثُمَّ یَتُوبُونَ مِن قَرِیبࣲ فَأُو۟لَـٰۤىِٕكَ یَتُوبُ ٱللَّهُ عَلَیۡهِمۡۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 511,
    "surahId": 4,
    "ayahNumber": 18,
    "arabicText": "وَلَیۡسَتِ ٱلتَّوۡبَةُ لِلَّذِینَ یَعۡمَلُونَ ٱلسَّیِّـَٔاتِ حَتَّىٰۤ إِذَا حَضَرَ أَحَدَهُمُ ٱلۡمَوۡتُ قَالَ إِنِّی تُبۡتُ ٱلۡـَٔـٰنَ وَلَا ٱلَّذِینَ یَمُوتُونَ وَهُمۡ كُفَّارٌۚ أُو۟لَـٰۤىِٕكَ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِیمࣰا\n",
    "translations": {
      "en": "whereas repentance shall not be accepted from those who do evil deeds until their dying hour and then say, \"Behold, I now repent\"; nor from those who die as deniers of the truth: it is these for whom We have readied grievous suffering.",
      "ms": "Dan tidak ada gunanya taubat itu kepada orang-orang yang selalu melakukan kejahatan, hingga apabila salah seorang dari mereka hampir mati, berkatalah ia: \"Sesungguhnya aku bertaubat sekarang ini,\" (sedang taubatnya itu sudah terlambat), dan (demikian juga halnya) orang-orang yang mati sedang mereka tetap kafir. Orang-orang yang demikian, Kami telah sediakan bagi mereka azab seksa yang tidak terperi sakitnya.",
      "id": "Dan tidaklah taubat itu diterima Allah dari orang-orang yang mengerjakan kejahatan (yang) hingga apabila datang ajal kepada seseorang di antara mereka, (barulah) ia mengatakan: \"Sesungguhnya saya bertaubat sekarang\". Dan tidak (pula diterima taubat) orang-orang yang mati sedang mereka di dalam kekafiran. Bagi orang-orang itu telah Kami sediakan siksa yang pedih.",
      "ar": "وَلَیۡسَتِ ٱلتَّوۡبَةُ لِلَّذِینَ یَعۡمَلُونَ ٱلسَّیِّـَٔاتِ حَتَّىٰۤ إِذَا حَضَرَ أَحَدَهُمُ ٱلۡمَوۡتُ قَالَ إِنِّی تُبۡتُ ٱلۡـَٔـٰنَ وَلَا ٱلَّذِینَ یَمُوتُونَ وَهُمۡ كُفَّارٌۚ أُو۟لَـٰۤىِٕكَ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِیمࣰا\n"
    }
  },
  {
    "id": 512,
    "surahId": 4,
    "ayahNumber": 19,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا یَحِلُّ لَكُمۡ أَن تَرِثُوا۟ ٱلنِّسَاۤءَ كَرۡهࣰاۖ وَلَا تَعۡضُلُوهُنَّ لِتَذۡهَبُوا۟ بِبَعۡضِ مَاۤ ءَاتَیۡتُمُوهُنَّ إِلَّاۤ أَن یَأۡتِینَ بِفَـٰحِشَةࣲ مُّبَیِّنَةࣲۚ وَعَاشِرُوهُنَّ بِٱلۡمَعۡرُوفِۚ فَإِن كَرِهۡتُمُوهُنَّ فَعَسَىٰۤ أَن تَكۡرَهُوا۟ شَیۡـࣰٔا وَیَجۡعَلَ ٱللَّهُ فِیهِ خَیۡرࣰا كَثِیرࣰا\n",
    "translations": {
      "en": "O YOU who have attained to faith! It is not lawful for you to [try to] become heirs to your wives [by holding onto them] against their will; and neither shall you keep them under constraint with a view to taking away anything of what you may have given them, unless it be that they have become guilty, in an obvious man­ner, of immoral conduct. And consort with your wives in a goodly manner; for if you dislike them, it may well be that you dislike something which God might yet make a source of abundant good.",
      "ms": "Wahai orang-orang yang beriman, tidak halal bagi kamu mewarisi perempuan-perempuan dengan jalan paksaan, dan janganlah kamu menyakiti mereka (dengan menahan dan menyusahkan mereka) kerana kamu hendak mengambil balik sebahagian dari apa yang kamu telah berikan kepadanya, kecuali (apabila) mereka melakukan perbuatan keji yang nyata. Dan bergaulah kamu dengan mereka (isteri-isteri kamu itu) dengan cara yang baik. Kemudian jika kamu (merasai) benci kepada mereka (disebabkan tingkah-lakunya, janganlah kamu terburu-buru menceraikannya), kerana boleh jadi kamu bencikan sesuatu, sedang Allah hendak menjadikan pada apa yang kamu benci itu kebaikan yang banyak (untuk kamu).",
      "id": "Hai orang-orang yang beriman, tidak halal bagi kamu mempusakai wanita dengan jalan paksa dan janganlah kamu menyusahkan mereka karena hendak mengambil kembali sebagian dari apa yang telah kamu berikan kepadanya, terkecuali bila mereka melakukan pekerjaan keji yang nyata. Dan bergaullah dengan mereka secara patut. Kemudian bila kamu tidak menyukai mereka, (maka bersabarlah) karena mungkin kamu tidak menyukai sesuatu, padahal Allah menjadikan padanya kebaikan yang banyak.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا یَحِلُّ لَكُمۡ أَن تَرِثُوا۟ ٱلنِّسَاۤءَ كَرۡهࣰاۖ وَلَا تَعۡضُلُوهُنَّ لِتَذۡهَبُوا۟ بِبَعۡضِ مَاۤ ءَاتَیۡتُمُوهُنَّ إِلَّاۤ أَن یَأۡتِینَ بِفَـٰحِشَةࣲ مُّبَیِّنَةࣲۚ وَعَاشِرُوهُنَّ بِٱلۡمَعۡرُوفِۚ فَإِن كَرِهۡتُمُوهُنَّ فَعَسَىٰۤ أَن تَكۡرَهُوا۟ شَیۡـࣰٔا وَیَجۡعَلَ ٱللَّهُ فِیهِ خَیۡرࣰا كَثِیرࣰا\n"
    }
  },
  {
    "id": 513,
    "surahId": 4,
    "ayahNumber": 20,
    "arabicText": "وَإِنۡ أَرَدتُّمُ ٱسۡتِبۡدَالَ زَوۡجࣲ مَّكَانَ زَوۡجࣲ وَءَاتَیۡتُمۡ إِحۡدَىٰهُنَّ قِنطَارࣰا فَلَا تَأۡخُذُوا۟ مِنۡهُ شَیۡـًٔاۚ أَتَأۡخُذُونَهُۥ بُهۡتَـٰنࣰا وَإِثۡمࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "But if you desire to give up a wife and to take another in her stead, do not take away anything of what you have given the first one, however much it may have been. Would you, perchance, take it away by slandering her and thus committing a manifest sin?",
      "ms": "Dan jika kamu hendak mengambil isteri (baharu) menggantikan isteri (lama yang kamu ceraikan) sedang kamu telahpun memberikan kepada seseorang di antaranya (isteri yang diceraikan itu) harta yang banyak, maka janganlah kamu mengambil sedikitpun dari harta itu. Patutkah kamu mengambilnya dengan cara yang tidak benar dan (yang menyebabkan) dosa yang nyata?",
      "id": "Dan jika kamu ingin mengganti isterimu dengan isteri yang lain, sedang kamu telah memberikan kepada seseorang di antara mereka harta yang banyak, maka janganlah kamu mengambil kembali dari padanya barang sedikitpun. Apakah kamu akan mengambilnya kembali dengan jalan tuduhan yang dusta dan dengan (menanggung) dosa yang nyata?",
      "ar": "وَإِنۡ أَرَدتُّمُ ٱسۡتِبۡدَالَ زَوۡجࣲ مَّكَانَ زَوۡجࣲ وَءَاتَیۡتُمۡ إِحۡدَىٰهُنَّ قِنطَارࣰا فَلَا تَأۡخُذُوا۟ مِنۡهُ شَیۡـًٔاۚ أَتَأۡخُذُونَهُۥ بُهۡتَـٰنࣰا وَإِثۡمࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 514,
    "surahId": 4,
    "ayahNumber": 21,
    "arabicText": "وَكَیۡفَ تَأۡخُذُونَهُۥ وَقَدۡ أَفۡضَىٰ بَعۡضُكُمۡ إِلَىٰ بَعۡضࣲ وَأَخَذۡنَ مِنكُم مِّیثَـٰقًا غَلِیظࣰا\n",
    "translations": {
      "en": "And how could you take it away after you have given yourselves to one another, and she has received a most solemn pledge from you?",
      "ms": "Dan bagaimana kamu tergamak mengambil balik pemberian itu padahal kasih mesra kamu telah terjalin antara satu dengan yang lain, dan mereka pula (isteri-isteri kamu itu) telahpun mengambil perjanjian yang kuat daripada kamu?",
      "id": "Bagaimana kamu akan mengambilnya kembali, padahal sebagian kamu telah bergaul (bercampur) dengan yang lain sebagai suami-isteri. Dan mereka (isteri-isterimu) telah mengambil dari kamu perjanjian yang kuat.",
      "ar": "وَكَیۡفَ تَأۡخُذُونَهُۥ وَقَدۡ أَفۡضَىٰ بَعۡضُكُمۡ إِلَىٰ بَعۡضࣲ وَأَخَذۡنَ مِنكُم مِّیثَـٰقًا غَلِیظࣰا\n"
    }
  },
  {
    "id": 515,
    "surahId": 4,
    "ayahNumber": 22,
    "arabicText": "وَلَا تَنكِحُوا۟ مَا نَكَحَ ءَابَاۤؤُكُم مِّنَ ٱلنِّسَاۤءِ إِلَّا مَا قَدۡ سَلَفَۚ إِنَّهُۥ كَانَ فَـٰحِشَةࣰ وَمَقۡتࣰا وَسَاۤءَ سَبِیلًا\n",
    "translations": {
      "en": "AND DO NOT marry women whom your fathers have previously married - although what is past is past: this, verily, is a shameful deed, and a hateful thing, and an evil way.",
      "ms": "Dan janganlah kamu berkahwin (dengan perempuan-perempuan) yang telah diperisterikan oleh bapa kamu kecuali apa yang telah berlaku pada masa yang lalu. Sesungguhnya perbuatan itu adalah satu perkara yang keji, dan dibenci (oleh Allah), serta menjadi seburuk-buruk jalan (yang dilalui dalam perkahwinan).",
      "id": "Dan janganlah kamu kawini wanita-wanita yang telah dikawini oleh ayahmu, terkecuali pada masa yang telah lampau. Sesungguhnya perbuatan itu amat keji dan dibenci Allah dan seburuk-buruk jalan (yang ditempuh).",
      "ar": "وَلَا تَنكِحُوا۟ مَا نَكَحَ ءَابَاۤؤُكُم مِّنَ ٱلنِّسَاۤءِ إِلَّا مَا قَدۡ سَلَفَۚ إِنَّهُۥ كَانَ فَـٰحِشَةࣰ وَمَقۡتࣰا وَسَاۤءَ سَبِیلًا\n"
    }
  },
  {
    "id": 516,
    "surahId": 4,
    "ayahNumber": 23,
    "arabicText": "حُرِّمَتۡ عَلَیۡكُمۡ أُمَّهَـٰتُكُمۡ وَبَنَاتُكُمۡ وَأَخَوَ ٰ⁠تُكُمۡ وَعَمَّـٰتُكُمۡ وَخَـٰلَـٰتُكُمۡ وَبَنَاتُ ٱلۡأَخِ وَبَنَاتُ ٱلۡأُخۡتِ وَأُمَّهَـٰتُكُمُ ٱلَّـٰتِیۤ أَرۡضَعۡنَكُمۡ وَأَخَوَ ٰ⁠تُكُم مِّنَ ٱلرَّضَـٰعَةِ وَأُمَّهَـٰتُ نِسَاۤىِٕكُمۡ وَرَبَـٰۤىِٕبُكُمُ ٱلَّـٰتِی فِی حُجُورِكُم مِّن نِّسَاۤىِٕكُمُ ٱلَّـٰتِی دَخَلۡتُم بِهِنَّ فَإِن لَّمۡ تَكُونُوا۟ دَخَلۡتُم بِهِنَّ فَلَا جُنَاحَ عَلَیۡكُمۡ وَحَلَـٰۤىِٕلُ أَبۡنَاۤىِٕكُمُ ٱلَّذِینَ مِنۡ أَصۡلَـٰبِكُمۡ وَأَن تَجۡمَعُوا۟ بَیۡنَ ٱلۡأُخۡتَیۡنِ إِلَّا مَا قَدۡ سَلَفَۗ إِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "Forbidden to you are your mothers, and your daughters, and your sisters, and your aunts paternal and maternal, and a brother's daughters, and a sister's daughters; and your milk-mothers, and your milk-sisters; and the mothers of your wives; and your step-daughters - who are your foster children - born of your wives with whom you have consummated your marriage; but if you have not consummated your marriage, you will incur no sin [by marrying their daughters]; and [forbidden to you are] the spouses of the sons who have sprung from your loins; and [you are forbidden] to have two sisters [as your wives] at one and the same time - but what is past is past: for, behold, God is indeed much-forgiving, a dispenser of grace.",
      "ms": "Diharamkan kepada kamu berkahwin dengan (perempuan-perempuan yang berikut): ibu-ibu kamu, dan anak-anak kamu, dan saudara-saudara kamu, dan saudara-saudara bapa kamu, dan saudara-saudara ibu kamu dan anak-anak saudara kamu yang lelaki, dan anak-anak saudara kamu yang perempuan, dan ibu-ibu kamu yang telah menyusukan kamu, dan saudara-saudara susuan kamu, dan ibu-ibu isteri kamu, dan anak-anak tiri yang dalam pemuliharaan kamu dari isteri-isteri yang kamu telah campuri; tetapi kalau kamu belum campuri mereka (isteri kamu) itu (dan kamu telahpun menceraikan mereka), maka tiadalah salah kamu (berkahwin dengannya). Dan (haram juga kamu berkahwin dengan) bekas isteri anak-anak kamu sendiri yang berasal dari benih kamu. Dan diharamkan kamu menghimpunkan dua beradik sekali (untuk menjadi isteri-isteri kamu), kecuali yang telah berlaku pada masa yang lalu. Sesungguhnya Allah adalah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Diharamkan atas kamu (mengawini) ibu-ibumu; anak-anakmu yang perempuan; saudara-saudaramu yang perempuan, saudara-saudara bapakmu yang perempuan; saudara-saudara ibumu yang perempuan; anak-anak perempuan dari saudara-saudaramu yang laki-laki; anak-anak perempuan dari saudara-saudaramu yang perempuan; ibu-ibumu yang menyusui kamu; saudara perempuan sepersusuan; ibu-ibu isterimu (mertua); anak-anak isterimu yang dalam pemeliharaanmu dari isteri yang telah kamu campuri, tetapi jika kamu belum campur dengan isterimu itu (dan sudah kamu ceraikan), maka tidak berdosa kamu mengawininya; (dan diharamkan bagimu) isteri-isteri anak kandungmu (menantu); dan menghimpunkan (dalam perkawinan) dua perempuan yang bersaudara, kecuali yang telah terjadi pada masa lampau; sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "حُرِّمَتۡ عَلَیۡكُمۡ أُمَّهَـٰتُكُمۡ وَبَنَاتُكُمۡ وَأَخَوَ ٰ⁠تُكُمۡ وَعَمَّـٰتُكُمۡ وَخَـٰلَـٰتُكُمۡ وَبَنَاتُ ٱلۡأَخِ وَبَنَاتُ ٱلۡأُخۡتِ وَأُمَّهَـٰتُكُمُ ٱلَّـٰتِیۤ أَرۡضَعۡنَكُمۡ وَأَخَوَ ٰ⁠تُكُم مِّنَ ٱلرَّضَـٰعَةِ وَأُمَّهَـٰتُ نِسَاۤىِٕكُمۡ وَرَبَـٰۤىِٕبُكُمُ ٱلَّـٰتِی فِی حُجُورِكُم مِّن نِّسَاۤىِٕكُمُ ٱلَّـٰتِی دَخَلۡتُم بِهِنَّ فَإِن لَّمۡ تَكُونُوا۟ دَخَلۡتُم بِهِنَّ فَلَا جُنَاحَ عَلَیۡكُمۡ وَحَلَـٰۤىِٕلُ أَبۡنَاۤىِٕكُمُ ٱلَّذِینَ مِنۡ أَصۡلَـٰبِكُمۡ وَأَن تَجۡمَعُوا۟ بَیۡنَ ٱلۡأُخۡتَیۡنِ إِلَّا مَا قَدۡ سَلَفَۗ إِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 517,
    "surahId": 4,
    "ayahNumber": 24,
    "arabicText": "۞ وَٱلۡمُحۡصَنَـٰتُ مِنَ ٱلنِّسَاۤءِ إِلَّا مَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۖ كِتَـٰبَ ٱللَّهِ عَلَیۡكُمۡۚ وَأُحِلَّ لَكُم مَّا وَرَاۤءَ ذَ ٰ⁠لِكُمۡ أَن تَبۡتَغُوا۟ بِأَمۡوَ ٰ⁠لِكُم مُّحۡصِنِینَ غَیۡرَ مُسَـٰفِحِینَۚ فَمَا ٱسۡتَمۡتَعۡتُم بِهِۦ مِنۡهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِیضَةࣰۚ وَلَا جُنَاحَ عَلَیۡكُمۡ فِیمَا تَرَ ٰ⁠ضَیۡتُم بِهِۦ مِنۢ بَعۡدِ ٱلۡفَرِیضَةِۚ إِنَّ ٱللَّهَ كَانَ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "And [forbidden to you are] all married women other than those whom you rightfully possess [through wedlock]: this is God's ordinance, binding upon you. But lawful to you are all [women] beyond these, for you to seek out, offering them of your possessions, taking them in honest wedlock, and not in fornication. And unto those with whom you desire to enjoy marriage, you shall give the dowers due to them; but you will incur no sin if, after [having agreed upon] this lawful due, you freely agree with one another upon anything [else]: behold, God is indeed all-knowing, wise.",
      "ms": "Dan (diharamkan juga kamu berkahwin dengan) perempuan-perempuan isteri orang, kecuali hamba sahaya yang kamu miliki. (Haramnya segala yang tersebut itu) ialah suatu ketetapan hukum Allah (yang diwajibkan) atas kamu. Dan (sebaliknya) dihalalkan bagi kamu perempuan-perempuan yang lain daripada yang tersebut itu, untuk kamu mencari (isteri) dengan harta kamu secara bernikah, bukan secara berzina. Kemudian mana-mana perempuan yang kamu nikmati percampuran dengannya (setelah ia menjadi isteri kamu), maka berikanlah kepada mereka maskahwinnya (dengan sempurna), sebagai suatu ketetapan (yang diwajibkan oleh Allah). Dan tiadalah kamu berdosa mengenai sesuatu persetujuan yang telah dicapai bersama oleh kamu (suami isteri), sesudah ditetapkan maskahwin itu (tentang cara dan kadar pembayarannya). Sesungguhnya Allah Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "dan (diharamkan juga kamu mengawini) wanita yang bersuami, kecuali budak-budak yang kamu miliki (Allah telah menetapkan hukum itu) sebagai ketetapan-Nya atas kamu. Dan dihalalkan bagi kamu selain yang demikian (yaitu) mencari isteri-isteri dengan hartamu untuk dikawini bukan untuk berzina. Maka isteri-isteri yang telah kamu nikmati (campuri) di antara mereka, berikanlah kepada mereka maharnya (dengan sempurna), sebagai suatu kewajiban; dan tiadalah mengapa bagi kamu terhadap sesuatu yang kamu telah saling merelakannya, sesudah menentukan mahar itu. Sesungguhnya Allah Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "۞ وَٱلۡمُحۡصَنَـٰتُ مِنَ ٱلنِّسَاۤءِ إِلَّا مَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۖ كِتَـٰبَ ٱللَّهِ عَلَیۡكُمۡۚ وَأُحِلَّ لَكُم مَّا وَرَاۤءَ ذَ ٰ⁠لِكُمۡ أَن تَبۡتَغُوا۟ بِأَمۡوَ ٰ⁠لِكُم مُّحۡصِنِینَ غَیۡرَ مُسَـٰفِحِینَۚ فَمَا ٱسۡتَمۡتَعۡتُم بِهِۦ مِنۡهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِیضَةࣰۚ وَلَا جُنَاحَ عَلَیۡكُمۡ فِیمَا تَرَ ٰ⁠ضَیۡتُم بِهِۦ مِنۢ بَعۡدِ ٱلۡفَرِیضَةِۚ إِنَّ ٱللَّهَ كَانَ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 518,
    "surahId": 4,
    "ayahNumber": 25,
    "arabicText": "وَمَن لَّمۡ یَسۡتَطِعۡ مِنكُمۡ طَوۡلًا أَن یَنكِحَ ٱلۡمُحۡصَنَـٰتِ ٱلۡمُؤۡمِنَـٰتِ فَمِن مَّا مَلَكَتۡ أَیۡمَـٰنُكُم مِّن فَتَیَـٰتِكُمُ ٱلۡمُؤۡمِنَـٰتِۚ وَٱللَّهُ أَعۡلَمُ بِإِیمَـٰنِكُمۚ بَعۡضُكُم مِّنۢ بَعۡضࣲۚ فَٱنكِحُوهُنَّ بِإِذۡنِ أَهۡلِهِنَّ وَءَاتُوهُنَّ أُجُورَهُنَّ بِٱلۡمَعۡرُوفِ مُحۡصَنَـٰتٍ غَیۡرَ مُسَـٰفِحَـٰتࣲ وَلَا مُتَّخِذَ ٰ⁠تِ أَخۡدَانࣲۚ فَإِذَاۤ أُحۡصِنَّ فَإِنۡ أَتَیۡنَ بِفَـٰحِشَةࣲ فَعَلَیۡهِنَّ نِصۡفُ مَا عَلَى ٱلۡمُحۡصَنَـٰتِ مِنَ ٱلۡعَذَابِۚ ذَ ٰ⁠لِكَ لِمَنۡ خَشِیَ ٱلۡعَنَتَ مِنكُمۡۚ وَأَن تَصۡبِرُوا۟ خَیۡرࣱ لَّكُمۡۗ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "And as for those of you who, owing to cir­cumstances, are not in a position to marry free believing women, [let them marry] believing maidens from among those whom you rightfully possess. And God knows all about your faith; each one of you is an issue of the other. Marry them, then, with their people's leave, and give them their dowers in an equitable manner - they being women who give themselves in honest wedlock, not in fornication, nor as secret love-companions. And when they are married, and thereafter become guilty of immoral conduct, they shall be liable to half the penalty to which free married women are liable. This [permission to marry slave-girls applies] to those of you who fear lest they stumble into evil. But it is for your own good to persevere in patience [and to abstain from such marriages]: and God is much-forgiving, a dispenser of grace.",
      "ms": "Dan sesiapa di antara kamu yang tidak mempunyai kemampuan yang cukup untuk berkahwin dengan perempuan-perempuan yang baik-baik (yang merdeka, yang terpelihara kehormatannya) lagi beriman, maka bolehlah kamu berkahwin dengan hamba-hamba perempuan yang beriman yang kamu miliki. Dan Allah lebih mengetahui akan iman kamu; kamu masing-masing (suami yang merdeka dan isteri dari hamba - abdi itu) adalah berasal sama (dari Adam, dan seugama pula). Oleh itu berkahwinlah dengan mereka dengan izin walinya serta berikanlah maskahwinnya menurut yang patut. Mereka (hamba-hamba perempuan yang akan dijadikan isteri, hendaklah) yang sopan bukan perempuan-perempuan lacur, dan bukan pula yang mengambil lelaki sebagai teman simpanan. Kemudian setelah mereka (hamba-hamba perempuan itu) berkahwin, lalu mereka melakukan perbuatan keji (zina), maka mereka dikenakan separuh dari (hukuman) seksa yang ditetapkan ke atas perempuan-perempuan yang merdeka. (Hukum perkahwinan) yang demikian (yang membolehkan seseorang berkahwin dengan hamba-hamba perempuan) itu ialah bagi orang-orang yang bimbang melakukan zina di antara kamu; dan sabarnya kamu (tidak berkahwin dengan hamba-hamba perempuan) itu adalah lebih baik bagi kamu. Dan (ingatlah), Allah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Dan barangsiapa diantara kamu (orang merdeka) yang tidak cukup perbelanjaannya untuk mengawini wanita merdeka lagi beriman, ia boleh mengawini wanita yang beriman, dari budak-budak yang kamu miliki. Allah mengetahui keimananmu; sebahagian kamu adalah dari sebahagian yang lain, karena itu kawinilah mereka dengan seizin tuan mereka, dan berilah maskawin mereka menurut yang patut, sedang merekapun wanita-wanita yang memelihara diri, bukan pezina dan bukan (pula) wanita yang mengambil laki-laki lain sebagai piaraannya; dan apabila mereka telah menjaga diri dengan kawin, kemudian mereka melakukan perbuatan yang keji (zina), maka atas mereka separo hukuman dari hukuman wanita-wanita merdeka yang bersuami. (Kebolehan mengawini budak) itu, adalah bagi orang-orang yang takut kepada kemasyakatan menjaga diri (dari perbuatan zina) di antara kamu, dan kesabaran itu lebih baik bagimu. Dan Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "وَمَن لَّمۡ یَسۡتَطِعۡ مِنكُمۡ طَوۡلًا أَن یَنكِحَ ٱلۡمُحۡصَنَـٰتِ ٱلۡمُؤۡمِنَـٰتِ فَمِن مَّا مَلَكَتۡ أَیۡمَـٰنُكُم مِّن فَتَیَـٰتِكُمُ ٱلۡمُؤۡمِنَـٰتِۚ وَٱللَّهُ أَعۡلَمُ بِإِیمَـٰنِكُمۚ بَعۡضُكُم مِّنۢ بَعۡضࣲۚ فَٱنكِحُوهُنَّ بِإِذۡنِ أَهۡلِهِنَّ وَءَاتُوهُنَّ أُجُورَهُنَّ بِٱلۡمَعۡرُوفِ مُحۡصَنَـٰتٍ غَیۡرَ مُسَـٰفِحَـٰتࣲ وَلَا مُتَّخِذَ ٰ⁠تِ أَخۡدَانࣲۚ فَإِذَاۤ أُحۡصِنَّ فَإِنۡ أَتَیۡنَ بِفَـٰحِشَةࣲ فَعَلَیۡهِنَّ نِصۡفُ مَا عَلَى ٱلۡمُحۡصَنَـٰتِ مِنَ ٱلۡعَذَابِۚ ذَ ٰ⁠لِكَ لِمَنۡ خَشِیَ ٱلۡعَنَتَ مِنكُمۡۚ وَأَن تَصۡبِرُوا۟ خَیۡرࣱ لَّكُمۡۗ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 519,
    "surahId": 4,
    "ayahNumber": 26,
    "arabicText": "یُرِیدُ ٱللَّهُ لِیُبَیِّنَ لَكُمۡ وَیَهۡدِیَكُمۡ سُنَنَ ٱلَّذِینَ مِن قَبۡلِكُمۡ وَیَتُوبَ عَلَیۡكُمۡۗ وَٱللَّهُ عَلِیمٌ حَكِیمࣱ\n",
    "translations": {
      "en": "God wants to make [all this] clear unto you, and to guide you onto the [righteous] ways of life of those who preceded you, and to turn unto you in His mercy: for God is all-knowing, wise.",
      "ms": "Allah menghendaki (dengan apa yang telah diharamkan dan dihalalkan dari kaum perempuan itu) ialah untuk menerangkan (SyariatNya) dan untuk menunjukkan kepada kamu jalan-jalan aturan orang-orang yang dahulu daripada kamu (Nabi-nabi dan orang-orang yang soleh, supaya kamu mengikutinya), dan juga untuk menerima taubat kamu. Dan (ingatlah) Allah Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "Allah hendak menerangkan (hukum syari'at-Nya) kepadamu, dan menunjukimu kepada jalan-jalan orang yang sebelum kamu (para nabi dan shalihin) dan (hendak) menerima taubatmu. Dan Allah Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "یُرِیدُ ٱللَّهُ لِیُبَیِّنَ لَكُمۡ وَیَهۡدِیَكُمۡ سُنَنَ ٱلَّذِینَ مِن قَبۡلِكُمۡ وَیَتُوبَ عَلَیۡكُمۡۗ وَٱللَّهُ عَلِیمٌ حَكِیمࣱ\n"
    }
  },
  {
    "id": 520,
    "surahId": 4,
    "ayahNumber": 27,
    "arabicText": "وَٱللَّهُ یُرِیدُ أَن یَتُوبَ عَلَیۡكُمۡ وَیُرِیدُ ٱلَّذِینَ یَتَّبِعُونَ ٱلشَّهَوَ ٰ⁠تِ أَن تَمِیلُوا۟ مَیۡلًا عَظِیمࣰا\n",
    "translations": {
      "en": "And God wants to turn unto you in His mercy, whereas those who follow [only] their own lusts want you to drift far away from the right path.",
      "ms": "Dan Allah hendak (membersihkan kamu dari dosa dengan) menerima taubat kamu, sedang orang-orang (yang fasik) yang menurut keinginan hawa nafsu (yang diharamkan oleh Allah itu) hendak mendorong kamu supaya kamu menyeleweng (dari kebenaran) dengan penyelewengan yang besar bahayanya.",
      "id": "Dan Allah hendak menerima taubatmu, sedang orang-orang yang mengikuti hawa nafsunya bermaksud supaya kamu berpaling sejauh-jauhnya (dari kebenaran).",
      "ar": "وَٱللَّهُ یُرِیدُ أَن یَتُوبَ عَلَیۡكُمۡ وَیُرِیدُ ٱلَّذِینَ یَتَّبِعُونَ ٱلشَّهَوَ ٰ⁠تِ أَن تَمِیلُوا۟ مَیۡلًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 521,
    "surahId": 4,
    "ayahNumber": 28,
    "arabicText": "یُرِیدُ ٱللَّهُ أَن یُخَفِّفَ عَنكُمۡۚ وَخُلِقَ ٱلۡإِنسَـٰنُ ضَعِیفࣰا\n",
    "translations": {
      "en": "God wants to lighten your burdens: for man has been created weak.",
      "ms": "Allah (sentiasa) hendak meringankan (beban hukumnya) daripada kamu, kerana manusia itu dijadikan berkeadaan lemah.",
      "id": "Allah hendak memberikan keringanan kepadamu, dan manusia dijadikan bersifat lemah.",
      "ar": "یُرِیدُ ٱللَّهُ أَن یُخَفِّفَ عَنكُمۡۚ وَخُلِقَ ٱلۡإِنسَـٰنُ ضَعِیفࣰا\n"
    }
  },
  {
    "id": 522,
    "surahId": 4,
    "ayahNumber": 29,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَأۡكُلُوۤا۟ أَمۡوَ ٰ⁠لَكُم بَیۡنَكُم بِٱلۡبَـٰطِلِ إِلَّاۤ أَن تَكُونَ تِجَـٰرَةً عَن تَرَاضࣲ مِّنكُمۡۚ وَلَا تَقۡتُلُوۤا۟ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِیمࣰا\n",
    "translations": {
      "en": "O YOU who have attained to faith! Do not devour one another's possessions wrongfully - not even by way of trade based on mutual agreement - and do not destroy one another: for, behold, God is indeed a dispenser of grace unto you!",
      "ms": "Wahai orang-orang yang beriman, janganlah kamu makan (gunakan) harta-harta kamu sesama kamu dengan jalan yang salah (tipu, judi dan sebagainya), kecuali dengan jalan perniagaan yang dilakukan secara suka sama suka di antara kamu, dan janganlah kamu berbunuh-bunuhan sesama sendiri. Sesungguhnya Allah sentiasa Mengasihani kamu.",
      "id": "Hai orang-orang yang beriman, janganlah kamu saling memakan harta sesamamu dengan jalan yang batil, kecuali dengan jalan perniagaan yang berlaku dengan suka sama-suka di antara kamu. Dan janganlah kamu membunuh dirimu; sesungguhnya Allah adalah Maha Penyayang kepadamu.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَأۡكُلُوۤا۟ أَمۡوَ ٰ⁠لَكُم بَیۡنَكُم بِٱلۡبَـٰطِلِ إِلَّاۤ أَن تَكُونَ تِجَـٰرَةً عَن تَرَاضࣲ مِّنكُمۡۚ وَلَا تَقۡتُلُوۤا۟ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِیمࣰا\n"
    }
  },
  {
    "id": 523,
    "surahId": 4,
    "ayahNumber": 30,
    "arabicText": "وَمَن یَفۡعَلۡ ذَ ٰ⁠لِكَ عُدۡوَ ٰ⁠نࣰا وَظُلۡمࣰا فَسَوۡفَ نُصۡلِیهِ نَارࣰاۚ وَكَانَ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرًا\n",
    "translations": {
      "en": "And as for him who does this with malicious intent and a will to do wrong - him shall We, in time, cause to endure [suffering through] fire: for this is indeed easy for God.",
      "ms": "Dan sesiapa berbuat demikian dengan menceroboh dan aniaya, maka kami akan masukkan dia ke dalam api neraka, dan balasan yang sedemikian itu adalah mudah bagi Allah, (tidak ada sesiapapun yang dapat menghalangnya).",
      "id": "Dan barangsiapa berbuat demikian dengan melanggar hak dan aniaya, maka Kami kelak akan memasukkannya ke dalam neraka. Yang demikian itu adalah mudah bagi Allah.",
      "ar": "وَمَن یَفۡعَلۡ ذَ ٰ⁠لِكَ عُدۡوَ ٰ⁠نࣰا وَظُلۡمࣰا فَسَوۡفَ نُصۡلِیهِ نَارࣰاۚ وَكَانَ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرًا\n"
    }
  },
  {
    "id": 524,
    "surahId": 4,
    "ayahNumber": 31,
    "arabicText": "إِن تَجۡتَنِبُوا۟ كَبَاۤىِٕرَ مَا تُنۡهَوۡنَ عَنۡهُ نُكَفِّرۡ عَنكُمۡ سَیِّـَٔاتِكُمۡ وَنُدۡخِلۡكُم مُّدۡخَلࣰا كَرِیمࣰا\n",
    "translations": {
      "en": "If you avoid the great sins, which you have been enjoined to shun, We shall efface your [minor] bad deeds, and shall cause you to enter an abode of glory.",
      "ms": "Jika kamu menjauhkan dosa-dosa besar yang dilarang kamu melakukannya, Kami akan ampunkan kesalahan-kesalahan (dosa kecil) kamu, dan kami akan masukkan kamu ke tempat yang mulia (syurga).",
      "id": "Jika kamu menjauhi dosa-dosa besar di antara dosa-dosa yang dilarang kamu mengerjakannya, niscaya Kami hapus kesalahan-kesalahanmu (dosa-dosamu yang kecil) dan Kami masukkan kamu ke tempat yang mulia (surga).",
      "ar": "إِن تَجۡتَنِبُوا۟ كَبَاۤىِٕرَ مَا تُنۡهَوۡنَ عَنۡهُ نُكَفِّرۡ عَنكُمۡ سَیِّـَٔاتِكُمۡ وَنُدۡخِلۡكُم مُّدۡخَلࣰا كَرِیمࣰا\n"
    }
  },
  {
    "id": 525,
    "surahId": 4,
    "ayahNumber": 32,
    "arabicText": "وَلَا تَتَمَنَّوۡا۟ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعۡضَكُمۡ عَلَىٰ بَعۡضࣲۚ لِّلرِّجَالِ نَصِیبࣱ مِّمَّا ٱكۡتَسَبُوا۟ۖ وَلِلنِّسَاۤءِ نَصِیبࣱ مِّمَّا ٱكۡتَسَبۡنَۚ وَسۡـَٔلُوا۟ ٱللَّهَ مِن فَضۡلِهِۦۤۚ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَیۡءٍ عَلِیمࣰا\n",
    "translations": {
      "en": "Hence, do not covet the bounties which God has bestowed more abundantly on some of you than on others. Men shall have a benefit from what they earn, and women shall have a benefit from what they earn. Ask, therefore, God [to give you] out of His bounty: behold, God has indeed full knowledge of everything.",
      "ms": "Dan janganlah kamu terlalu mengharapkan (ingin mendapat) limpah kurnia yang Allah telah berikan kepada sebahagian dari kamu (untuk menjadikan mereka) melebihi sebahagian yang lain (tentang harta benda, ilmu pengetahuan atau pangkat kebesaran). (Kerana telah tetap) orang-orang lelaki ada bahagian dari apa yang mereka usahakan, dan orang-orang perempuan pula ada bahagian dari apa yang mereka usahakan; (maka berusahalah kamu) dan pohonkanlah kepada Allah akan limpah kurnianya. Sesungguhnya Allah sentiasa Mengetahui akan tiap-tiap sesuatu.",
      "id": "Dan janganlah kamu iri hati terhadap apa yang dikaruniakan Allah kepada sebahagian kamu lebih banyak dari sebahagian yang lain. (Karena) bagi orang laki-laki ada bahagian dari pada apa yang mereka usahakan, dan bagi para wanita (pun) ada bahagian dari apa yang mereka usahakan, dan mohonlah kepada Allah sebagian dari karunia-Nya. Sesungguhnya Allah Maha Mengetahui segala sesuatu.",
      "ar": "وَلَا تَتَمَنَّوۡا۟ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعۡضَكُمۡ عَلَىٰ بَعۡضࣲۚ لِّلرِّجَالِ نَصِیبࣱ مِّمَّا ٱكۡتَسَبُوا۟ۖ وَلِلنِّسَاۤءِ نَصِیبࣱ مِّمَّا ٱكۡتَسَبۡنَۚ وَسۡـَٔلُوا۟ ٱللَّهَ مِن فَضۡلِهِۦۤۚ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَیۡءٍ عَلِیمࣰا\n"
    }
  },
  {
    "id": 526,
    "surahId": 4,
    "ayahNumber": 33,
    "arabicText": "وَلِكُلࣲّ جَعَلۡنَا مَوَ ٰ⁠لِیَ مِمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَۚ وَٱلَّذِینَ عَقَدَتۡ أَیۡمَـٰنُكُمۡ فَـَٔاتُوهُمۡ نَصِیبَهُمۡۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَیۡءࣲ شَهِیدًا\n",
    "translations": {
      "en": "And unto everyone have We appointed heirs to what he may leave behind: parents, and near kinsfolk, and those to whom you have pledged your troth give them, therefore, their share. Behold, God is indeed a witness unto everything.",
      "ms": "Dan bagi tiap-tiap (lelaki dan perempuan yang telah mati), kami telah tetapkan orang-orang yang berhak mewarisi peninggalannya iaitu ibu bapa dan kerabat yang dekat. Dan mana-mana orang yang kamu telah membuat ikatan setia dengan mereka (untuk bantu-membantu dalam masa kecemasan dan kesusahan) maka berikanlah kepada mereka bahagiannya. Sesungguhnya Allah sentiasa Menyaksikan tiap-tiap sesuatu.",
      "id": "Bagi tiap-tiap harta peninggalan dari harta yang ditinggalkan ibu bapak dan karib kerabat, Kami jadikan pewaris-pewarisnya. Dan (jika ada) orang-orang yang kamu telah bersumpah setia dengan mereka, maka berilah kepada mereka bahagiannya. Sesungguhnya Allah menyaksikan segala sesuatu.",
      "ar": "وَلِكُلࣲّ جَعَلۡنَا مَوَ ٰ⁠لِیَ مِمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَۚ وَٱلَّذِینَ عَقَدَتۡ أَیۡمَـٰنُكُمۡ فَـَٔاتُوهُمۡ نَصِیبَهُمۡۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَیۡءࣲ شَهِیدًا\n"
    }
  },
  {
    "id": 527,
    "surahId": 4,
    "ayahNumber": 34,
    "arabicText": "ٱلرِّجَالُ قَوَّ ٰ⁠مُونَ عَلَى ٱلنِّسَاۤءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضࣲ وَبِمَاۤ أَنفَقُوا۟ مِنۡ أَمۡوَ ٰ⁠لِهِمۡۚ فَٱلصَّـٰلِحَـٰتُ قَـٰنِتَـٰتٌ حَـٰفِظَـٰتࣱ لِّلۡغَیۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّـٰتِی تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِی ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُوا۟ عَلَیۡهِنَّ سَبِیلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِیࣰّا كَبِیرࣰا\n",
    "translations": {
      "en": "MEN SHALL take full care of women with the bounties which God has bestowed more abundantly on the former than on the latter, and with what they may spend out of their possessions. And the right­eous women are the truly devout ones, who guard the intimacy which God has [ordained to be] guar­ded. And as for those women whose ill-will you have reason to fear, admonish them [first]; then leave them alone in bed; then beat them; and if thereupon they pay you heed, do not seek to harm them. Behold, God is indeed most high, great!",
      "ms": "Kaum lelaki itu adalah pemimpin dan pengawal yang bertanggungjawab terhadap kaum perempuan, oleh kerana Allah telah melebihkan orang-orang lelaki (dengan beberapa keistimewaan) atas orang-orang perempuan, dan juga kerana orang-orang lelaki telah membelanjakan (memberi nafkah) sebahagian dari harta mereka. Maka perempuan-perempuan yang soleh itu ialah yang taat (kepada Allah dan suaminya), dan yang memelihara (kehormatan dirinya dan apa jua yang wajib dipelihara) ketika suami tidak hadir bersama, dengan pemuliharaan Allah dan pertolonganNya. Dan perempuan-perempuan yang kamu bimbang melakukan perbuatan derhaka (nusyuz) hendaklah kamu menasihati mereka, dan (jika mereka berdegil) pulaukanlah mereka di tempat tidur, dan (kalau juga mereka masih degil) pukulah mereka (dengan pukulan ringan yang bertujuan mengajarnya). Kemudian jika mereka taat kepada kamu, maka janganlah kamu mencari-cari jalan untuk menyusahkan mereka. Sesungguhnya Allah Maha Tinggi, lagi Maha Besar.",
      "id": "Kaum laki-laki itu adalah pemimpin bagi kaum wanita, oleh karena Allah telah melebihkan sebahagian mereka (laki-laki) atas sebahagian yang lain (wanita), dan karena mereka (laki-laki) telah menafkahkan sebagian dari harta mereka. Sebab itu maka wanita yang saleh, ialah yang taat kepada Allah lagi memelihara diri ketika suaminya tidak ada, oleh karena Allah telah memelihara (mereka). Wanita-wanita yang kamu khawatirkan nusyuznya, maka nasehatilah mereka dan pisahkanlah mereka di tempat tidur mereka, dan pukullah mereka. Kemudian jika mereka mentaatimu, maka janganlah kamu mencari-cari jalan untuk menyusahkannya. Sesungguhnya Allah Maha Tinggi lagi Maha Besar.",
      "ar": "ٱلرِّجَالُ قَوَّ ٰ⁠مُونَ عَلَى ٱلنِّسَاۤءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضࣲ وَبِمَاۤ أَنفَقُوا۟ مِنۡ أَمۡوَ ٰ⁠لِهِمۡۚ فَٱلصَّـٰلِحَـٰتُ قَـٰنِتَـٰتٌ حَـٰفِظَـٰتࣱ لِّلۡغَیۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّـٰتِی تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِی ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُوا۟ عَلَیۡهِنَّ سَبِیلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِیࣰّا كَبِیرࣰا\n"
    }
  },
  {
    "id": 528,
    "surahId": 4,
    "ayahNumber": 35,
    "arabicText": "وَإِنۡ خِفۡتُمۡ شِقَاقَ بَیۡنِهِمَا فَٱبۡعَثُوا۟ حَكَمࣰا مِّنۡ أَهۡلِهِۦ وَحَكَمࣰا مِّنۡ أَهۡلِهَاۤ إِن یُرِیدَاۤ إِصۡلَـٰحࣰا یُوَفِّقِ ٱللَّهُ بَیۡنَهُمَاۤۗ إِنَّ ٱللَّهَ كَانَ عَلِیمًا خَبِیرࣰا\n",
    "translations": {
      "en": "And if you have reason to fear that a breach might occur between a [married] couple, appoint an arbiter from among his people and an arbiter from among her people; if they both want to set things aright, God may bring about their reconciliation. Be­hold, God is indeed all-knowing, aware.",
      "ms": "Dan jika kamu bimbangkan perpecahan di antara mereka berdua (suami isteri) maka lantiklah \"orang tengah\" (untuk mendamaikan mereka, iaitu), seorang dari keluarga lelaki dan seorang dari keluarga perempuan. Jika kedua-dua \"orang tengah\" itu (dengan ikhlas) bertujuan hendak mendamaikan, nescaya Allah akan menjadikan kedua (suami isteri itu) berpakat baik. Sesungguhnya Allah sentiasa Mengetahui, lagi Amat mendalam pengetahuanNya.",
      "id": "Dan jika kamu khawatirkan ada persengketaan antara keduanya, maka kirimlah seorang hakam dari keluarga laki-laki dan seorang hakam dari keluarga perempuan. Jika kedua orang hakam itu bermaksud mengadakan perbaikan, niscaya Allah memberi taufik kepada suami-isteri itu. Sesungguhnya Allah Maha Mengetahui lagi Maha Mengenal.",
      "ar": "وَإِنۡ خِفۡتُمۡ شِقَاقَ بَیۡنِهِمَا فَٱبۡعَثُوا۟ حَكَمࣰا مِّنۡ أَهۡلِهِۦ وَحَكَمࣰا مِّنۡ أَهۡلِهَاۤ إِن یُرِیدَاۤ إِصۡلَـٰحࣰا یُوَفِّقِ ٱللَّهُ بَیۡنَهُمَاۤۗ إِنَّ ٱللَّهَ كَانَ عَلِیمًا خَبِیرࣰا\n"
    }
  },
  {
    "id": 529,
    "surahId": 4,
    "ayahNumber": 36,
    "arabicText": "۞ وَٱعۡبُدُوا۟ ٱللَّهَ وَلَا تُشۡرِكُوا۟ بِهِۦ شَیۡـࣰٔاۖ وَبِٱلۡوَ ٰ⁠لِدَیۡنِ إِحۡسَـٰنࣰا وَبِذِی ٱلۡقُرۡبَىٰ وَٱلۡیَتَـٰمَىٰ وَٱلۡمَسَـٰكِینِ وَٱلۡجَارِ ذِی ٱلۡقُرۡبَىٰ وَٱلۡجَارِ ٱلۡجُنُبِ وَٱلصَّاحِبِ بِٱلۡجَنۢبِ وَٱبۡنِ ٱلسَّبِیلِ وَمَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۗ إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ مُخۡتَالࣰا فَخُورًا\n",
    "translations": {
      "en": "AND WORSHIP God [alone], and do not ascribe divinity, in any way, to aught beside Him. And do good unto your parents, and near of kin, and unto orphans, and the needy, and the neighbour from among your own people, and the neighbour who is a stranger, and the friend by your side, and the wayfarer, and those whom you rightfully possess. Verily, God does not love any of those who, full of self-conceit, act in a boastful manner;",
      "ms": "Dan hendaklah kamu beribadat kepada Allah dan janganlah kamu sekutukan Dia dengan sesuatu apa jua; dan hendaklah kamu berbuat baik kepada kedua ibu bapa, dan kaum kerabat, dan anak-anak yatim, dan orang-orang miskin, dan jiran tetangga yang dekat, dan jiran tetangga yang jauh, dan rakan sejawat, dan orang musafir yang terlantar, dan juga hamba yang kamu miliki. Sesungguhnya Allah tidak suka kepada orang-orang yang sombong takbur dan membangga-banggakan diri;",
      "id": "Sembahlah Allah dan janganlah kamu mempersekutukan-Nya dengan sesuatupun. Dan berbuat baiklah kepada dua orang ibu-bapa, karib-kerabat, anak-anak yatim, orang-orang miskin, tetangga yang dekat dan tetangga yang jauh, dan teman sejawat, ibnu sabil dan hamba sahayamu. Sesungguhnya Allah tidak menyukai orang-orang yang sombong dan membangga-banggakan diri,",
      "ar": "۞ وَٱعۡبُدُوا۟ ٱللَّهَ وَلَا تُشۡرِكُوا۟ بِهِۦ شَیۡـࣰٔاۖ وَبِٱلۡوَ ٰ⁠لِدَیۡنِ إِحۡسَـٰنࣰا وَبِذِی ٱلۡقُرۡبَىٰ وَٱلۡیَتَـٰمَىٰ وَٱلۡمَسَـٰكِینِ وَٱلۡجَارِ ذِی ٱلۡقُرۡبَىٰ وَٱلۡجَارِ ٱلۡجُنُبِ وَٱلصَّاحِبِ بِٱلۡجَنۢبِ وَٱبۡنِ ٱلسَّبِیلِ وَمَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۗ إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ مُخۡتَالࣰا فَخُورًا\n"
    }
  },
  {
    "id": 530,
    "surahId": 4,
    "ayahNumber": 37,
    "arabicText": "ٱلَّذِینَ یَبۡخَلُونَ وَیَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِ وَیَكۡتُمُونَ مَاۤ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n",
    "translations": {
      "en": "[nor] those who are niggardly, and bid others to be niggardly, and conceal whatever God has bestowed upon them out of His bounty; and so We have readied shameful suffering for all who thus deny the truth.",
      "ms": "Iaitu orang-orang yang bakhil dan menyuruh manusia supaya bakhil serta menyembunyikan apa-apa jua yang Allah berikan kepada mereka dari limpah kurnianya. Dan (sebenarnya) Kami telah sediakan bagi orang-orang kafir itu azab seksa yang amat menghina;",
      "id": "(yaitu) orang-orang yang kikir, dan menyuruh orang lain berbuat kikir, dan menyembunyikan karunia Allah yang telah diberikan-Nya kepada mereka. Dan Kami telah menyediakan untuk orang-orang kafir siksa yang menghinakan.",
      "ar": "ٱلَّذِینَ یَبۡخَلُونَ وَیَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِ وَیَكۡتُمُونَ مَاۤ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n"
    }
  },
  {
    "id": 531,
    "surahId": 4,
    "ayahNumber": 38,
    "arabicText": "وَٱلَّذِینَ یُنفِقُونَ أَمۡوَ ٰ⁠لَهُمۡ رِئَاۤءَ ٱلنَّاسِ وَلَا یُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡیَوۡمِ ٱلۡـَٔاخِرِۗ وَمَن یَكُنِ ٱلشَّیۡطَـٰنُ لَهُۥ قَرِینࣰا فَسَاۤءَ قَرِینࣰا\n",
    "translations": {
      "en": "And [God does not love] those who spend their possessions on others [only] to be seen and praised by men, the while they believe neither in God nor in the Last Day; and he who has Satan for a soul-mate, how evil a soul-mate has he!",
      "ms": "Dan juga orang-orang yang membelanjakan hartanya dengan menunjuk-nunjuk kepada manusia (riak), dan mereka tidak pula beriman kepada Allah dan tidak juga beriman kepada hari akhirat. Dan sesiapa yang (mengambil) Syaitan itu menjadi kawannya, maka seburuk-buruk kawan ialah syaitan.",
      "id": "Dan (juga) orang-orang yang menafkahkan harta-harta mereka karena riya kepada manusia, dan orang-orang yang tidak beriman kepada Allah dan kepada hari kemudian. Barangsiapa yang mengambil syaitan itu menjadi temannya, maka syaitan itu adalah teman yang seburuk-buruknya.",
      "ar": "وَٱلَّذِینَ یُنفِقُونَ أَمۡوَ ٰ⁠لَهُمۡ رِئَاۤءَ ٱلنَّاسِ وَلَا یُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡیَوۡمِ ٱلۡـَٔاخِرِۗ وَمَن یَكُنِ ٱلشَّیۡطَـٰنُ لَهُۥ قَرِینࣰا فَسَاۤءَ قَرِینࣰا\n"
    }
  },
  {
    "id": 532,
    "surahId": 4,
    "ayahNumber": 39,
    "arabicText": "وَمَاذَا عَلَیۡهِمۡ لَوۡ ءَامَنُوا۟ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ وَأَنفَقُوا۟ مِمَّا رَزَقَهُمُ ٱللَّهُۚ وَكَانَ ٱللَّهُ بِهِمۡ عَلِیمًا\n",
    "translations": {
      "en": "And what would they have to fear if they would but believe in God and the Last Day, and spend [in His way] out of what God has granted them as sustenance - since God has indeed full knowledge of them?",
      "ms": "Dan apakah (kerugian) yang akan menimpa mereka jika mereka beriman kepada Allah dan hari akhirat, serta mereka mendermakan sebahagian dari apa yang telah dikurniakan Allah kepada mereka? Dan (ingatlah) Allah sentiasa Mengetahui akan keadaan mereka.",
      "id": "Apakah kemudharatannya bagi mereka, kalau mereka beriman kepada Allah dan hari kemudian dan menafkahkan sebahagian rezeki yang telah diberikan Allah kepada mereka? Dan adalah Allah Maha Mengetahui keadaan mereka.",
      "ar": "وَمَاذَا عَلَیۡهِمۡ لَوۡ ءَامَنُوا۟ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ وَأَنفَقُوا۟ مِمَّا رَزَقَهُمُ ٱللَّهُۚ وَكَانَ ٱللَّهُ بِهِمۡ عَلِیمًا\n"
    }
  },
  {
    "id": 533,
    "surahId": 4,
    "ayahNumber": 40,
    "arabicText": "إِنَّ ٱللَّهَ لَا یَظۡلِمُ مِثۡقَالَ ذَرَّةࣲۖ وَإِن تَكُ حَسَنَةࣰ یُضَـٰعِفۡهَا وَیُؤۡتِ مِن لَّدُنۡهُ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "Verily, God does not wrong [anyone] by as much as an atom's weight; and if there be a good deed, He will multiply it, and will bestow out of His grace a mighty reward.",
      "ms": "Sesungguhnya Allah tidak sekali-kali menganiaya (seseorang) sekalipun seberat zarah (debu). Dan kalaulah (amal yang seberat zarrah) itu amal kebajikan, nescaya akan menggandakannya dan akan memberi, dari sisiNya, pahala yang amat besar.",
      "id": "Sesungguhnya Allah tidak menganiaya seseorang walaupun sebesar zarrah, dan jika ada kebajikan sebesar zarrah, niscaya Allah akan melipat gandakannya dan memberikan dari sisi-Nya pahala yang besar.",
      "ar": "إِنَّ ٱللَّهَ لَا یَظۡلِمُ مِثۡقَالَ ذَرَّةࣲۖ وَإِن تَكُ حَسَنَةࣰ یُضَـٰعِفۡهَا وَیُؤۡتِ مِن لَّدُنۡهُ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 534,
    "surahId": 4,
    "ayahNumber": 41,
    "arabicText": "فَكَیۡفَ إِذَا جِئۡنَا مِن كُلِّ أُمَّةِۭ بِشَهِیدࣲ وَجِئۡنَا بِكَ عَلَىٰ هَـٰۤؤُلَاۤءِ شَهِیدࣰا\n",
    "translations": {
      "en": "How, then, [will the sinners fare on Judgment Day,] when We shall bring forward witnesses from within every community, and bring thee [O Prophet] as witness against them?",
      "ms": "Maka bagaimanakah (keadaan orang-orang kafir pada hari akhirat kelak), apabila Kami datangkan dari tiap-tiap umat seorang saksi (iaitu Rasul mereka sendiri menjadi saksi terhadap perbuatan mereka), dan Kami juga datangkan engkau (wahai Muhammad) sebagai saksi terhadap umatmu ini?",
      "id": "Maka bagaimanakah (halnya orang kafir nanti), apabila Kami mendatangkan seseorang saksi (rasul) dari tiap-tiap umat dan Kami mendatangkan kamu (Muhammad) sebagai saksi atas mereka itu (sebagai umatmu).",
      "ar": "فَكَیۡفَ إِذَا جِئۡنَا مِن كُلِّ أُمَّةِۭ بِشَهِیدࣲ وَجِئۡنَا بِكَ عَلَىٰ هَـٰۤؤُلَاۤءِ شَهِیدࣰا\n"
    }
  },
  {
    "id": 535,
    "surahId": 4,
    "ayahNumber": 42,
    "arabicText": "یَوۡمَىِٕذࣲ یَوَدُّ ٱلَّذِینَ كَفَرُوا۟ وَعَصَوُا۟ ٱلرَّسُولَ لَوۡ تُسَوَّىٰ بِهِمُ ٱلۡأَرۡضُ وَلَا یَكۡتُمُونَ ٱللَّهَ حَدِیثࣰا\n",
    "translations": {
      "en": "Those who were bent on denying the truth and paid no heed to the Apostle will on that Day wish that the earth would swallow them: but they shall not [be able to] conceal from God anything that has happened.",
      "ms": "Pada hari itu orang-orang yang kafir dan menderhaka kepada Rasulullah, suka jika mereka disama ratakan dengan tanah (ditelan bumi), dan (ketika itu) mereka tidak dapat menyembunyikan sepatah kata pun dari pengetahuan Allah.",
      "id": "Di hari itu orang-orang kafir dan orang-orang yang mendurhakai rasul, ingin supaya mereka disamaratakan dengan tanah, dan mereka tidak dapat menyembunyikan (dari Allah) sesuatu kejadianpun.",
      "ar": "یَوۡمَىِٕذࣲ یَوَدُّ ٱلَّذِینَ كَفَرُوا۟ وَعَصَوُا۟ ٱلرَّسُولَ لَوۡ تُسَوَّىٰ بِهِمُ ٱلۡأَرۡضُ وَلَا یَكۡتُمُونَ ٱللَّهَ حَدِیثࣰا\n"
    }
  },
  {
    "id": 536,
    "surahId": 4,
    "ayahNumber": 43,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَقۡرَبُوا۟ ٱلصَّلَوٰةَ وَأَنتُمۡ سُكَـٰرَىٰ حَتَّىٰ تَعۡلَمُوا۟ مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِی سَبِیلٍ حَتَّىٰ تَغۡتَسِلُوا۟ۚ وَإِن كُنتُم مَّرۡضَىٰۤ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَاۤءَ أَحَدࣱ مِّنكُم مِّنَ ٱلۡغَاۤىِٕطِ أَوۡ لَـٰمَسۡتُمُ ٱلنِّسَاۤءَ فَلَمۡ تَجِدُوا۟ مَاۤءࣰ فَتَیَمَّمُوا۟ صَعِیدࣰا طَیِّبࣰا فَٱمۡسَحُوا۟ بِوُجُوهِكُمۡ وَأَیۡدِیكُمۡۗ إِنَّ ٱللَّهَ كَانَ عَفُوًّا غَفُورًا\n",
    "translations": {
      "en": "O YOU who have attained to faith! Do not attempt to pray while you are in a state of drunkenness, [but wait] until you know what you are saying; nor yet [while you are] in a state requiring total ablution, until you have bathed - except if you are travelling [and are unable to do so]. But if you are ill, or are travelling, or have just satisfied a want of nature, or have cohabited with a woman, and can find no water - then take resort to pure dust, passing [there­with] lightly over your face and your hands. Behold, God is indeed an absolver of sins, much-forgiving.",
      "ms": "Wahai orang-orang yang beriman, janganlah kamu hampiri sembahyang (mengerjakannya) sedang kamu dalam keadaan mabuk, hingga kamu sedar dan mengetahui akan apa yang kamu katakan. Dan janganlah pula (hampiri masjid) sedang kamu dalam keadaan Junub (berhadas besar) - kecuali kamu hendak melintas sahaja - hingga kamu mandi bersuci. Dan jika kamu sakit, atau sedang dalam musafir, atau salah seorang di antara kamu datang dari tempat buang air, atau kamu bersentuh dengan perempuan, kemudian kamu tidak mendapat air (untuk mandi atau berwuduk), maka hendaklah kamu bertayamum dengan tanah - debu, yang suci, iaitu sapukanlah ke muka kamu dan kedua tangan kamu. Sesungguhnya Allah Maha Pemaaf, lagi Maha Pengampun.",
      "id": "Hai orang-orang yang beriman, janganlah kamu shalat, sedang kamu dalam keadaan mabuk, sehingga kamu mengerti apa yang kamu ucapkan, (jangan pula hampiri mesjid) sedang kamu dalam keadaan junub, terkecuali sekedar berlalu saja, hingga kamu mandi. Dan jika kamu sakit atau sedang dalam musafir atau datang dari tempat buang air atau kamu telah menyentuh perempuan, kemudian kamu tidak mendapat air, maka bertayamumlah kamu dengan tanah yang baik (suci); sapulah mukamu dan tanganmu. Sesungguhnya Allah Maha Pemaaf lagi Maha Pengampun.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَقۡرَبُوا۟ ٱلصَّلَوٰةَ وَأَنتُمۡ سُكَـٰرَىٰ حَتَّىٰ تَعۡلَمُوا۟ مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِی سَبِیلٍ حَتَّىٰ تَغۡتَسِلُوا۟ۚ وَإِن كُنتُم مَّرۡضَىٰۤ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَاۤءَ أَحَدࣱ مِّنكُم مِّنَ ٱلۡغَاۤىِٕطِ أَوۡ لَـٰمَسۡتُمُ ٱلنِّسَاۤءَ فَلَمۡ تَجِدُوا۟ مَاۤءࣰ فَتَیَمَّمُوا۟ صَعِیدࣰا طَیِّبࣰا فَٱمۡسَحُوا۟ بِوُجُوهِكُمۡ وَأَیۡدِیكُمۡۗ إِنَّ ٱللَّهَ كَانَ عَفُوًّا غَفُورًا\n"
    }
  },
  {
    "id": 537,
    "surahId": 4,
    "ayahNumber": 44,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ أُوتُوا۟ نَصِیبࣰا مِّنَ ٱلۡكِتَـٰبِ یَشۡتَرُونَ ٱلضَّلَـٰلَةَ وَیُرِیدُونَ أَن تَضِلُّوا۟ ٱلسَّبِیلَ\n",
    "translations": {
      "en": "ART THOU NOT aware of those who, having been granted their share of the divine writ, now barter it away for error, and want you [too] to lose your way?",
      "ms": "Tidakkah engkau memerhatikan (wahai Muhammad) orang-orang yang telah diberikan sebahagian dari Kitab, mereka memilih kesesatan (dengan meninggalkan pertunjuk Tuhan), dan mereka pula berkehendak supaya kamu juga sesat jalan.",
      "id": "Apakah kamu tidak melihat orang-orang yang telah diberi bahagian dari Al Kitab (Taurat)? Mereka membeli (memilih) kesesatan (dengan petunjuk) dan mereka bermaksud supaya kamu tersesat (menyimpang) dari jalan (yang benar).",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ أُوتُوا۟ نَصِیبࣰا مِّنَ ٱلۡكِتَـٰبِ یَشۡتَرُونَ ٱلضَّلَـٰلَةَ وَیُرِیدُونَ أَن تَضِلُّوا۟ ٱلسَّبِیلَ\n"
    }
  },
  {
    "id": 538,
    "surahId": 4,
    "ayahNumber": 45,
    "arabicText": "وَٱللَّهُ أَعۡلَمُ بِأَعۡدَاۤىِٕكُمۡۚ وَكَفَىٰ بِٱللَّهِ وَلِیࣰّا وَكَفَىٰ بِٱللَّهِ نَصِیرࣰا\n",
    "translations": {
      "en": "But God knows best who are your enemies: and none can befriend as God does, and none can give succour as God does.",
      "ms": "Dan Allah lebih mengetahui berkenaan dengan musuh-musuh kamu, (oleh itu awasilah angkara musuh kamu itu). Dan cukuplah Allah sebagai Pengawal yang melindungi, dan cukuplah Allah sebagai Penolong (yang menyelamatkan kamu dari angkara mereka).",
      "id": "Dan Allah lebih mengetahui (dari pada kamu) tentang musuh-musuhmu. Dan cukuplah Allah menjadi Pelindung (bagimu). Dan cukuplah Allah menjadi Penolong (bagimu).",
      "ar": "وَٱللَّهُ أَعۡلَمُ بِأَعۡدَاۤىِٕكُمۡۚ وَكَفَىٰ بِٱللَّهِ وَلِیࣰّا وَكَفَىٰ بِٱللَّهِ نَصِیرࣰا\n"
    }
  },
  {
    "id": 539,
    "surahId": 4,
    "ayahNumber": 46,
    "arabicText": "مِّنَ ٱلَّذِینَ هَادُوا۟ یُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَیَقُولُونَ سَمِعۡنَا وَعَصَیۡنَا وَٱسۡمَعۡ غَیۡرَ مُسۡمَعࣲ وَرَ ٰ⁠عِنَا لَیَّۢا بِأَلۡسِنَتِهِمۡ وَطَعۡنࣰا فِی ٱلدِّینِۚ وَلَوۡ أَنَّهُمۡ قَالُوا۟ سَمِعۡنَا وَأَطَعۡنَا وَٱسۡمَعۡ وَٱنظُرۡنَا لَكَانَ خَیۡرࣰا لَّهُمۡ وَأَقۡوَمَ وَلَـٰكِن لَّعَنَهُمُ ٱللَّهُ بِكُفۡرِهِمۡ فَلَا یُؤۡمِنُونَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "Among those of the Jewish faith there are some who distort the meaning of the [revealed] words, taking them out of their context and saying, [as it were,] \"We have heard, but we disobey,\" and, \"Hear without hearkening,” and, “Hearken thou unto us, (O Muhammad)” - thus making a play with their tongues, and implying that the [true] Faith is false. And had they but said, \"We have heard, and we pay heed,\" and \"Hear [us], and have patience with us,\" it would indeed have been for their own good, and more upright: but God has rejected them because of their refusal to acknowledge the truth - for it is in but few things that they believe.",
      "ms": "Di antara orang-orang Yahudi ada yang mengubah (atau menukar ganti) Kalamullah (isi Kitab Taurat), dari tempat dan maksudnya yang sebenar, dan berkata (kepada Nabi Muhammad): \"Kami dengar\", (sedang mereka berkata dalam hati): \"Kami tidak akan menurut\". (Mereka juga berkata): \"Tolonglah dengar, tuan tidak diperdengarkan sesuatu yang buruk\", serta (mereka mengatakan): \"Raaeina\"; (Tujuan kata-kata mereka yang tersebut) hanya memutar belitkan perkataan mereka dan mencela ugama Islam. Dan kalaulah mereka berkata: \"Kami dengar dan kami taat, dan dengarlah serta berilah perhatian kepada kami\", tentulah yang demikian itu lebih baik bagi mereka dan lebih betul. Akan tetapi Allah melaknat mereka dengan sebab kekufuran mereka. Oleh itu, mereka tidak beriman kecuali sedikit sahaja (di antara mereka).",
      "id": "Yaitu orang-orang Yahudi, mereka mengubah perkataan dari tempat-tempatnya. Mereka berkata: \"Kami mendengar\", tetapi kami tidak mau menurutinya. Dan (mereka mengatakan pula): \"Dengarlah\" sedang kamu sebenarnya tidak mendengar apa-apa. Dan (mereka mengatakan): \"Raa'ina\", dengan memutar-mutar lidahnya dan mencela agama. Sekiranya mereka mengatakan: \"Kami mendengar dan menurut, dan dengarlah, dan perhatikanlah kami\", tentulah itu lebih baik bagi mereka dan lebih tepat, akan tetapi Allah mengutuk mereka, karena kekafiran mereka. Mereka tidak beriman kecuali iman yang sangat tipis.",
      "ar": "مِّنَ ٱلَّذِینَ هَادُوا۟ یُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَیَقُولُونَ سَمِعۡنَا وَعَصَیۡنَا وَٱسۡمَعۡ غَیۡرَ مُسۡمَعࣲ وَرَ ٰ⁠عِنَا لَیَّۢا بِأَلۡسِنَتِهِمۡ وَطَعۡنࣰا فِی ٱلدِّینِۚ وَلَوۡ أَنَّهُمۡ قَالُوا۟ سَمِعۡنَا وَأَطَعۡنَا وَٱسۡمَعۡ وَٱنظُرۡنَا لَكَانَ خَیۡرࣰا لَّهُمۡ وَأَقۡوَمَ وَلَـٰكِن لَّعَنَهُمُ ٱللَّهُ بِكُفۡرِهِمۡ فَلَا یُؤۡمِنُونَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 540,
    "surahId": 4,
    "ayahNumber": 47,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ ءَامِنُوا۟ بِمَا نَزَّلۡنَا مُصَدِّقࣰا لِّمَا مَعَكُم مِّن قَبۡلِ أَن نَّطۡمِسَ وُجُوهࣰا فَنَرُدَّهَا عَلَىٰۤ أَدۡبَارِهَاۤ أَوۡ نَلۡعَنَهُمۡ كَمَا لَعَنَّاۤ أَصۡحَـٰبَ ٱلسَّبۡتِۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولًا\n",
    "translations": {
      "en": "O you who have been granted revelation [aforetime]! Believe in what We have [now] bestowed from on high in confirmation of whatever [of the truth] you already possess, lest We efface your hopes and bring them to an end - just as We rejected those people who broke the Sabbath: for God's will is always done.",
      "ms": "Wahai orang-orang yang telah diberikan Kitab, berimanlah kamu dengan apa yang telah Kami turunkan (Al-Quran), yang mengesahkan Kitab-Kitab yang ada pada kamu, sebelum Kami menyeksa dengan menghapuskan bentuk muka kamu (sehingga berubah menjadi rata - tidak bermulut, berhidung dan bermata), lalu Kami menjadikannya sama seperti rupa sebelah belakangnya, atau Kami melaknatkan mereka sebagaimana Kami telah melaknatkan orang-orang (dari kaum mereka - Yahudi) yang melanggar larangan bekerja pada hari Sabtu. Dan (ingatlah) perintah Allah itu tetap berlaku.",
      "id": "Hai orang-orang yang telah diberi Al Kitab, berimanlah kamu kepada apa yang telah Kami turunkan (Al Quran) yang membenarkan Kitab yang ada pada kamu sebelum Kami mengubah muka(mu), lalu Kami putarkan ke belakang atau Kami kutuki mereka sebagaimana Kami telah mengutuki orang-orang (yang berbuat maksiat) pada hari Sabtu. Dan ketetapan Allah pasti berlaku.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ ءَامِنُوا۟ بِمَا نَزَّلۡنَا مُصَدِّقࣰا لِّمَا مَعَكُم مِّن قَبۡلِ أَن نَّطۡمِسَ وُجُوهࣰا فَنَرُدَّهَا عَلَىٰۤ أَدۡبَارِهَاۤ أَوۡ نَلۡعَنَهُمۡ كَمَا لَعَنَّاۤ أَصۡحَـٰبَ ٱلسَّبۡتِۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولًا\n"
    }
  },
  {
    "id": 541,
    "surahId": 4,
    "ayahNumber": 48,
    "arabicText": "إِنَّ ٱللَّهَ لَا یَغۡفِرُ أَن یُشۡرَكَ بِهِۦ وَیَغۡفِرُ مَا دُونَ ذَ ٰ⁠لِكَ لِمَن یَشَاۤءُۚ وَمَن یُشۡرِكۡ بِٱللَّهِ فَقَدِ ٱفۡتَرَىٰۤ إِثۡمًا عَظِیمًا\n",
    "translations": {
      "en": "VERILY, God does not forgive the ascribing of divinity to aught beside Him, although He forgives any lesser sin unto whomever He wills: for he who ascribes divinity to aught beside God has indeed contrived an awesome sin.",
      "ms": "Sesungguhnya Allah tidak akan mengampunkan dosa syirik mempersekutukanNya (dengan sesuatu apajua), dan akan mengampunkan dosa yang lain dari itu bagi sesiapa yang dikehendakiNya (menurut aturan SyariatNya). Dan sesiapa yang mempersekutukan Allah (dengan sesuatu yang lain), maka sesungguhnya ia telah melakukan dosa yang besar.",
      "id": "Sesungguhnya Allah tidak akan mengampuni dosa syirik, dan Dia mengampuni segala dosa yang selain dari (syirik) itu, bagi siapa yang dikehendaki-Nya. Barangsiapa yang mempersekutukan Allah, maka sungguh ia telah berbuat dosa yang besar.",
      "ar": "إِنَّ ٱللَّهَ لَا یَغۡفِرُ أَن یُشۡرَكَ بِهِۦ وَیَغۡفِرُ مَا دُونَ ذَ ٰ⁠لِكَ لِمَن یَشَاۤءُۚ وَمَن یُشۡرِكۡ بِٱللَّهِ فَقَدِ ٱفۡتَرَىٰۤ إِثۡمًا عَظِیمًا\n"
    }
  },
  {
    "id": 542,
    "surahId": 4,
    "ayahNumber": 49,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ یُزَكُّونَ أَنفُسَهُمۚ بَلِ ٱللَّهُ یُزَكِّی مَن یَشَاۤءُ وَلَا یُظۡلَمُونَ فَتِیلًا\n",
    "translations": {
      "en": "Art thou not aware of those who consider themselves pure? Nay, but it is God who causes whomever He wills to grow in purity; and none shall be wronged by as much as a hair's breadth.",
      "ms": "Tidakkah engkau perhatikan (dan merasa pelik wahai Muhammad) kepada orang-orang yang membersihkan (memuji) diri sendiri? (Padahal perkara itu bukan hak manusia) bahkan Allah jualah yang berhak membersihkan (memuji) sesiapa yang dikehendakiNya (menurut aturan SyariatNya); dan mereka pula tidak akan dianiaya (atau dikurangkan balasan mereka) sedikitpun.",
      "id": "Apakah kamu tidak memperhatikan orang yang menganggap dirinya bersih?. Sebenarnya Allah membersihkan siapa yang dikehendaki-Nya dan mereka tidak aniaya sedikitpun.",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ یُزَكُّونَ أَنفُسَهُمۚ بَلِ ٱللَّهُ یُزَكِّی مَن یَشَاۤءُ وَلَا یُظۡلَمُونَ فَتِیلًا\n"
    }
  },
  {
    "id": 543,
    "surahId": 4,
    "ayahNumber": 50,
    "arabicText": "ٱنظُرۡ كَیۡفَ یَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَۖ وَكَفَىٰ بِهِۦۤ إِثۡمࣰا مُّبِینًا\n",
    "translations": {
      "en": "Behold how they attribute their own lying inventions to God - than which there is no sin more obvious.",
      "ms": "Lihatlah (wahai Muhammad) betapa beraninya mereka mengada-adakan perkara-perkara dusta terhadap Allah? Dan cukuplah perbuatan itu menjadi dosa yang terang nyata.",
      "id": "Perhatikanlah, betapakah mereka mengada-adakan dusta terhadap Allah? Dan cukuplah perbuatan itu menjadi dosa yang nyata (bagi mereka).",
      "ar": "ٱنظُرۡ كَیۡفَ یَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَۖ وَكَفَىٰ بِهِۦۤ إِثۡمࣰا مُّبِینًا\n"
    }
  },
  {
    "id": 544,
    "surahId": 4,
    "ayahNumber": 51,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ أُوتُوا۟ نَصِیبࣰا مِّنَ ٱلۡكِتَـٰبِ یُؤۡمِنُونَ بِٱلۡجِبۡتِ وَٱلطَّـٰغُوتِ وَیَقُولُونَ لِلَّذِینَ كَفَرُوا۟ هَـٰۤؤُلَاۤءِ أَهۡدَىٰ مِنَ ٱلَّذِینَ ءَامَنُوا۟ سَبِیلًا\n",
    "translations": {
      "en": "Art thou not aware of those who, having been granted their share of the divine writ, [now] believe in baseless mysteries and in the powers of evil, and maintain that those who are bent on denying the truth are more surely guided than those who have attained to faith?",
      "ms": "Tidakkah engkau perhatikan (dan merasa pelik wahai Muhammad) kepada orang-orang yang telah diberikan sebahagian dari Kitab (Taurat)? Mereka percaya kepada benda-benda yang disembah yang lain dari Allah, dan kepada Taghut, dan mereka pula berkata kepada orang-orang kafir (kaum musyrik di Makkah) bahawa mereka (kaum musyrik itu) lebih betul jalan ugamanya daripada orang-orang yang beriman (kepada Nabi Muhammad s.a.w).",
      "id": "Apakah kamu tidak memperhatikan orang-orang yang diberi bahagian dari Al kitab? Mereka percaya kepada jibt dan thaghut, dan mengatakan kepada orang-orang Kafir (musyrik Mekah), bahwa mereka itu lebih benar jalannya dari orang-orang yang beriman.",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ أُوتُوا۟ نَصِیبࣰا مِّنَ ٱلۡكِتَـٰبِ یُؤۡمِنُونَ بِٱلۡجِبۡتِ وَٱلطَّـٰغُوتِ وَیَقُولُونَ لِلَّذِینَ كَفَرُوا۟ هَـٰۤؤُلَاۤءِ أَهۡدَىٰ مِنَ ٱلَّذِینَ ءَامَنُوا۟ سَبِیلًا\n"
    }
  },
  {
    "id": 545,
    "surahId": 4,
    "ayahNumber": 52,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ لَعَنَهُمُ ٱللَّهُۖ وَمَن یَلۡعَنِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ نَصِیرًا\n",
    "translations": {
      "en": "It is they whom God has rejected: and he whom God rejects shall find none to succour him.",
      "ms": "(Kaum Yahudi yang demikian sikapnya) mereka itulah orang-orang yang dilaknat oleh Allah; dan sesiapa yang dilaknat oleh Allah, maka engkau tidak sekali-kali akan mendapati sesiapa pun yang boleh menolongnya.",
      "id": "Mereka itulah orang yang dikutuki Allah. Barangsiapa yang dikutuki Allah, niscaya kamu sekali-kali tidak akan memperoleh penolong baginya.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ لَعَنَهُمُ ٱللَّهُۖ وَمَن یَلۡعَنِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ نَصِیرًا\n"
    }
  },
  {
    "id": 546,
    "surahId": 4,
    "ayahNumber": 53,
    "arabicText": "أَمۡ لَهُمۡ نَصِیبࣱ مِّنَ ٱلۡمُلۡكِ فَإِذࣰا لَّا یُؤۡتُونَ ٱلنَّاسَ نَقِیرًا\n",
    "translations": {
      "en": "Have they, perchance, a share in [God's] dominion? But [if they had], lo, they would not give to other people as much as [would fill] the groove of a date-stone!",
      "ms": "Patutkah ada bagi mereka (kaum Yahudi itu) sesuatu bahagian dari kekuasaan memerintah? (Tidak, bahkan kalau ada) maka sudah tentu mereka tidak akan memberikan sedikitpun kebaikan kepada manusia.",
      "id": "Ataukah ada bagi mereka bahagian dari kerajaan (kekuasaan)? Kendatipun ada, mereka tidak akan memberikan sedikitpun (kebajikan) kepada manusia.",
      "ar": "أَمۡ لَهُمۡ نَصِیبࣱ مِّنَ ٱلۡمُلۡكِ فَإِذࣰا لَّا یُؤۡتُونَ ٱلنَّاسَ نَقِیرًا\n"
    }
  },
  {
    "id": 547,
    "surahId": 4,
    "ayahNumber": 54,
    "arabicText": "أَمۡ یَحۡسُدُونَ ٱلنَّاسَ عَلَىٰ مَاۤ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۖ فَقَدۡ ءَاتَیۡنَاۤ ءَالَ إِبۡرَ ٰ⁠هِیمَ ٱلۡكِتَـٰبَ وَٱلۡحِكۡمَةَ وَءَاتَیۡنَـٰهُم مُّلۡكًا عَظِیمࣰا\n",
    "translations": {
      "en": "Do they, perchance, envy other people for what God has granted them out of His bounty? But then, We did grant revelation and wisdom unto the House of Abraham, and We did bestow on them a mighty dominion:",
      "ms": "Atau patutkah mereka dengki kepada manusia (Nabi Muhammad dan umatnya) disebabkan nikmat (pangkat Nabi dan ugama Islam) yang telah diberikan oleh Allah kepada mereka dari limpah kurniaNya? Kerana sesungguhnya Kami telahpun memberi kepada keluarga Ibrahim: Kitab (ugama) dan hikmat (pangkat Nabi), dan kami telah memberi kepada mereka kerajaan yang besar.",
      "id": "ataukah mereka dengki kepada manusia (Muhammad) lantaran karunia yang Allah telah berikan kepadanya? Sesungguhnya Kami telah memberikan Kitab dan Hikmah kepada keluarga Ibrahim, dan Kami telah memberikan kepadanya kerajaan yang besar.",
      "ar": "أَمۡ یَحۡسُدُونَ ٱلنَّاسَ عَلَىٰ مَاۤ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۖ فَقَدۡ ءَاتَیۡنَاۤ ءَالَ إِبۡرَ ٰ⁠هِیمَ ٱلۡكِتَـٰبَ وَٱلۡحِكۡمَةَ وَءَاتَیۡنَـٰهُم مُّلۡكًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 548,
    "surahId": 4,
    "ayahNumber": 55,
    "arabicText": "فَمِنۡهُم مَّنۡ ءَامَنَ بِهِۦ وَمِنۡهُم مَّن صَدَّ عَنۡهُۚ وَكَفَىٰ بِجَهَنَّمَ سَعِیرًا\n",
    "translations": {
      "en": "and among them are such as [truly] believe in him, and among them are such as have turned away from him. And nothing could be as burning as [the fire of] hell:",
      "ms": "Maka di antara mereka (kaum Yahudi yang dengki itu) ada yang beriman kepada (apa yang telah di kurniakan oleh Allah kepada keluarga Nabi Ibrahim) itu, dan ada pula di antara mereka yang berpaling daripadanya (tidak beriman). Dan cukuplah dengan neraka jahanam yang sentiasa menyala-nyala itu (menjadi tempat seksa mereka).",
      "id": "Maka di antara mereka (orang-orang yang dengki itu), ada orang-orang yang beriman kepadanya, dan di antara mereka ada orang-orang yang menghalangi (manusia) dari beriman kepadanya. Dan cukuplah (bagi mereka) Jahannam yang menyala-nyala apinya.",
      "ar": "فَمِنۡهُم مَّنۡ ءَامَنَ بِهِۦ وَمِنۡهُم مَّن صَدَّ عَنۡهُۚ وَكَفَىٰ بِجَهَنَّمَ سَعِیرًا\n"
    }
  },
  {
    "id": 549,
    "surahId": 4,
    "ayahNumber": 56,
    "arabicText": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ بِـَٔایَـٰتِنَا سَوۡفَ نُصۡلِیهِمۡ نَارࣰا كُلَّمَا نَضِجَتۡ جُلُودُهُم بَدَّلۡنَـٰهُمۡ جُلُودًا غَیۡرَهَا لِیَذُوقُوا۟ ٱلۡعَذَابَۗ إِنَّ ٱللَّهَ كَانَ عَزِیزًا حَكِیمࣰا\n",
    "translations": {
      "en": "for, verily, those who are bent on denying the truth of Our messages We shall, in time, cause to endure fire: [and] every time their skins are burnt off, We shall replace them with new skins, so that they may taste suffering [in full] Verily, God is almighty, wise.",
      "ms": "Sesungguhnya orang-orang yang kufur ingkar kepada ayat-ayat keterangan Kami, Kami akan membakar mereka dalam api neraka. Tiap-tiap kali kulit mereka masak hangus, Kami gantikan untuk mereka kulit yang lain supaya mereka dapat merasa azab sengsara itu. Dan (ingatlah) sesungguhnya Allah adalah Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Sesungguhnya orang-orang yang kafir kepada ayat-ayat Kami, kelak akan Kami masukkan mereka ke dalam neraka. Setiap kali kulit mereka hangus, Kami ganti kulit mereka dengan kulit yang lain, supaya mereka merasakan azab. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana.",
      "ar": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ بِـَٔایَـٰتِنَا سَوۡفَ نُصۡلِیهِمۡ نَارࣰا كُلَّمَا نَضِجَتۡ جُلُودُهُم بَدَّلۡنَـٰهُمۡ جُلُودًا غَیۡرَهَا لِیَذُوقُوا۟ ٱلۡعَذَابَۗ إِنَّ ٱللَّهَ كَانَ عَزِیزًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 550,
    "surahId": 4,
    "ayahNumber": 57,
    "arabicText": "وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۖ لَّهُمۡ فِیهَاۤ أَزۡوَ ٰ⁠جࣱ مُّطَهَّرَةࣱۖ وَنُدۡخِلُهُمۡ ظِلࣰّا ظَلِیلًا\n",
    "translations": {
      "en": "But those who attain to faith and do righteous deeds We shall bring into gardens through which running waters flow, therein to abide beyond the count of time; there shall they have spouses pure: and [thus] We shall bring them unto happiness abounding.",
      "ms": "Dan orang-orang yang beriman serta beramal soleh, Kami akan masukkan mereka ke dalam syurga yang mengalir di bawahnya beberapa sungai, mereka kekal di dalamnya selama-lamanya. Mereka beroleh dalam syurga itu pasangan-pasangan, isteri-isteri yang suci bersih, serta Kami masukkan mereka ke tempat yang teduh yang sentiasa dinaungi.",
      "id": "Dan orang-orang yang beriman dan mengerjakan amalan-amalan yang shaleh, kelak akan Kami masukkan mereka ke dalam surga yang di dalamnya mengalir sungai-sungai; kekal mereka di dalamnya; mereka di dalamnya mempunyai isteri-isteri yang suci, dan Kami masukkan mereka ke tempat yang teduh lagi nyaman.",
      "ar": "وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۖ لَّهُمۡ فِیهَاۤ أَزۡوَ ٰ⁠جࣱ مُّطَهَّرَةࣱۖ وَنُدۡخِلُهُمۡ ظِلࣰّا ظَلِیلًا\n"
    }
  },
  {
    "id": 551,
    "surahId": 4,
    "ayahNumber": 58,
    "arabicText": "۞ إِنَّ ٱللَّهَ یَأۡمُرُكُمۡ أَن تُؤَدُّوا۟ ٱلۡأَمَـٰنَـٰتِ إِلَىٰۤ أَهۡلِهَا وَإِذَا حَكَمۡتُم بَیۡنَ ٱلنَّاسِ أَن تَحۡكُمُوا۟ بِٱلۡعَدۡلِۚ إِنَّ ٱللَّهَ نِعِمَّا یَعِظُكُم بِهِۦۤۗ إِنَّ ٱللَّهَ كَانَ سَمِیعَۢا بَصِیرࣰا\n",
    "translations": {
      "en": "BEHOLD, God bids you to deliver all that you have been entrusted with unto those who are entitled thereto, and whenever you judge between people, to judge with justice. Verily, most excellent is what God exhorts you to do: verily, God is all-hearing, all-seeing!",
      "ms": "Sesungguhnya Allah menyuruh kamu supaya menyerahkan segala jenis amanah kepada ahlinya (yang berhak menerimanya), dan apabila kamu menjalankan hukum di antara manusia, (Allah menyuruh) kamu menghukum dengan adil. Sesungguhnya Allah dengan (suruhanNya) itu memberi pengajaran yang sebaik-baiknya kepada kamu. Sesungguhnya Allah sentiasa Mendengar, lagi sentiasa Melihat.",
      "id": "Sesungguhnya Allah menyuruh kamu menyampaikan amanat kepada yang berhak menerimanya, dan (menyuruh kamu) apabila menetapkan hukum di antara manusia supaya kamu menetapkan dengan adil. Sesungguhnya Allah memberi pengajaran yang sebaik-baiknya kepadamu. Sesungguhnya Allah adalah Maha Mendengar lagi Maha Melihat.",
      "ar": "۞ إِنَّ ٱللَّهَ یَأۡمُرُكُمۡ أَن تُؤَدُّوا۟ ٱلۡأَمَـٰنَـٰتِ إِلَىٰۤ أَهۡلِهَا وَإِذَا حَكَمۡتُم بَیۡنَ ٱلنَّاسِ أَن تَحۡكُمُوا۟ بِٱلۡعَدۡلِۚ إِنَّ ٱللَّهَ نِعِمَّا یَعِظُكُم بِهِۦۤۗ إِنَّ ٱللَّهَ كَانَ سَمِیعَۢا بَصِیرࣰا\n"
    }
  },
  {
    "id": 552,
    "surahId": 4,
    "ayahNumber": 59,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَطِیعُوا۟ ٱللَّهَ وَأَطِیعُوا۟ ٱلرَّسُولَ وَأُو۟لِی ٱلۡأَمۡرِ مِنكُمۡۖ فَإِن تَنَـٰزَعۡتُمۡ فِی شَیۡءࣲ فَرُدُّوهُ إِلَى ٱللَّهِ وَٱلرَّسُولِ إِن كُنتُمۡ تُؤۡمِنُونَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِۚ ذَ ٰ⁠لِكَ خَیۡرࣱ وَأَحۡسَنُ تَأۡوِیلًا\n",
    "translations": {
      "en": "O you who have attained to faith! Pay heed unto God, and pay heed unto the Apostle and unto those from among you who have been entrusted with authority; and if you are at variance over any matter, refer it unto God and the Apostle, if you [truly] believe in God and the Last Day. This is the best [for you], and best in the end.",
      "ms": "Wahai orang-orang yang beriman, taatlah kamu kepada Allah dan taatlah kamu kepada Rasulullah dan kepada \"Ulil-Amri\" (orang-orang yang berkuasa) dari kalangan kamu. Kemudian jika kamu berbantah-bantah (berselisihan) dalam sesuatu perkara, maka hendaklah kamu mengembalikannya kepada (Kitab) Allah (Al-Quran) dan (Sunnah) RasulNya - jika kamu benar beriman kepada Allah dan hari akhirat. Yang demikian adalah lebih baik (bagi kamu), dan lebih elok pula kesudahannya.",
      "id": "Hai orang-orang yang beriman, taatilah Allah dan taatilah Rasul (Nya), dan ulil amri di antara kamu. Kemudian jika kamu berlainan pendapat tentang sesuatu, maka kembalikanlah ia kepada Allah (Al Quran) dan Rasul (sunnahnya), jika kamu benar-benar beriman kepada Allah dan hari kemudian. Yang demikian itu lebih utama (bagimu) dan lebih baik akibatnya.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَطِیعُوا۟ ٱللَّهَ وَأَطِیعُوا۟ ٱلرَّسُولَ وَأُو۟لِی ٱلۡأَمۡرِ مِنكُمۡۖ فَإِن تَنَـٰزَعۡتُمۡ فِی شَیۡءࣲ فَرُدُّوهُ إِلَى ٱللَّهِ وَٱلرَّسُولِ إِن كُنتُمۡ تُؤۡمِنُونَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِۚ ذَ ٰ⁠لِكَ خَیۡرࣱ وَأَحۡسَنُ تَأۡوِیلًا\n"
    }
  },
  {
    "id": 553,
    "surahId": 4,
    "ayahNumber": 60,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ یَزۡعُمُونَ أَنَّهُمۡ ءَامَنُوا۟ بِمَاۤ أُنزِلَ إِلَیۡكَ وَمَاۤ أُنزِلَ مِن قَبۡلِكَ یُرِیدُونَ أَن یَتَحَاكَمُوۤا۟ إِلَى ٱلطَّـٰغُوتِ وَقَدۡ أُمِرُوۤا۟ أَن یَكۡفُرُوا۟ بِهِۦۖ وَیُرِیدُ ٱلشَّیۡطَـٰنُ أَن یُضِلَّهُمۡ ضَلَـٰلَۢا بَعِیدࣰا\n",
    "translations": {
      "en": "ART THOU NOT aware of those who claim that they believe in what has been bestowed from on high upon thee, [O Prophet,] as well as in what was bestowed from on high before thee, [and yet] are willing to defer to the rule of the powers of evil - although they were bidden to deny it, seeing that Satan but wants to lead them far astray?",
      "ms": "Tidakkah engkau (hairan) melihat (wahai Muhammad) orang-orang (munafik) yang mendakwa bahawa mereka telah beriman kepada Al-Quran yang telah diturunkan kepadamu dan kepada (Kitab-kitab) yang telah diturunkan dahulu daripadamu? Mereka suka hendak berhakim kepada Taghut, padahal mereka telah diperintahkan supaya kufur ingkar kepada Taghut itu. Dan Syaitan pula sentiasa hendak menyesatkan mereka dengan kesesatan yang amat jauh.",
      "id": "Apakah kamu tidak memperhatikan orang-orang yang mengaku dirinya telah beriman kepada apa yang diturunkan kepadamu dan kepada apa yang diturunkan sebelum kamu? Mereka hendak berhakim kepada thaghut, padahal mereka telah diperintah mengingkari thaghut itu. Dan syaitan bermaksud menyesatkan mereka (dengan) penyesatan yang sejauh-jauhnya.",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ یَزۡعُمُونَ أَنَّهُمۡ ءَامَنُوا۟ بِمَاۤ أُنزِلَ إِلَیۡكَ وَمَاۤ أُنزِلَ مِن قَبۡلِكَ یُرِیدُونَ أَن یَتَحَاكَمُوۤا۟ إِلَى ٱلطَّـٰغُوتِ وَقَدۡ أُمِرُوۤا۟ أَن یَكۡفُرُوا۟ بِهِۦۖ وَیُرِیدُ ٱلشَّیۡطَـٰنُ أَن یُضِلَّهُمۡ ضَلَـٰلَۢا بَعِیدࣰا\n"
    }
  },
  {
    "id": 554,
    "surahId": 4,
    "ayahNumber": 61,
    "arabicText": "وَإِذَا قِیلَ لَهُمۡ تَعَالَوۡا۟ إِلَىٰ مَاۤ أَنزَلَ ٱللَّهُ وَإِلَى ٱلرَّسُولِ رَأَیۡتَ ٱلۡمُنَـٰفِقِینَ یَصُدُّونَ عَنكَ صُدُودࣰا\n",
    "translations": {
      "en": "And so, whenever they are told, \"Come unto that which God has be­stowed from on high, and unto the Apostle,\" thou canst see these hypocrites turn away from thee with aversion.",
      "ms": "Dan apabila dikatakan kepada mereka: \"Marilah berhakim kepada hukum Al-Quran yang telah diturunkan oleh Allah dan kepada hukum Rasulullah,\" nescaya engkau melihat orang-orang munafik itu berpaling serta menghalang (manusia) dengan bersungguh-sungguh daripada menghampirimu.",
      "id": "Apabila dikatakan kepada mereka: \"Marilah kamu (tunduk) kepada hukum yang Allah telah turunkan dan kepada hukum Rasul\", niscaya kamu lihat orang-orang munafik menghalangi (manusia) dengan sekuat-kuatnya dari (mendekati) kamu.",
      "ar": "وَإِذَا قِیلَ لَهُمۡ تَعَالَوۡا۟ إِلَىٰ مَاۤ أَنزَلَ ٱللَّهُ وَإِلَى ٱلرَّسُولِ رَأَیۡتَ ٱلۡمُنَـٰفِقِینَ یَصُدُّونَ عَنكَ صُدُودࣰا\n"
    }
  },
  {
    "id": 555,
    "surahId": 4,
    "ayahNumber": 62,
    "arabicText": "فَكَیۡفَ إِذَاۤ أَصَـٰبَتۡهُم مُّصِیبَةُۢ بِمَا قَدَّمَتۡ أَیۡدِیهِمۡ ثُمَّ جَاۤءُوكَ یَحۡلِفُونَ بِٱللَّهِ إِنۡ أَرَدۡنَاۤ إِلَّاۤ إِحۡسَـٰنࣰا وَتَوۡفِیقًا\n",
    "translations": {
      "en": "But how [will they fare] when calamity befalls them [on the Day of Judgment] because of what they have wrought in this world - whereupon they will come to thee, swearing by God, \"Our aim was but to do good, and to bring about harmony\"?",
      "ms": "Maka bagaimana halnya apabila mereka ditimpa sesuatu kemalangan disebabkan (kesalahan) yang telah dibuat oleh tangan mereka sendiri, kemudian mereka datang kepadamu sambil bersumpah: \"Demi Allah, kami tidak sekali-kali menghendaki melainkan kebaikan dan perdamaian (bagi kedua pihak yang berbalah)\".",
      "id": "Maka bagaimanakah halnya apabila mereka (orang-orang munafik) ditimpa sesuatu musibah disebabkan perbuatan tangan mereka sendiri, kemudian mereka datang kepadamu sambil bersumpah: \"Demi Allah, kami sekali-kali tidak menghendaki selain penyelesaian yang baik dan perdamaian yang sempurna\".",
      "ar": "فَكَیۡفَ إِذَاۤ أَصَـٰبَتۡهُم مُّصِیبَةُۢ بِمَا قَدَّمَتۡ أَیۡدِیهِمۡ ثُمَّ جَاۤءُوكَ یَحۡلِفُونَ بِٱللَّهِ إِنۡ أَرَدۡنَاۤ إِلَّاۤ إِحۡسَـٰنࣰا وَتَوۡفِیقًا\n"
    }
  },
  {
    "id": 556,
    "surahId": 4,
    "ayahNumber": 63,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ یَعۡلَمُ ٱللَّهُ مَا فِی قُلُوبِهِمۡ فَأَعۡرِضۡ عَنۡهُمۡ وَعِظۡهُمۡ وَقُل لَّهُمۡ فِیۤ أَنفُسِهِمۡ قَوۡلَۢا بَلِیغࣰا\n",
    "translations": {
      "en": "As for them - God knows all that is in their hearts; so leave them alone, and admonish them, and speak unto them about themselves in a gravely search­ing manner:",
      "ms": "Mereka itulah orang-orang yang diketahui oleh Allah akan apa yang ada dalam hati mereka, oleh itu berpalinglah engkau daripada mereka, dan nasihatilah mereka, serta katakanlah kepada mereka kata-kata yang boleh memberi kesan pada hati mereka.",
      "id": "Mereka itu adalah orang-orang yang Allah mengetahui apa yang di dalam hati mereka. Karena itu berpalinglah kamu dari mereka, dan berilah mereka pelajaran, dan katakanlah kepada mereka perkataan yang berbekas pada jiwa mereka.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ یَعۡلَمُ ٱللَّهُ مَا فِی قُلُوبِهِمۡ فَأَعۡرِضۡ عَنۡهُمۡ وَعِظۡهُمۡ وَقُل لَّهُمۡ فِیۤ أَنفُسِهِمۡ قَوۡلَۢا بَلِیغࣰا\n"
    }
  },
  {
    "id": 557,
    "surahId": 4,
    "ayahNumber": 64,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا لِیُطَاعَ بِإِذۡنِ ٱللَّهِۚ وَلَوۡ أَنَّهُمۡ إِذ ظَّلَمُوۤا۟ أَنفُسَهُمۡ جَاۤءُوكَ فَٱسۡتَغۡفَرُوا۟ ٱللَّهَ وَٱسۡتَغۡفَرَ لَهُمُ ٱلرَّسُولُ لَوَجَدُوا۟ ٱللَّهَ تَوَّابࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "for We have never sent any apostle save that he should be heeded by God's leave. If, then, after having sinned against themselves, they would but come round to thee and ask God to forgive them - with the Apostle, too, praying that they be forgiven - they would assuredly find that God is an acceptor of repentance, a dispenser of grace.",
      "ms": "Dan Kami tidak mengutus seseorang Rasul pun melainkan supaya ia ditaati dengan izin Allah. Dan kalaulah mereka ketika menganiaya diri mereka sendiri datang kepadamu (wahai Muhammad) lalu memohon ampun kepada Allah, dan Rasulullah juga memohon ampun untuk mereka, tentulah mereka mendapati Allah Maha Penerima taubat, lagi Maha Mengasihani.",
      "id": "Dan Kami tidak mengutus seseorang rasul melainkan untuk ditaati dengan seizin Allah. Sesungguhnya jikalau mereka ketika menganiaya dirinya datang kepadamu, lalu memohon ampun kepada Allah, dan Rasulpun memohonkan ampun untuk mereka, tentulah mereka mendapati Allah Maha Penerima Taubat lagi Maha Penyayang.",
      "ar": "وَمَاۤ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا لِیُطَاعَ بِإِذۡنِ ٱللَّهِۚ وَلَوۡ أَنَّهُمۡ إِذ ظَّلَمُوۤا۟ أَنفُسَهُمۡ جَاۤءُوكَ فَٱسۡتَغۡفَرُوا۟ ٱللَّهَ وَٱسۡتَغۡفَرَ لَهُمُ ٱلرَّسُولُ لَوَجَدُوا۟ ٱللَّهَ تَوَّابࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 558,
    "surahId": 4,
    "ayahNumber": 65,
    "arabicText": "فَلَا وَرَبِّكَ لَا یُؤۡمِنُونَ حَتَّىٰ یُحَكِّمُوكَ فِیمَا شَجَرَ بَیۡنَهُمۡ ثُمَّ لَا یَجِدُوا۟ فِیۤ أَنفُسِهِمۡ حَرَجࣰا مِّمَّا قَضَیۡتَ وَیُسَلِّمُوا۟ تَسۡلِیمࣰا\n",
    "translations": {
      "en": "But nay, by thy Sustainer! They do not [really] believe unless they make thee [O Prophet] a judge of all on which they disagree among themselves, and then find in their hearts no bar to an acceptance of thy decision and give themselves up [to it] in utter self-surrender.",
      "ms": "Maka demi Tuhanmu (wahai Muhammad)! Mereka tidak disifatkan beriman sehingga mereka menjadikan engkau hakim dalam mana-mana perselisihan yang timbul di antara mereka, kemudian mereka pula tidak merasa di hati mereka sesuatu keberatan dari apa yang telah engkau hukumkan, dan mereka menerima keputusan itu dengan sepenuhnya.",
      "id": "Maka demi Tuhanmu, mereka (pada hakekatnya) tidak beriman hingga mereka menjadikan kamu hakim terhadap perkara yang mereka perselisihkan, kemudian mereka tidak merasa dalam hati mereka sesuatu keberatan terhadap putusan yang kamu berikan, dan mereka menerima dengan sepenuhnya.",
      "ar": "فَلَا وَرَبِّكَ لَا یُؤۡمِنُونَ حَتَّىٰ یُحَكِّمُوكَ فِیمَا شَجَرَ بَیۡنَهُمۡ ثُمَّ لَا یَجِدُوا۟ فِیۤ أَنفُسِهِمۡ حَرَجࣰا مِّمَّا قَضَیۡتَ وَیُسَلِّمُوا۟ تَسۡلِیمࣰا\n"
    }
  },
  {
    "id": 559,
    "surahId": 4,
    "ayahNumber": 66,
    "arabicText": "وَلَوۡ أَنَّا كَتَبۡنَا عَلَیۡهِمۡ أَنِ ٱقۡتُلُوۤا۟ أَنفُسَكُمۡ أَوِ ٱخۡرُجُوا۟ مِن دِیَـٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِیلࣱ مِّنۡهُمۡۖ وَلَوۡ أَنَّهُمۡ فَعَلُوا۟ مَا یُوعَظُونَ بِهِۦ لَكَانَ خَیۡرࣰا لَّهُمۡ وَأَشَدَّ تَثۡبِیتࣰا\n",
    "translations": {
      "en": "Yet if We were to ordain for them, \"Lay down your lives,\" or, \"Forsake your homelands,\" only a very few of them would do it - although, if they did what they are admonished to do, it would indeed be for their own good and apt to strengthen them greatly [in faith],",
      "ms": "Dan sesungguhnya kalau Kami wajibkan kepada mereka (dengan perintah): \"Bunuhlah diri kamu sendiri, atau keluarlah dari tempat kediaman kamu\", nescaya mereka tidak akan melakukannya, kecuali sedikit di antara mereka. Dan sesungguhnya kalau mereka amalkan nasihat pengajaran (meliputi suruh dan tegah) yang telah diberikan kepada mereka, tentulah yang demikian itu lebih baik bagi mereka dan lebih meneguhkan (iman mereka).",
      "id": "Dan sesungguhnya kalau Kami perintahkan kepada mereka: \"Bunuhlah dirimu atau keluarlah kamu dari kampungmu\", niscaya mereka tidak akan melakukannya kecuali sebagian kecil dari mereka. Dan sesungguhnya kalau mereka melaksanakan pelajaran yang diberikan kepada mereka, tentulah hal yang demikian itu lebih baik bagi mereka dan lebih menguatkan (iman mereka),",
      "ar": "وَلَوۡ أَنَّا كَتَبۡنَا عَلَیۡهِمۡ أَنِ ٱقۡتُلُوۤا۟ أَنفُسَكُمۡ أَوِ ٱخۡرُجُوا۟ مِن دِیَـٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِیلࣱ مِّنۡهُمۡۖ وَلَوۡ أَنَّهُمۡ فَعَلُوا۟ مَا یُوعَظُونَ بِهِۦ لَكَانَ خَیۡرࣰا لَّهُمۡ وَأَشَدَّ تَثۡبِیتࣰا\n"
    }
  },
  {
    "id": 560,
    "surahId": 4,
    "ayahNumber": 67,
    "arabicText": "وَإِذࣰا لَّـَٔاتَیۡنَـٰهُم مِّن لَّدُنَّاۤ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "whereupon We should indeed grant them, out of Our grace, a mighty reward,",
      "ms": "Dan (setelah mereka berkeadaan demikian), tentulah Kami akan berikan kepada mereka - dari sisi Kami - pahala balasan yang amat besar;",
      "id": "dan kalau demikian, pasti Kami berikan kepada mereka pahala yang besar dari sisi Kami,",
      "ar": "وَإِذࣰا لَّـَٔاتَیۡنَـٰهُم مِّن لَّدُنَّاۤ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 561,
    "surahId": 4,
    "ayahNumber": 68,
    "arabicText": "وَلَهَدَیۡنَـٰهُمۡ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n",
    "translations": {
      "en": "and indeed guide them onto a straight way.",
      "ms": "Dan tentulah Kami pimpin mereka ke jalan yang lurus.",
      "id": "dan pasti Kami tunjuki mereka kepada jalan yang lurus.",
      "ar": "وَلَهَدَیۡنَـٰهُمۡ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n"
    }
  },
  {
    "id": 562,
    "surahId": 4,
    "ayahNumber": 69,
    "arabicText": "وَمَن یُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُو۟لَـٰۤىِٕكَ مَعَ ٱلَّذِینَ أَنۡعَمَ ٱللَّهُ عَلَیۡهِم مِّنَ ٱلنَّبِیِّـۧنَ وَٱلصِّدِّیقِینَ وَٱلشُّهَدَاۤءِ وَٱلصَّـٰلِحِینَۚ وَحَسُنَ أُو۟لَـٰۤىِٕكَ رَفِیقࣰا\n",
    "translations": {
      "en": "For, all who pay heed unto God and the Apostle shall be among those upon whom God has bestowed His blessings: the prophets, and those who never deviated from the truth, and those who [with their lives] bore witness to the truth, and the right­eous ones: and how goodly a company are these!",
      "ms": "Dan sesiapa yang taat kepada Allah dan RasulNya, maka mereka akan (ditempatkan di syurga) bersama-sama orang-orang yang telah dikurniakan nikmat oleh Allah kepada mereka, iaitu Nabi-nabi, dan orang-orang Siddiqiin, dan orang-orang yang Syahid, serta orang-orang yang soleh. Dan amatlah eloknya mereka itu menjadi teman rakan (kepada orang-orang yang taat).",
      "id": "Dan barangsiapa yang mentaati Allah dan Rasul(Nya), mereka itu akan bersama-sama dengan orang-orang yang dianugerahi nikmat oleh Allah, yaitu: Nabi-nabi, para shiddiiqiin, orang-orang yang mati syahid, dan orang-orang saleh. Dan mereka itulah teman yang sebaik-baiknya.",
      "ar": "وَمَن یُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُو۟لَـٰۤىِٕكَ مَعَ ٱلَّذِینَ أَنۡعَمَ ٱللَّهُ عَلَیۡهِم مِّنَ ٱلنَّبِیِّـۧنَ وَٱلصِّدِّیقِینَ وَٱلشُّهَدَاۤءِ وَٱلصَّـٰلِحِینَۚ وَحَسُنَ أُو۟لَـٰۤىِٕكَ رَفِیقࣰا\n"
    }
  },
  {
    "id": 563,
    "surahId": 4,
    "ayahNumber": 70,
    "arabicText": "ذَ ٰ⁠لِكَ ٱلۡفَضۡلُ مِنَ ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ عَلِیمࣰا\n",
    "translations": {
      "en": "Such is the bounty of God - and none has the knowledge which God has.",
      "ms": "Yang demikian itu adalah limpah kurnia dari Allah; dan cukuplah Allah Yang Maha Mengetahui (akan balasan pahalanya).",
      "id": "Yang demikian itu adalah karunia dari Allah, dan Allah cukup mengetahui.",
      "ar": "ذَ ٰ⁠لِكَ ٱلۡفَضۡلُ مِنَ ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ عَلِیمࣰا\n"
    }
  },
  {
    "id": 564,
    "surahId": 4,
    "ayahNumber": 71,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ خُذُوا۟ حِذۡرَكُمۡ فَٱنفِرُوا۟ ثُبَاتٍ أَوِ ٱنفِرُوا۟ جَمِیعࣰا\n",
    "translations": {
      "en": "O YOU who have attained to faith! Be fully prepared against danger, whether you go to war in small groups or all together.",
      "ms": "Wahai orang-orang yang beriman, bersedialah dan berjaga-jagalah (sebelum kamu menghadapi musuh), kemudian (bila dikehendaki) maralah (ke medan perang) sepuak demi sepuak, atau (jika perlu) maralah serentak beramai-ramai.",
      "id": "Hai orang-orang yang beriman, bersiap siagalah kamu, dan majulah (ke medan pertempuran) berkelompok-kelompok, atau majulah bersama-sama!",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ خُذُوا۟ حِذۡرَكُمۡ فَٱنفِرُوا۟ ثُبَاتٍ أَوِ ٱنفِرُوا۟ جَمِیعࣰا\n"
    }
  },
  {
    "id": 565,
    "surahId": 4,
    "ayahNumber": 72,
    "arabicText": "وَإِنَّ مِنكُمۡ لَمَن لَّیُبَطِّئَنَّ فَإِنۡ أَصَـٰبَتۡكُم مُّصِیبَةࣱ قَالَ قَدۡ أَنۡعَمَ ٱللَّهُ عَلَیَّ إِذۡ لَمۡ أَكُن مَّعَهُمۡ شَهِیدࣰا\n",
    "translations": {
      "en": "And, behold, there are indeed among you such as would lag behind, and then, if calamity befalls you, say, \"God has bestowed His favour upon me in that I did not accompany them.\"",
      "ms": "Dan sesungguhnya ada di antara kamu: orang-orang yang sengaja memberat-beratkan dirinya (juga orang lain, daripada turut mara ke medan perang). Kemudian kalau kamu ditimpa kemalangan (tercedera atau terbunuh) ia berkata: \"Sesungguhnya Allah telah mengurniakan nikmat kepadaku, kerana aku tidak turut berperang bersama-sama mereka\".",
      "id": "Dan sesungguhnya di antara kamu ada orang yang sangat berlambat-lambat (ke medan pertempuran). Maka jika kamu ditimpa musibah ia berkata: \"Sesungguhnya Tuhan telah menganugerahkan nikmat kepada saya karena saya tidak ikut berperang bersama mereka.",
      "ar": "وَإِنَّ مِنكُمۡ لَمَن لَّیُبَطِّئَنَّ فَإِنۡ أَصَـٰبَتۡكُم مُّصِیبَةࣱ قَالَ قَدۡ أَنۡعَمَ ٱللَّهُ عَلَیَّ إِذۡ لَمۡ أَكُن مَّعَهُمۡ شَهِیدࣰا\n"
    }
  },
  {
    "id": 566,
    "surahId": 4,
    "ayahNumber": 73,
    "arabicText": "وَلَىِٕنۡ أَصَـٰبَكُمۡ فَضۡلࣱ مِّنَ ٱللَّهِ لَیَقُولَنَّ كَأَن لَّمۡ تَكُنۢ بَیۡنَكُمۡ وَبَیۡنَهُۥ مَوَدَّةࣱ یَـٰلَیۡتَنِی كُنتُ مَعَهُمۡ فَأَفُوزَ فَوۡزًا عَظِیمࣰا\n",
    "translations": {
      "en": "But if good fortune comes to you from God, such a person is sure to say - just as if there had never been any question of love between you and him -: \"Oh, would that I had been with them, and thus had a [share in their] mighty triumph!\"",
      "ms": "Dan demi sesungguhnya kalau kamu beroleh limpah kurnia (kemenangan) dari Allah, sudah tentu ia mengatakan (dengan sesalnya), seolah-olah tidak ada hubungan kasih mesra antara kamu dengannya: \"Alangkah baiknya kalau aku turut serta bersama-sama mereka, supaya aku juga beroleh kemenangan yang amat besar?\"",
      "id": "Dan sungguh jika kamu beroleh karunia (kemenangan) dari Allah, tentulah dia mengatakan seolah-oleh belum pernah ada hubungan kasih sayang antara kamu dengan dia: \"Wahai kiranya saya ada bersama-sama mereka, tentu saya mendapat kemenangan yang besar (pula)\".",
      "ar": "وَلَىِٕنۡ أَصَـٰبَكُمۡ فَضۡلࣱ مِّنَ ٱللَّهِ لَیَقُولَنَّ كَأَن لَّمۡ تَكُنۢ بَیۡنَكُمۡ وَبَیۡنَهُۥ مَوَدَّةࣱ یَـٰلَیۡتَنِی كُنتُ مَعَهُمۡ فَأَفُوزَ فَوۡزًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 567,
    "surahId": 4,
    "ayahNumber": 74,
    "arabicText": "۞ فَلۡیُقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ ٱلَّذِینَ یَشۡرُونَ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا بِٱلۡـَٔاخِرَةِۚ وَمَن یُقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ فَیُقۡتَلۡ أَوۡ یَغۡلِبۡ فَسَوۡفَ نُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "Hence, let them fight in God's cause - all who are willing to barter the life of this world for the life to come: for unto him who fights in God's cause, whether he be slain or be victorious, We shall in time grant a mighty reward.",
      "ms": "Oleh itu, orang-orang (yang beriman) yang mengutamakan kebahagiaan akhirat daripada (kesenangan) kehidupan dunia, hendaklah mereka berperang pada jalan Allah (untuk membela Islam). Dan sesiapa yang berperang pada jalan Allah lalu ia mati (gugur Syahid) atau beroleh kemenangan, maka Kami akan memberi kepadanya pahala yang besar.",
      "id": "Karena itu hendaklah orang-orang yang menukar kehidupan dunia dengan kehidupan akhirat berperang di jalan Allah. Barangsiapa yang berperang di jalan Allah, lalu gugur atau memperoleh kemenangan maka kelak akan Kami berikan kepadanya pahala yang besar.",
      "ar": "۞ فَلۡیُقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ ٱلَّذِینَ یَشۡرُونَ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا بِٱلۡـَٔاخِرَةِۚ وَمَن یُقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ فَیُقۡتَلۡ أَوۡ یَغۡلِبۡ فَسَوۡفَ نُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 568,
    "surahId": 4,
    "ayahNumber": 75,
    "arabicText": "وَمَا لَكُمۡ لَا تُقَـٰتِلُونَ فِی سَبِیلِ ٱللَّهِ وَٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلرِّجَالِ وَٱلنِّسَاۤءِ وَٱلۡوِلۡدَ ٰ⁠نِ ٱلَّذِینَ یَقُولُونَ رَبَّنَاۤ أَخۡرِجۡنَا مِنۡ هَـٰذِهِ ٱلۡقَرۡیَةِ ٱلظَّالِمِ أَهۡلُهَا وَٱجۡعَل لَّنَا مِن لَّدُنكَ وَلِیࣰّا وَٱجۡعَل لَّنَا مِن لَّدُنكَ نَصِیرًا\n",
    "translations": {
      "en": "And how could you refuse to fight in the cause of God and of the utterly helpless men and women and children who are crying, \"O our Sustainer! Lead us forth [to freedom] out of this land whose people are oppressors, and raise for us, out of Thy grace, a protector, and raise for us, out of Thy grace, one who will bring us succour!\"",
      "ms": "Dan apakah yang menghalang kamu (maka kamu) tidak mahu berperang pada jalan Allah (untuk menegakkan ugama Islam) dan (untuk menyelamatkan) orang-orang yang tertindas dari kaum lelaki, perempuan dan kanak-kanak, iaitu mereka yang selalu (berdoa dengan) berkata: \"Wahai Tuhan kami! Keluarkanlah kami dari negeri (Makkah) ini, yang penduduknya (kaum kafir musyrik) yang zalim, dan jadikanlah bagi kami dari pihakMu seorang pemimpin yang mengawal (keselamatan ugama kami), dan jadikanlah bagi kami dari pihakMu seorang pemimpin yang membela kami (dari ancaman musuh)\".",
      "id": "Mengapa kamu tidak mau berperang di jalan Allah dan (membela) orang-orang yang lemah baik laki-laki, wanita-wanita maupun anak-anak yang semuanya berdoa: \"Ya Tuhan kami, keluarkanlah kami dari negeri ini (Mekah) yang zalim penduduknya dan berilah kami pelindung dari sisi Engkau, dan berilah kami penolong dari sisi Engkau!\".",
      "ar": "وَمَا لَكُمۡ لَا تُقَـٰتِلُونَ فِی سَبِیلِ ٱللَّهِ وَٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلرِّجَالِ وَٱلنِّسَاۤءِ وَٱلۡوِلۡدَ ٰ⁠نِ ٱلَّذِینَ یَقُولُونَ رَبَّنَاۤ أَخۡرِجۡنَا مِنۡ هَـٰذِهِ ٱلۡقَرۡیَةِ ٱلظَّالِمِ أَهۡلُهَا وَٱجۡعَل لَّنَا مِن لَّدُنكَ وَلِیࣰّا وَٱجۡعَل لَّنَا مِن لَّدُنكَ نَصِیرًا\n"
    }
  },
  {
    "id": 569,
    "surahId": 4,
    "ayahNumber": 76,
    "arabicText": "ٱلَّذِینَ ءَامَنُوا۟ یُقَـٰتِلُونَ فِی سَبِیلِ ٱللَّهِۖ وَٱلَّذِینَ كَفَرُوا۟ یُقَـٰتِلُونَ فِی سَبِیلِ ٱلطَّـٰغُوتِ فَقَـٰتِلُوۤا۟ أَوۡلِیَاۤءَ ٱلشَّیۡطَـٰنِۖ إِنَّ كَیۡدَ ٱلشَّیۡطَـٰنِ كَانَ ضَعِیفًا\n",
    "translations": {
      "en": "Those who have attained to faith fight in the cause of God, whereas those who are bent on denying the truth fight in the cause of the powers of evil. Fight, then, against those friends of Satan: verily, Satan's guile is weak indeed!",
      "ms": "Orang-orang yang beriman, berperang pada jalan Allah; dan orang-orang yang kafir pula berperang pada jalan Taghut (Syaitan). Oleh sebab itu, perangilah kamu akan pengikut-pengikut Syaitan itu, kerana sesungguhnya tipu daya Syaitan itu adalah lemah.",
      "id": "Orang-orang yang beriman berperang di jalan Allah, dan orang-orang yang kafir berperang di jalan thaghut, sebab itu perangilah kawan-kawan syaitan itu, karena sesungguhnya tipu daya syaitan itu adalah lemah.",
      "ar": "ٱلَّذِینَ ءَامَنُوا۟ یُقَـٰتِلُونَ فِی سَبِیلِ ٱللَّهِۖ وَٱلَّذِینَ كَفَرُوا۟ یُقَـٰتِلُونَ فِی سَبِیلِ ٱلطَّـٰغُوتِ فَقَـٰتِلُوۤا۟ أَوۡلِیَاۤءَ ٱلشَّیۡطَـٰنِۖ إِنَّ كَیۡدَ ٱلشَّیۡطَـٰنِ كَانَ ضَعِیفًا\n"
    }
  },
  {
    "id": 570,
    "surahId": 4,
    "ayahNumber": 77,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ قِیلَ لَهُمۡ كُفُّوۤا۟ أَیۡدِیَكُمۡ وَأَقِیمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَیۡهِمُ ٱلۡقِتَالُ إِذَا فَرِیقࣱ مِّنۡهُمۡ یَخۡشَوۡنَ ٱلنَّاسَ كَخَشۡیَةِ ٱللَّهِ أَوۡ أَشَدَّ خَشۡیَةࣰۚ وَقَالُوا۟ رَبَّنَا لِمَ كَتَبۡتَ عَلَیۡنَا ٱلۡقِتَالَ لَوۡلَاۤ أَخَّرۡتَنَاۤ إِلَىٰۤ أَجَلࣲ قَرِیبࣲۗ قُلۡ مَتَـٰعُ ٱلدُّنۡیَا قَلِیلࣱ وَٱلۡـَٔاخِرَةُ خَیۡرࣱ لِّمَنِ ٱتَّقَىٰ وَلَا تُظۡلَمُونَ فَتِیلًا\n",
    "translations": {
      "en": "ART THOU NOT aware of those who have been told, \"Curb your hands, and be constant in prayer, and render the purifying dues\"? But as soon as fighting [in God's cause] is ordained for them, lo, some of them stand in awe of men as one should stand in awe of God - or in even greater awe - and say, \"O our Sustainer! Why hast Thou ordained fighting for us? If only Thou hadst granted us a delay for a little while!\" Say: \"Brief is the enjoyment of this world, whereas the life to come is the best for all who are conscious of God - since none of you shall be wronged by as much as a hair's breadth.",
      "ms": "Tidakkah engkau (hairan) melihat (wahai Muhammad), akan orang-orang yang (pernah) dikatakan kepada mereka: \"Tahanlah tangan kamu (daripada bertindak melancarkan perang yang belum diizinkan), dan dirikanlah sembahyang serta berikanlah zakat\". (Mereka meminta juga hendak berperang), kemudian apabila mereka diperintahkan berperang, tiba-tiba sepuak di antara mereka merasa gerun kepada manusia sama seperti mereka merasa gerun kepada (azab) Allah atau lebih gerun lagi. Lalu mereka (merayu kepada Allah dengan) berkata: \"Wahai Tuhan kami, mengapa Engkau wajibkan kami berperang (pada saat ini)? Mengapa Engkau tidak biarkan kami hingga ke tempoh yang singkat (iaitu akhir hayat kami)?\" Katakanlah (wahai Muhammad): \"Harba benda yang menjadi kesenangan di dunia ini adalah sedikit sahaja, (dan akhirnya akan lenyap), dan (balasan) hari akhirat itu lebih baik lagi bagi orang-orang yang bertaqwa (kerana ia lebih mewah dan kekal selama-lamanya), dan kamu pula tidak akan dianiaya sedikit pun\".",
      "id": "Tidakkah kamu perhatikan orang-orang yang dikatakan kepada mereka: \"Tahanlah tanganmu (dari berperang), dirikanlah sembahyang dan tunaikanlah zakat!\" Setelah diwajibkan kepada mereka berperang, tiba-tiba sebahagian dari mereka (golongan munafik) takut kepada manusia (musuh), seperti takutnya kepada Allah, bahkan lebih sangat dari itu takutnya. Mereka berkata: \"Ya Tuhan kami, mengapa Engkau wajibkan berperang kepada kami? Mengapa tidak Engkau tangguhkan (kewajiban berperang) kepada kami sampai kepada beberapa waktu lagi?\" Katakanlah: \"Kesenangan di dunia ini hanya sebentar dan akhirat itu lebih baik untuk orang-orang yang bertakwa, dan kamu tidak akan dianiaya sedikitpun.",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ قِیلَ لَهُمۡ كُفُّوۤا۟ أَیۡدِیَكُمۡ وَأَقِیمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَیۡهِمُ ٱلۡقِتَالُ إِذَا فَرِیقࣱ مِّنۡهُمۡ یَخۡشَوۡنَ ٱلنَّاسَ كَخَشۡیَةِ ٱللَّهِ أَوۡ أَشَدَّ خَشۡیَةࣰۚ وَقَالُوا۟ رَبَّنَا لِمَ كَتَبۡتَ عَلَیۡنَا ٱلۡقِتَالَ لَوۡلَاۤ أَخَّرۡتَنَاۤ إِلَىٰۤ أَجَلࣲ قَرِیبࣲۗ قُلۡ مَتَـٰعُ ٱلدُّنۡیَا قَلِیلࣱ وَٱلۡـَٔاخِرَةُ خَیۡرࣱ لِّمَنِ ٱتَّقَىٰ وَلَا تُظۡلَمُونَ فَتِیلًا\n"
    }
  },
  {
    "id": 571,
    "surahId": 4,
    "ayahNumber": 78,
    "arabicText": "أَیۡنَمَا تَكُونُوا۟ یُدۡرِككُّمُ ٱلۡمَوۡتُ وَلَوۡ كُنتُمۡ فِی بُرُوجࣲ مُّشَیَّدَةࣲۗ وَإِن تُصِبۡهُمۡ حَسَنَةࣱ یَقُولُوا۟ هَـٰذِهِۦ مِنۡ عِندِ ٱللَّهِۖ وَإِن تُصِبۡهُمۡ سَیِّئَةࣱ یَقُولُوا۟ هَـٰذِهِۦ مِنۡ عِندِكَۚ قُلۡ كُلࣱّ مِّنۡ عِندِ ٱللَّهِۖ فَمَالِ هَـٰۤؤُلَاۤءِ ٱلۡقَوۡمِ لَا یَكَادُونَ یَفۡقَهُونَ حَدِیثࣰا\n",
    "translations": {
      "en": "Wherever you may be, death will overtake you - even though you be in towers raised high. \"Yet, when a good thing happens to them, some [people] say, \"This is from God,\" whereas when evil befalls them, they say, \"This is from thee [O fellow­man]!” Say: \"All is from God.\" What, then, is amiss with these people that they are in no wise near to grasping the truth of what they are told?",
      "ms": "Di mana jua kamu berada, maut akan mendapatkan kamu (bila sampai ajal), sekalipun kamu berada dalam benteng-benteng yang tinggi lagi kukuh. Dan kalau mereka beroleh kebaikan (kemewahan hidup), mereka berkata: \"Ini adalah dari sisi Allah\", dan kalau pula mereka ditimpa bencana, mereka berkata:\" Ini adalah dari (sesuatu nahas) yang ada padamu\". Katakanlah (wahai Muhammad): \"Semuanya itu (kebaikan dan bencana) adalah (berpunca) dari sisi Allah\". Maka apakah yang menyebabkan kaum itu hampir-hampir tidak memahami perkataan (nasihat dan pengajaran)?",
      "id": "Di mana saja kamu berada, kematian akan mendapatkan kamu, kendatipun kamu di dalam benteng yang tinggi lagi kokoh, dan jika mereka memperoleh kebaikan, mereka mengatakan: \"Ini adalah dari sisi Allah\", dan kalau mereka ditimpa sesuatu bencana mereka mengatakan: \"Ini (datangnya) dari sisi kamu (Muhammad)\". Katakanlah: \"Semuanya (datang) dari sisi Allah\". Maka mengapa orang-orang itu (orang munafik) hampir-hampir tidak memahami pembicaraan sedikitpun?",
      "ar": "أَیۡنَمَا تَكُونُوا۟ یُدۡرِككُّمُ ٱلۡمَوۡتُ وَلَوۡ كُنتُمۡ فِی بُرُوجࣲ مُّشَیَّدَةࣲۗ وَإِن تُصِبۡهُمۡ حَسَنَةࣱ یَقُولُوا۟ هَـٰذِهِۦ مِنۡ عِندِ ٱللَّهِۖ وَإِن تُصِبۡهُمۡ سَیِّئَةࣱ یَقُولُوا۟ هَـٰذِهِۦ مِنۡ عِندِكَۚ قُلۡ كُلࣱّ مِّنۡ عِندِ ٱللَّهِۖ فَمَالِ هَـٰۤؤُلَاۤءِ ٱلۡقَوۡمِ لَا یَكَادُونَ یَفۡقَهُونَ حَدِیثࣰا\n"
    }
  },
  {
    "id": 572,
    "surahId": 4,
    "ayahNumber": 79,
    "arabicText": "مَّاۤ أَصَابَكَ مِنۡ حَسَنَةࣲ فَمِنَ ٱللَّهِۖ وَمَاۤ أَصَابَكَ مِن سَیِّئَةࣲ فَمِن نَّفۡسِكَۚ وَأَرۡسَلۡنَـٰكَ لِلنَّاسِ رَسُولࣰاۚ وَكَفَىٰ بِٱللَّهِ شَهِیدࣰا\n",
    "translations": {
      "en": "Whatever good happens to thee is from God; and whatever evil befalls thee is from thyself. AND WE have sent thee [O Muhammad] as an apostle unto all mankind: and none can bear witness [thereto] as God does.",
      "ms": "Apa jua kebaikan (nikmat kesenangan) yang engkau dapati maka ia adalah dari Allah; dan apa jua bencana yang menimpamu maka ia adalah dari (kesalahan) dirimu sendiri. Dan Kami telah mengutus engkau (wahai Muhammad) kepada seluruh umat manusia sebagai seorang Rasul (yang membawa rahmat). Dan cukuplah Allah menjadi saksi (yang membuktikan kebenaran hakikat ini).",
      "id": "Apa saja nikmat yang kamu peroleh adalah dari Allah, dan apa saja bencana yang menimpamu, maka dari (kesalahan) dirimu sendiri. Kami mengutusmu menjadi Rasul kepada segenap manusia. Dan cukuplah Allah menjadi saksi.",
      "ar": "مَّاۤ أَصَابَكَ مِنۡ حَسَنَةࣲ فَمِنَ ٱللَّهِۖ وَمَاۤ أَصَابَكَ مِن سَیِّئَةࣲ فَمِن نَّفۡسِكَۚ وَأَرۡسَلۡنَـٰكَ لِلنَّاسِ رَسُولࣰاۚ وَكَفَىٰ بِٱللَّهِ شَهِیدࣰا\n"
    }
  },
  {
    "id": 573,
    "surahId": 4,
    "ayahNumber": 80,
    "arabicText": "مَّن یُطِعِ ٱلرَّسُولَ فَقَدۡ أَطَاعَ ٱللَّهَۖ وَمَن تَوَلَّىٰ فَمَاۤ أَرۡسَلۡنَـٰكَ عَلَیۡهِمۡ حَفِیظࣰا\n",
    "translations": {
      "en": "Whoever pays heed unto the Apostle pays heed unto God thereby; and as for those who turn away - We have not sent thee to be their keeper.",
      "ms": "Sesiapa yang taat kepada Rasulullah, maka sesungguhnya ia telah taat kepada Allah; dan sesiapa yang berpaling ingkar, maka (janganlah engkau berdukacita wahai Muhammad), kerana Kami tidak mengutusmu untuk menjadi pengawal (yang memelihara mereka dari melakukan kesalahan).",
      "id": "Barangsiapa yang mentaati Rasul itu, sesungguhnya ia telah mentaati Allah. Dan barangsiapa yang berpaling (dari ketaatan itu), maka Kami tidak mengutusmu untuk menjadi pemelihara bagi mereka.",
      "ar": "مَّن یُطِعِ ٱلرَّسُولَ فَقَدۡ أَطَاعَ ٱللَّهَۖ وَمَن تَوَلَّىٰ فَمَاۤ أَرۡسَلۡنَـٰكَ عَلَیۡهِمۡ حَفِیظࣰا\n"
    }
  },
  {
    "id": 574,
    "surahId": 4,
    "ayahNumber": 81,
    "arabicText": "وَیَقُولُونَ طَاعَةࣱ فَإِذَا بَرَزُوا۟ مِنۡ عِندِكَ بَیَّتَ طَاۤىِٕفَةࣱ مِّنۡهُمۡ غَیۡرَ ٱلَّذِی تَقُولُۖ وَٱللَّهُ یَكۡتُبُ مَا یُبَیِّتُونَۖ فَأَعۡرِضۡ عَنۡهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا\n",
    "translations": {
      "en": "And they say, \"We do pay heed unto thee'' - but when they leave thy presence, some of them devise, in the dark of night, [beliefs] other than thou art voicing; and all the while God records what they thus devise in the dark of night. Leave them, then, alone, and place thy trust in God: for none is as worthy of trust as God.",
      "ms": "Dan mereka (golongan munafik) berkata: \"(Kami) taat\", kemudian apabila mereka keluar dari majlismu, segolongan dari mereka memutuskan pada malam hari satu rancangan yang lain daripada (pengakuan taat) yang mereka katakan (kepadamu). Sedang Allah (perintahkan malaikat) menulis apa yang mereka rancangkan itu; maka berpalinglah (wahai Muhammad) daripada mereka, (janganlah dihiraukan apa yang mereka rancangkan), serta berserahlah kepada Allah; kerana cukuplah Allah menjadi Pembela (yang memeliharamu dari angkara mereka).",
      "id": "Dan mereka (orang-orang munafik) mengatakan: \"(Kewajiban kami hanyalah) taat\". Tetapi apabila mereka telah pergi dari sisimu, sebahagian dari mereka mengatur siasat di malam hari (mengambil keputusan) lain dari yang telah mereka katakan tadi. Allah menulis siasat yang mereka atur di malam hari itu, maka berpalinglah kamu dari mereka dan tawakallah kepada Allah. Cukuplah Allah menjadi Pelindung.",
      "ar": "وَیَقُولُونَ طَاعَةࣱ فَإِذَا بَرَزُوا۟ مِنۡ عِندِكَ بَیَّتَ طَاۤىِٕفَةࣱ مِّنۡهُمۡ غَیۡرَ ٱلَّذِی تَقُولُۖ وَٱللَّهُ یَكۡتُبُ مَا یُبَیِّتُونَۖ فَأَعۡرِضۡ عَنۡهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا\n"
    }
  },
  {
    "id": 575,
    "surahId": 4,
    "ayahNumber": 82,
    "arabicText": "أَفَلَا یَتَدَبَّرُونَ ٱلۡقُرۡءَانَۚ وَلَوۡ كَانَ مِنۡ عِندِ غَیۡرِ ٱللَّهِ لَوَجَدُوا۟ فِیهِ ٱخۡتِلَـٰفࣰا كَثِیرࣰا\n",
    "translations": {
      "en": "Will they not, then, try to understand this Qur’an? Had it issued from any but God, they would surely have found in it many an inner contradiction!",
      "ms": "Patutkah mereka (bersikap demikian), tidak mahu memikirkan isi Al-Quran? Kalaulah Al-Quran itu (datangnya) bukan dari sisi Allah, nescaya mereka akan dapati perselisihan yang banyak di dalamnya.",
      "id": "Maka apakah mereka tidak memperhatikan Al Quran? Kalau kiranya Al Quran itu bukan dari sisi Allah, tentulah mereka mendapat pertentangan yang banyak di dalamnya.",
      "ar": "أَفَلَا یَتَدَبَّرُونَ ٱلۡقُرۡءَانَۚ وَلَوۡ كَانَ مِنۡ عِندِ غَیۡرِ ٱللَّهِ لَوَجَدُوا۟ فِیهِ ٱخۡتِلَـٰفࣰا كَثِیرࣰا\n"
    }
  },
  {
    "id": 576,
    "surahId": 4,
    "ayahNumber": 83,
    "arabicText": "وَإِذَا جَاۤءَهُمۡ أَمۡرࣱ مِّنَ ٱلۡأَمۡنِ أَوِ ٱلۡخَوۡفِ أَذَاعُوا۟ بِهِۦۖ وَلَوۡ رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰۤ أُو۟لِی ٱلۡأَمۡرِ مِنۡهُمۡ لَعَلِمَهُ ٱلَّذِینَ یَسۡتَنۢبِطُونَهُۥ مِنۡهُمۡۗ وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَیۡكُمۡ وَرَحۡمَتُهُۥ لَٱتَّبَعۡتُمُ ٱلشَّیۡطَـٰنَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "AND IF any [secret] matter pertaining to peace or war comes within their ken, they spread it abroad - whereas, if they would but refer it unto the Apostle and unto those from among the believers who have been entrusted with authority, such of them as are engaged in obtaining intelligence would indeed know [what to do with] it And but for God's bounty towards you, and His grace, all but a few of you would certainly have followed Satan.",
      "ms": "Dan apabila datang kepada mereka sesuatu berita mengenai keamanan atau kecemasan, mereka terus menghebahkannya; padahal kalau mereka kembalikan sahaja hal itu kepada Rasulullah dan kepada - \"Ulil-Amri\" (orang-orang yang berkuasa) di antara mereka, tentulah hal itu dapat diketahui oleh orang-orang yang layak mengambil keputusan mengenainya di antara mereka; dan jika tidaklah kerana limpah kurnia Allah dan belas kasihanNya kepada kamu, tentulah kamu (terbabas) menurut Syaitan kecuali sedikit sahaja (iaitu orang-orang yang teguh imannya dan luas ilmunya di antara kamu).",
      "id": "Dan apabila datang kepada mereka suatu berita tentang keamanan ataupun ketakutan, mereka lalu menyiarkannya. Dan kalau mereka menyerahkannya kepada Rasul dan Ulil Amri di antara mereka, tentulah orang-orang yang ingin mengetahui kebenarannya (akan dapat) mengetahuinya dari mereka (Rasul dan Ulil Amri). Kalau tidaklah karena karunia dan rahmat Allah kepada kamu, tentulah kamu mengikut syaitan, kecuali sebahagian kecil saja (di antaramu).",
      "ar": "وَإِذَا جَاۤءَهُمۡ أَمۡرࣱ مِّنَ ٱلۡأَمۡنِ أَوِ ٱلۡخَوۡفِ أَذَاعُوا۟ بِهِۦۖ وَلَوۡ رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰۤ أُو۟لِی ٱلۡأَمۡرِ مِنۡهُمۡ لَعَلِمَهُ ٱلَّذِینَ یَسۡتَنۢبِطُونَهُۥ مِنۡهُمۡۗ وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَیۡكُمۡ وَرَحۡمَتُهُۥ لَٱتَّبَعۡتُمُ ٱلشَّیۡطَـٰنَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 577,
    "surahId": 4,
    "ayahNumber": 84,
    "arabicText": "فَقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ لَا تُكَلَّفُ إِلَّا نَفۡسَكَۚ وَحَرِّضِ ٱلۡمُؤۡمِنِینَۖ عَسَى ٱللَّهُ أَن یَكُفَّ بَأۡسَ ٱلَّذِینَ كَفَرُوا۟ۚ وَٱللَّهُ أَشَدُّ بَأۡسࣰا وَأَشَدُّ تَنكِیلࣰا\n",
    "translations": {
      "en": "Fight thou, then, in God's cause - since thou art but responsible for thine own self - and inspire the believers to overcome all fear of death. God may well curb the might of those who are bent on denying the truth: for God is stronger in might, and stronger in ability to deter.",
      "ms": "Oleh itu, berperanglah (wahai Muhammad) pada jalan Allah (untuk membela Islam dari pencerobohan musuh); engkau tidak diberati selain daripada kewajipanmu sendiri. Dan berilah peransang kepada orang-orang yang beriman (supaya turut berjuang dengan gagah berani). Mudah-mudahan Allah menahan bahaya serangan orang-orang yang kafir itu. Dan (ingatlah) Allah Amatlah besar kekuatanNya dan Amatlah berat azab seksaNya.",
      "id": "Maka berperanglah kamu pada jalan Allah, tidaklah kamu dibebani melainkan dengan kewajiban kamu sendiri. Kobarkanlah semangat para mukmin (untuk berperang). Mudah-mudahan Allah menolak serangan orang-orang yang kafir itu. Allah amat besar kekuatan dan amat keras siksaan(Nya).",
      "ar": "فَقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ لَا تُكَلَّفُ إِلَّا نَفۡسَكَۚ وَحَرِّضِ ٱلۡمُؤۡمِنِینَۖ عَسَى ٱللَّهُ أَن یَكُفَّ بَأۡسَ ٱلَّذِینَ كَفَرُوا۟ۚ وَٱللَّهُ أَشَدُّ بَأۡسࣰا وَأَشَدُّ تَنكِیلࣰا\n"
    }
  },
  {
    "id": 578,
    "surahId": 4,
    "ayahNumber": 85,
    "arabicText": "مَّن یَشۡفَعۡ شَفَـٰعَةً حَسَنَةࣰ یَكُن لَّهُۥ نَصِیبࣱ مِّنۡهَاۖ وَمَن یَشۡفَعۡ شَفَـٰعَةࣰ سَیِّئَةࣰ یَكُن لَّهُۥ كِفۡلࣱ مِّنۡهَاۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ مُّقِیتࣰا\n",
    "translations": {
      "en": "Whoever rallies to a good cause shall have a share in its blessings; and whoever rallies to an evil cause shall be answerable for his part in it: for, indeed, God watches over everything.",
      "ms": "Sesiapa yang memberikan syafaat yang baik nescaya ia akan memperoleh bahagian (pahala) daripadanya; dan sesiapa yang memberikan syafaat yang buruk, nescaya ia akan mendapat bahagian (dosa) daripadanya. Dan (ingatlah) Allah Maha Kuasa atas tiap-tiap sesuatu.",
      "id": "Barangsiapa yang memberikan syafa'at yang baik, niscaya ia akan memperoleh bahagian (pahala) dari padanya. Dan barangsiapa memberi syafa'at yang buruk, niscaya ia akan memikul bahagian (dosa) dari padanya. Allah Maha Kuasa atas segala sesuatu.",
      "ar": "مَّن یَشۡفَعۡ شَفَـٰعَةً حَسَنَةࣰ یَكُن لَّهُۥ نَصِیبࣱ مِّنۡهَاۖ وَمَن یَشۡفَعۡ شَفَـٰعَةࣰ سَیِّئَةࣰ یَكُن لَّهُۥ كِفۡلࣱ مِّنۡهَاۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ مُّقِیتࣰا\n"
    }
  },
  {
    "id": 579,
    "surahId": 4,
    "ayahNumber": 86,
    "arabicText": "وَإِذَا حُیِّیتُم بِتَحِیَّةࣲ فَحَیُّوا۟ بِأَحۡسَنَ مِنۡهَاۤ أَوۡ رُدُّوهَاۤۗ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَیۡءٍ حَسِیبًا\n",
    "translations": {
      "en": "But when you are greeted with a greeting [of peace], answer with an even better greeting, or [at least] with the like thereof. Verily, God keeps count indeed of all things.",
      "ms": "Dan apabila kamu diberikan penghormatan dengan sesuatu ucapan hormat (seperti memberi salam), maka balaslah penghormatan itu dengan yang lebih baik daripadanya, atau balaslah dia (dengan cara yang sama). Sesungguhnya Allah sentiasa menghitung tiap-tiap sesuatu.",
      "id": "Apabila kamu diberi penghormatan dengan sesuatu penghormatan, maka balaslah penghormatan itu dengan yang lebih baik dari padanya, atau balaslah penghormatan itu (dengan yang serupa). Sesungguhnya Allah memperhitungankan segala sesuatu.",
      "ar": "وَإِذَا حُیِّیتُم بِتَحِیَّةࣲ فَحَیُّوا۟ بِأَحۡسَنَ مِنۡهَاۤ أَوۡ رُدُّوهَاۤۗ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَیۡءٍ حَسِیبًا\n"
    }
  },
  {
    "id": 580,
    "surahId": 4,
    "ayahNumber": 87,
    "arabicText": "ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَۚ لَیَجۡمَعَنَّكُمۡ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ لَا رَیۡبَ فِیهِۗ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ حَدِیثࣰا\n",
    "translations": {
      "en": "God - save whom there is no deity - will surely gather you all together on the Day of Resurrection, [the coming of] which is beyond all doubt: and whose word could be truer than God's?",
      "ms": "Allah, tiada Tuhan (yang berhak disembah) melainkan Dia. Sesungguhnya Ia akan menghimpunkan kamu pada hari kiamat, (hari) yang tidak ada syak padanya. Dan siapakah pula yang lebih benar perkataannya daripada Allah?",
      "id": "Allah, tidak ada Tuhan (yang berhak disembah) selain Dia. Sesungguhnya Dia akan mengumpulkan kamu di hari kiamat, yang tidak ada keraguan terjadinya. Dan siapakah orang yang lebih benar perkataan(nya) dari pada Allah?",
      "ar": "ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَۚ لَیَجۡمَعَنَّكُمۡ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ لَا رَیۡبَ فِیهِۗ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ حَدِیثࣰا\n"
    }
  },
  {
    "id": 581,
    "surahId": 4,
    "ayahNumber": 88,
    "arabicText": "۞ فَمَا لَكُمۡ فِی ٱلۡمُنَـٰفِقِینَ فِئَتَیۡنِ وَٱللَّهُ أَرۡكَسَهُم بِمَا كَسَبُوۤا۟ۚ أَتُرِیدُونَ أَن تَهۡدُوا۟ مَنۡ أَضَلَّ ٱللَّهُۖ وَمَن یُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِیلࣰا\n",
    "translations": {
      "en": "How, then, could you be of two minds about the hypocrites, seeing that God [Himself] has disowned them because of their guilt? Do you, perchance, seek to guide those whom God has let go astray - when for him whom God lets go astray thou canst never find any way?",
      "ms": "Maka apakah yang menyebabkan kamu (berpecah) menjadi dua golongan terhadap kaum munafik itu, padahal Allah telah menjerumuskan mereka (ke dalam kekufuran) disebabkan apa yang telah mereka usahakan? Adakah kamu pula hendak memberi pertunjuk kepada orang-orang yang telah disesatkan oleh Allah? Padahal sesiapa yang telah disesatkan oleh Allah, maka engkau tidak sekali-kali akan mendapat jalan untuk menyelamatkannya.",
      "id": "Maka mengapa kamu (terpecah) menjadi dua golongan dalam (menghadapi) orang-orang munafik, padahal Allah telah membalikkan mereka kepada kekafiran, disebabkan usaha mereka sendiri? Apakah kamu bermaksud memberi petunjuk kepada orang-orang yang telah disesatkan Allah? Barangsiapa yang disesatkan Allah, sekali-kali kamu tidak mendapatkan jalan (untuk memberi petunjuk) kepadanya.",
      "ar": "۞ فَمَا لَكُمۡ فِی ٱلۡمُنَـٰفِقِینَ فِئَتَیۡنِ وَٱللَّهُ أَرۡكَسَهُم بِمَا كَسَبُوۤا۟ۚ أَتُرِیدُونَ أَن تَهۡدُوا۟ مَنۡ أَضَلَّ ٱللَّهُۖ وَمَن یُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِیلࣰا\n"
    }
  },
  {
    "id": 582,
    "surahId": 4,
    "ayahNumber": 89,
    "arabicText": "وَدُّوا۟ لَوۡ تَكۡفُرُونَ كَمَا كَفَرُوا۟ فَتَكُونُونَ سَوَاۤءࣰۖ فَلَا تَتَّخِذُوا۟ مِنۡهُمۡ أَوۡلِیَاۤءَ حَتَّىٰ یُهَاجِرُوا۟ فِی سَبِیلِ ٱللَّهِۚ فَإِن تَوَلَّوۡا۟ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَیۡثُ وَجَدتُّمُوهُمۡۖ وَلَا تَتَّخِذُوا۟ مِنۡهُمۡ وَلِیࣰّا وَلَا نَصِیرًا\n",
    "translations": {
      "en": "They would love to see you deny the truth even as they have denied it, so that you should be like them. Do not, therefore, take them for your allies until they forsake the domain of evil for the sake of God; and if they revert to [open] enmity, seize them and slay them wherever you may find them. And do not take any of them for your ally or giver of succour,",
      "ms": ". Mereka suka kalau kamu pula menjadi kafir sebagaimana mereka telah menjadi kafir, maka (dengan yang demikian) menjadilah kamu sama seperti mereka. Oleh itu janganlah kamu mengambil (seorang pun) di antara mereka menjadi teman rapat kamu, sehingga mereka berhijrah pada jalan Allah (untuk menegakkan Islam). Kemudian kalau mereka sengaja berpaling ingkar, maka tawanlah mereka dan bunuhlah mereka di mana sahaja kamu menemuinya; dan jangan sekali-kali kamu mengambil (seorang pun) di antara mereka menjadi teman rapat atau penolong;",
      "id": "Mereka ingin supaya kamu menjadi kafir sebagaimana mereka telah menjadi kafir, lalu kamu menjadi sama (dengan mereka). Maka janganlah kamu jadikan di antara mereka penolong-penolong(mu), hingga mereka berhijrah pada jalan Allah. Maka jika mereka berpaling, tawan dan bunuhlah mereka di mana saja kamu menemuinya, dan janganlah kamu ambil seorangpun di antara mereka menjadi pelindung, dan jangan (pula) menjadi penolong,",
      "ar": "وَدُّوا۟ لَوۡ تَكۡفُرُونَ كَمَا كَفَرُوا۟ فَتَكُونُونَ سَوَاۤءࣰۖ فَلَا تَتَّخِذُوا۟ مِنۡهُمۡ أَوۡلِیَاۤءَ حَتَّىٰ یُهَاجِرُوا۟ فِی سَبِیلِ ٱللَّهِۚ فَإِن تَوَلَّوۡا۟ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَیۡثُ وَجَدتُّمُوهُمۡۖ وَلَا تَتَّخِذُوا۟ مِنۡهُمۡ وَلِیࣰّا وَلَا نَصِیرًا\n"
    }
  },
  {
    "id": 583,
    "surahId": 4,
    "ayahNumber": 90,
    "arabicText": "إِلَّا ٱلَّذِینَ یَصِلُونَ إِلَىٰ قَوۡمِۭ بَیۡنَكُمۡ وَبَیۡنَهُم مِّیثَـٰقٌ أَوۡ جَاۤءُوكُمۡ حَصِرَتۡ صُدُورُهُمۡ أَن یُقَـٰتِلُوكُمۡ أَوۡ یُقَـٰتِلُوا۟ قَوۡمَهُمۡۚ وَلَوۡ شَاۤءَ ٱللَّهُ لَسَلَّطَهُمۡ عَلَیۡكُمۡ فَلَقَـٰتَلُوكُمۡۚ فَإِنِ ٱعۡتَزَلُوكُمۡ فَلَمۡ یُقَـٰتِلُوكُمۡ وَأَلۡقَوۡا۟ إِلَیۡكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمۡ عَلَیۡهِمۡ سَبِیلࣰا\n",
    "translations": {
      "en": "unless it be such [of them] as have ties with people to whom you yourselves are bound by a covenant, or such as come unto you because their hearts shrink from [the thought of] making war either on you or on their own folk - although, if God had willed to make them stronger than you, they would certainly have made war on you. Thus, if they let you be, and do not make war on you, and offer you peace, God does not allow you to harm them.",
      "ms": "Kecuali orang-orang yang pergi (meminta perlindungan) kepada suatu kaum yang ada ikatan perjanjian setia antara kamu dengan mereka, atau orang-orang yang datang kepada kamu sedang hati mereka merasa berat hendak memerangi kamu atau memerangi kaumnya. Dan jika Allah menghendaki, nescaya Ia menjadikan mereka berkuasa melawan kamu, kemudian tentulah mereka memerangi kamu. Dalam pada itu, jika mereka membiarkan kamu (dengan tidak mengancam atau mengganggu), serta mereka tidak memerangi kamu dan mereka menawarkan perdamaian kepada kamu, maka Allah tidak menjadikan bagi kamu sesuatu jalan (yang membolehkan kamu memerangi atau menawan) mereka.",
      "id": "kecuali orang-orang yang meminta perlindungan kepada sesuatu kaum, yang antara kamu dan kaum itu telah ada perjanjian (damai) atau orang-orang yang datang kepada kamu sedang hati mereka merasa keberatan untuk memerangi kamu dan memerangi kaumnya. Kalau Allah menghendaki, tentu Dia memberi kekuasaan kepada mereka terhadap kamu, lalu pastilah mereka memerangimu. tetapi jika mereka membiarkan kamu, dan tidak memerangi kamu serta mengemukakan perdamaian kepadamu maka Allah tidak memberi jalan bagimu (untuk menawan dan membunuh) mereka.",
      "ar": "إِلَّا ٱلَّذِینَ یَصِلُونَ إِلَىٰ قَوۡمِۭ بَیۡنَكُمۡ وَبَیۡنَهُم مِّیثَـٰقٌ أَوۡ جَاۤءُوكُمۡ حَصِرَتۡ صُدُورُهُمۡ أَن یُقَـٰتِلُوكُمۡ أَوۡ یُقَـٰتِلُوا۟ قَوۡمَهُمۡۚ وَلَوۡ شَاۤءَ ٱللَّهُ لَسَلَّطَهُمۡ عَلَیۡكُمۡ فَلَقَـٰتَلُوكُمۡۚ فَإِنِ ٱعۡتَزَلُوكُمۡ فَلَمۡ یُقَـٰتِلُوكُمۡ وَأَلۡقَوۡا۟ إِلَیۡكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمۡ عَلَیۡهِمۡ سَبِیلࣰا\n"
    }
  },
  {
    "id": 584,
    "surahId": 4,
    "ayahNumber": 91,
    "arabicText": "سَتَجِدُونَ ءَاخَرِینَ یُرِیدُونَ أَن یَأۡمَنُوكُمۡ وَیَأۡمَنُوا۟ قَوۡمَهُمۡ كُلَّ مَا رُدُّوۤا۟ إِلَى ٱلۡفِتۡنَةِ أُرۡكِسُوا۟ فِیهَاۚ فَإِن لَّمۡ یَعۡتَزِلُوكُمۡ وَیُلۡقُوۤا۟ إِلَیۡكُمُ ٱلسَّلَمَ وَیَكُفُّوۤا۟ أَیۡدِیَهُمۡ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَیۡثُ ثَقِفۡتُمُوهُمۡۚ وَأُو۟لَـٰۤىِٕكُمۡ جَعَلۡنَا لَكُمۡ عَلَیۡهِمۡ سُلۡطَـٰنࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "You will find [that there are] others who would like to be safe from you as well as safe from their own folk, [but who,] whenever they are faced anew with temptation to evil, plunge into it headlong. Hence, if they do not let you be, and do not offer you peace, and do not stay their hands, seize them and slay them whenever you come upon them: for it is against these that We have clearly empowered you [to make war].",
      "ms": "Kamu juga akan dapati golongan-golongan yang lain (yang pura-pura Islam) supaya mereka beroleh aman dari pihak kamu, dan (sebaliknya mereka melahirkan kekufurannya) supaya mereka beroleh aman dari pihak kaumnya (yang masih kafir). Tiap-tiap kali mereka diajak kepada fitnah (pencerobohan), mereka segera terjerumus ke dalamnya. Oleh itu, jika mereka tidak membiarkan kamu (dan terus mengganggu atau berpihak kepada musuh), dan (tidak pula) menawarkan perdamaian kepada kamu dan juga (tidak) menahan tangan mereka (daripada memerangi kamu), maka hendaklah kamu bertindak menawan mereka dan membunuh mereka di mana sahaja kamu menemuinya; kerana merekalah orang-orang yang Kami jadikan bagi kamu alasan yang terang nyata untuk bertindak terhadapnya.",
      "id": "Kelak kamu akan dapati (golongan-golongan) yang lain, yang bermaksud supaya mereka aman dari pada kamu dan aman (pula) dari kaumnya. Setiap mereka diajak kembali kepada fitnah (syirik), merekapun terjun kedalamnya. Karena itu jika mereka tidak membiarkan kamu dan (tidak) mau mengemukakan perdamaian kepadamu, serta (tidak) menahan tangan mereka (dari memerangimu), maka tawanlah mereka dan bunuhlah mereka dan merekalah orang-orang yang Kami berikan kepadamu alasan yang nyata (untuk menawan dan membunuh) mereka.",
      "ar": "سَتَجِدُونَ ءَاخَرِینَ یُرِیدُونَ أَن یَأۡمَنُوكُمۡ وَیَأۡمَنُوا۟ قَوۡمَهُمۡ كُلَّ مَا رُدُّوۤا۟ إِلَى ٱلۡفِتۡنَةِ أُرۡكِسُوا۟ فِیهَاۚ فَإِن لَّمۡ یَعۡتَزِلُوكُمۡ وَیُلۡقُوۤا۟ إِلَیۡكُمُ ٱلسَّلَمَ وَیَكُفُّوۤا۟ أَیۡدِیَهُمۡ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَیۡثُ ثَقِفۡتُمُوهُمۡۚ وَأُو۟لَـٰۤىِٕكُمۡ جَعَلۡنَا لَكُمۡ عَلَیۡهِمۡ سُلۡطَـٰنࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 585,
    "surahId": 4,
    "ayahNumber": 92,
    "arabicText": "وَمَا كَانَ لِمُؤۡمِنٍ أَن یَقۡتُلَ مُؤۡمِنًا إِلَّا خَطَـࣰٔاۚ وَمَن قَتَلَ مُؤۡمِنًا خَطَـࣰٔا فَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲ وَدِیَةࣱ مُّسَلَّمَةٌ إِلَىٰۤ أَهۡلِهِۦۤ إِلَّاۤ أَن یَصَّدَّقُوا۟ۚ فَإِن كَانَ مِن قَوۡمٍ عَدُوࣲّ لَّكُمۡ وَهُوَ مُؤۡمِنࣱ فَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲۖ وَإِن كَانَ مِن قَوۡمِۭ بَیۡنَكُمۡ وَبَیۡنَهُم مِّیثَـٰقࣱ فَدِیَةࣱ مُّسَلَّمَةٌ إِلَىٰۤ أَهۡلِهِۦ وَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲۖ فَمَن لَّمۡ یَجِدۡ فَصِیَامُ شَهۡرَیۡنِ مُتَتَابِعَیۡنِ تَوۡبَةࣰ مِّنَ ٱللَّهِۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "AND IT IS not conceivable that a believer should slay another believer, unless it be by mistake. And upon him who has slain a believer by mistake there is the duty of freeing a believing soul from bondage and paying an indemnity to the victim's relations, unless they forgo it by way of charity. Now if the slain, while himself a believer, belonged to a people who are at war with you, [the penance shall be confined to] the freeing of a believing soul from bondage; whereas, if he belonged to a people to whom you are bound by a covenant, [it shall consist of] an indemnity to be paid to his relations in ad­dition to the freeing of a believing soul from bon­dage. And he who does not have the wherewithal shall fast [instead] for two consecutive months. (This is) the atonement ordained by God: and God is indeed all-knowing, wise.",
      "ms": "Dan tidak harus sama sekali bagi seseorang mukmin membunuh seorang mukmin yang lain, kecuali dengan tidak sengaja. Dan sesiapa yang membunuh seorang mukmin dengan tidak sengaja, maka (wajiblah ia membayar kaffarah) dengan memerdekakan seorang hamba yang beriman serta membayar \"diah\" (denda ganti nyawa) yang diserahkan kepada ahlinya (keluarga si mati), kecuali jika mereka sedekahkan (memaafkannya). Tetapi jika ia (yang terbunuh dengan tidak sengaja) dari kaum (kafir) yang memusuhi kamu, sedang ia sendiri beriman, maka (wajiblah si pembunuh membayar kaffarah sahaja dengan) memerdekakan seorang hamba yang beriman. Dan jika ia (orang yang terbunuh dengan tidak sengaja itu) dari kaum (kafir) yang ada ikatan perjanjian setia di antara kamu dengan mereka, maka wajiblah membayar \"diah\" (denda ganti nyawa) kepada keluarganya serta memerdekakan seorang hamba yang beriman. Dalam pada itu, sesiapa yang tidak dapat (mencari hamba yang akan dimerdekakannya), maka hendaklah ia berpuasa dua bulan berturut-turut; (hukum yang tersebut) datangnya dari Allah untuk menerima taubat (membersihkan diri kamu). Dan (ingatlah) Allah Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "Dan tidak layak bagi seorang mukmin membunuh seorang mukmin (yang lain), kecuali karena tersalah (tidak sengaja), dan barangsiapa membunuh seorang mukmin karena tersalah (hendaklah) ia memerdekakan seorang hamba sahaya yang beriman serta membayar diat yang diserahkan kepada keluarganya (si terbunuh itu), kecuali jika mereka (keluarga terbunuh) bersedekah. Jika ia (si terbunuh) dari kaum (kafir) yang ada perjanjian (damai) antara mereka dengan kamu, maka (hendaklah si pembunuh) membayar diat yang diserahkan kepada keluarganya (si terbunuh) serta memerdekakan hamba sahaya yang beriman. Barangsiapa yang tidak memperolehnya, maka hendaklah ia (si pembunuh) berpuasa dua bulan berturut-turut untuk penerimaan taubat dari pada Allah. Dan adalah Allah Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "وَمَا كَانَ لِمُؤۡمِنٍ أَن یَقۡتُلَ مُؤۡمِنًا إِلَّا خَطَـࣰٔاۚ وَمَن قَتَلَ مُؤۡمِنًا خَطَـࣰٔا فَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲ وَدِیَةࣱ مُّسَلَّمَةٌ إِلَىٰۤ أَهۡلِهِۦۤ إِلَّاۤ أَن یَصَّدَّقُوا۟ۚ فَإِن كَانَ مِن قَوۡمٍ عَدُوࣲّ لَّكُمۡ وَهُوَ مُؤۡمِنࣱ فَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲۖ وَإِن كَانَ مِن قَوۡمِۭ بَیۡنَكُمۡ وَبَیۡنَهُم مِّیثَـٰقࣱ فَدِیَةࣱ مُّسَلَّمَةٌ إِلَىٰۤ أَهۡلِهِۦ وَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲۖ فَمَن لَّمۡ یَجِدۡ فَصِیَامُ شَهۡرَیۡنِ مُتَتَابِعَیۡنِ تَوۡبَةࣰ مِّنَ ٱللَّهِۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 586,
    "surahId": 4,
    "ayahNumber": 93,
    "arabicText": "وَمَن یَقۡتُلۡ مُؤۡمِنࣰا مُّتَعَمِّدࣰا فَجَزَاۤؤُهُۥ جَهَنَّمُ خَـٰلِدࣰا فِیهَا وَغَضِبَ ٱللَّهُ عَلَیۡهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِیمࣰا\n",
    "translations": {
      "en": "But whoever deliberately slays another be­liever, his requital shall be hell, therein to abide; and God will condemn him, and will reject him, and will prepare for him awesome suffering.",
      "ms": "Dan sesiapa yang membunuh seorang mukmin dengan sengaja, maka balasannya ialah neraka jahanam, kekal ia di dalamnya, dan Allah murka kepadanya, dan melakanatkannya serta menyediakan baginya azab seksa yang besar.",
      "id": "Dan barangsiapa yang membunuh seorang mukmin dengan sengaja maka balasannya ialah Jahannam, kekal ia di dalamnya dan Allah murka kepadanya, dan mengutukinya serta menyediakan azab yang besar baginya.",
      "ar": "وَمَن یَقۡتُلۡ مُؤۡمِنࣰا مُّتَعَمِّدࣰا فَجَزَاۤؤُهُۥ جَهَنَّمُ خَـٰلِدࣰا فِیهَا وَغَضِبَ ٱللَّهُ عَلَیۡهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 587,
    "surahId": 4,
    "ayahNumber": 94,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا ضَرَبۡتُمۡ فِی سَبِیلِ ٱللَّهِ فَتَبَیَّنُوا۟ وَلَا تَقُولُوا۟ لِمَنۡ أَلۡقَىٰۤ إِلَیۡكُمُ ٱلسَّلَـٰمَ لَسۡتَ مُؤۡمِنࣰا تَبۡتَغُونَ عَرَضَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا فَعِندَ ٱللَّهِ مَغَانِمُ كَثِیرَةࣱۚ كَذَ ٰ⁠لِكَ كُنتُم مِّن قَبۡلُ فَمَنَّ ٱللَّهُ عَلَیۡكُمۡ فَتَبَیَّنُوۤا۟ۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n",
    "translations": {
      "en": "[Hence,] O you who have attained to faith, when you go forth [to war] in God's cause, use your discernment, and do not - out of a desire for the fleeting gains of this worldly life - say unto anyone who offers you the greeting of peace, \"Thou art not a believer\" for with God there are gains abundant. You, too, were once in the same condition - but God has been gracious unto you. Use, therefore, your discernment: verily, God is always aware of what you do.",
      "ms": "Wahai orang-orang yang beriman, apabila kamu pergi (berperang) pada jalan Allah (untuk membela Islam), maka hendaklah kamu menyelidik (apa jua perkara dengan sebaik-baiknya), dan janganlah kamu (terburu-buru) mengatakan kepada orang yang menunjukkan kepada kamu sikap damai (dengan memberi salam atau mengucap dua Kalimah Syahadat): \"Engkau bukan orang yang beriman\" (lalu kamu membunuhnya) dengan tujuan hendak (mendapat harta bendanya yang merupakan) harta benda kehidupan dunia (yang tidak kekal). (Janganlah kamu gelap mata kepada daki dunia itu) kerana di sisi Allah ada disediakan limpah kurnia yang banyak. Demikianlah juga keadaan kamu dahulu (dapat diketahui oleh orang lain akan keIslaman kamu dengan memberi salam atau mengucap kalimah Syahadat), lalu Allah mengurniakan nikmatNya kepada kamu. Oleh itu selidikilah (apa-apa jua lebih dahulu, dan janganlah bertindak dengan terburu-buru). Sesungguhnya Allah sentiasa memerhati dengan mendalam akan segala yang kamu lakukan.",
      "id": "Hai orang-orang yang beriman, apabila kamu pergi (berperang) di jalan Allah, maka telitilah dan janganlah kamu mengatakan kepada orang yang mengucapkan \"salam\" kepadamu: \"Kamu bukan seorang mukmin\" (lalu kamu membunuhnya), dengan maksud mencari harta benda kehidupan di dunia, karena di sisi Allah ada harta yang banyak. Begitu jugalah keadaan kamu dahulu, lalu Allah menganugerahkan nikmat-Nya atas kamu, maka telitilah. Sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا ضَرَبۡتُمۡ فِی سَبِیلِ ٱللَّهِ فَتَبَیَّنُوا۟ وَلَا تَقُولُوا۟ لِمَنۡ أَلۡقَىٰۤ إِلَیۡكُمُ ٱلسَّلَـٰمَ لَسۡتَ مُؤۡمِنࣰا تَبۡتَغُونَ عَرَضَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا فَعِندَ ٱللَّهِ مَغَانِمُ كَثِیرَةࣱۚ كَذَ ٰ⁠لِكَ كُنتُم مِّن قَبۡلُ فَمَنَّ ٱللَّهُ عَلَیۡكُمۡ فَتَبَیَّنُوۤا۟ۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n"
    }
  },
  {
    "id": 588,
    "surahId": 4,
    "ayahNumber": 95,
    "arabicText": "لَّا یَسۡتَوِی ٱلۡقَـٰعِدُونَ مِنَ ٱلۡمُؤۡمِنِینَ غَیۡرُ أُو۟لِی ٱلضَّرَرِ وَٱلۡمُجَـٰهِدُونَ فِی سَبِیلِ ٱللَّهِ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡۚ فَضَّلَ ٱللَّهُ ٱلۡمُجَـٰهِدِینَ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡ عَلَى ٱلۡقَـٰعِدِینَ دَرَجَةࣰۚ وَكُلࣰّا وَعَدَ ٱللَّهُ ٱلۡحُسۡنَىٰۚ وَفَضَّلَ ٱللَّهُ ٱلۡمُجَـٰهِدِینَ عَلَى ٱلۡقَـٰعِدِینَ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "SUCH of the believers as remain passive - other than the disabled - cannot be deemed equal to those who strive hard in God's cause with their possessions and their lives: God has exalted those who strive hard with their possessions and their lives far above those who remain passive. Although God has promised the ultimate good unto all [believers], yet has God exalted those who strive hard above those who remain passive by [promising them] a mighty reward -",
      "ms": "Tidaklah sama keadaan orang-orang yang duduk (tidak turut berperang) dari kalangan orang-orang yang beriman - selain daripada orang-orang yang ada keuzuran - dengan orang-orang yang berjihad (berjuang) pada jalan Allah (untuk membela Islam) dengan harta dan jiwanya. Allah melebihkan orang-orang yang berjuang dengan harta benda dan jiwa mereka atas orang-orang yang tinggal duduk (tidak turut berperang kerana uzur) dengan kelebihan satu darjat. Dan tiap-tiap satu (dari dua golongan itu) Allah menjanjikan dengan balasan yang baik (Syurga), dan Allah melebihkan orang-orang yang berjuang atas orang-orang yang tinggal duduk (tidak turut berperang dan tidak ada sesuatu uzur) dengan pahala yang amat besar;",
      "id": "Tidaklah sama antara mukmin yang duduk (yang tidak ikut berperang) yang tidak mempunyai 'uzur dengan orang-orang yang berjihad di jalan Allah dengan harta mereka dan jiwanya. Allah melebihkan orang-orang yang berjihad dengan harta dan jiwanya atas orang-orang yang duduk satu derajat. Kepada masing-masing mereka Allah menjanjikan pahala yang baik (surga) dan Allah melebihkan orang-orang yang berjihad atas orang yang duduk dengan pahala yang besar,",
      "ar": "لَّا یَسۡتَوِی ٱلۡقَـٰعِدُونَ مِنَ ٱلۡمُؤۡمِنِینَ غَیۡرُ أُو۟لِی ٱلضَّرَرِ وَٱلۡمُجَـٰهِدُونَ فِی سَبِیلِ ٱللَّهِ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡۚ فَضَّلَ ٱللَّهُ ٱلۡمُجَـٰهِدِینَ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡ عَلَى ٱلۡقَـٰعِدِینَ دَرَجَةࣰۚ وَكُلࣰّا وَعَدَ ٱللَّهُ ٱلۡحُسۡنَىٰۚ وَفَضَّلَ ٱللَّهُ ٱلۡمُجَـٰهِدِینَ عَلَى ٱلۡقَـٰعِدِینَ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 589,
    "surahId": 4,
    "ayahNumber": 96,
    "arabicText": "دَرَجَـٰتࣲ مِّنۡهُ وَمَغۡفِرَةࣰ وَرَحۡمَةࣰۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمًا\n",
    "translations": {
      "en": "[many] degrees thereof - and for­giveness of sins, and His grace; for God is indeed much-forgiving, a dispenser of grace.",
      "ms": "Iaitu beberapa darjat kelebihan daripadaNya, dan keampunan serta rahmat belas kasihan. Dan (ingatlah) adalah Allah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "(yaitu) beberapa derajat dari pada-Nya, ampunan serta rahmat. Dan adalah Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "دَرَجَـٰتࣲ مِّنۡهُ وَمَغۡفِرَةࣰ وَرَحۡمَةࣰۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمًا\n"
    }
  },
  {
    "id": 590,
    "surahId": 4,
    "ayahNumber": 97,
    "arabicText": "إِنَّ ٱلَّذِینَ تَوَفَّىٰهُمُ ٱلۡمَلَـٰۤىِٕكَةُ ظَالِمِیۤ أَنفُسِهِمۡ قَالُوا۟ فِیمَ كُنتُمۡۖ قَالُوا۟ كُنَّا مُسۡتَضۡعَفِینَ فِی ٱلۡأَرۡضِۚ قَالُوۤا۟ أَلَمۡ تَكُنۡ أَرۡضُ ٱللَّهِ وَ ٰ⁠سِعَةࣰ فَتُهَاجِرُوا۟ فِیهَاۚ فَأُو۟لَـٰۤىِٕكَ مَأۡوَىٰهُمۡ جَهَنَّمُۖ وَسَاۤءَتۡ مَصِیرًا\n",
    "translations": {
      "en": "Behold, those whom the angels gather in death while they are still sinning against themselves, [the angels] will ask, \"What was wrong with you?'' They will answer: \"We were too weak on earth.\" [The angels] will say: \"Was, then, God's earth not wide enough for you to forsake the domain of evil?\" For such, then, the goal is hell - and how evil a journey's end!",
      "ms": "Sesungguhnya orang-orang yang diambil nyawanya oleh malaikat semasa mereka sedang menganiaya diri sendiri (kerana enggan berhijrah untuk membela Islam dan rela ditindas oleh kaum kafir musyrik), mereka ditanya oleh malaikat dengan berkata: \"Apakah yang kamu telah lakukan mengenai ugama kamu?\" Mereka menjawab: \"Kami dahulu adalah orang-orang yang tertindas di bumi\". Malaikat bertanya lagi: \"Tidakkah bumi Allah itu luas, yang membolehkan kamu berhijrah dengan bebas padanya?\" Maka orang-orang yang sedemikian itu keadaannya, tempat akhir mereka ialah neraka jahanam, dan neraka jahanam itu adalah seburuk-buruk tempat kembali.",
      "id": "Sesungguhnya orang-orang yang diwafatkan malaikat dalam keadaan menganiaya diri sendiri, (kepada mereka) malaikat bertanya: \"Dalam keadaan bagaimana kamu ini?\". Mereka menjawab: \"Adalah kami orang-orang yang tertindas di negeri (Mekah)\". Para malaikat berkata: \"Bukankah bumi Allah itu luas, sehingga kamu dapat berhijrah di bumi itu?\". Orang-orang itu tempatnya neraka Jahannam, dan Jahannam itu seburuk-buruk tempat kembali,",
      "ar": "إِنَّ ٱلَّذِینَ تَوَفَّىٰهُمُ ٱلۡمَلَـٰۤىِٕكَةُ ظَالِمِیۤ أَنفُسِهِمۡ قَالُوا۟ فِیمَ كُنتُمۡۖ قَالُوا۟ كُنَّا مُسۡتَضۡعَفِینَ فِی ٱلۡأَرۡضِۚ قَالُوۤا۟ أَلَمۡ تَكُنۡ أَرۡضُ ٱللَّهِ وَ ٰ⁠سِعَةࣰ فَتُهَاجِرُوا۟ فِیهَاۚ فَأُو۟لَـٰۤىِٕكَ مَأۡوَىٰهُمۡ جَهَنَّمُۖ وَسَاۤءَتۡ مَصِیرًا\n"
    }
  },
  {
    "id": 591,
    "surahId": 4,
    "ayahNumber": 98,
    "arabicText": "إِلَّا ٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلرِّجَالِ وَٱلنِّسَاۤءِ وَٱلۡوِلۡدَ ٰ⁠نِ لَا یَسۡتَطِیعُونَ حِیلَةࣰ وَلَا یَهۡتَدُونَ سَبِیلࣰا\n",
    "translations": {
      "en": "But excepted shall be the truly helpless - be they men or women or children - who cannot bring forth any strength and have not been shown the right way:",
      "ms": "Kecuali orang-orang yang lemah (lagi uzur) dari kaum lelaki dan perempuan serta kanak-kanak, yang tidak berdaya upaya mencari helah (untuk melepaskan diri) dan tidak pula mengetahui sesuatu jalan (untuk berhijrah).",
      "id": "kecuali mereka yang tertindas baik laki-laki atau wanita ataupun anak-anak yang tidak mampu berdaya upaya dan tidak mengetahui jalan (untuk hijrah),",
      "ar": "إِلَّا ٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلرِّجَالِ وَٱلنِّسَاۤءِ وَٱلۡوِلۡدَ ٰ⁠نِ لَا یَسۡتَطِیعُونَ حِیلَةࣰ وَلَا یَهۡتَدُونَ سَبِیلࣰا\n"
    }
  },
  {
    "id": 592,
    "surahId": 4,
    "ayahNumber": 99,
    "arabicText": "فَأُو۟لَـٰۤىِٕكَ عَسَى ٱللَّهُ أَن یَعۡفُوَ عَنۡهُمۡۚ وَكَانَ ٱللَّهُ عَفُوًّا غَفُورࣰا\n",
    "translations": {
      "en": "as for them, God may well efface their sin - for God is indeed an absolver of sins, much-forgiving.",
      "ms": "Maka mereka (yang demikian sifatnya), mudah-mudahan Allah maafkan mereka. Dan (ingatlah), Allah Maha Pemaaf, lagi Maha Pengampun.",
      "id": "mereka itu, mudah-mudahan Allah memaafkannya. Dan adalah Allah Maha Pemaaf lagi Maha Pengampun.",
      "ar": "فَأُو۟لَـٰۤىِٕكَ عَسَى ٱللَّهُ أَن یَعۡفُوَ عَنۡهُمۡۚ وَكَانَ ٱللَّهُ عَفُوًّا غَفُورࣰا\n"
    }
  },
  {
    "id": 593,
    "surahId": 4,
    "ayahNumber": 100,
    "arabicText": "۞ وَمَن یُهَاجِرۡ فِی سَبِیلِ ٱللَّهِ یَجِدۡ فِی ٱلۡأَرۡضِ مُرَ ٰ⁠غَمࣰا كَثِیرࣰا وَسَعَةࣰۚ وَمَن یَخۡرُجۡ مِنۢ بَیۡتِهِۦ مُهَاجِرًا إِلَى ٱللَّهِ وَرَسُولِهِۦ ثُمَّ یُدۡرِكۡهُ ٱلۡمَوۡتُ فَقَدۡ وَقَعَ أَجۡرُهُۥ عَلَى ٱللَّهِۗ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "And he who forsakes the domain of evil for the sake of God shall find on earth many a lonely road, as well as life abundant. And if anyone leaves his home, fleeing from evil unto God and His Apostle, and then death overtakes him - his reward is ready with God: for God iss indeed much-forgiving, a dis­penser of grace.",
      "ms": "Dan sesiapa yang berhijrah pada jalan Allah (untuk membela dan menegakkan Islam), nescaya ia akan dapati di muka bumi ini tempat berhijrah yang banyak dan rezeki yang makmur; dan sesiapa yang keluar dari rumahnya dengan tujuan berhijrah kepada Allah dan RasulNya, kemudian ia mati (dalam perjalanan), maka sesungguhnya telah tetap pahala hijrahnya di sisi Allah. Dan (ingatlah) Allah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Barangsiapa berhijrah di jalan Allah, niscaya mereka mendapati di muka bumi ini tempat hijrah yang luas dan rezeki yang banyak. Barangsiapa keluar dari rumahnya dengan maksud berhijrah kepada Allah dan Rasul-Nya, kemudian kematian menimpanya (sebelum sampai ke tempat yang dituju), maka sungguh telah tetap pahalanya di sisi Allah. Dan adalah Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "۞ وَمَن یُهَاجِرۡ فِی سَبِیلِ ٱللَّهِ یَجِدۡ فِی ٱلۡأَرۡضِ مُرَ ٰ⁠غَمࣰا كَثِیرࣰا وَسَعَةࣰۚ وَمَن یَخۡرُجۡ مِنۢ بَیۡتِهِۦ مُهَاجِرًا إِلَى ٱللَّهِ وَرَسُولِهِۦ ثُمَّ یُدۡرِكۡهُ ٱلۡمَوۡتُ فَقَدۡ وَقَعَ أَجۡرُهُۥ عَلَى ٱللَّهِۗ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 594,
    "surahId": 4,
    "ayahNumber": 101,
    "arabicText": "وَإِذَا ضَرَبۡتُمۡ فِی ٱلۡأَرۡضِ فَلَیۡسَ عَلَیۡكُمۡ جُنَاحٌ أَن تَقۡصُرُوا۟ مِنَ ٱلصَّلَوٰةِ إِنۡ خِفۡتُمۡ أَن یَفۡتِنَكُمُ ٱلَّذِینَ كَفَرُوۤا۟ۚ إِنَّ ٱلۡكَـٰفِرِینَ كَانُوا۟ لَكُمۡ عَدُوࣰّا مُّبِینࣰا\n",
    "translations": {
      "en": "AND WHEN you go forth [to war] on earth, you will incur no sin by shortening your prayers if you have reason to fear that those who are bent on denying the truth might suddenly fall upon you: for, verily, those who deny the truth are your open foes.",
      "ms": "Dan apabila kamu musafir di muka bumi, maka kamu tidaklah berdosa \"mengqasarkan\" (memendekkan) sembahyang jika kamu takut diserang oleh orang-orang kafir. Sesungguhnya orang-orang kafir itu adalah musuh yang amat nyata bagi kamu.",
      "id": "Dan apabila kamu bepergian di muka bumi, maka tidaklah mengapa kamu men-qashar sembahyang(mu), jika kamu takut diserang orang-orang kafir. Sesungguhnya orang-orang kafir itu adalah musuh yang nyata bagimu.",
      "ar": "وَإِذَا ضَرَبۡتُمۡ فِی ٱلۡأَرۡضِ فَلَیۡسَ عَلَیۡكُمۡ جُنَاحٌ أَن تَقۡصُرُوا۟ مِنَ ٱلصَّلَوٰةِ إِنۡ خِفۡتُمۡ أَن یَفۡتِنَكُمُ ٱلَّذِینَ كَفَرُوۤا۟ۚ إِنَّ ٱلۡكَـٰفِرِینَ كَانُوا۟ لَكُمۡ عَدُوࣰّا مُّبِینࣰا\n"
    }
  },
  {
    "id": 595,
    "surahId": 4,
    "ayahNumber": 102,
    "arabicText": "وَإِذَا كُنتَ فِیهِمۡ فَأَقَمۡتَ لَهُمُ ٱلصَّلَوٰةَ فَلۡتَقُمۡ طَاۤىِٕفَةࣱ مِّنۡهُم مَّعَكَ وَلۡیَأۡخُذُوۤا۟ أَسۡلِحَتَهُمۡۖ فَإِذَا سَجَدُوا۟ فَلۡیَكُونُوا۟ مِن وَرَاۤىِٕكُمۡ وَلۡتَأۡتِ طَاۤىِٕفَةٌ أُخۡرَىٰ لَمۡ یُصَلُّوا۟ فَلۡیُصَلُّوا۟ مَعَكَ وَلۡیَأۡخُذُوا۟ حِذۡرَهُمۡ وَأَسۡلِحَتَهُمۡۗ وَدَّ ٱلَّذِینَ كَفَرُوا۟ لَوۡ تَغۡفُلُونَ عَنۡ أَسۡلِحَتِكُمۡ وَأَمۡتِعَتِكُمۡ فَیَمِیلُونَ عَلَیۡكُم مَّیۡلَةࣰ وَ ٰ⁠حِدَةࣰۚ وَلَا جُنَاحَ عَلَیۡكُمۡ إِن كَانَ بِكُمۡ أَذࣰى مِّن مَّطَرٍ أَوۡ كُنتُم مَّرۡضَىٰۤ أَن تَضَعُوۤا۟ أَسۡلِحَتَكُمۡۖ وَخُذُوا۟ حِذۡرَكُمۡۗ إِنَّ ٱللَّهَ أَعَدَّ لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n",
    "translations": {
      "en": "Thus, when thou art among the believers and about to lead them in prayer, let [only] part of them stand up with thee, retaining their arms. Then, after they have finished their prayer, let them provide you cover while another group, who have not yet prayed, shall come forward and pray with thee, being fully prepared against danger and retaining their arms: (for) those who are bent on denying the truth would love to see you oblivious of your arms and your equipment, so that they might fall upon you in a surprise attack. But it shall not be wrong for you to lay down your arms [while you pray] if you are troubled by rain or if you are ill; but [always] be fully prepared against danger. Verily, God has readied shameful suffering for all who deny the truth!",
      "ms": "Dan apabila engkau (wahai Muhammad) berada dalam kalangan mereka (semasa perang), lalu engkau mendirikan sembahyang dengan (menjadi imam) mereka, maka hendaklah sepuak dari mereka berdiri (mengerjakan sembahyang) bersama-samamu, dan hendaklah mereka menyandang senjata masing-masing; kemudian apabila mereka telah sujud, maka hendaklah mereka berundur ke belakang (untuk menjaga serbuan musuh); dan hendaklah datang pula puak yang lain (yang kedua) yang belum sembahyang (kerana menjaga serbuan musuh), maka hendaklah mereka bersembahyang (berjamaah) bersama-samamu, dan hendakah mereka mengambil langkah berjaga-jaga serta menyandang senjata masing-masing. Orang-orang kafir memang suka kalau kamu cuai lalai akan senjata dan harta benda kamu, supaya dengan jalan itu mereka dapat menyerbu kamu beramai-ramai dengan serentak. Dan tidaklah kamu berdosa meletakkan senjata masing-masing, jika kamu dihalangi sesuatu yang menyusahkan disebabkan hujan atau kamu sakit. Dan hendaklah kamu mengambil langkah berjaga-jaga. Sesungguhnya Allah telah menyediakan bagi orang-orang kafir itu azab seksa yang amat menghina.",
      "id": "Dan apabila kamu berada di tengah-tengah mereka (sahabatmu) lalu kamu hendak mendirikan shalat bersama-sama mereka, maka hendaklah segolongan dari mereka berdiri (shalat) besertamu dan menyandang senjata, kemudian apabila mereka (yang shalat besertamu) sujud (telah menyempurnakan serakaat), maka hendaklah mereka pindah dari belakangmu (untuk menghadapi musuh) dan hendaklah datang golongan yang kedua yang belum bersembahyang, lalu bersembahyanglah mereka denganmu], dan hendaklah mereka bersiap siaga dan menyandang senjata. Orang-orang kafir ingin supaya kamu lengah terhadap senjatamu dan harta bendamu, lalu mereka menyerbu kamu dengan sekaligus. Dan tidak ada dosa atasmu meletakkan senjata-senjatamu, jika kamu mendapat sesuatu kesusahan karena hujan atau karena kamu memang sakit; dan siap siagalah kamu. Sesungguhnya Allah telah menyediakan azab yang menghinakan bagi orang-orang kafir itu.",
      "ar": "وَإِذَا كُنتَ فِیهِمۡ فَأَقَمۡتَ لَهُمُ ٱلصَّلَوٰةَ فَلۡتَقُمۡ طَاۤىِٕفَةࣱ مِّنۡهُم مَّعَكَ وَلۡیَأۡخُذُوۤا۟ أَسۡلِحَتَهُمۡۖ فَإِذَا سَجَدُوا۟ فَلۡیَكُونُوا۟ مِن وَرَاۤىِٕكُمۡ وَلۡتَأۡتِ طَاۤىِٕفَةٌ أُخۡرَىٰ لَمۡ یُصَلُّوا۟ فَلۡیُصَلُّوا۟ مَعَكَ وَلۡیَأۡخُذُوا۟ حِذۡرَهُمۡ وَأَسۡلِحَتَهُمۡۗ وَدَّ ٱلَّذِینَ كَفَرُوا۟ لَوۡ تَغۡفُلُونَ عَنۡ أَسۡلِحَتِكُمۡ وَأَمۡتِعَتِكُمۡ فَیَمِیلُونَ عَلَیۡكُم مَّیۡلَةࣰ وَ ٰ⁠حِدَةࣰۚ وَلَا جُنَاحَ عَلَیۡكُمۡ إِن كَانَ بِكُمۡ أَذࣰى مِّن مَّطَرٍ أَوۡ كُنتُم مَّرۡضَىٰۤ أَن تَضَعُوۤا۟ أَسۡلِحَتَكُمۡۖ وَخُذُوا۟ حِذۡرَكُمۡۗ إِنَّ ٱللَّهَ أَعَدَّ لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n"
    }
  },
  {
    "id": 596,
    "surahId": 4,
    "ayahNumber": 103,
    "arabicText": "فَإِذَا قَضَیۡتُمُ ٱلصَّلَوٰةَ فَٱذۡكُرُوا۟ ٱللَّهَ قِیَـٰمࣰا وَقُعُودࣰا وَعَلَىٰ جُنُوبِكُمۡۚ فَإِذَا ٱطۡمَأۡنَنتُمۡ فَأَقِیمُوا۟ ٱلصَّلَوٰةَۚ إِنَّ ٱلصَّلَوٰةَ كَانَتۡ عَلَى ٱلۡمُؤۡمِنِینَ كِتَـٰبࣰا مَّوۡقُوتࣰا\n",
    "translations": {
      "en": "And when you have finished your prayer, remember God - standing and sitting and lying down; and when you are once again secure, observe your prayers [fully]. Verily, for all believers prayer is indeed a sacred duty linked to particular times [of day].",
      "ms": "Kemudian apabila kamu telah selesai mengerjakan sembahyang, maka hendaklah kamu menyebut dan mengingati Allah semasa kamu berdiri atau duduk, dan semasa kamu berbaring. Kemudian apabila kamu telah merasa tenteram (berada dalam keadaan aman) maka dirikanlah sembahyang itu (dengan sempurna sebagaimana biasa). Sesungguhnya sembahyang itu adalah satu ketetapan yang diwajibkan atas orang-orang yang beriman, yang tertentu waktunya.",
      "id": "Maka apabila kamu telah menyelesaikan shalat(mu), ingatlah Allah di waktu berdiri, di waktu duduk dan di waktu berbaring. Kemudian apabila kamu telah merasa aman, maka dirikanlah shalat itu (sebagaimana biasa). Sesungguhnya shalat itu adalah fardhu yang ditentukan waktunya atas orang-orang yang beriman.",
      "ar": "فَإِذَا قَضَیۡتُمُ ٱلصَّلَوٰةَ فَٱذۡكُرُوا۟ ٱللَّهَ قِیَـٰمࣰا وَقُعُودࣰا وَعَلَىٰ جُنُوبِكُمۡۚ فَإِذَا ٱطۡمَأۡنَنتُمۡ فَأَقِیمُوا۟ ٱلصَّلَوٰةَۚ إِنَّ ٱلصَّلَوٰةَ كَانَتۡ عَلَى ٱلۡمُؤۡمِنِینَ كِتَـٰبࣰا مَّوۡقُوتࣰا\n"
    }
  },
  {
    "id": 597,
    "surahId": 4,
    "ayahNumber": 104,
    "arabicText": "وَلَا تَهِنُوا۟ فِی ٱبۡتِغَاۤءِ ٱلۡقَوۡمِۖ إِن تَكُونُوا۟ تَأۡلَمُونَ فَإِنَّهُمۡ یَأۡلَمُونَ كَمَا تَأۡلَمُونَۖ وَتَرۡجُونَ مِنَ ٱللَّهِ مَا لَا یَرۡجُونَۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمًا\n",
    "translations": {
      "en": "And be not faint of heart when you seek out the [enemy] host. If you happen to suffer pain, behold, they suffer pain even as you suffer it: but you are hoping [to receive] from God what they cannot hope for. And God is indeed all-knowing, wise.",
      "ms": "Dan janganlah kamu lemah (hilang semangat) dalam memburu musuh (yang menceroboh) itu; kerana kalau kamu menderita sakit (luka atau mati) maka sesungguhnya mereka pun menderita sakitnya seperti penderitaan kamu; sedang kamu mengharapkan dari Allah apa yang mereka tidak harapkan (iaitu balasan yang baik pada hari akhirat kelak). Dan (ingatlah) Allah Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "Janganlah kamu berhati lemah dalam mengejar mereka (musuhmu). Jika kamu menderita kesakitan, maka sesungguhnya merekapun menderita kesakitan (pula), sebagaimana kamu menderitanya, sedang kamu mengharap dari pada Allah apa yang tidak mereka harapkan. Dan adalah Allah Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "وَلَا تَهِنُوا۟ فِی ٱبۡتِغَاۤءِ ٱلۡقَوۡمِۖ إِن تَكُونُوا۟ تَأۡلَمُونَ فَإِنَّهُمۡ یَأۡلَمُونَ كَمَا تَأۡلَمُونَۖ وَتَرۡجُونَ مِنَ ٱللَّهِ مَا لَا یَرۡجُونَۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمًا\n"
    }
  },
  {
    "id": 598,
    "surahId": 4,
    "ayahNumber": 105,
    "arabicText": "إِنَّاۤ أَنزَلۡنَاۤ إِلَیۡكَ ٱلۡكِتَـٰبَ بِٱلۡحَقِّ لِتَحۡكُمَ بَیۡنَ ٱلنَّاسِ بِمَاۤ أَرَىٰكَ ٱللَّهُۚ وَلَا تَكُن لِّلۡخَاۤىِٕنِینَ خَصِیمࣰا\n",
    "translations": {
      "en": "BEHOLD, We have bestowed upon thee from on high this divine writ, setting forth the truth, so that thou may judge between people in accordance with what God has taught thee. Hence, do not contend with those who are false to their trust,",
      "ms": "Sesungguhnya Kami menurunkan kepadamu (wahai Muhammad) Kitab (Al-Quran) dengan membawa kebenaran, supaya engkau menghukum di antara manusia menurut apa yang Allah telah tunjukkan kepadamu (melalui wahyuNya); dan janganlah engkau menjadi pembela bagi orang-orang yang khianat.",
      "id": "Sesungguhnya Kami telah menurunkan kitab kepadamu dengan membawa kebenaran, supaya kamu mengadili antara manusia dengan apa yang telah Allah wahyukan kepadamu, dan janganlah kamu menjadi penantang (orang yang tidak bersalah), karena (membela) orang-orang yang khianat,",
      "ar": "إِنَّاۤ أَنزَلۡنَاۤ إِلَیۡكَ ٱلۡكِتَـٰبَ بِٱلۡحَقِّ لِتَحۡكُمَ بَیۡنَ ٱلنَّاسِ بِمَاۤ أَرَىٰكَ ٱللَّهُۚ وَلَا تَكُن لِّلۡخَاۤىِٕنِینَ خَصِیمࣰا\n"
    }
  },
  {
    "id": 599,
    "surahId": 4,
    "ayahNumber": 106,
    "arabicText": "وَٱسۡتَغۡفِرِ ٱللَّهَۖ إِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "but pray God to forgive [them]: behold, God is indeed much-forgiving, a dispenser of grace.",
      "ms": "Dan hendaklah engkau memohon ampun kepada Allah; kerana sesungguhnya Allah adalah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "dan mohonlah ampun kepada Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "وَٱسۡتَغۡفِرِ ٱللَّهَۖ إِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 600,
    "surahId": 4,
    "ayahNumber": 107,
    "arabicText": "وَلَا تُجَـٰدِلۡ عَنِ ٱلَّذِینَ یَخۡتَانُونَ أَنفُسَهُمۡۚ إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ خَوَّانًا أَثِیمࣰا\n",
    "translations": {
      "en": "Yet do not argue in behalf of those who are false to their own selves: verily, God does not love those who betray their trust and persist in sinful ways.",
      "ms": "Dan janganlah engkau berbahas untuk membela orang-orang yang mengkhianati diri mereka sendiri. Sesungguhnya Allah tidak suka kepada orang-orang yang selalu melakukan khianat, lagi sentiasa berdosa.",
      "id": "Dan janganlah kamu berdebat (untuk membela) orang-orang yang mengkhianati dirinya. Sesungguhnya Allah tidak menyukai orang-orang yang selalu berkhianat lagi bergelimang dosa,",
      "ar": "وَلَا تُجَـٰدِلۡ عَنِ ٱلَّذِینَ یَخۡتَانُونَ أَنفُسَهُمۡۚ إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ خَوَّانًا أَثِیمࣰا\n"
    }
  },
  {
    "id": 601,
    "surahId": 4,
    "ayahNumber": 108,
    "arabicText": "یَسۡتَخۡفُونَ مِنَ ٱلنَّاسِ وَلَا یَسۡتَخۡفُونَ مِنَ ٱللَّهِ وَهُوَ مَعَهُمۡ إِذۡ یُبَیِّتُونَ مَا لَا یَرۡضَىٰ مِنَ ٱلۡقَوۡلِۚ وَكَانَ ٱللَّهُ بِمَا یَعۡمَلُونَ مُحِیطًا\n",
    "translations": {
      "en": "They would conceal their doings from men; but from God they cannot conceal them - for He is with them whenever they devise, in the dark of night, all manner of beliefs which He does not approve. And God indeed encompasses [with His knowledge] whatever they do.",
      "ms": "Mereka menyembunyikan (kejahatan mereka) daripada manusia, dalam pada itu mereka tidak menyembunyikan (kejahatan mereka) daripada Allah. Padahal Allah ada bersama-sama mereka, ketika mereka merancangkan pada malam hari, kata-kata yang tidak diredhai oleh Allah. Dan (ingatlah) Allah sentiasa Meliputi PengetahuanNya akan apa yang mereka lakukan.",
      "id": "mereka bersembunyi dari manusia, tetapi mereka tidak bersembunyi dari Allah, padahal Allah beserta mereka, ketika pada suatu malam mereka menetapkan keputusan rahasia yang Allah tidak redlai. Dan adalah Allah Maha Meliputi (ilmu-Nya) terhadap apa yang mereka kerjakan.",
      "ar": "یَسۡتَخۡفُونَ مِنَ ٱلنَّاسِ وَلَا یَسۡتَخۡفُونَ مِنَ ٱللَّهِ وَهُوَ مَعَهُمۡ إِذۡ یُبَیِّتُونَ مَا لَا یَرۡضَىٰ مِنَ ٱلۡقَوۡلِۚ وَكَانَ ٱللَّهُ بِمَا یَعۡمَلُونَ مُحِیطًا\n"
    }
  },
  {
    "id": 602,
    "surahId": 4,
    "ayahNumber": 109,
    "arabicText": "هَـٰۤأَنتُمۡ هَـٰۤؤُلَاۤءِ جَـٰدَلۡتُمۡ عَنۡهُمۡ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا فَمَن یُجَـٰدِلُ ٱللَّهَ عَنۡهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ أَم مَّن یَكُونُ عَلَیۡهِمۡ وَكِیلࣰا\n",
    "translations": {
      "en": "Oh, you might well argue in their behalf in the life of this world: but who will argue in their behalf with God on the Day of Resurrection, or who will be their defender?",
      "ms": "Sedarlah! Kamu ini adalah orang-orang (yang telah menyimpang dari kebenaran), kamu telah berhujah membela mereka (yang bersalah) dalam kehidupan dunia ini, maka siapakah yang akan berhujah kepada Allah untuk membela mereka itu pada hari kiamat kelak? Atau siapakah yang akan menjadi pelindung mereka (dari azab seksa yang disediakan oleh Allah)?",
      "id": "Beginilah kamu, kamu sekalian adalah orang-orang yang berdebat untuk (membela) mereka dalam kehidupan dunia ini. Maka siapakah yang akan mendebat Allah untuk (membela) mereka pada hari kiamat? Atau siapakah yang menjadi pelindung mereka (terhadap siksa Allah)?",
      "ar": "هَـٰۤأَنتُمۡ هَـٰۤؤُلَاۤءِ جَـٰدَلۡتُمۡ عَنۡهُمۡ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا فَمَن یُجَـٰدِلُ ٱللَّهَ عَنۡهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ أَم مَّن یَكُونُ عَلَیۡهِمۡ وَكِیلࣰا\n"
    }
  },
  {
    "id": 603,
    "surahId": 4,
    "ayahNumber": 110,
    "arabicText": "وَمَن یَعۡمَلۡ سُوۤءًا أَوۡ یَظۡلِمۡ نَفۡسَهُۥ ثُمَّ یَسۡتَغۡفِرِ ٱللَّهَ یَجِدِ ٱللَّهَ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "Yet he who does evil or [otherwise] sins against himself, and thereafter prays God to forgive him, shall find God much-forgiving, a dispenser of grace:",
      "ms": "Dan sesiapa yang melakukan kejahatan atau menganiaya dirinya sendiri (dengan melakukan maksiat) kemudian ia memohon ampun kepada Allah, nescaya ia akan mendapati Allah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Dan barangsiapa yang mengerjakan kejahatan dan menganiaya dirinya, kemudian ia mohon ampun kepada Allah, niscaya ia mendapati Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "وَمَن یَعۡمَلۡ سُوۤءًا أَوۡ یَظۡلِمۡ نَفۡسَهُۥ ثُمَّ یَسۡتَغۡفِرِ ٱللَّهَ یَجِدِ ٱللَّهَ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 604,
    "surahId": 4,
    "ayahNumber": 111,
    "arabicText": "وَمَن یَكۡسِبۡ إِثۡمࣰا فَإِنَّمَا یَكۡسِبُهُۥ عَلَىٰ نَفۡسِهِۦۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "for he who commits a sin, commits it only to his own hurt; and God is indeed all-knowing, wise.",
      "ms": "Dan sesiapa yang mengerjakan sesuatu dosa maka sesungguhnya ia hanya mengerjakannya untuk (menjadi bala bencana yang) menimpa dirinya sendiri. Dan (ingatlah) Allah Maha Mengetahui, lagi Maha Bijaksana.",
      "id": "Barangsiapa yang mengerjakan dosa, maka sesungguhnya ia mengerjakannya untuk (kemudharatan) dirinya sendiri. Dan Allah Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "وَمَن یَكۡسِبۡ إِثۡمࣰا فَإِنَّمَا یَكۡسِبُهُۥ عَلَىٰ نَفۡسِهِۦۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 605,
    "surahId": 4,
    "ayahNumber": 112,
    "arabicText": "وَمَن یَكۡسِبۡ خَطِیۤـَٔةً أَوۡ إِثۡمࣰا ثُمَّ یَرۡمِ بِهِۦ بَرِیۤـࣰٔا فَقَدِ ٱحۡتَمَلَ بُهۡتَـٰنࣰا وَإِثۡمࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "But he who commits a fault or a sin and then throws the blame therefore on an innocent person, burdens himself with the guilt of calumny and [yet another] flagrant sin.",
      "ms": "Dan sesiapa yang melakukan suatu kesalahan atau suatu dosa, kemudian ia menuduhnya kepada orang yang tidak bersalah, maka sesungguhnya ia telah memikul kesalahan berbuat dusta, dan melakukan dosa yang amat nyata.",
      "id": "Dan barangsiapa yang mengerjakan kesalahan atau dosa, kemudian dituduhkannya kepada orang yang tidak bersalah, maka sesungguhnya ia telah berbuat suatu kebohongan dan dosa yang nyata.",
      "ar": "وَمَن یَكۡسِبۡ خَطِیۤـَٔةً أَوۡ إِثۡمࣰا ثُمَّ یَرۡمِ بِهِۦ بَرِیۤـࣰٔا فَقَدِ ٱحۡتَمَلَ بُهۡتَـٰنࣰا وَإِثۡمࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 606,
    "surahId": 4,
    "ayahNumber": 113,
    "arabicText": "وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَیۡكَ وَرَحۡمَتُهُۥ لَهَمَّت طَّاۤىِٕفَةࣱ مِّنۡهُمۡ أَن یُضِلُّوكَ وَمَا یُضِلُّونَ إِلَّاۤ أَنفُسَهُمۡۖ وَمَا یَضُرُّونَكَ مِن شَیۡءࣲۚ وَأَنزَلَ ٱللَّهُ عَلَیۡكَ ٱلۡكِتَـٰبَ وَٱلۡحِكۡمَةَ وَعَلَّمَكَ مَا لَمۡ تَكُن تَعۡلَمُۚ وَكَانَ فَضۡلُ ٱللَّهِ عَلَیۡكَ عَظِیمࣰا\n",
    "translations": {
      "en": "And but for God's favour upon thee and His grace, some of those [who are false to themselves] would indeed endeavour to lead thee astray; yet none but themselves do they lead astray. Nor can they harm thee in any way, since God has bestowed upon thee from on high this divine writ and [given thee] wisdom, and has imparted unto thee the knowledge of what thou didst not know. And God's favour upon thee is tremendous indeed.",
      "ms": "Dan kalaulah tidak kerana limpah kurnia Allah dan rahmatNya kepadamu (wahai Muhammad), nescaya berhasilah cita-cita segolongan dari mereka yang bertujuan hendak menyesatkanmu, padahal mereka tidak akan menyesatkan melainkan dirinya sendiri; dan juga mereka tidak akan dapat mendatangkan mudarat kepadamu sedikitpun; dan (selain itu) Allah telah menurunkan kepadamu Kitab (Al-Quran) serta Hikmah (pengetahuan yang mendalam), dan telah mengajarkanmu apa yang engkau tidak mengetahuinya. Dan adalah kurnia Allah yang dilimpahkanNya kepada mu amatlah besar.",
      "id": "Sekiranya bukan karena karunia Allah dan rahmat-Nya kepadamu, tentulah segolongan dari mereka berkeinginan keras untuk menyesatkanmu. Tetapi mereka tidak menyesatkan melainkan dirinya sendiri, dan mereka tidak dapat membahayakanmu sedikitpun kepadamu. Dan (juga karena) Allah telah menurunkan Kitab dan hikmah kepadamu, dan telah mengajarkan kepadamu apa yang belum kamu ketahui. Dan adalah karunia Allah sangat besar atasmu.",
      "ar": "وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَیۡكَ وَرَحۡمَتُهُۥ لَهَمَّت طَّاۤىِٕفَةࣱ مِّنۡهُمۡ أَن یُضِلُّوكَ وَمَا یُضِلُّونَ إِلَّاۤ أَنفُسَهُمۡۖ وَمَا یَضُرُّونَكَ مِن شَیۡءࣲۚ وَأَنزَلَ ٱللَّهُ عَلَیۡكَ ٱلۡكِتَـٰبَ وَٱلۡحِكۡمَةَ وَعَلَّمَكَ مَا لَمۡ تَكُن تَعۡلَمُۚ وَكَانَ فَضۡلُ ٱللَّهِ عَلَیۡكَ عَظِیمࣰا\n"
    }
  },
  {
    "id": 607,
    "surahId": 4,
    "ayahNumber": 114,
    "arabicText": "۞ لَّا خَیۡرَ فِی كَثِیرࣲ مِّن نَّجۡوَىٰهُمۡ إِلَّا مَنۡ أَمَرَ بِصَدَقَةٍ أَوۡ مَعۡرُوفٍ أَوۡ إِصۡلَـٰحِۭ بَیۡنَ ٱلنَّاسِۚ وَمَن یَفۡعَلۡ ذَ ٰ⁠لِكَ ٱبۡتِغَاۤءَ مَرۡضَاتِ ٱللَّهِ فَسَوۡفَ نُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "NO GOOD comes, as a rule, out of secret confabulations - saving such as are devoted to en­joining charity, or equitable dealings, or setting things to rights between people: and unto him who does this out of a longing for God's goodly acceptance We shall in time grant a mighty reward.",
      "ms": "Tidak ada kebaikan pada kebanyakan bisik-bisikan mereka, kecuali (bisik-bisikan) orang yang menyuruh bersedekah, atau berbuat kebaikan, atau mendamaikan di antara manusia. Dan sesiapa yang berbuat demikian dengan maksud mencari keredaan Allah, tentulah Kami akan memberi kepadanya pahala yang amat besar.",
      "id": "Tidak ada kebaikan pada kebanyakan bisikan-bisikan mereka, kecuali bisikan-bisikan dari orang yang menyuruh (manusia) memberi sedekah, atau berbuat ma'ruf, atau mengadakan perdamaian di antara manusia. Dan barangsiapa yang berbuat demikian karena mencari keridhaan Allah, maka kelak Kami memberi kepadanya pahala yang besar.",
      "ar": "۞ لَّا خَیۡرَ فِی كَثِیرࣲ مِّن نَّجۡوَىٰهُمۡ إِلَّا مَنۡ أَمَرَ بِصَدَقَةٍ أَوۡ مَعۡرُوفٍ أَوۡ إِصۡلَـٰحِۭ بَیۡنَ ٱلنَّاسِۚ وَمَن یَفۡعَلۡ ذَ ٰ⁠لِكَ ٱبۡتِغَاۤءَ مَرۡضَاتِ ٱللَّهِ فَسَوۡفَ نُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 608,
    "surahId": 4,
    "ayahNumber": 115,
    "arabicText": "وَمَن یُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَیَّنَ لَهُ ٱلۡهُدَىٰ وَیَتَّبِعۡ غَیۡرَ سَبِیلِ ٱلۡمُؤۡمِنِینَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصۡلِهِۦ جَهَنَّمَۖ وَسَاۤءَتۡ مَصِیرًا\n",
    "translations": {
      "en": "But as for him who, after guidance has been vouchsafed to him, cuts himself off from the Apostle and follows a path other than that of the believers - him shall We leave unto that which he himself has chosen, and shall cause him to endure hell: and how evil a journey’s end!",
      "ms": "Dan sesiapa yang menentang (ajaran) Rasulullah sesudah terang nyata kepadanya kebenaran pertunjuk (yang dibawanya), dan ia pula mengikut jalan yang lain dari jalan orang-orang yang beriman, Kami akan memberikannya kuasa untuk melakukan (kesesatan) yang dipilihnya, dan (pada hari akhirat kelak) Kami akan memasukkannya ke dalam neraka jahanam; dan neraka jahanam itu adalah seburuk-buruk tempat kembali.",
      "id": "Dan barangsiapa yang menentang Rasul sesudah jelas kebenaran baginya, dan mengikuti jalan yang bukan jalan orang-orang mukmin, Kami biarkan ia leluasa terhadap kesesatan yang telah dikuasainya itu dan Kami masukkan ia ke dalam Jahannam, dan Jahannam itu seburuk-buruk tempat kembali.",
      "ar": "وَمَن یُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَیَّنَ لَهُ ٱلۡهُدَىٰ وَیَتَّبِعۡ غَیۡرَ سَبِیلِ ٱلۡمُؤۡمِنِینَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصۡلِهِۦ جَهَنَّمَۖ وَسَاۤءَتۡ مَصِیرًا\n"
    }
  },
  {
    "id": 609,
    "surahId": 4,
    "ayahNumber": 116,
    "arabicText": "إِنَّ ٱللَّهَ لَا یَغۡفِرُ أَن یُشۡرَكَ بِهِۦ وَیَغۡفِرُ مَا دُونَ ذَ ٰ⁠لِكَ لِمَن یَشَاۤءُۚ وَمَن یُشۡرِكۡ بِٱللَّهِ فَقَدۡ ضَلَّ ضَلَـٰلَۢا بَعِیدًا\n",
    "translations": {
      "en": "VERILY, God does not forgive the ascribing of divinity to aught beside Him, although He forgives any lesser sin unto whomever He wills: for those who ascribe divinity to aught beside God have indeed gone far astray.",
      "ms": "Sesungguhnya Allah tidak akan mengampunkan dosa orang yang mempersekutukanNya dengan sesuatu (apa jua), dan akan mengampunkan yang lain daripada kesalahan (syirik) itu bagi sesiapa yang dikehendakiNya (menurut peraturan hukum-hukumNya); dan sesiapa yang mempersekutukan Allah dengan sesuatu (apa jua), maka sesungguhnya ia telah sesat dengan kesesatan yang amat jauh.",
      "id": "Sesungguhnya Allah tidak mengampuni dosa mempersekutukan (sesuatu) dengan Dia, dan dia mengampuni dosa yang selain syirik bagi siapa yang dikehendaki-Nya. Barangsiapa yang mempersekutukan (sesuatu) dengan Allah, maka sesungguhnya ia telah tersesat sejauh-jauhnya.",
      "ar": "إِنَّ ٱللَّهَ لَا یَغۡفِرُ أَن یُشۡرَكَ بِهِۦ وَیَغۡفِرُ مَا دُونَ ذَ ٰ⁠لِكَ لِمَن یَشَاۤءُۚ وَمَن یُشۡرِكۡ بِٱللَّهِ فَقَدۡ ضَلَّ ضَلَـٰلَۢا بَعِیدًا\n"
    }
  },
  {
    "id": 610,
    "surahId": 4,
    "ayahNumber": 117,
    "arabicText": "إِن یَدۡعُونَ مِن دُونِهِۦۤ إِلَّاۤ إِنَـٰثࣰا وَإِن یَدۡعُونَ إِلَّا شَیۡطَـٰنࣰا مَّرِیدࣰا\n",
    "translations": {
      "en": "In His stead, they invoke only life­less symbols - thus invoking none but a rebellious Satan",
      "ms": "Apa yang mereka sembah yang lain dari Allah itu, hanyalah berhala-berhala (makhluk-makhluk yang lemah), dan mereka (dengan yang demikian) tidak menyembah melainkan Syaitan yang derhaka;",
      "id": "Yang mereka sembah selain Allah itu, tidak lain hanyalah berhala, dan (dengan menyembah berhala itu) mereka tidak lain hanyalah menyembah syaitan yang durhaka,",
      "ar": "إِن یَدۡعُونَ مِن دُونِهِۦۤ إِلَّاۤ إِنَـٰثࣰا وَإِن یَدۡعُونَ إِلَّا شَیۡطَـٰنࣰا مَّرِیدࣰا\n"
    }
  },
  {
    "id": 611,
    "surahId": 4,
    "ayahNumber": 118,
    "arabicText": "لَّعَنَهُ ٱللَّهُۘ وَقَالَ لَأَتَّخِذَنَّ مِنۡ عِبَادِكَ نَصِیبࣰا مَّفۡرُوضࣰا\n",
    "translations": {
      "en": "whom God has rejected for having said, \"Verily, of Thy servants I shall most certainly take my due share,",
      "ms": "Yang telah dilaknat oleh Allah, dan yang telah mengatakan: \"Demi sesungguhnya, aku akan mengambil dari kalangan hamba-hambaMu, bahagian yang tertentu (untuk menjadi pengikutku);",
      "id": "yang dilaknati Allah dan syaitan itu mengatakan: \"Saya benar-benar akan mengambil dari hamba-hamba Engkau bahagian yang sudah ditentukan (untuk saya),",
      "ar": "لَّعَنَهُ ٱللَّهُۘ وَقَالَ لَأَتَّخِذَنَّ مِنۡ عِبَادِكَ نَصِیبࣰا مَّفۡرُوضࣰا\n"
    }
  },
  {
    "id": 612,
    "surahId": 4,
    "ayahNumber": 119,
    "arabicText": "وَلَأُضِلَّنَّهُمۡ وَلَأُمَنِّیَنَّهُمۡ وَلَـَٔامُرَنَّهُمۡ فَلَیُبَتِّكُنَّ ءَاذَانَ ٱلۡأَنۡعَـٰمِ وَلَـَٔامُرَنَّهُمۡ فَلَیُغَیِّرُنَّ خَلۡقَ ٱللَّهِۚ وَمَن یَتَّخِذِ ٱلشَّیۡطَـٰنَ وَلِیࣰّا مِّن دُونِ ٱللَّهِ فَقَدۡ خَسِرَ خُسۡرَانࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "and shall lead them astray, and fill them with vain desires; and I shall command them - and they will cut off the ears of cattle [in idolatrous sacrifice]; and I shall command them - and they will corrupt God's creation!\" But all who take Satan rather than God for their master do indeed, most clearly, lose all:",
      "ms": "\"Dan demi sesungguhnya, aku akan menyesatkan mereka (dari kebenaran), dan demi sesungguhnya aku akan memperdayakan mereka dengan angan-angan kosong, dan demi sesungguhnya aku akan menyuruh mereka (mencacatkan binatang-binatang ternak), lalu mereka membelah telinga binatang-binatang itu; dan aku akan menyuruh mereka mengubah ciptaan Allah\". Dan (ingatlah) sesiapa yang mengambil Syaitan menjadi pemimpin yang ditaati selain dari Allah, maka sesungguhnya rugilah ia dengan kerugian yang terang nyata.",
      "id": "dan aku benar-benar akan menyesatkan mereka, dan akan membangkitkan angan-angan kosong pada mereka dan menyuruh mereka (memotong telinga-telinga binatang ternak), lalu mereka benar-benar memotongnya, dan akan aku suruh mereka (mengubah ciptaan Allah), lalu benar-benar mereka meubahnya\". Barangsiapa yang menjadikan syaitan menjadi pelindung selain Allah, maka sesungguhnya ia menderita kerugian yang nyata.",
      "ar": "وَلَأُضِلَّنَّهُمۡ وَلَأُمَنِّیَنَّهُمۡ وَلَـَٔامُرَنَّهُمۡ فَلَیُبَتِّكُنَّ ءَاذَانَ ٱلۡأَنۡعَـٰمِ وَلَـَٔامُرَنَّهُمۡ فَلَیُغَیِّرُنَّ خَلۡقَ ٱللَّهِۚ وَمَن یَتَّخِذِ ٱلشَّیۡطَـٰنَ وَلِیࣰّا مِّن دُونِ ٱللَّهِ فَقَدۡ خَسِرَ خُسۡرَانࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 613,
    "surahId": 4,
    "ayahNumber": 120,
    "arabicText": "یَعِدُهُمۡ وَیُمَنِّیهِمۡۖ وَمَا یَعِدُهُمُ ٱلشَّیۡطَـٰنُ إِلَّا غُرُورًا\n",
    "translations": {
      "en": "he holds out promises to them, and fills them with vain desires: yet whatever Satan promises them is but meant to delude the mind.",
      "ms": "Syaitan sentiasa menjanjikan mereka (dengan janji-janji indah) serta memperdayakan mereka dengan angan-angan kosong; dan apa yang dijanjikan oleh Syaitan itu tidak lain hanyalah tipu daya semata-mata.",
      "id": "Syaitan itu memberikan janji-janji kepada mereka dan membangkitkan angan-angan kosong pada mereka, padahal syaitan itu tidak menjanjikan kepada mereka selain dari tipuan belaka.",
      "ar": "یَعِدُهُمۡ وَیُمَنِّیهِمۡۖ وَمَا یَعِدُهُمُ ٱلشَّیۡطَـٰنُ إِلَّا غُرُورًا\n"
    }
  },
  {
    "id": 614,
    "surahId": 4,
    "ayahNumber": 121,
    "arabicText": "أُو۟لَـٰۤىِٕكَ مَأۡوَىٰهُمۡ جَهَنَّمُ وَلَا یَجِدُونَ عَنۡهَا مَحِیصࣰا\n",
    "translations": {
      "en": "Such as these have hell for their goal: and they shall find no way to escape therefrom.",
      "ms": "Mereka itu, tempat akhirnya ialah neraka jahanam, dan mereka pula tidak akan dapat melarikan diri daripadanya.",
      "id": "Mereka itu tempatnya Jahannam dan mereka tidak memperoleh tempat lari dari padanya.",
      "ar": "أُو۟لَـٰۤىِٕكَ مَأۡوَىٰهُمۡ جَهَنَّمُ وَلَا یَجِدُونَ عَنۡهَا مَحِیصࣰا\n"
    }
  },
  {
    "id": 615,
    "surahId": 4,
    "ayahNumber": 122,
    "arabicText": "وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۖ وَعۡدَ ٱللَّهِ حَقࣰّاۚ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ قِیلࣰا\n",
    "translations": {
      "en": "Yet those who attain to faith and do righteous deeds We shall bring into gardens through which running waters flow, therein to abide beyond the count of time: this is, in truth, God's promise - and whose word could be truer than God's?",
      "ms": "Dan orang-orang yang beriman serta beramal soleh, Kami akan masukkan mereka ke dalam Syurga yang mengalir di bawahnya beberapa sungai, mereka kekal di dalamnya selama-lamanya, sebagai janji Allah yang benar. Dan siapakah yang lebih benar perkataannya daripada Allah?",
      "id": "Orang-orang yang beriman dan mengerjakan amalan saleh, kelak akan Kami masukkan ke dalam surga yang mengalir sungai-sungai di dalamnya, mereka kekal di dalamnya selama-lamanya. Allah telah membuat suatu janji yang benar. Dan siapakah yang lebih benar perkataannya dari pada Allah?",
      "ar": "وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۖ وَعۡدَ ٱللَّهِ حَقࣰّاۚ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ قِیلࣰا\n"
    }
  },
  {
    "id": 616,
    "surahId": 4,
    "ayahNumber": 123,
    "arabicText": "لَّیۡسَ بِأَمَانِیِّكُمۡ وَلَاۤ أَمَانِیِّ أَهۡلِ ٱلۡكِتَـٰبِۗ مَن یَعۡمَلۡ سُوۤءࣰا یُجۡزَ بِهِۦ وَلَا یَجِدۡ لَهُۥ مِن دُونِ ٱللَّهِ وَلِیࣰّا وَلَا نَصِیرࣰا\n",
    "translations": {
      "en": "It may not accord with your wishful thinking - nor with the wishful thinking of the fol­lowers of earlier revelation - [that] he who does evil shall be requited for it, and shall find none to protect him from God, and none to bring him succour,",
      "ms": "(Balasan yang baik yang dijanjikan oleh Allah itu) tidak akan didapati hanya dengan angan-angan kamu semata-mata, dan tidak pula dengan angan-angan ahli Kitab (Yahudi dan Nasrani). Sesiapa yang melakukan kejahatan, ia akan dibalas dengan kejahatan itu, dan ia pula tidak akan mendapat - selain dari Allah - seorang pun yang akan melindunginya, dan tidak ada juga yang dapat menolongnya.",
      "id": "(Pahala dari Allah) itu bukanlah menurut angan-anganmu yang kosong dan tidak (pula) menurut angan-angan Ahli Kitab. Barangsiapa yang mengerjakan kejahatan, niscaya akan diberi pembalasan dengan kejahatan itu dan ia tidak mendapat pelindung dan tidak (pula) penolong baginya selain dari Allah.",
      "ar": "لَّیۡسَ بِأَمَانِیِّكُمۡ وَلَاۤ أَمَانِیِّ أَهۡلِ ٱلۡكِتَـٰبِۗ مَن یَعۡمَلۡ سُوۤءࣰا یُجۡزَ بِهِۦ وَلَا یَجِدۡ لَهُۥ مِن دُونِ ٱللَّهِ وَلِیࣰّا وَلَا نَصِیرࣰا\n"
    }
  },
  {
    "id": 617,
    "surahId": 4,
    "ayahNumber": 124,
    "arabicText": "وَمَن یَعۡمَلۡ مِنَ ٱلصَّـٰلِحَـٰتِ مِن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَأُو۟لَـٰۤىِٕكَ یَدۡخُلُونَ ٱلۡجَنَّةَ وَلَا یُظۡلَمُونَ نَقِیرࣰا\n",
    "translations": {
      "en": "whereas anyone - be it man or woman - who does [whatever he can] of good deeds and is a believer withal, shall enter paradise, and shall not be wronged by as much as [would fill] the groove of a date-stone.",
      "ms": "Dan sesiapa yang mengerjakan amal soleh, dari lelaki atau perempuan, sedang ia beriman, maka mereka itu akan masuk Syurga, dan mereka pula tidak akan dianiaya (atau dikurangkan balasannya) sedikitpun.",
      "id": "Barangsiapa yang mengerjakan amal-amal saleh, baik laki-laki maupun wanita sedang ia orang yang beriman, maka mereka itu masuk ke dalam surga dan mereka tidak dianiaya walau sedikitpun.",
      "ar": "وَمَن یَعۡمَلۡ مِنَ ٱلصَّـٰلِحَـٰتِ مِن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَأُو۟لَـٰۤىِٕكَ یَدۡخُلُونَ ٱلۡجَنَّةَ وَلَا یُظۡلَمُونَ نَقِیرࣰا\n"
    }
  },
  {
    "id": 618,
    "surahId": 4,
    "ayahNumber": 125,
    "arabicText": "وَمَنۡ أَحۡسَنُ دِینࣰا مِّمَّنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ وَهُوَ مُحۡسِنࣱ وَٱتَّبَعَ مِلَّةَ إِبۡرَ ٰ⁠هِیمَ حَنِیفࣰاۗ وَٱتَّخَذَ ٱللَّهُ إِبۡرَ ٰ⁠هِیمَ خَلِیلࣰا\n",
    "translations": {
      "en": "And who could be of better faith than he who surrenders his whole being unto God and is a doer of good withal, and follows the creed of Abraham, who turned away from all that is false - seeing that God exalted Abraham with His love?",
      "ms": "Dan tidak ada yang lebih baik ugamanya daripada orang yang menyerahkan dirinya kepada Allah (dengan ikhlas), sedang ia berusaha mengerjakan kebaikan, dan ia pula mengikut ugama Nabi Ibrahim yang lurus (yang tetap di atas dasar tauhid); dan (kerana itulah) Allah menjadikan Nabi Ibrahim kesayanganNya.",
      "id": "Dan siapakah yang lebih baik agamanya dari pada orang yang ikhlas menyerahkan dirinya kepada Allah, sedang diapun mengerjakan kebaikan, dan ia mengikuti agama Ibrahim yang lurus? Dan Allah mengambil Ibrahim menjadi kesayangan-Nya.",
      "ar": "وَمَنۡ أَحۡسَنُ دِینࣰا مِّمَّنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ وَهُوَ مُحۡسِنࣱ وَٱتَّبَعَ مِلَّةَ إِبۡرَ ٰ⁠هِیمَ حَنِیفࣰاۗ وَٱتَّخَذَ ٱللَّهُ إِبۡرَ ٰ⁠هِیمَ خَلِیلࣰا\n"
    }
  },
  {
    "id": 619,
    "surahId": 4,
    "ayahNumber": 126,
    "arabicText": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ بِكُلِّ شَیۡءࣲ مُّحِیطࣰا\n",
    "translations": {
      "en": "For, unto God belongs all that is in the heavens and all that is on earth; and, indeed, God encompasses everything.",
      "ms": "Dan bagi Allah jualah segala yang ada di langit dan yang ada di bumi; dan Allah sentiasa Meliputi (pengetahuanNya dan kekuasaanNya) akan tiap-tiap sesuatu.",
      "id": "Kepunyaan Allah-lah apa yang di langit dan apa yang di bumi, dan adalah (pengetahuan) Allah Maha Meliputi segala sesuatu.",
      "ar": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ بِكُلِّ شَیۡءࣲ مُّحِیطࣰا\n"
    }
  },
  {
    "id": 620,
    "surahId": 4,
    "ayahNumber": 127,
    "arabicText": "وَیَسۡتَفۡتُونَكَ فِی ٱلنِّسَاۤءِۖ قُلِ ٱللَّهُ یُفۡتِیكُمۡ فِیهِنَّ وَمَا یُتۡلَىٰ عَلَیۡكُمۡ فِی ٱلۡكِتَـٰبِ فِی یَتَـٰمَى ٱلنِّسَاۤءِ ٱلَّـٰتِی لَا تُؤۡتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرۡغَبُونَ أَن تَنكِحُوهُنَّ وَٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلۡوِلۡدَ ٰ⁠نِ وَأَن تَقُومُوا۟ لِلۡیَتَـٰمَىٰ بِٱلۡقِسۡطِۚ وَمَا تَفۡعَلُوا۟ مِنۡ خَیۡرࣲ فَإِنَّ ٱللَّهَ كَانَ بِهِۦ عَلِیمࣰا\n",
    "translations": {
      "en": "AND THEY will ask thee to enlighten them about the laws concerning women. Say: \"God [Himself] en­lightens you about the laws concerning them\"- for [His will is shown] in what is being conveyed unto you through this divine writ about orphan women [in your charge], to whom - because you yourselves may be desirous of marrying them - you do not give that which has been ordained for them; and about help­less children; and about your duty to treat orphans with equity. And whatever good you may do - be­hold, God has indeed full knowledge thereof.",
      "ms": "Dan mereka meminta fatwa kepadamu (wahai Muhammad), mengenai (hak dan kewajipan) kaum perempuan. Katakanlah olehmu: \"Allah akan memberi keterangan (fatwa) kepada kamu mengenai mereka dan juga (ada difatwakan dalam) apa yang selalu dibacakan kepada kamu dalam Kitab (Al-Quran) ini mengenai perempuan-perempuan yatim yang kamu tidak memberi kepadanya apa yang telah ditetapkan menjadi hak mereka, dan yang kamu suka berkahwin dengan mereka; dan juga mengenai anak-anak yang lemah (yang masih kecil lagi). Dan (kamu juga diwajibkan) supaya menguruskan (hak dan keperluan) anak-anak yatim dengan adil. Dan (ingatlah) apa jua kebaikan yang kamu lakukan (kepada mereka), maka sesungguhnya Allah sentiasa Mengetahuinya.\"",
      "id": "Dan mereka minta fatwa kepadamu tentang para wanita. Katakanlah: \"Allah memberi fatwa kepadamu tentang mereka, dan apa yang dibacakan kepadamu dalam Al Quran (juga memfatwakan) tentang para wanita yatim yang kamu tidak memberikan kepada mereka apa yang ditetapkan untuk mereka, sedang kamu ingin mengawini mereka dan tentang anak-anak yang masih dipandang lemah. Dan (Allah menyuruh kamu) supaya kamu mengurus anak-anak yatim secara adil. Dan kebajikan apa saja yang kamu kerjakan, maka sesungguhnya Allah adalah Maha Mengetahuinya.",
      "ar": "وَیَسۡتَفۡتُونَكَ فِی ٱلنِّسَاۤءِۖ قُلِ ٱللَّهُ یُفۡتِیكُمۡ فِیهِنَّ وَمَا یُتۡلَىٰ عَلَیۡكُمۡ فِی ٱلۡكِتَـٰبِ فِی یَتَـٰمَى ٱلنِّسَاۤءِ ٱلَّـٰتِی لَا تُؤۡتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرۡغَبُونَ أَن تَنكِحُوهُنَّ وَٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلۡوِلۡدَ ٰ⁠نِ وَأَن تَقُومُوا۟ لِلۡیَتَـٰمَىٰ بِٱلۡقِسۡطِۚ وَمَا تَفۡعَلُوا۟ مِنۡ خَیۡرࣲ فَإِنَّ ٱللَّهَ كَانَ بِهِۦ عَلِیمࣰا\n"
    }
  },
  {
    "id": 621,
    "surahId": 4,
    "ayahNumber": 128,
    "arabicText": "وَإِنِ ٱمۡرَأَةٌ خَافَتۡ مِنۢ بَعۡلِهَا نُشُوزًا أَوۡ إِعۡرَاضࣰا فَلَا جُنَاحَ عَلَیۡهِمَاۤ أَن یُصۡلِحَا بَیۡنَهُمَا صُلۡحࣰاۚ وَٱلصُّلۡحُ خَیۡرࣱۗ وَأُحۡضِرَتِ ٱلۡأَنفُسُ ٱلشُّحَّۚ وَإِن تُحۡسِنُوا۟ وَتَتَّقُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n",
    "translations": {
      "en": "And if a woman has reason to fear ill-treat­ment from her husband, or that he might turn away from her, it shall not be wrong for the two to set things peacefully to rights between themselves: for peace is best, and selfishness is ever-present in human souls. But if you do good and are conscious of Him - behold, God is indeed aware of all that you do.",
      "ms": "Dan jika seorang perempuan bimbang akan timbul dari suaminya \"nusyuz\" (kebencian), atau tidak melayaninya, maka tiadalah salah bagi mereka (suami isteri) membuat perdamaian di antara mereka berdua (secara yang sebaik-baiknya), kerana perdamaian itu lebih baik (bagi mereka daripada bercerai-berai); sedang sifat bakhil kedekut (tidak suka memberi atau bertolak ansur) itu memang tabiat semula jadi yang ada pada manusia. Dan jika kamu berlaku baik (dalam pergaulan), dan mencegah diri (daripada melakukan kezaliman), maka sesungguhnya Allah Maha Mendalam PengetahuanNya akan apa yang kamu lakukan.",
      "id": "Dan jika seorang wanita khawatir akan nusyuz atau sikap tidak acuh dari suaminya, maka tidak mengapa bagi keduanya mengadakan perdamaian yang sebenar-benarnya, dan perdamaian itu lebih baik (bagi mereka) walaupun manusia itu menurut tabiatnya kikir. Dan jika kamu bergaul dengan isterimu secara baik dan memelihara dirimu (dari nusyuz dan sikap tak acuh), maka sesungguhnya Allah adalah Maha Mengetahui apa yang kamu kerjakan.",
      "ar": "وَإِنِ ٱمۡرَأَةٌ خَافَتۡ مِنۢ بَعۡلِهَا نُشُوزًا أَوۡ إِعۡرَاضࣰا فَلَا جُنَاحَ عَلَیۡهِمَاۤ أَن یُصۡلِحَا بَیۡنَهُمَا صُلۡحࣰاۚ وَٱلصُّلۡحُ خَیۡرࣱۗ وَأُحۡضِرَتِ ٱلۡأَنفُسُ ٱلشُّحَّۚ وَإِن تُحۡسِنُوا۟ وَتَتَّقُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n"
    }
  },
  {
    "id": 622,
    "surahId": 4,
    "ayahNumber": 129,
    "arabicText": "وَلَن تَسۡتَطِیعُوۤا۟ أَن تَعۡدِلُوا۟ بَیۡنَ ٱلنِّسَاۤءِ وَلَوۡ حَرَصۡتُمۡۖ فَلَا تَمِیلُوا۟ كُلَّ ٱلۡمَیۡلِ فَتَذَرُوهَا كَٱلۡمُعَلَّقَةِۚ وَإِن تُصۡلِحُوا۟ وَتَتَّقُوا۟ فَإِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "And it will not be within your power to treat your wives with equal fairness, however much you may desire it; and so, do not allow yourselves to incline towards one to the exclusion of the other, leaving her in a state, as it were, of having and not having a husband. But if you put things to rights and are conscious of Him - behold, God is indeed much-forgiving, a dispenser of grace.",
      "ms": "Dan kamu tidak akan dapat berlaku adil di antara isteri-isteri kamu sekalipun kamu bersungguh-sungguh (hendak melakukannya); oleh itu janganlah kamu cenderung dengan melampau (berat sebelah kepada isteri yang kamu sayangi) sehingga kamu biarkan isteri yang lain seperti benda yang tergantung (di awan-awan); dan jika kamu memperbaiki (keadaan yang pincang itu), dan memelihara diri (daripada perbuatan yang zalim), maka sesungguhnya Allah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Dan kamu sekali-kali tidak akan dapat berlaku adil di antara isteri-isteri(mu), walaupun kamu sangat ingin berbuat demikian, karena itu janganlah kamu terlalu cenderung (kepada yang kamu cintai), sehingga kamu biarkan yang lain terkatung-katung. Dan jika kamu mengadakan perbaikan dan memelihara diri (dari kecurangan), maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "وَلَن تَسۡتَطِیعُوۤا۟ أَن تَعۡدِلُوا۟ بَیۡنَ ٱلنِّسَاۤءِ وَلَوۡ حَرَصۡتُمۡۖ فَلَا تَمِیلُوا۟ كُلَّ ٱلۡمَیۡلِ فَتَذَرُوهَا كَٱلۡمُعَلَّقَةِۚ وَإِن تُصۡلِحُوا۟ وَتَتَّقُوا۟ فَإِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 623,
    "surahId": 4,
    "ayahNumber": 130,
    "arabicText": "وَإِن یَتَفَرَّقَا یُغۡنِ ٱللَّهُ كُلࣰّا مِّن سَعَتِهِۦۚ وَكَانَ ٱللَّهُ وَ ٰ⁠سِعًا حَكِیمࣰا\n",
    "translations": {
      "en": "And if husband and wife do separate, God shall provide for each of them out of His abundance: for God is indeed infinite, wise,",
      "ms": "Dan jika keduanya bercerai, maka Allah akan cukupkan (keperluan) masing-masing dari limpah kurniaNya. Dan (ingatlah) Allah Maha Luas limpah kurniaNya, lagi Maha Bijaksana.",
      "id": "Jika keduanya bercerai, maka Allah akan memberi kecukupan kepada masing-masingnya dari limpahan karunia-Nya. Dan adalah Allah Maha Luas (karunia-Nya) lagi Maha Bijaksana.",
      "ar": "وَإِن یَتَفَرَّقَا یُغۡنِ ٱللَّهُ كُلࣰّا مِّن سَعَتِهِۦۚ وَكَانَ ٱللَّهُ وَ ٰ⁠سِعًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 624,
    "surahId": 4,
    "ayahNumber": 131,
    "arabicText": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ وَلَقَدۡ وَصَّیۡنَا ٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ مِن قَبۡلِكُمۡ وَإِیَّاكُمۡ أَنِ ٱتَّقُوا۟ ٱللَّهَۚ وَإِن تَكۡفُرُوا۟ فَإِنَّ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ غَنِیًّا حَمِیدࣰا\n",
    "translations": {
      "en": "and unto God belongs all that is in the heavens and all that is on earth. AND, INDEED, We have enjoined upon those who were granted revelation before your time, as well as upon yourselves, to remain conscious of God. And if you deny Him - behold, unto God belongs all that is in the heavens and all that is on earth, and God is indeed self-sufficient, ever to be praised.",
      "ms": "Dan bagi Allah jualah segala yang ada di langit dan yang ada di bumi; dan demi sesungguhnya, Kami telah perintahkan orang-orang yang diberi Kitab dahulu daripada kamu, dan juga (perintahkan) kamu, iaitu hendaklah bertaqwa kepada Allah; dan jika kamu kufur ingkar, maka (ketahuilah) sesungguhnya Allah jualah yang memiliki segala yang ada di langit dan yang ada di bumi; dan (ingatlah) adalah Allah Maha Kaya, lagi Maha Terpuji.",
      "id": "Dan kepunyaan Allah-lah apa yang di langit dan yang di bumi, dan sungguh Kami telah memerintahkan kepada orang-orang yang diberi kitab sebelum kamu dan (juga) kepada kamu; bertakwalah kepada Allah. Tetapi jika kamu kafir maka (ketahuilah), sesungguhnya apa yang di langit dan apa yang di bumi hanyalah kepunyaan Allah dan Allah Maha Kaya dan Maha Terpuji.",
      "ar": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ وَلَقَدۡ وَصَّیۡنَا ٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ مِن قَبۡلِكُمۡ وَإِیَّاكُمۡ أَنِ ٱتَّقُوا۟ ٱللَّهَۚ وَإِن تَكۡفُرُوا۟ فَإِنَّ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ غَنِیًّا حَمِیدࣰا\n"
    }
  },
  {
    "id": 625,
    "surahId": 4,
    "ayahNumber": 132,
    "arabicText": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا\n",
    "translations": {
      "en": "And unto God belongs all that is in the heavens and all that is on earth; and none is as worthy of trust as God.",
      "ms": "Dan bagi Allah jualah apa yang ada di langit dan yang ada di bumi; dan cukuplah Allah sebagai Pengawal (yang mentadbirkan dan menguasai segala-galanya).",
      "id": "Dan kepunyaan Allah-lah apa yang di langit dan apa yang di bumi. Cukuplah Allah sebagai Pemelihara.",
      "ar": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا\n"
    }
  },
  {
    "id": 626,
    "surahId": 4,
    "ayahNumber": 133,
    "arabicText": "إِن یَشَأۡ یُذۡهِبۡكُمۡ أَیُّهَا ٱلنَّاسُ وَیَأۡتِ بِـَٔاخَرِینَۚ وَكَانَ ٱللَّهُ عَلَىٰ ذَ ٰ⁠لِكَ قَدِیرࣰا\n",
    "translations": {
      "en": "If He so wills, He can cause you, O mankind, to disappear, and bring forth other beings [in your stead]: for God has indeed the power to do this.",
      "ms": "Jika Allah menghendaki, nescaya Ia musnahkan kamu wahai umat manusia dan Ia datangkan gantinya dengan umat-umat yang lain. Dan adalah Allah Maha Kuasa melakukan yang demikian itu.",
      "id": "Jika Allah menghendaki, niscaya Dia musnahkan kamu wahai manusia, dan Dia datangkan umat yang lain (sebagai penggantimu). Dan adalah Allah Maha Kuasa berbuat demikian.",
      "ar": "إِن یَشَأۡ یُذۡهِبۡكُمۡ أَیُّهَا ٱلنَّاسُ وَیَأۡتِ بِـَٔاخَرِینَۚ وَكَانَ ٱللَّهُ عَلَىٰ ذَ ٰ⁠لِكَ قَدِیرࣰا\n"
    }
  },
  {
    "id": 627,
    "surahId": 4,
    "ayahNumber": 134,
    "arabicText": "مَّن كَانَ یُرِیدُ ثَوَابَ ٱلدُّنۡیَا فَعِندَ ٱللَّهِ ثَوَابُ ٱلدُّنۡیَا وَٱلۡـَٔاخِرَةِۚ وَكَانَ ٱللَّهُ سَمِیعَۢا بَصِیرࣰا\n",
    "translations": {
      "en": "If one desires the rewards of this world, [let him remember that] with God are the rewards of [both] this world and the life to come: and God is indeed all-hearing, all-seeing.",
      "ms": "Sesiapa yang mahukan pahala (balasan) dunia sahaja (maka rugilah ia), kerana di sisi Allah disediakan pahala (balasan) dunia dan akhirat. Dan (ingatlah) Allah sentiasa Mendengar, lagi sentiasa Melihat.",
      "id": "Barangsiapa yang menghendaki pahala di dunia saja (maka ia merugi), karena di sisi Allah ada pahala dunia dan akhirat. Dan Allah Maha Mendengar lagi Maha Melihat.",
      "ar": "مَّن كَانَ یُرِیدُ ثَوَابَ ٱلدُّنۡیَا فَعِندَ ٱللَّهِ ثَوَابُ ٱلدُّنۡیَا وَٱلۡـَٔاخِرَةِۚ وَكَانَ ٱللَّهُ سَمِیعَۢا بَصِیرࣰا\n"
    }
  },
  {
    "id": 628,
    "surahId": 4,
    "ayahNumber": 135,
    "arabicText": "۞ یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ كُونُوا۟ قَوَّ ٰ⁠مِینَ بِٱلۡقِسۡطِ شُهَدَاۤءَ لِلَّهِ وَلَوۡ عَلَىٰۤ أَنفُسِكُمۡ أَوِ ٱلۡوَ ٰ⁠لِدَیۡنِ وَٱلۡأَقۡرَبِینَۚ إِن یَكُنۡ غَنِیًّا أَوۡ فَقِیرࣰا فَٱللَّهُ أَوۡلَىٰ بِهِمَاۖ فَلَا تَتَّبِعُوا۟ ٱلۡهَوَىٰۤ أَن تَعۡدِلُوا۟ۚ وَإِن تَلۡوُۥۤا۟ أَوۡ تُعۡرِضُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n",
    "translations": {
      "en": "O YOU who have attained to faith! Be ever steadfast in upholding equity, bearing witness to the truth for the sake of God, even though it be against your own selves or your parents and kinsfolk. Whether the person concerned be rich or poor, God's claim takes precedence over [the claims of] either of them. Do not, then, follow your own desires, lest you swerve from justice: for if you distort [the truth], behold, God is indeed aware of all that you do!",
      "ms": "Wahai orang-orang yang beriman! Hendaklah kamu menjadi orang-orang yang sentiasa menegakkan keadilan, lagi menjadi saksi (yang menerangkan kebenaran) kerana Allah, sekalipun terhadap diri kamu sendiri, atau ibu bapa dan kaum kerabat kamu. Kalaulah orang (yang didakwa) itu kaya atau miskin (maka janganlah kamu terhalang daripada menjadi saksi yang memperkatakan kebenaran disebabkan kamu bertimbang rasa), kerana Allah lebih bertimbang rasa kepada keduanya. Oleh itu, janganlah kamu turutkan hawa nafsu supaya kamu tidak menyeleweng dari keadilan. Dan jika kamu memutar-balikkan keterangan ataupun enggan (daripada menjadi saksi), maka sesungguhnya Allah sentiasa Mengetahui dengan mendalam akan apa yang kamu lakukan.",
      "id": "Wahai orang-orang yang beriman, jadilah kamu orang yang benar-benar penegak keadilan, menjadi saksi karena Allah biarpun terhadap dirimu sendiri atau ibu bapa dan kaum kerabatmu. Jika ia kaya ataupun miskin, maka Allah lebih tahu kemaslahatannya. Maka janganlah kamu mengikuti hawa nafsu karena ingin menyimpang dari kebenaran. Dan jika kamu memutar balikkan (kata-kata) atau enggan menjadi saksi, maka sesungguhnya Allah adalah Maha Mengetahui segala apa yang kamu kerjakan.",
      "ar": "۞ یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ كُونُوا۟ قَوَّ ٰ⁠مِینَ بِٱلۡقِسۡطِ شُهَدَاۤءَ لِلَّهِ وَلَوۡ عَلَىٰۤ أَنفُسِكُمۡ أَوِ ٱلۡوَ ٰ⁠لِدَیۡنِ وَٱلۡأَقۡرَبِینَۚ إِن یَكُنۡ غَنِیًّا أَوۡ فَقِیرࣰا فَٱللَّهُ أَوۡلَىٰ بِهِمَاۖ فَلَا تَتَّبِعُوا۟ ٱلۡهَوَىٰۤ أَن تَعۡدِلُوا۟ۚ وَإِن تَلۡوُۥۤا۟ أَوۡ تُعۡرِضُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n"
    }
  },
  {
    "id": 629,
    "surahId": 4,
    "ayahNumber": 136,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ ءَامِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَٱلۡكِتَـٰبِ ٱلَّذِی نَزَّلَ عَلَىٰ رَسُولِهِۦ وَٱلۡكِتَـٰبِ ٱلَّذِیۤ أَنزَلَ مِن قَبۡلُۚ وَمَن یَكۡفُرۡ بِٱللَّهِ وَمَلَـٰۤىِٕكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ فَقَدۡ ضَلَّ ضَلَـٰلَۢا بَعِیدًا\n",
    "translations": {
      "en": "O you who have attained to faith! Hold fast unto your belief in God and His Apostle, and in the divine writ which He has bestowed from on high upon His Apostle, step by step, as well as in the revelation which He sent down aforetime: for he who denies God, and His angels, and His revelations, and His apostles, and the Last Day, has indeed gone far astray.",
      "ms": "Wahai orang-orang yang beriman! Tetapkanlah iman kamu kepada Allah dan RasulNya, dan kepada Kitab Al-Quran yang telah diturunkan kepada RasulNya (Muhammad, s.a.w), dan juga kepada Kitab-kitab Suci yang telah diturunkan dahulu daripada itu. Dan sesiapa yang kufur ingkar kepada Allah, dan Malaikat-malaikatNya, dan Kitab-kitabNya, dan Rasul-rasulNya dan juga Hari Akhirat, maka sesungguhnya ia telah sesat dengan kesesatan yang amat jauh.",
      "id": "Wahai orang-orang yang beriman, tetaplah beriman kepada Allah dan Rasul-Nya dan kepada kitab yang Allah turunkan kepada Rasul-Nya serta kitab yang Allah turunkan sebelumnya. Barangsiapa yang kafir kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, dan hari kemudian, maka sesungguhnya orang itu telah sesat sejauh-jauhnya.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ ءَامِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَٱلۡكِتَـٰبِ ٱلَّذِی نَزَّلَ عَلَىٰ رَسُولِهِۦ وَٱلۡكِتَـٰبِ ٱلَّذِیۤ أَنزَلَ مِن قَبۡلُۚ وَمَن یَكۡفُرۡ بِٱللَّهِ وَمَلَـٰۤىِٕكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ فَقَدۡ ضَلَّ ضَلَـٰلَۢا بَعِیدًا\n"
    }
  },
  {
    "id": 630,
    "surahId": 4,
    "ayahNumber": 137,
    "arabicText": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ ثُمَّ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ ثُمَّ ٱزۡدَادُوا۟ كُفۡرࣰا لَّمۡ یَكُنِ ٱللَّهُ لِیَغۡفِرَ لَهُمۡ وَلَا لِیَهۡدِیَهُمۡ سَبِیلَۢا\n",
    "translations": {
      "en": "Behold, as for those who come to believe, and then deny the truth, and again come to believe, and again deny the truth, and thereafter grow stubborn in their denial of the truth - God will not forgive them, nor will He guide them in any way.",
      "ms": "Sesungguhnya orang-orang yang beriman, kemudian mereka kafir, kemudian mereka beriman semula, kemudian mereka kafir sekali lagi, kemudian mereka bertambah-tambah lagi dengan kekufuran, Allah tidak sekali-kali akan memberi ampun kepada mereka, dan tidak akan memberi pertunjuk hidayah kepada mereka ke jalan yang benar.",
      "id": "Sesungguhnya orang-orang yang beriman kemudian kafir, kemudian beriman (pula), kamudian kafir lagi, kemudian bertambah kekafirannya, maka sekali-kali Allah tidak akan memberi ampunan kepada mereka, dan tidak (pula) menunjuki mereka kepada jalan yang lurus.",
      "ar": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ ثُمَّ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ ثُمَّ ٱزۡدَادُوا۟ كُفۡرࣰا لَّمۡ یَكُنِ ٱللَّهُ لِیَغۡفِرَ لَهُمۡ وَلَا لِیَهۡدِیَهُمۡ سَبِیلَۢا\n"
    }
  },
  {
    "id": 631,
    "surahId": 4,
    "ayahNumber": 138,
    "arabicText": "بَشِّرِ ٱلۡمُنَـٰفِقِینَ بِأَنَّ لَهُمۡ عَذَابًا أَلِیمًا\n",
    "translations": {
      "en": "Announce thou to such hypocrites that grievous suffering awaits them.",
      "ms": "Sampaikanlah khabar berita kepada orang-orang munafik: bahawa sesungguhnya disediakan untuk mereka azab seksa yang tidak terperi sakitnya;",
      "id": "Kabarkanlah kepada orang-orang munafik bahwa mereka akan mendapat siksaan yang pedih,",
      "ar": "بَشِّرِ ٱلۡمُنَـٰفِقِینَ بِأَنَّ لَهُمۡ عَذَابًا أَلِیمًا\n"
    }
  },
  {
    "id": 632,
    "surahId": 4,
    "ayahNumber": 139,
    "arabicText": "ٱلَّذِینَ یَتَّخِذُونَ ٱلۡكَـٰفِرِینَ أَوۡلِیَاۤءَ مِن دُونِ ٱلۡمُؤۡمِنِینَۚ أَیَبۡتَغُونَ عِندَهُمُ ٱلۡعِزَّةَ فَإِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِیعࣰا\n",
    "translations": {
      "en": "As for those who take the deniers of the truth for their allies in preference to the believers - do they hope to be honoured by them when, behold, all honour belongs to God [alone]?",
      "ms": "(Iaitu) orang-orang yang mengambil orang-orang kafir menjadi teman rapat dengan meninggalkan orang-orang yang beriman. Tidaklah patut mereka (orang-orang munafik) mencari kekuatan dan kemuliaan di sisi orang-orang kafir itu, kerana sesungguhnya kekuatan dan kemuliaan itu semuanya ialah milik Allah, (diberikannya kepada sesiapa yang dikehendakiNya).",
      "id": "(yaitu) orang-orang yang mengambil orang-orang kafir menjadi teman-teman penolong dengan meninggalkan orang-orang mukmin. Apakah mereka mencari kekuatan di sisi orang kafir itu? Maka sesungguhnya semua kekuatan kepunyaan Allah.",
      "ar": "ٱلَّذِینَ یَتَّخِذُونَ ٱلۡكَـٰفِرِینَ أَوۡلِیَاۤءَ مِن دُونِ ٱلۡمُؤۡمِنِینَۚ أَیَبۡتَغُونَ عِندَهُمُ ٱلۡعِزَّةَ فَإِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِیعࣰا\n"
    }
  },
  {
    "id": 633,
    "surahId": 4,
    "ayahNumber": 140,
    "arabicText": "وَقَدۡ نَزَّلَ عَلَیۡكُمۡ فِی ٱلۡكِتَـٰبِ أَنۡ إِذَا سَمِعۡتُمۡ ءَایَـٰتِ ٱللَّهِ یُكۡفَرُ بِهَا وَیُسۡتَهۡزَأُ بِهَا فَلَا تَقۡعُدُوا۟ مَعَهُمۡ حَتَّىٰ یَخُوضُوا۟ فِی حَدِیثٍ غَیۡرِهِۦۤ إِنَّكُمۡ إِذࣰا مِّثۡلُهُمۡۗ إِنَّ ٱللَّهَ جَامِعُ ٱلۡمُنَـٰفِقِینَ وَٱلۡكَـٰفِرِینَ فِی جَهَنَّمَ جَمِیعًا\n",
    "translations": {
      "en": "And, indeed, He has enjoined upon you in this divine writ that whenever you hear people deny the truth of God's messages and mock at them, you shall avoid their company until they begin to talk of other things - or else, verily, you will become like them. Behold, together with those who deny the truth God will gather in hell the hypocrites,",
      "ms": "Dan sesungguhnya Allah telahpun menurunkan kepada kamu (perintahNya) di dalam Kitab (Al-Quran), iaitu: apabila kamu mendengar ayat-ayat keterangan Allah diingkari dan diejek-ejek (oleh kaum kafir dan munafik), maka janganlah kamu duduk (bergaul) dengan mereka sehingga mereka masuk kepada memperkatakan soal yang lain; kerana sesungguhnya (jika kamu melakukan yang demikian), tentulah kamu sama seperti mereka. Sesungguhnya Allah akan menghimpunkan sekalian orang manufik dan orang kafir di dalam neraka jahannam.",
      "id": "Dan sungguh Allah telah menurunkan kekuatan kepada kamu di dalam Al Quran bahwa apabila kamu mendengar ayat-ayat Allah diingkari dan diperolok-olokkan (oleh orang-orang kafir), maka janganlah kamu duduk beserta mereka, sehingga mereka memasuki pembicaraan yang lain. Karena sesungguhnya (kalau kamu berbuat demikian), tentulah kamu serupa dengan mereka. Sesungguhnya Allah akan mengumpulkan semua orang-orang munafik dan orang-orang kafir di dalam Jahannam,",
      "ar": "وَقَدۡ نَزَّلَ عَلَیۡكُمۡ فِی ٱلۡكِتَـٰبِ أَنۡ إِذَا سَمِعۡتُمۡ ءَایَـٰتِ ٱللَّهِ یُكۡفَرُ بِهَا وَیُسۡتَهۡزَأُ بِهَا فَلَا تَقۡعُدُوا۟ مَعَهُمۡ حَتَّىٰ یَخُوضُوا۟ فِی حَدِیثٍ غَیۡرِهِۦۤ إِنَّكُمۡ إِذࣰا مِّثۡلُهُمۡۗ إِنَّ ٱللَّهَ جَامِعُ ٱلۡمُنَـٰفِقِینَ وَٱلۡكَـٰفِرِینَ فِی جَهَنَّمَ جَمِیعًا\n"
    }
  },
  {
    "id": 634,
    "surahId": 4,
    "ayahNumber": 141,
    "arabicText": "ٱلَّذِینَ یَتَرَبَّصُونَ بِكُمۡ فَإِن كَانَ لَكُمۡ فَتۡحࣱ مِّنَ ٱللَّهِ قَالُوۤا۟ أَلَمۡ نَكُن مَّعَكُمۡ وَإِن كَانَ لِلۡكَـٰفِرِینَ نَصِیبࣱ قَالُوۤا۟ أَلَمۡ نَسۡتَحۡوِذۡ عَلَیۡكُمۡ وَنَمۡنَعۡكُم مِّنَ ٱلۡمُؤۡمِنِینَۚ فَٱللَّهُ یَحۡكُمُ بَیۡنَكُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِۗ وَلَن یَجۡعَلَ ٱللَّهُ لِلۡكَـٰفِرِینَ عَلَى ٱلۡمُؤۡمِنِینَ سَبِیلًا\n",
    "translations": {
      "en": "who but wait to see what betides you: thus, if triumph comes to you from God, they say, \"Were we not on your side?\"- whereas if those who deny the truth are in luck, they say [to them], \"Have we not earned your affection by defending you against those be­lievers?'' But God will judge between you all on the Day of Resurrection; and never will God allow those who deny the truth to harm the believers.",
      "ms": "(Mereka yang munafik itu ialah) orang-orang yang sentiasa menunggu-nunggu (berlakunya sesuatu) kepada kamu; maka kalau kamu mendapat kemenangan dari Allah (dalam sesuatu peperangan), berkatalah mereka (kepada kamu): \"Bukankah kami turut berjuang bersama-sama kamu? (Oleh itu kami juga berhak menerima bahagian dari harta rampasan perang)\". Dan jika orang-orang kafir pula mendapat bahagian (yang menguntungkan dalam peperangan), berkatalah mereka (kepada orang-orang kafir itu): \"Bukankah kami turut membantu kamu dan mempertahankan kamu dari (serang balas) orang-orang yang beriman (dengan mendedahkan rahsia perpaduannya)?\" Maka Allah akan menghakimi di antara kamu semua pada hari kiamat; dan Allah tidak sekali-kali akan memberi jalan kepada orang-orang kafir untuk membinasakan orang-orang yang beriman.",
      "id": "(yaitu) orang-orang yang menunggu-nunggu (peristiwa) yang akan terjadi pada dirimu (hai orang-orang mukmin). Maka jika terjadi bagimu kemenangan dari Allah mereka berkata: \"Bukankah kami (turut berperang) beserta kamu?\" Dan jika orang-orang kafir mendapat keberuntungan (kemenangan) mereka berkata: \"Bukankah kami turut memenangkanmu, dan membela kamu dari orang-orang mukmin?\" Maka Allah akan memberi keputusan di antara kamu di hari kiamat dan Allah sekali-kali tidak akan memberi jalan kepada orang-orang kafir untuk memusnahkan orang-orang yang beriman.",
      "ar": "ٱلَّذِینَ یَتَرَبَّصُونَ بِكُمۡ فَإِن كَانَ لَكُمۡ فَتۡحࣱ مِّنَ ٱللَّهِ قَالُوۤا۟ أَلَمۡ نَكُن مَّعَكُمۡ وَإِن كَانَ لِلۡكَـٰفِرِینَ نَصِیبࣱ قَالُوۤا۟ أَلَمۡ نَسۡتَحۡوِذۡ عَلَیۡكُمۡ وَنَمۡنَعۡكُم مِّنَ ٱلۡمُؤۡمِنِینَۚ فَٱللَّهُ یَحۡكُمُ بَیۡنَكُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِۗ وَلَن یَجۡعَلَ ٱللَّهُ لِلۡكَـٰفِرِینَ عَلَى ٱلۡمُؤۡمِنِینَ سَبِیلًا\n"
    }
  },
  {
    "id": 635,
    "surahId": 4,
    "ayahNumber": 142,
    "arabicText": "إِنَّ ٱلۡمُنَـٰفِقِینَ یُخَـٰدِعُونَ ٱللَّهَ وَهُوَ خَـٰدِعُهُمۡ وَإِذَا قَامُوۤا۟ إِلَى ٱلصَّلَوٰةِ قَامُوا۟ كُسَالَىٰ یُرَاۤءُونَ ٱلنَّاسَ وَلَا یَذۡكُرُونَ ٱللَّهَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "Behold, the hypocrites seek to deceive God - the while it is He who causes them to be deceived [by themselves] And when they rise to pray, they rise reluctantly, only to be seen and praised by men, remembering God but seldom,",
      "ms": "Sesungguhnya orang-orang munafik itu melakukan tipu daya (terhadap ugama) Allah (dengan perbuatan pura-pura beriman sedang mereka kafir pada batinnya), dan Allah pula tetap membalas tipu daya mereka (dengan membiarkan mereka dalam keadaan munafik). Mereka pula apabila berdiri hendak sembahyang, mereka berdiri dengan malas. Mereka (hanya bertujuan) riak (memperlihatkan sembahyangnya) kepada manusia (supaya disangka bahawa mereka orang yang beriman), dan mereka pula tidak mengingati Allah (dengan mengerjakan sembahyang) melainkan sedikit sekali (jarang-jarang).",
      "id": "Sesungguhnya orang-orang munafik itu menipu Allah, dan Allah akan membalas tipuan mereka. Dan apabila mereka berdiri untuk shalat mereka berdiri dengan malas. Mereka bermaksud riya (dengan shalat) di hadapan manusia. Dan tidaklah mereka menyebut Allah kecuali sedikit sekali.",
      "ar": "إِنَّ ٱلۡمُنَـٰفِقِینَ یُخَـٰدِعُونَ ٱللَّهَ وَهُوَ خَـٰدِعُهُمۡ وَإِذَا قَامُوۤا۟ إِلَى ٱلصَّلَوٰةِ قَامُوا۟ كُسَالَىٰ یُرَاۤءُونَ ٱلنَّاسَ وَلَا یَذۡكُرُونَ ٱللَّهَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 636,
    "surahId": 4,
    "ayahNumber": 143,
    "arabicText": "مُّذَبۡذَبِینَ بَیۡنَ ذَ ٰ⁠لِكَ لَاۤ إِلَىٰ هَـٰۤؤُلَاۤءِ وَلَاۤ إِلَىٰ هَـٰۤؤُلَاۤءِۚ وَمَن یُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِیلࣰا\n",
    "translations": {
      "en": "wavering be­tween this and that, [true] neither to these nor those. But for him whom God lets go astray thou canst never find any way.",
      "ms": "Mereka berkeadaan \"muzabzab\" (tidak mempunyai pendirian yang tetap) antara (iman dan kufur) itu; mereka tidak berpihak terus kepada golongan (kafir) dan tidak pula berpihak kepada golongan (yang beriman). Dan sesiapa yang disesatkan oleh Allah, maka engkau (wahai Muhammad) tidak sekali-kali akan mendapat jalan untuk menyelamatkannya.",
      "id": "Mereka dalam keadaan ragu-ragu antara yang demikian (iman atau kafir): tidak masuk kepada golongan ini (orang-orang beriman) dan tidak (pula) kepada golongan itu (orang-orang kafir), maka kamu sekali-kali tidak akan mendapat jalan (untuk memberi petunjuk) baginya.",
      "ar": "مُّذَبۡذَبِینَ بَیۡنَ ذَ ٰ⁠لِكَ لَاۤ إِلَىٰ هَـٰۤؤُلَاۤءِ وَلَاۤ إِلَىٰ هَـٰۤؤُلَاۤءِۚ وَمَن یُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِیلࣰا\n"
    }
  },
  {
    "id": 637,
    "surahId": 4,
    "ayahNumber": 144,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ ٱلۡكَـٰفِرِینَ أَوۡلِیَاۤءَ مِن دُونِ ٱلۡمُؤۡمِنِینَۚ أَتُرِیدُونَ أَن تَجۡعَلُوا۟ لِلَّهِ عَلَیۡكُمۡ سُلۡطَـٰنࣰا مُّبِینًا\n",
    "translations": {
      "en": "O you who have attained to faith! Do not take the deniers of the truth for your allies in preference to the believers! Do you want to place before God a manifest proof of your guilt?",
      "ms": "Wahai orang-orang yang beriman, janganlah kamu mengambil orang-orang kafir menjadi teman rapat dengan meninggalkan orang-orang yang beriman. Adakah kamu hendak mengadakan alasan yang terang nyata bagi Allah untuk (menyeksa) kamu?",
      "id": "Hai orang-orang yang beriman, janganlah kamu mengambil orang-orang kafir menjadi wali dengan meninggalkan orang-orang mukmin. Inginkah kamu mengadakan alasan yang nyata bagi Allah (untuk menyiksamu)?",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ ٱلۡكَـٰفِرِینَ أَوۡلِیَاۤءَ مِن دُونِ ٱلۡمُؤۡمِنِینَۚ أَتُرِیدُونَ أَن تَجۡعَلُوا۟ لِلَّهِ عَلَیۡكُمۡ سُلۡطَـٰنࣰا مُّبِینًا\n"
    }
  },
  {
    "id": 638,
    "surahId": 4,
    "ayahNumber": 145,
    "arabicText": "إِنَّ ٱلۡمُنَـٰفِقِینَ فِی ٱلدَّرۡكِ ٱلۡأَسۡفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمۡ نَصِیرًا\n",
    "translations": {
      "en": "Verily, the hypocrites shall be in the lowest depth of the fire, and thou wilt find none who could succour them.",
      "ms": "Sesungguhnya orang-orang munafik itu ditempatkan pada tingkatan yang terkebawah sekali dari (lapisan-lapisan dalam) neraka. Dan engkau tidak sekali-kali akan mendapat sesiapa pun yang boleh menolong mereka.",
      "id": "Sesungguhnya orang-orang munafik itu (ditempatkan) pada tingkatan yang paling bawah dari neraka. Dan kamu sekali-kali tidak akan mendapat seorang penolongpun bagi mereka.",
      "ar": "إِنَّ ٱلۡمُنَـٰفِقِینَ فِی ٱلدَّرۡكِ ٱلۡأَسۡفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمۡ نَصِیرًا\n"
    }
  },
  {
    "id": 639,
    "surahId": 4,
    "ayahNumber": 146,
    "arabicText": "إِلَّا ٱلَّذِینَ تَابُوا۟ وَأَصۡلَحُوا۟ وَٱعۡتَصَمُوا۟ بِٱللَّهِ وَأَخۡلَصُوا۟ دِینَهُمۡ لِلَّهِ فَأُو۟لَـٰۤىِٕكَ مَعَ ٱلۡمُؤۡمِنِینَۖ وَسَوۡفَ یُؤۡتِ ٱللَّهُ ٱلۡمُؤۡمِنِینَ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "But excepted shall be they who repent, and live righteously, and hold fast unto God, and grow sincere in their faith in God alone: for these shall be one with the believers - and in time God will grant to all believers a mighty reward.",
      "ms": "Kecuali orang-orang yang bertaubat (dari perbuatan munafik itu) dan memperbaiki amalan mereka (yang salah), dan mereka pula berpegang teguh kepada (ugama) Allah, serta mengerjakan ugama mereka dengan ikhlas kerana Allah, maka mereka yang demikian itu ditempatkan bersama-sama orang-orang yang beriman (di dalam Syurga); dan Allah akan memberikan orang-orang yang beriman itu pahala yang amat besar.",
      "id": "Kecuali orang-orang yang taubat dan mengadakan perbaikan dan berpegang teguh pada (agama) Allah dan tulus ikhlas (mengerjakan) agama mereka karena Allah. Maka mereka itu adalah bersama-sama orang yang beriman dan kelak Allah akan memberikan kepada orang-orang yang beriman pahala yang besar.",
      "ar": "إِلَّا ٱلَّذِینَ تَابُوا۟ وَأَصۡلَحُوا۟ وَٱعۡتَصَمُوا۟ بِٱللَّهِ وَأَخۡلَصُوا۟ دِینَهُمۡ لِلَّهِ فَأُو۟لَـٰۤىِٕكَ مَعَ ٱلۡمُؤۡمِنِینَۖ وَسَوۡفَ یُؤۡتِ ٱللَّهُ ٱلۡمُؤۡمِنِینَ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 640,
    "surahId": 4,
    "ayahNumber": 147,
    "arabicText": "مَّا یَفۡعَلُ ٱللَّهُ بِعَذَابِكُمۡ إِن شَكَرۡتُمۡ وَءَامَنتُمۡۚ وَكَانَ ٱللَّهُ شَاكِرًا عَلِیمࣰا\n",
    "translations": {
      "en": "Why would God cause you to suffer [for your past sins] if you are grateful and attain to belief - seeing that God is always responsive to gratitude, all-knowing?",
      "ms": "Apa gunanya Allah menyeksa kamu sekiranya kamu bersyukur (akan nikmatNya) serta kamu beriman (kepadaNya)? Dan (ingatlah) Allah sentiasa Membalas dengan sebaik-baiknya (akan orang-orang yang bersyukur kepadaNya), lagi Maha Mengetahui (akan hal keadaan mereka).",
      "id": "Mengapa Allah akan menyiksamu, jika kamu bersyukur dan beriman? Dan Allah adalah Maha Mensyukuri lagi Maha Mengetahui.",
      "ar": "مَّا یَفۡعَلُ ٱللَّهُ بِعَذَابِكُمۡ إِن شَكَرۡتُمۡ وَءَامَنتُمۡۚ وَكَانَ ٱللَّهُ شَاكِرًا عَلِیمࣰا\n"
    }
  },
  {
    "id": 641,
    "surahId": 4,
    "ayahNumber": 148,
    "arabicText": "۞ لَّا یُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوۤءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِیعًا عَلِیمًا\n",
    "translations": {
      "en": "God does not like any evil to be mentioned openly, unless it be by him who has been wronged (thereby) And God is indeed all-hearing, all-knowing,",
      "ms": "Allah tidak suka kepada perkataan-perkataan buruk yang dikatakan dengan berterus-terang (untuk mendedahkan kejahatan orang); kecuali oleh orang yang dianiayakan. Dan (ingatlah) Allah sentiasa Mendengar, lagi Maha Mengetahui.",
      "id": "Allah tidak menyukai ucapan buruk, (yang diucapkan) dengan terus terang kecuali oleh orang yang dianiaya. Allah adalah Maha Mendengar lagi Maha Mengetahui.",
      "ar": "۞ لَّا یُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوۤءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِیعًا عَلِیمًا\n"
    }
  },
  {
    "id": 642,
    "surahId": 4,
    "ayahNumber": 149,
    "arabicText": "إِن تُبۡدُوا۟ خَیۡرًا أَوۡ تُخۡفُوهُ أَوۡ تَعۡفُوا۟ عَن سُوۤءࣲ فَإِنَّ ٱللَّهَ كَانَ عَفُوࣰّا قَدِیرًا\n",
    "translations": {
      "en": "whether you do good openly or in secret, or pardon others for evil [done unto you]: for, behold, God is indeed an absolver of sins, infinite in His power.",
      "ms": "Jika kamu melahirkan sesuatu kebaikan, atau menyembunyikannya, atau kamu memaafkan kesalahan (yang dilakukan terhadap kamu), maka sesungguhnya Allah adalah Maha Pemaaf lagi Maha Kuasa.",
      "id": "Jika kamu melahirkan sesuatu kebaikan atau menyembunyikan atau memaafkan sesuatu kesalahan (orang lain), maka sesungguhnya Allah Maha Pemaaf lagi Maha Kuasa.",
      "ar": "إِن تُبۡدُوا۟ خَیۡرًا أَوۡ تُخۡفُوهُ أَوۡ تَعۡفُوا۟ عَن سُوۤءࣲ فَإِنَّ ٱللَّهَ كَانَ عَفُوࣰّا قَدِیرًا\n"
    }
  },
  {
    "id": 643,
    "surahId": 4,
    "ayahNumber": 150,
    "arabicText": "إِنَّ ٱلَّذِینَ یَكۡفُرُونَ بِٱللَّهِ وَرُسُلِهِۦ وَیُرِیدُونَ أَن یُفَرِّقُوا۟ بَیۡنَ ٱللَّهِ وَرُسُلِهِۦ وَیَقُولُونَ نُؤۡمِنُ بِبَعۡضࣲ وَنَكۡفُرُ بِبَعۡضࣲ وَیُرِیدُونَ أَن یَتَّخِذُوا۟ بَیۡنَ ذَ ٰ⁠لِكَ سَبِیلًا\n",
    "translations": {
      "en": "VERILY, those who deny God and His apostles by endeavouring to make a distinction between [belief in] God and [belief in] His apostles, and who say, \"We believe in the one but we deny the other,\" and want to pursue a path in-between -",
      "ms": "Sesungguhnya orang-orang yang kufur ingkar kepada Allah dan Rasul-rasulNya, dan (orang-orang yang) hendak membeza-bezakan iman mereka di antara Allah dan Rasul-rasulNya, dan (orang-orang yang) berkata: \"Kami beriman kepada setengah Rasul-rasul itu dan kufur ingkar kepada setengahnya yang lain\", serta bertujuan hendak mengambil jalan lain antara iman dan kufur itu:",
      "id": "Sesungguhnya orang-orang yang kafir kepada Allah dan rasul-rasul-Nya, dan bermaksud memperbedakan antara (keimanan kepada) Allah dan rasul-rasul-Nya, dengan mengatakan: \"Kami beriman kepada yang sebahagian dan kami kafir terhadap sebahagian (yang lain)\", serta bermaksud (dengan perkataan itu) mengambil jalan (tengah) di antara yang demikian (iman atau kafir),",
      "ar": "إِنَّ ٱلَّذِینَ یَكۡفُرُونَ بِٱللَّهِ وَرُسُلِهِۦ وَیُرِیدُونَ أَن یُفَرِّقُوا۟ بَیۡنَ ٱللَّهِ وَرُسُلِهِۦ وَیَقُولُونَ نُؤۡمِنُ بِبَعۡضࣲ وَنَكۡفُرُ بِبَعۡضࣲ وَیُرِیدُونَ أَن یَتَّخِذُوا۟ بَیۡنَ ذَ ٰ⁠لِكَ سَبِیلًا\n"
    }
  },
  {
    "id": 644,
    "surahId": 4,
    "ayahNumber": 151,
    "arabicText": "أُو۟لَـٰۤىِٕكَ هُمُ ٱلۡكَـٰفِرُونَ حَقࣰّاۚ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n",
    "translations": {
      "en": "it is they, they who are truly denying the truth: and for those who deny the truth We have readied shameful suffering.",
      "ms": "Mereka itulah orang-orang yang kafir dengan sebenar-benarnya. Dan Kami telah menyediakan bagi orang-orang kafir itu azab seksa yang menghina.",
      "id": "merekalah orang-orang yang kafir sebenar-benarnya. Kami telah menyediakan untuk orang-orang yang kafir itu siksaan yang menghinakan.",
      "ar": "أُو۟لَـٰۤىِٕكَ هُمُ ٱلۡكَـٰفِرُونَ حَقࣰّاۚ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n"
    }
  },
  {
    "id": 645,
    "surahId": 4,
    "ayahNumber": 152,
    "arabicText": "وَٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَرُسُلِهِۦ وَلَمۡ یُفَرِّقُوا۟ بَیۡنَ أَحَدࣲ مِّنۡهُمۡ أُو۟لَـٰۤىِٕكَ سَوۡفَ یُؤۡتِیهِمۡ أُجُورَهُمۡۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "But as for those who believe in God and His apostles and make no distinction between any of them - unto them, in time, will He grant their re­wards [in full]. And God is indeed much-forgiving, a dispenser of grace.",
      "ms": "Dan orang-orang yang beriman kepada Allah dan Rasul-rasulNya dan mereka pula tidak membeza-bezakan (imannya terhadap) seseorang pun di antara Rasul-rasul itu, (maka) mereka yang demikian, Allah akan memberi mereka pahala mereka. Dan (ingatlah) adalah Allah Maha Pengampun, lagi Maha Mengasihani.",
      "id": "Orang-orang yang beriman kepada Allah dan para rasul-Nya dan tidak membeda-bedakan seorangpun di antara mereka, kelak Allah akan memberikan kepada mereka pahalanya. Dan adalah Allah Maha Pengampun lagi Maha Penyayang.",
      "ar": "وَٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَرُسُلِهِۦ وَلَمۡ یُفَرِّقُوا۟ بَیۡنَ أَحَدࣲ مِّنۡهُمۡ أُو۟لَـٰۤىِٕكَ سَوۡفَ یُؤۡتِیهِمۡ أُجُورَهُمۡۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 646,
    "surahId": 4,
    "ayahNumber": 153,
    "arabicText": "یَسۡـَٔلُكَ أَهۡلُ ٱلۡكِتَـٰبِ أَن تُنَزِّلَ عَلَیۡهِمۡ كِتَـٰبࣰا مِّنَ ٱلسَّمَاۤءِۚ فَقَدۡ سَأَلُوا۟ مُوسَىٰۤ أَكۡبَرَ مِن ذَ ٰ⁠لِكَ فَقَالُوۤا۟ أَرِنَا ٱللَّهَ جَهۡرَةࣰ فَأَخَذَتۡهُمُ ٱلصَّـٰعِقَةُ بِظُلۡمِهِمۡۚ ثُمَّ ٱتَّخَذُوا۟ ٱلۡعِجۡلَ مِنۢ بَعۡدِ مَا جَاۤءَتۡهُمُ ٱلۡبَیِّنَـٰتُ فَعَفَوۡنَا عَن ذَ ٰ⁠لِكَۚ وَءَاتَیۡنَا مُوسَىٰ سُلۡطَـٰنࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "THE FOLLOWERS of the Old Testament demand of thee [O Prophet] that thou cause a revelation to be sent down to them from heaven. And an even greater thing than this did they demand of Moses when they said, \"Make us see God face to face\" - whereupon the thunderbolt of punishment overtook them for this their wickedness. After that, they took to worshipping the [golden] calf - and this after all evidence of the truth had come unto them! None the less, We effaced this [sin of theirs], and vouchsafed unto Moses a clear proof [of the truth],",
      "ms": "Ahli Kitab (kaum Yahudi) meminta kepadamu (wahai Muhammad) supaya engkau menurunkan kepada mereka sebuah Kitab dari langit. (Janganlah engkau merasa pelik), kerana sesungguhnya mereka telah meminta kepada Nabi Musa lebih besar dari itu. Mereka berkata: \"(Wahai Musa) perlihatkanlah Allah kepada kami dengan nyata (supaya kami dapat melihatNya dan percaya kepadaNya)\". Lalu mereka disambar oleh petir dengan sebab kezaliman mereka (menderhaka kepada Allah); kemudian mereka pula menyembah (patung) anak lembu sesudah datang kepada mereka keterangan-keterangan (mukjizat), lalu Kami maafkan mereka dari perbuatan yang sedemikian itu (ketika mereka bertaubat). Dan Kami telah memberi kepada Nabi Musa kekuasaan yang nyata (untuk mengalahkan kaum yang kafir itu).",
      "id": "Ahli Kitab meminta kepadamu agar kamu menurunkan kepada mereka sebuah Kitab dari langit. Maka sesungguhnya mereka telah meminta kepada Musa yang lebih besar dari itu. Mereka berkata: \"Perlihatkanlah Allah kepada kami dengan nyata\". Maka mereka disambar petir karena kezalimannya, dan mereka menyembah anak sapi, sesudah datang kepada mereka bukti-bukti yang nyata, lalu Kami maafkan (mereka) dari yang demikian. Dan telah Kami berikan kepada Musa keterangan yang nyata.",
      "ar": "یَسۡـَٔلُكَ أَهۡلُ ٱلۡكِتَـٰبِ أَن تُنَزِّلَ عَلَیۡهِمۡ كِتَـٰبࣰا مِّنَ ٱلسَّمَاۤءِۚ فَقَدۡ سَأَلُوا۟ مُوسَىٰۤ أَكۡبَرَ مِن ذَ ٰ⁠لِكَ فَقَالُوۤا۟ أَرِنَا ٱللَّهَ جَهۡرَةࣰ فَأَخَذَتۡهُمُ ٱلصَّـٰعِقَةُ بِظُلۡمِهِمۡۚ ثُمَّ ٱتَّخَذُوا۟ ٱلۡعِجۡلَ مِنۢ بَعۡدِ مَا جَاۤءَتۡهُمُ ٱلۡبَیِّنَـٰتُ فَعَفَوۡنَا عَن ذَ ٰ⁠لِكَۚ وَءَاتَیۡنَا مُوسَىٰ سُلۡطَـٰنࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 647,
    "surahId": 4,
    "ayahNumber": 154,
    "arabicText": "وَرَفَعۡنَا فَوۡقَهُمُ ٱلطُّورَ بِمِیثَـٰقِهِمۡ وَقُلۡنَا لَهُمُ ٱدۡخُلُوا۟ ٱلۡبَابَ سُجَّدࣰا وَقُلۡنَا لَهُمۡ لَا تَعۡدُوا۟ فِی ٱلسَّبۡتِ وَأَخَذۡنَا مِنۡهُم مِّیثَـٰقًا غَلِیظࣰا\n",
    "translations": {
      "en": "raising Mount Sinai high above them in witness of their solemn pledge. And We said unto them, “Enter the gate humbly”; and We told them, \"Do not break the Sabbath-law\"; and We accepted from them a most solemn pledge.",
      "ms": "Dan Kami telah mengangkat \"Gunung Tursina\" ke atas mereka disebabkan (mereka ingkar akan) perjanjian setia mereka (mematuhi hukum-hukum Taurat), dan Kami perintahkan mereka: \"Masuklah kamu melalui pintu (negeri) itu dengan merendah diri\" dan Kami juga perintahkan mereka: \"Janganlah kamu melanggar perintah larangan yang ditentukan pada hari Sabtu\", dan Kami telah mengambil daripada mereka perjanjian setia yang teguh (yang mewajibkan mereka mengerjakan suruhan Allah dan meninggalkan laranganNya).",
      "id": "Dan telah Kami angkat ke atas (kepala) mereka bukit Thursina untuk (menerima) perjanjian (yang telah Kami ambil dari) mereka. Dan kami perintahkan kepada mereka: \"Masuklah pintu gerbang itu sambil bersujud\", dan Kami perintahkan (pula) kepada mereka: \"Janganlah kamu melanggar peraturan mengenai hari Sabtu\", dan Kami telah mengambil dari mereka perjanjian yang kokoh.",
      "ar": "وَرَفَعۡنَا فَوۡقَهُمُ ٱلطُّورَ بِمِیثَـٰقِهِمۡ وَقُلۡنَا لَهُمُ ٱدۡخُلُوا۟ ٱلۡبَابَ سُجَّدࣰا وَقُلۡنَا لَهُمۡ لَا تَعۡدُوا۟ فِی ٱلسَّبۡتِ وَأَخَذۡنَا مِنۡهُم مِّیثَـٰقًا غَلِیظࣰا\n"
    }
  },
  {
    "id": 648,
    "surahId": 4,
    "ayahNumber": 155,
    "arabicText": "فَبِمَا نَقۡضِهِم مِّیثَـٰقَهُمۡ وَكُفۡرِهِم بِـَٔایَـٰتِ ٱللَّهِ وَقَتۡلِهِمُ ٱلۡأَنۢبِیَاۤءَ بِغَیۡرِ حَقࣲّ وَقَوۡلِهِمۡ قُلُوبُنَا غُلۡفُۢۚ بَلۡ طَبَعَ ٱللَّهُ عَلَیۡهَا بِكُفۡرِهِمۡ فَلَا یُؤۡمِنُونَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "And so, [We punished them] for the break­ing of their pledge, and their refusal to acknowledge God's messages, and their slaying of prophets against all right, and their boast, \"Our hearts are already full of knowledge\"- nay, but God has sealed their hearts in result of their denial of the truth, and [now] they believe in but few things -;",
      "ms": "Maka (Kami laknatkan mereka) dengan sebab mereka mencabuli perjanjian setia mereka, dan mereka kufur ingkar akan ayat-ayat keterangan Allah, dan mereka pula membunuh Nabi-nabi dengan tiada sesuatu alasan yang benar, dan mereka juga mengatakan: \"Hati kami tertutup (tidak dapat menerima ajaran Islam yang dibawa oleh Nabi Muhammad)\". (Sebenarnya hati mereka tidak tertutup), bahkan Allah telah memeteraikan hati mereka disebabkan kekufuran mereka. Oleh itu mereka tidak beriman kecuali sedikit sahaja (di antaranya).",
      "id": "Maka (Kami lakukan terhadap mereka beberapa tindakan), disebabkan mereka melanggar perjanjian itu, dan karena kekafiran mereka terhadap keterangan-keterangan Allah dan mereka membunuh nabi-nabi tanpa (alasan) yang benar dan mengatakan: \"Hati kami tertutup\". Bahkan, sebenarnya Allah telah mengunci mati hati mereka karena kekafirannya, karena itu mereka tidak beriman kecuali sebahagian kecil dari mereka.",
      "ar": "فَبِمَا نَقۡضِهِم مِّیثَـٰقَهُمۡ وَكُفۡرِهِم بِـَٔایَـٰتِ ٱللَّهِ وَقَتۡلِهِمُ ٱلۡأَنۢبِیَاۤءَ بِغَیۡرِ حَقࣲّ وَقَوۡلِهِمۡ قُلُوبُنَا غُلۡفُۢۚ بَلۡ طَبَعَ ٱللَّهُ عَلَیۡهَا بِكُفۡرِهِمۡ فَلَا یُؤۡمِنُونَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 649,
    "surahId": 4,
    "ayahNumber": 156,
    "arabicText": "وَبِكُفۡرِهِمۡ وَقَوۡلِهِمۡ عَلَىٰ مَرۡیَمَ بُهۡتَـٰنًا عَظِیمࣰا\n",
    "translations": {
      "en": "and for their refusal to acknowledge the truth, and the awesome calumny which they utter against Mary,",
      "ms": "Demikian juga (Kami laknatkan mereka) dangan sebab kekufuran mereka dan tuduhan mereka terhadap Maryam (dengan tuduhan yang amat dustanya.",
      "id": "Dan karena kekafiran mereka (terhadap Isa) dan tuduhan mereka terhadap Maryam dengan kedustaan besar (zina),",
      "ar": "وَبِكُفۡرِهِمۡ وَقَوۡلِهِمۡ عَلَىٰ مَرۡیَمَ بُهۡتَـٰنًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 650,
    "surahId": 4,
    "ayahNumber": 157,
    "arabicText": "وَقَوۡلِهِمۡ إِنَّا قَتَلۡنَا ٱلۡمَسِیحَ عِیسَى ٱبۡنَ مَرۡیَمَ رَسُولَ ٱللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَـٰكِن شُبِّهَ لَهُمۡۚ وَإِنَّ ٱلَّذِینَ ٱخۡتَلَفُوا۟ فِیهِ لَفِی شَكࣲّ مِّنۡهُۚ مَا لَهُم بِهِۦ مِنۡ عِلۡمٍ إِلَّا ٱتِّبَاعَ ٱلظَّنِّۚ وَمَا قَتَلُوهُ یَقِینَۢا\n",
    "translations": {
      "en": "and their boast, \"Behold, we have slain the Christ Jesus, son of Mary, [who claimed to be] an apostle of God!\" However, they did not slay him, and neither did they crucify him, but it only seemed to them [as if it had been] so; and, verily, those who hold conflict­ing views thereon are indeed confused, having no [real] knowledge thereof, and following mere con­jecture. For, of a certainty, they did not slay him:",
      "ms": "Dan juga (disebabkan) dakwaan mereka dengan mengatakan: \"Sesungguhnya kami telah membunuh Al-Masih Isa Ibni Maryam, Rasul Allah\". Padahal mereka tidak membunuhnya dan tidak memalangnya (di kayu palang - salib), tetapi diserupakan bagi mereka (orang yang mereka bunuh itu seperti Nabi Isa). Dan Sesungguhnya orang-orang yang telah berselisih faham, mengenai Nabi Isa, sebenarnya mereka berada dalam keadaan syak (ragu-ragu) tentang menentukan (pembunuhannya). Tiada sesuatu pengetahuan pun bagi mereka mengenainya selain daripada mengikut sangkaan semata-mata; dan mereka tidak membunuhnya dengan yakin.",
      "id": "dan karena ucapan mereka: \"Sesungguhnya kami telah membunuh Al Masih, Isa putra Maryam, Rasul Allah\", padahal mereka tidak membunuhnya dan tidak (pula) menyalibnya, tetapi (yang mereka bunuh ialah) orang yang diserupakan dengan Isa bagi mereka. Sesungguhnya orang-orang yang berselisih paham tentang (pembunuhan) Isa, benar-benar dalam keragu-raguan tentang yang dibunuh itu. Mereka tidak mempunyai keyakinan tentang siapa yang dibunuh itu, kecuali mengikuti persangkaan belaka, mereka tidak (pula) yakin bahwa yang mereka bunuh itu adalah Isa.",
      "ar": "وَقَوۡلِهِمۡ إِنَّا قَتَلۡنَا ٱلۡمَسِیحَ عِیسَى ٱبۡنَ مَرۡیَمَ رَسُولَ ٱللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَـٰكِن شُبِّهَ لَهُمۡۚ وَإِنَّ ٱلَّذِینَ ٱخۡتَلَفُوا۟ فِیهِ لَفِی شَكࣲّ مِّنۡهُۚ مَا لَهُم بِهِۦ مِنۡ عِلۡمٍ إِلَّا ٱتِّبَاعَ ٱلظَّنِّۚ وَمَا قَتَلُوهُ یَقِینَۢا\n"
    }
  },
  {
    "id": 651,
    "surahId": 4,
    "ayahNumber": 158,
    "arabicText": "بَل رَّفَعَهُ ٱللَّهُ إِلَیۡهِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n",
    "translations": {
      "en": "nay, God exalted him unto Himself - and God is indeed almighty, wise.",
      "ms": "Bahkan Allah telah mengangkat Nabi Isa kepadaNya; dan adalah Allah Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Tetapi (yang sebenarnya), Allah telah mengangkat Isa kepada-Nya. Dan adalah Allah Maha Perkasa lagi Maha Bijaksana.",
      "ar": "بَل رَّفَعَهُ ٱللَّهُ إِلَیۡهِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 652,
    "surahId": 4,
    "ayahNumber": 159,
    "arabicText": "وَإِن مِّنۡ أَهۡلِ ٱلۡكِتَـٰبِ إِلَّا لَیُؤۡمِنَنَّ بِهِۦ قَبۡلَ مَوۡتِهِۦۖ وَیَوۡمَ ٱلۡقِیَـٰمَةِ یَكُونُ عَلَیۡهِمۡ شَهِیدࣰا\n",
    "translations": {
      "en": "Yet there is not one of the followers of earlier revelation who does not, at the moment of his death, grasp the truth about Jesus; and on the Day of Resurrection he [himself] shall bear witness to the truth against them.",
      "ms": "Dan tidak ada seorang pun dari kalangan ahli Kitab melainkan ia akan beriman kepada Nabi Isa sebelum matinya dan pada hari kiamat kelak Nabi Isa akan menjadi saksi terhadap mereka.",
      "id": "Tidak ada seorangpun dari Ahli Kitab, kecuali akan beriman kepadanya (Isa) sebelum kematiannya. Dan di hari kiamat nanti Isa itu akan menjadi saksi terhadap mereka.",
      "ar": "وَإِن مِّنۡ أَهۡلِ ٱلۡكِتَـٰبِ إِلَّا لَیُؤۡمِنَنَّ بِهِۦ قَبۡلَ مَوۡتِهِۦۖ وَیَوۡمَ ٱلۡقِیَـٰمَةِ یَكُونُ عَلَیۡهِمۡ شَهِیدࣰا\n"
    }
  },
  {
    "id": 653,
    "surahId": 4,
    "ayahNumber": 160,
    "arabicText": "فَبِظُلۡمࣲ مِّنَ ٱلَّذِینَ هَادُوا۟ حَرَّمۡنَا عَلَیۡهِمۡ طَیِّبَـٰتٍ أُحِلَّتۡ لَهُمۡ وَبِصَدِّهِمۡ عَن سَبِیلِ ٱللَّهِ كَثِیرࣰا\n",
    "translations": {
      "en": "So, then, for the wickedness committed by those who followed the Jewish faith did We deny unto them certain of the good things of life which [aforetime] had been allowed to them; and [We did this] for their having so often turned away from the path of God,",
      "ms": "Maka disebabkan kezaliman yang amat besar dari perbuatan orang-orang Yahudi, Kami haramkan atas mereka makanan yang baik-baik yang pernah dihalalkan bagi mereka, dan disebabkan mereka banyak menghalang manusia dari jalan Allah.",
      "id": "Maka disebabkan kezaliman orang-orang Yahudi, kami haramkan atas (memakan makanan) yang baik-baik (yang dahulunya) dihalalkan bagi mereka, dan karena mereka banyak menghalangi (manusia) dari jalan Allah,",
      "ar": "فَبِظُلۡمࣲ مِّنَ ٱلَّذِینَ هَادُوا۟ حَرَّمۡنَا عَلَیۡهِمۡ طَیِّبَـٰتٍ أُحِلَّتۡ لَهُمۡ وَبِصَدِّهِمۡ عَن سَبِیلِ ٱللَّهِ كَثِیرࣰا\n"
    }
  },
  {
    "id": 654,
    "surahId": 4,
    "ayahNumber": 161,
    "arabicText": "وَأَخۡذِهِمُ ٱلرِّبَوٰا۟ وَقَدۡ نُهُوا۟ عَنۡهُ وَأَكۡلِهِمۡ أَمۡوَ ٰ⁠لَ ٱلنَّاسِ بِٱلۡبَـٰطِلِۚ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ مِنۡهُمۡ عَذَابًا أَلِیمࣰا\n",
    "translations": {
      "en": "and [for] their taking usury although it had been forbidden to them, and their wrongful devouring of other people's possessions. And for those from among them who [continue to] deny the truth We have readied grievous suffering.",
      "ms": "Dan juga (disebabkan) mereka mengambil riba padahal mereka telah dilarang melakukannya, dan (disebabkan) mereka memakan harta orang dengan jalan yang salah (tipu, judi dan sebagainya). Dan (ingatlah) Kami telah menyediakan bagi orang-orang yang kafir di antara mereka, azab seksa yang tidak terperi sakitnya.",
      "id": "dan disebabkan mereka memakan riba, padahal sesungguhnya mereka telah dilarang daripadanya, dan karena mereka memakan harta benda orang dengan jalan yang batil. Kami telah menyediakan untuk orang-orang yang kafir di antara mereka itu siksa yang pedih.",
      "ar": "وَأَخۡذِهِمُ ٱلرِّبَوٰا۟ وَقَدۡ نُهُوا۟ عَنۡهُ وَأَكۡلِهِمۡ أَمۡوَ ٰ⁠لَ ٱلنَّاسِ بِٱلۡبَـٰطِلِۚ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ مِنۡهُمۡ عَذَابًا أَلِیمࣰا\n"
    }
  },
  {
    "id": 655,
    "surahId": 4,
    "ayahNumber": 162,
    "arabicText": "لَّـٰكِنِ ٱلرَّ ٰ⁠سِخُونَ فِی ٱلۡعِلۡمِ مِنۡهُمۡ وَٱلۡمُؤۡمِنُونَ یُؤۡمِنُونَ بِمَاۤ أُنزِلَ إِلَیۡكَ وَمَاۤ أُنزِلَ مِن قَبۡلِكَۚ وَٱلۡمُقِیمِینَ ٱلصَّلَوٰةَۚ وَٱلۡمُؤۡتُونَ ٱلزَّكَوٰةَ وَٱلۡمُؤۡمِنُونَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ أُو۟لَـٰۤىِٕكَ سَنُؤۡتِیهِمۡ أَجۡرًا عَظِیمًا\n",
    "translations": {
      "en": "But as for those from among them who are deeply rooted in knowledge, and the believers who believe in that which has been bestowed upon thee from on high as well as that which was bestowed from on high before thee, and those who are [es­pecially] constant in prayer, and spend in charity, and all who believe in God and the Last Day - these it is unto whom We shall grant a mighty reward.",
      "ms": "Tetapi orang-orang yang teguh serta mendalam ilmu pengetahuannya di antara mereka dan orang-orang yang beriman, sekaliannya beriman dengan apa yang telah diturunkan kepadamu (Al-Quran), dan kepada apa yang telah diturunkan dahulu daripadamu, - khasnya orang-orang yang mendirikan sembahyang, dan orang-orang yang menunaikan zakat, serta yang beriman kepada Allah dan hari akhirat; mereka itulah yang Kami akan berikan kepadanya pahala (balasan) yang amat besar.",
      "id": "Tetapi orang-orang yang mendalam ilmunya di antara mereka dan orang-orang mukmin, mereka beriman kepada apa yang telah diturunkan kepadamu (Al Quran), dan apa yang telah diturunkan sebelummu dan orang-orang yang mendirikan shalat, menunaikan zakat, dan yang beriman kepada Allah dan hari kemudian. Orang-orang itulah yang akan Kami berikan kepada mereka pahala yang besar.",
      "ar": "لَّـٰكِنِ ٱلرَّ ٰ⁠سِخُونَ فِی ٱلۡعِلۡمِ مِنۡهُمۡ وَٱلۡمُؤۡمِنُونَ یُؤۡمِنُونَ بِمَاۤ أُنزِلَ إِلَیۡكَ وَمَاۤ أُنزِلَ مِن قَبۡلِكَۚ وَٱلۡمُقِیمِینَ ٱلصَّلَوٰةَۚ وَٱلۡمُؤۡتُونَ ٱلزَّكَوٰةَ وَٱلۡمُؤۡمِنُونَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ أُو۟لَـٰۤىِٕكَ سَنُؤۡتِیهِمۡ أَجۡرًا عَظِیمًا\n"
    }
  },
  {
    "id": 656,
    "surahId": 4,
    "ayahNumber": 163,
    "arabicText": "۞ إِنَّاۤ أَوۡحَیۡنَاۤ إِلَیۡكَ كَمَاۤ أَوۡحَیۡنَاۤ إِلَىٰ نُوحࣲ وَٱلنَّبِیِّـۧنَ مِنۢ بَعۡدِهِۦۚ وَأَوۡحَیۡنَاۤ إِلَىٰۤ إِبۡرَ ٰ⁠هِیمَ وَإِسۡمَـٰعِیلَ وَإِسۡحَـٰقَ وَیَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَعِیسَىٰ وَأَیُّوبَ وَیُونُسَ وَهَـٰرُونَ وَسُلَیۡمَـٰنَۚ وَءَاتَیۡنَا دَاوُۥدَ زَبُورࣰا\n",
    "translations": {
      "en": "BEHOLD, We have inspired thee [O Prophet] just as We inspired Noah and all the prophets after him - as We inspired Abraham, and Ishmael, and Isaac, and Jacob, and their descendants, including Jesus and Job, and Jonah, and Aaron, and Solomon; and as We vouchsafed unto David a book of divine wisdom;",
      "ms": "Sungguhnya Kami telah memberikan wahyu kepadamu (wahai Muhammad), sebagaimana Kami telah memberikan wahyu kepada Nabi Nuh, dan Nabi-nabi yang diutus kemudian daripadanya; dan Kami juga telah memberikan wahyu kepada Nabi Ibrahim, dan Nabi Ismail, dan Nabi Ishak, dan Nabi Yaakub, serta Nabi-nabi keturunannya, dan Nabi Isa, dan Nabi Ayub, dan Nabi Yunus, dan Nabi Harun, dan Nabi Sulaiman; dan juga Kami telah memberikan kepada Nabi Daud: Kitab Zabur.",
      "id": "Sesungguhnya Kami telah memberikan wahyu kepadamu sebagaimana Kami telah memberikan wahyu kepada Nuh dan nabi-nabi yang kemudiannya, dan Kami telah memberikan wahyu (pula) kepada Ibrahim, Isma'il, Ishak, Ya'qub dan anak cucunya, Isa, Ayyub, Yunus, Harun dan Sulaiman. Dan Kami berikan Zabur kepada Daud.",
      "ar": "۞ إِنَّاۤ أَوۡحَیۡنَاۤ إِلَیۡكَ كَمَاۤ أَوۡحَیۡنَاۤ إِلَىٰ نُوحࣲ وَٱلنَّبِیِّـۧنَ مِنۢ بَعۡدِهِۦۚ وَأَوۡحَیۡنَاۤ إِلَىٰۤ إِبۡرَ ٰ⁠هِیمَ وَإِسۡمَـٰعِیلَ وَإِسۡحَـٰقَ وَیَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَعِیسَىٰ وَأَیُّوبَ وَیُونُسَ وَهَـٰرُونَ وَسُلَیۡمَـٰنَۚ وَءَاتَیۡنَا دَاوُۥدَ زَبُورࣰا\n"
    }
  },
  {
    "id": 657,
    "surahId": 4,
    "ayahNumber": 164,
    "arabicText": "وَرُسُلࣰا قَدۡ قَصَصۡنَـٰهُمۡ عَلَیۡكَ مِن قَبۡلُ وَرُسُلࣰا لَّمۡ نَقۡصُصۡهُمۡ عَلَیۡكَۚ وَكَلَّمَ ٱللَّهُ مُوسَىٰ تَكۡلِیمࣰا\n",
    "translations": {
      "en": "and as [We inspired other] apostles whom We have mentioned to thee ere this, as well as apostles whom We have not mentioned to thee; and as God spoke His word unto Moses:",
      "ms": "Dan (Kami telah mengutuskan) beberapa orang Rasul yang telah Kami ceritakan kepadamu dahulu sebelum ini, dan Rasul-rasul yang tidak Kami ceritakan hal mereka kepadamu. Dan Allah telah berkata-kata kepada Nabi Musa dengan kata-kata (secara langsung, tidak ada perantaraan).",
      "id": "Dan (Kami telah mengutus) rasul-rasul yang sungguh telah Kami kisahkan tentang mereka kepadamu dahulu, dan rasul-rasul yang tidak Kami kisahkan tentang mereka kepadamu. Dan Allah telah berbicara kepada Musa dengan langsung.",
      "ar": "وَرُسُلࣰا قَدۡ قَصَصۡنَـٰهُمۡ عَلَیۡكَ مِن قَبۡلُ وَرُسُلࣰا لَّمۡ نَقۡصُصۡهُمۡ عَلَیۡكَۚ وَكَلَّمَ ٱللَّهُ مُوسَىٰ تَكۡلِیمࣰا\n"
    }
  },
  {
    "id": 658,
    "surahId": 4,
    "ayahNumber": 165,
    "arabicText": "رُّسُلࣰا مُّبَشِّرِینَ وَمُنذِرِینَ لِئَلَّا یَكُونَ لِلنَّاسِ عَلَى ٱللَّهِ حُجَّةُۢ بَعۡدَ ٱلرُّسُلِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n",
    "translations": {
      "en": "[We sent all these] apostles as heralds of glad tidings and as warners, so that men might have no excuse before God after [the coming of] these apostles: and God is indeed al­mighty, wise.",
      "ms": "Rasul-rasul (yang Kami telah utuskan itu semuanya) pembawa khabar gembira (kepada orang-orang yang beriman), dan pembawa amaran (kepada orang-orang yang kafir dan yang berbuat maksiat), supaya tidak ada bagi manusia sesuatu hujah (atau sebarang alasan untuk berdalih pada hari kiamat kelak) terhadap Allah sesudah mengutuskan Rasul-rasul itu. Dan (ingatlah) Allah Maha Kuasa, lagi Maha Bijaksana.",
      "id": "(Mereka Kami utus) selaku rasul-rasul pembawa berita gembira dan pemberi peringatan agar supaya tidak ada alasan bagi manusia membantah Allah sesudah diutusnya rasul-rasul itu. Dan adalah Allah Maha Perkasa lagi Maha Bijaksana.",
      "ar": "رُّسُلࣰا مُّبَشِّرِینَ وَمُنذِرِینَ لِئَلَّا یَكُونَ لِلنَّاسِ عَلَى ٱللَّهِ حُجَّةُۢ بَعۡدَ ٱلرُّسُلِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 659,
    "surahId": 4,
    "ayahNumber": 166,
    "arabicText": "لَّـٰكِنِ ٱللَّهُ یَشۡهَدُ بِمَاۤ أَنزَلَ إِلَیۡكَۖ أَنزَلَهُۥ بِعِلۡمِهِۦۖ وَٱلۡمَلَـٰۤىِٕكَةُ یَشۡهَدُونَۚ وَكَفَىٰ بِٱللَّهِ شَهِیدًا\n",
    "translations": {
      "en": "However it be, God [Himself] bears witness to the truth of what He has bestowed from on high upon thee: out of His own wisdom has He bestowed it from on high, with the angels bearing witness thereto - although none can bear witness as God does.",
      "ms": "(Orang-orang kafir itu tidak mahu mengakui apa yang telah diturunkan Allah kepadamu wahai Muhammad), tetapi Allah sentiasa menjadi saksi akan kebenaran Al-Quran yang telah diturunkanNya kepadamu. Allah menurunkannya dengan ilmuNya, dan malaikat juga turut menjadi saksi. Dan cukuplah Allah menjadi saksi (akan kebenaran Al-Quran ini).",
      "id": "(Mereka tidak mau mengakui yang diturunkan kepadamu itu), tetapi Allah mengakui Al Quran yang diturunkan-Nya kepadamu. Allah menurunkannya dengan ilmu-Nya; dan malaikat-malaikat pun menjadi saksi (pula). Cukuplah Allah yang mengakuinya.",
      "ar": "لَّـٰكِنِ ٱللَّهُ یَشۡهَدُ بِمَاۤ أَنزَلَ إِلَیۡكَۖ أَنزَلَهُۥ بِعِلۡمِهِۦۖ وَٱلۡمَلَـٰۤىِٕكَةُ یَشۡهَدُونَۚ وَكَفَىٰ بِٱللَّهِ شَهِیدًا\n"
    }
  },
  {
    "id": 660,
    "surahId": 4,
    "ayahNumber": 167,
    "arabicText": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ قَدۡ ضَلُّوا۟ ضَلَـٰلَۢا بَعِیدًا\n",
    "translations": {
      "en": "Behold, those who are bent on denying the truth and on turning others away from the path of God have indeed gone far astray.",
      "ms": "Sesungguhnya orang-orang yang kafir serta menghalang orang-orang lain dari jalan Allah (ugama Islam), sebenarnya mereka telah sesat dengan kesesatan yang amat jauh.",
      "id": "Sesungguhnya orang-orang yang kafir dan menghalang-halangi (manusia) dari jalan Allah, benar-benar telah sesat sejauh-jauhnya.",
      "ar": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ قَدۡ ضَلُّوا۟ ضَلَـٰلَۢا بَعِیدًا\n"
    }
  },
  {
    "id": 661,
    "surahId": 4,
    "ayahNumber": 168,
    "arabicText": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَظَلَمُوا۟ لَمۡ یَكُنِ ٱللَّهُ لِیَغۡفِرَ لَهُمۡ وَلَا لِیَهۡدِیَهُمۡ طَرِیقًا\n",
    "translations": {
      "en": "Behold, those who are bent on denying the truth and on evildoing - God will indeed not forgive them, nor will He guide them onto any road",
      "ms": "Sesungguhnya orang-orang yang kafir serta berlaku zalim, Allah tidak sekali-kali akan mengampunkan mereka dan tidak akan menunjukkan jalan kepada mereka:",
      "id": "Sesungguhnya orang-orang yang kafir dan melakukan kezaliman, Allah sekali-kali tidak akan mengampuni (dosa) mereka dan tidak (pula) akan menunjukkan jalan kepada mereka,",
      "ar": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَظَلَمُوا۟ لَمۡ یَكُنِ ٱللَّهُ لِیَغۡفِرَ لَهُمۡ وَلَا لِیَهۡدِیَهُمۡ طَرِیقًا\n"
    }
  },
  {
    "id": 662,
    "surahId": 4,
    "ayahNumber": 169,
    "arabicText": "إِلَّا طَرِیقَ جَهَنَّمَ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۚ وَكَانَ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرࣰا\n",
    "translations": {
      "en": "but the road that leads to hell, therein to abide beyond the count of time: and this is indeed easy for God.",
      "ms": "Selain dari jalan neraka jahanam, yang mereka akan kekal di dalamnya selama-lamanya; dan balasan yang demikian itu adalah mudah bagi Allah.",
      "id": "kecuali jalan ke neraka Jahannam; mereka kekal di dalamnya selama-lamanya. Dan yang demikian itu adalah mudah bagi Allah.",
      "ar": "إِلَّا طَرِیقَ جَهَنَّمَ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۚ وَكَانَ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرࣰا\n"
    }
  },
  {
    "id": 663,
    "surahId": 4,
    "ayahNumber": 170,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَكُمُ ٱلرَّسُولُ بِٱلۡحَقِّ مِن رَّبِّكُمۡ فَـَٔامِنُوا۟ خَیۡرࣰا لَّكُمۡۚ وَإِن تَكۡفُرُوا۟ فَإِنَّ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "O mankind! The Apostle has now come unto you with the truth from your Sustainer: believe, then, for your own good! And if you deny the truth - behold, unto God belongs all that is in the heavens and all that is on earth, and God is indeed all-knowing, wise!",
      "ms": "Wahai sekalian umat manusia! Sesungguhnya telah datang kepada kamu Rasul Allah (Muhammad s.a.w) dengan membawa kebenaran dari Tuhan kamu, maka berimanlah kamu (kerana yang demikian itu) amatlah baiknya bagi kamu. Dan jika kamu kufur ingkar (maka kekufuran kamu itu tidak mendatangkan kerugian apa-apa kepada Allah), kerana sesungguhnya bagi Allah jualah segala yang ada di langit dan di bumi; dan Allah sentiasa Mengetahui lagi Maha Bijaksana.",
      "id": "Wahai manusia, sesungguhnya telah datang Rasul (Muhammad) itu kepadamu dengan (membawa) kebenaran dari Tuhanmu, maka berimanlah kamu, itulah yang lebih baik bagimu. Dan jika kamu kafir, (maka kekafiran itu tidak merugikan Allah sedikitpun) karena sesungguhnya apa yang di langit dan di bumi itu adalah kepunyaan Allah. Dan adalah Allah Maha Mengetahui lagi Maha Bijaksana.",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَكُمُ ٱلرَّسُولُ بِٱلۡحَقِّ مِن رَّبِّكُمۡ فَـَٔامِنُوا۟ خَیۡرࣰا لَّكُمۡۚ وَإِن تَكۡفُرُوا۟ فَإِنَّ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 664,
    "surahId": 4,
    "ayahNumber": 171,
    "arabicText": "یَـٰۤأَهۡلَ ٱلۡكِتَـٰبِ لَا تَغۡلُوا۟ فِی دِینِكُمۡ وَلَا تَقُولُوا۟ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِیحُ عِیسَى ٱبۡنُ مَرۡیَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥۤ أَلۡقَىٰهَاۤ إِلَىٰ مَرۡیَمَ وَرُوحࣱ مِّنۡهُۖ فَـَٔامِنُوا۟ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُوا۟ ثَلَـٰثَةٌۚ ٱنتَهُوا۟ خَیۡرࣰا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۖ سُبۡحَـٰنَهُۥۤ أَن یَكُونَ لَهُۥ وَلَدࣱۘ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِیلࣰا\n",
    "translations": {
      "en": "O FOLLOWERS of the Gospel! Do not overstep the bounds [of truth] in your religious beliefs, and do not say of God anything but the truth. The Christ Jesus, son of Mary, was but God's Apostle - [the fulfilment of] His promise which He had conveyed unto Mary - and a soul created by Him. Believe, then, in God and His apostles, and do not say, \"[God is] a trinity\". Desist [from this assertion] for your own good. God is but One God; utterly remote is He, in His glory, from having a son: unto Him belongs all that is in the heavens and all that is on earth; and none is as worthy of trust as God.",
      "ms": "Wahai Ahli kitab (Yahudi dan Nasrani)! Janganlah kamu melampaui batas dalam perkara ugama kamu, dan janganlah kamu mengatakan sesuatu terhadap Allah melainkan yang benar; sesungguhnya Al Masih Isa ibni Maryam itu hanya seorang pesuruh Allah dan Kalimah Allah yang telah disampaikanNya kepada Maryam, dan (ia juga tiupan) roh daripadaNya. Maka berimanlah kamu kepada Allah dan Rasul-rasulNya, dan janganlah kamu mengatakan: \"(Tuhan itu) tiga\". Berhentilah (daripada mengatakan yang demikian), supaya menjadi kebaikan bagi kamu. Hanyasanya Allah ialah Tuhan Yang Maha Esa, Maha Suci Allah daripada mempunyai anak. Bagi Allah jualah segala yang ada di langit dan yang ada di bumi. Dan cukuplah menjadi Pengawal (Yang Mentadbirkan sekalian makhlukNya).",
      "id": "Wahai Ahli Kitab, janganlah kamu melampaui batas dalam agamamu, dan janganlah kamu mengatakan terhadap Allah kecuali yang benar. Sesungguhnya Al Masih, Isa putera Maryam itu, adalah utusan Allah dan (yang diciptakan dengan) kalimat-Nya yang disampaikan-Nya kepada Maryam, dan (dengan tiupan) roh dari-Nya. Maka berimanlah kamu kepada Allah dan rasul-rasul-Nya dan janganlah kamu mengatakan: \"(Tuhan itu) tiga\", berhentilah (dari ucapan itu). (Itu) lebih baik bagimu. Sesungguhnya Allah Tuhan Yang Maha Esa, Maha Suci Allah dari mempunyai anak, segala yang di langit dan di bumi adalah kepunyaan-Nya. Cukuplah Allah menjadi Pemelihara.",
      "ar": "یَـٰۤأَهۡلَ ٱلۡكِتَـٰبِ لَا تَغۡلُوا۟ فِی دِینِكُمۡ وَلَا تَقُولُوا۟ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِیحُ عِیسَى ٱبۡنُ مَرۡیَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥۤ أَلۡقَىٰهَاۤ إِلَىٰ مَرۡیَمَ وَرُوحࣱ مِّنۡهُۖ فَـَٔامِنُوا۟ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُوا۟ ثَلَـٰثَةٌۚ ٱنتَهُوا۟ خَیۡرࣰا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۖ سُبۡحَـٰنَهُۥۤ أَن یَكُونَ لَهُۥ وَلَدࣱۘ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِیلࣰا\n"
    }
  },
  {
    "id": 665,
    "surahId": 4,
    "ayahNumber": 172,
    "arabicText": "لَّن یَسۡتَنكِفَ ٱلۡمَسِیحُ أَن یَكُونَ عَبۡدࣰا لِّلَّهِ وَلَا ٱلۡمَلَـٰۤىِٕكَةُ ٱلۡمُقَرَّبُونَۚ وَمَن یَسۡتَنكِفۡ عَنۡ عِبَادَتِهِۦ وَیَسۡتَكۡبِرۡ فَسَیَحۡشُرُهُمۡ إِلَیۡهِ جَمِیعࣰا\n",
    "translations": {
      "en": "Never did the Christ feel too proud to be God's servant, nor do the angels who are near unto Him. And those who feel too proud to serve Him and glory in their arrogance [should know that on Judgment Day] He will gather them all unto Himself:",
      "ms": "(Nabi Isa) Al-Masih tidak sekali-kali enggan dan angkuh daripada menjadi hamba bagi Allah, demikian juga (sikap) malaikat yang sentiasa berdamping (dengan Allah). Dan sesiapa yang enggan dan angkuh daripada beribadat (menyembah dan memperhambakan diri) kepada Allah, serta ia berlaku sombong takbur, maka Allah akan menghimpunkan mereka semua kepadaNya.",
      "id": "Al Masih sekali-kali tidak enggan menjadi hamba bagi Allah, dan tidak (pula enggan) malaikat-malaikat yang terdekat (kepada Allah). Barangsiapa yang enggan dari menyembah-Nya, dan menyombongkan diri, nanti Allah akan mengumpulkan mereka semua kepada-Nya.",
      "ar": "لَّن یَسۡتَنكِفَ ٱلۡمَسِیحُ أَن یَكُونَ عَبۡدࣰا لِّلَّهِ وَلَا ٱلۡمَلَـٰۤىِٕكَةُ ٱلۡمُقَرَّبُونَۚ وَمَن یَسۡتَنكِفۡ عَنۡ عِبَادَتِهِۦ وَیَسۡتَكۡبِرۡ فَسَیَحۡشُرُهُمۡ إِلَیۡهِ جَمِیعࣰا\n"
    }
  },
  {
    "id": 666,
    "surahId": 4,
    "ayahNumber": 173,
    "arabicText": "فَأَمَّا ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فَیُوَفِّیهِمۡ أُجُورَهُمۡ وَیَزِیدُهُم مِّن فَضۡلِهِۦۖ وَأَمَّا ٱلَّذِینَ ٱسۡتَنكَفُوا۟ وَٱسۡتَكۡبَرُوا۟ فَیُعَذِّبُهُمۡ عَذَابًا أَلِیمࣰا وَلَا یَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِیࣰّا وَلَا نَصِیرࣰا\n",
    "translations": {
      "en": "whereupon unto those who attained to faith and did good deeds He will grant their just rewards, and give them yet more out of His bounty; whereas those who felt too proud and gloried in their arrogance He will chastise with grievous suffering: and they shall find none to protect them from God, and none to bring them succour.",
      "ms": "Sesudah itu, orang-orang yang beriman beramal soleh, Allah akan menyempurnakan bagi mereka pahala (balasan) mereka, dan Ia akan menambahkan lagi limpah kurniaNya kepada mereka. Sebaliknya orang-orang yang enggan beribadat kepada Allah dan berlaku sombong takbur, maka Allah akan menyeksa mereka dengan azab seksa yang tidak terperi sakitnya, dan mereka pula tidak akan memperoleh sesiapa pun - yang lain dari Allah - yang akan menjadi pelindung atau penolong bagi mereka.",
      "id": "Adapun orang-orang yang beriman dan berbuat amal saleh, maka Allah akan menyempurnakan pahala mereka dan menambah untuk mereka sebagian dari karunia-Nya. Adapun orang-orang yang enggan dan menyombongkan diri, maka Allah akan menyiksa mereka dengan siksaan yang pedih, dan mereka tidak akan memperoleh bagi diri mereka, pelindung dan penolong selain dari pada Allah.",
      "ar": "فَأَمَّا ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فَیُوَفِّیهِمۡ أُجُورَهُمۡ وَیَزِیدُهُم مِّن فَضۡلِهِۦۖ وَأَمَّا ٱلَّذِینَ ٱسۡتَنكَفُوا۟ وَٱسۡتَكۡبَرُوا۟ فَیُعَذِّبُهُمۡ عَذَابًا أَلِیمࣰا وَلَا یَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِیࣰّا وَلَا نَصِیرࣰا\n"
    }
  },
  {
    "id": 667,
    "surahId": 4,
    "ayahNumber": 174,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَكُم بُرۡهَـٰنࣱ مِّن رَّبِّكُمۡ وَأَنزَلۡنَاۤ إِلَیۡكُمۡ نُورࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "O MANKIND! A manifestation of the truth has now come unto you from your Sustainer, and We have sent down unto you a clear light.",
      "ms": "Wahai sekalian umat manusia! Sesungguhnya telah datang kepada kamu: Bukti dari Tuhan kamu, dan Kami pula telah menurunkan kepada kamu (Al-Quran sebagai) Nur (cahaya) yang menerangi (segala apa jua yang membawa kejayaan di dunia ini dan kebahagiaan yang kekal di akhirat kelak).",
      "id": "Hai manusia, sesungguhnya telah datang kepadamu bukti kebenaran dari Tuhanmu. (Muhammad dengan mukjizatnya) dan telah Kami turunkan kepadamu cahaya yang terang benderang (Al Quran).",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَكُم بُرۡهَـٰنࣱ مِّن رَّبِّكُمۡ وَأَنزَلۡنَاۤ إِلَیۡكُمۡ نُورࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 668,
    "surahId": 4,
    "ayahNumber": 175,
    "arabicText": "فَأَمَّا ٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَٱعۡتَصَمُوا۟ بِهِۦ فَسَیُدۡخِلُهُمۡ فِی رَحۡمَةࣲ مِّنۡهُ وَفَضۡلࣲ وَیَهۡدِیهِمۡ إِلَیۡهِ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n",
    "translations": {
      "en": "And as for those who have attained to faith in God and hold fast unto Him - He will enfold them within His grace and bounty, and guide them unto Himself by a straight way.",
      "ms": "Oleh itu, orang-orang yang beriman kepada Allah dan berpegang teguh kepada (ajaran Al-Quran) ini, maka Allah akan memasukkan mereka ke dalam rahmatNya (yang khas iaitu Syurga) dan limpah kurniaNya (yang tidak terkira), dan Allah akan menunjukkan mereka ke jalan yang lurus (jalan ugama Islam), yang membawa kepadaNya.",
      "id": "Adapun orang-orang yang beriman kepada Allah dan berpegang teguh kepada (agama)-Nya niscaya Allah akan memasukkan mereka ke dalam rahmat yang besar dari-Nya (surga) dan limpahan karunia-Nya. Dan menunjuki mereka kepada jalan yang lurus (untuk sampai) kepada-Nya.",
      "ar": "فَأَمَّا ٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَٱعۡتَصَمُوا۟ بِهِۦ فَسَیُدۡخِلُهُمۡ فِی رَحۡمَةࣲ مِّنۡهُ وَفَضۡلࣲ وَیَهۡدِیهِمۡ إِلَیۡهِ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n"
    }
  },
  {
    "id": 669,
    "surahId": 4,
    "ayahNumber": 176,
    "arabicText": "یَسۡتَفۡتُونَكَ قُلِ ٱللَّهُ یُفۡتِیكُمۡ فِی ٱلۡكَلَـٰلَةِۚ إِنِ ٱمۡرُؤٌا۟ هَلَكَ لَیۡسَ لَهُۥ وَلَدࣱ وَلَهُۥۤ أُخۡتࣱ فَلَهَا نِصۡفُ مَا تَرَكَۚ وَهُوَ یَرِثُهَاۤ إِن لَّمۡ یَكُن لَّهَا وَلَدࣱۚ فَإِن كَانَتَا ٱثۡنَتَیۡنِ فَلَهُمَا ٱلثُّلُثَانِ مِمَّا تَرَكَۚ وَإِن كَانُوۤا۟ إِخۡوَةࣰ رِّجَالࣰا وَنِسَاۤءࣰ فَلِلذَّكَرِ مِثۡلُ حَظِّ ٱلۡأُنثَیَیۡنِۗ یُبَیِّنُ ٱللَّهُ لَكُمۡ أَن تَضِلُّوا۟ۗ وَٱللَّهُ بِكُلِّ شَیۡءٍ عَلِیمُۢ\n",
    "translations": {
      "en": "THEY WILL ASK thee to enlighten them. Say: \"God enlightens you [thus] about the laws concerning [inheritance from] those who leave no heir in the direct line: If a man dies childless and has a sister, she shall inherit one-half of what he has left, just as he shall inherit from her if she dies childless. But if there are two sisters, both [together] shall have two-thirds of what he has left; and if there are brothers and sisters, then the male shall have the equal of two females' share.\" God makes [all this] clear unto you, lest you go astray; and God knows everything.",
      "ms": "Mereka (orang-orang Islam umatmu) meminta fatwa kepadamu (Wahai Muhammad mengenai masalah Kalaalah). Katakanlah: \"Allah memberi fatwa kepada kamu di dalam perkara Kalaalah itu, iaitu jika seseorang mati yang tidak mempunyai anak dan ia mempunyai seorang saudara perempuan, maka bagi saudara perempuan itu satu perdua dari harta yang ditinggalkan oleh si mati; dan ia pula (saudara lelaki itu) mewarisi (semua harta) saudara perempuannya, jika saudara perempuannya tidak mempunyai anak. Kalau pula saudara perempuannya itu dua orang, maka keduanya mendapat dua pertiga dari harta yang di tinggalkan oleh si mati. Dan sekiranya mereka (saudara-saudaranya itu) ramai, lelaki dan perempuan, maka bahagian seorang lelaki menyamai bahagian dua orang perempuan\". Allah menerangkan (hukum ini) kepada kamu supaya kamu tidak sesat. Dan (ingatlah) Allah Maha Mengetahui akan tiap-tiap sesuatu.",
      "id": "Mereka meminta fatwa kepadamu (tentang kalalah). Katakanlah: \"Allah memberi fatwa kepadamu tentang kalalah (yaitu): jika seorang meninggal dunia, dan ia tidak mempunyai anak dan mempunyai saudara perempuan, maka bagi saudaranya yang perempuan itu seperdua dari harta yang ditinggalkannya, dan saudaranya yang laki-laki mempusakai (seluruh harta saudara perempuan), jika ia tidak mempunyai anak; tetapi jika saudara perempuan itu dua orang, maka bagi keduanya dua pertiga dari harta yang ditinggalkan oleh yang meninggal. Dan jika mereka (ahli waris itu terdiri dari) saudara-saudara laki dan perempuan, maka bahagian seorang saudara laki-laki sebanyak bahagian dua orang saudara perempuan. Allah menerangkan (hukum ini) kepadamu, supaya kamu tidak sesat. Dan Allah Maha Mengetahui segala sesuatu.",
      "ar": "یَسۡتَفۡتُونَكَ قُلِ ٱللَّهُ یُفۡتِیكُمۡ فِی ٱلۡكَلَـٰلَةِۚ إِنِ ٱمۡرُؤٌا۟ هَلَكَ لَیۡسَ لَهُۥ وَلَدࣱ وَلَهُۥۤ أُخۡتࣱ فَلَهَا نِصۡفُ مَا تَرَكَۚ وَهُوَ یَرِثُهَاۤ إِن لَّمۡ یَكُن لَّهَا وَلَدࣱۚ فَإِن كَانَتَا ٱثۡنَتَیۡنِ فَلَهُمَا ٱلثُّلُثَانِ مِمَّا تَرَكَۚ وَإِن كَانُوۤا۟ إِخۡوَةࣰ رِّجَالࣰا وَنِسَاۤءࣰ فَلِلذَّكَرِ مِثۡلُ حَظِّ ٱلۡأُنثَیَیۡنِۗ یُبَیِّنُ ٱللَّهُ لَكُمۡ أَن تَضِلُّوا۟ۗ وَٱللَّهُ بِكُلِّ شَیۡءٍ عَلِیمُۢ\n"
    }
  }
]