[
  {
    "id": 494,
    "surahId": 4,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ یَـٰۤأَیُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمُ ٱلَّذِی خَلَقَكُم مِّن نَّفۡسࣲ وَ ٰ⁠حِدَةࣲ وَخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالࣰا كَثِیرࣰا وَنِسَاۤءࣰۚ وَٱتَّقُوا۟ ٱللَّهَ ٱلَّذِی تَسَاۤءَلُونَ بِهِۦ وَٱلۡأَرۡحَامَۚ إِنَّ ٱللَّهَ كَانَ عَلَیۡكُمۡ رَقِیبࣰا\n",
    "translations": {
      "en": "O MANKIND! Be conscious of your Sustainer, who has created you out of one living entity, and out of it created its mate, and out of the two spread abroad a multitude of men and women. And remain conscious of God, in whose name you demand [your rights] from one another, and of these ties of kinship. Verily, God is ever watchful over you!",
      "ms": "",
      "id": "",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ یَـٰۤأَیُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمُ ٱلَّذِی خَلَقَكُم مِّن نَّفۡسࣲ وَ ٰ⁠حِدَةࣲ وَخَلَقَ مِنۡهَا زَوۡجَهَا وَبَثَّ مِنۡهُمَا رِجَالࣰا كَثِیرࣰا وَنِسَاۤءࣰۚ وَٱتَّقُوا۟ ٱللَّهَ ٱلَّذِی تَسَاۤءَلُونَ بِهِۦ وَٱلۡأَرۡحَامَۚ إِنَّ ٱللَّهَ كَانَ عَلَیۡكُمۡ رَقِیبࣰا\n"
    }
  },
  {
    "id": 495,
    "surahId": 4,
    "ayahNumber": 2,
    "arabicText": "وَءَاتُوا۟ ٱلۡیَتَـٰمَىٰۤ أَمۡوَ ٰ⁠لَهُمۡۖ وَلَا تَتَبَدَّلُوا۟ ٱلۡخَبِیثَ بِٱلطَّیِّبِۖ وَلَا تَأۡكُلُوۤا۟ أَمۡوَ ٰ⁠لَهُمۡ إِلَىٰۤ أَمۡوَ ٰ⁠لِكُمۡۚ إِنَّهُۥ كَانَ حُوبࣰا كَبِیرࣰا\n",
    "translations": {
      "en": "Hence, render unto the orphans their posses­sions, and do not substitute bad things [of your own] for the good things [that belong to them], and do not consume their possessions together with your own: this, verily, is a great crime.",
      "ms": "",
      "id": "",
      "ar": "وَءَاتُوا۟ ٱلۡیَتَـٰمَىٰۤ أَمۡوَ ٰ⁠لَهُمۡۖ وَلَا تَتَبَدَّلُوا۟ ٱلۡخَبِیثَ بِٱلطَّیِّبِۖ وَلَا تَأۡكُلُوۤا۟ أَمۡوَ ٰ⁠لَهُمۡ إِلَىٰۤ أَمۡوَ ٰ⁠لِكُمۡۚ إِنَّهُۥ كَانَ حُوبࣰا كَبِیرࣰا\n"
    }
  },
  {
    "id": 496,
    "surahId": 4,
    "ayahNumber": 3,
    "arabicText": "وَإِنۡ خِفۡتُمۡ أَلَّا تُقۡسِطُوا۟ فِی ٱلۡیَتَـٰمَىٰ فَٱنكِحُوا۟ مَا طَابَ لَكُم مِّنَ ٱلنِّسَاۤءِ مَثۡنَىٰ وَثُلَـٰثَ وَرُبَـٰعَۖ فَإِنۡ خِفۡتُمۡ أَلَّا تَعۡدِلُوا۟ فَوَ ٰ⁠حِدَةً أَوۡ مَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۚ ذَ ٰ⁠لِكَ أَدۡنَىٰۤ أَلَّا تَعُولُوا۟\n",
    "translations": {
      "en": "And if you have reason to fear that you might not act equitably towards orphans, then marry from among [other] women such as are lawful to you - [even] two, or three, or four: but if you have reason to fear that you might not be able to treat them with equal fairness, then [only] one - or [from among] those whom you rightfully possess. This will make it more likely that you will not deviate from the right course.",
      "ms": "",
      "id": "",
      "ar": "وَإِنۡ خِفۡتُمۡ أَلَّا تُقۡسِطُوا۟ فِی ٱلۡیَتَـٰمَىٰ فَٱنكِحُوا۟ مَا طَابَ لَكُم مِّنَ ٱلنِّسَاۤءِ مَثۡنَىٰ وَثُلَـٰثَ وَرُبَـٰعَۖ فَإِنۡ خِفۡتُمۡ أَلَّا تَعۡدِلُوا۟ فَوَ ٰ⁠حِدَةً أَوۡ مَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۚ ذَ ٰ⁠لِكَ أَدۡنَىٰۤ أَلَّا تَعُولُوا۟\n"
    }
  },
  {
    "id": 497,
    "surahId": 4,
    "ayahNumber": 4,
    "arabicText": "وَءَاتُوا۟ ٱلنِّسَاۤءَ صَدُقَـٰتِهِنَّ نِحۡلَةࣰۚ فَإِن طِبۡنَ لَكُمۡ عَن شَیۡءࣲ مِّنۡهُ نَفۡسࣰا فَكُلُوهُ هَنِیۤـࣰٔا مَّرِیۤـࣰٔا\n",
    "translations": {
      "en": "And give unto women their marriage portions in the spirit of a gift; but if they, of their own accord, give up unto you aught thereof, then enjoy it with pleasure and good cheer.",
      "ms": "",
      "id": "",
      "ar": "وَءَاتُوا۟ ٱلنِّسَاۤءَ صَدُقَـٰتِهِنَّ نِحۡلَةࣰۚ فَإِن طِبۡنَ لَكُمۡ عَن شَیۡءࣲ مِّنۡهُ نَفۡسࣰا فَكُلُوهُ هَنِیۤـࣰٔا مَّرِیۤـࣰٔا\n"
    }
  },
  {
    "id": 498,
    "surahId": 4,
    "ayahNumber": 5,
    "arabicText": "وَلَا تُؤۡتُوا۟ ٱلسُّفَهَاۤءَ أَمۡوَ ٰ⁠لَكُمُ ٱلَّتِی جَعَلَ ٱللَّهُ لَكُمۡ قِیَـٰمࣰا وَٱرۡزُقُوهُمۡ فِیهَا وَٱكۡسُوهُمۡ وَقُولُوا۟ لَهُمۡ قَوۡلࣰا مَّعۡرُوفࣰا\n",
    "translations": {
      "en": "And do not entrust to those who are weak of judgment the possessions which God has placed in your charge for [their] support; but let them have their sustenance therefrom, and clothe them, and speak unto them in a kindly way.",
      "ms": "",
      "id": "",
      "ar": "وَلَا تُؤۡتُوا۟ ٱلسُّفَهَاۤءَ أَمۡوَ ٰ⁠لَكُمُ ٱلَّتِی جَعَلَ ٱللَّهُ لَكُمۡ قِیَـٰمࣰا وَٱرۡزُقُوهُمۡ فِیهَا وَٱكۡسُوهُمۡ وَقُولُوا۟ لَهُمۡ قَوۡلࣰا مَّعۡرُوفࣰا\n"
    }
  },
  {
    "id": 499,
    "surahId": 4,
    "ayahNumber": 6,
    "arabicText": "وَٱبۡتَلُوا۟ ٱلۡیَتَـٰمَىٰ حَتَّىٰۤ إِذَا بَلَغُوا۟ ٱلنِّكَاحَ فَإِنۡ ءَانَسۡتُم مِّنۡهُمۡ رُشۡدࣰا فَٱدۡفَعُوۤا۟ إِلَیۡهِمۡ أَمۡوَ ٰ⁠لَهُمۡۖ وَلَا تَأۡكُلُوهَاۤ إِسۡرَافࣰا وَبِدَارًا أَن یَكۡبَرُوا۟ۚ وَمَن كَانَ غَنِیࣰّا فَلۡیَسۡتَعۡفِفۡۖ وَمَن كَانَ فَقِیرࣰا فَلۡیَأۡكُلۡ بِٱلۡمَعۡرُوفِۚ فَإِذَا دَفَعۡتُمۡ إِلَیۡهِمۡ أَمۡوَ ٰ⁠لَهُمۡ فَأَشۡهِدُوا۟ عَلَیۡهِمۡۚ وَكَفَىٰ بِٱللَّهِ حَسِیبࣰا\n",
    "translations": {
      "en": "And test the orphans [in your charge] until they reach a marriage­able age; then, if you find them to be mature of mind, hand over to them their possessions; and do not consume them by wasteful spending, and in haste, ere they grow up. And let him who is rich abstain entirely [from his ward's property]; and let him who is poor partake thereof in a fair manner. And when you hand over to them their possessions, let there be witnesses on their behalf - although none can take count as God does.",
      "ms": "",
      "id": "",
      "ar": "وَٱبۡتَلُوا۟ ٱلۡیَتَـٰمَىٰ حَتَّىٰۤ إِذَا بَلَغُوا۟ ٱلنِّكَاحَ فَإِنۡ ءَانَسۡتُم مِّنۡهُمۡ رُشۡدࣰا فَٱدۡفَعُوۤا۟ إِلَیۡهِمۡ أَمۡوَ ٰ⁠لَهُمۡۖ وَلَا تَأۡكُلُوهَاۤ إِسۡرَافࣰا وَبِدَارًا أَن یَكۡبَرُوا۟ۚ وَمَن كَانَ غَنِیࣰّا فَلۡیَسۡتَعۡفِفۡۖ وَمَن كَانَ فَقِیرࣰا فَلۡیَأۡكُلۡ بِٱلۡمَعۡرُوفِۚ فَإِذَا دَفَعۡتُمۡ إِلَیۡهِمۡ أَمۡوَ ٰ⁠لَهُمۡ فَأَشۡهِدُوا۟ عَلَیۡهِمۡۚ وَكَفَىٰ بِٱللَّهِ حَسِیبࣰا\n"
    }
  },
  {
    "id": 500,
    "surahId": 4,
    "ayahNumber": 7,
    "arabicText": "لِّلرِّجَالِ نَصِیبࣱ مِّمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَ وَلِلنِّسَاۤءِ نَصِیبࣱ مِّمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَ مِمَّا قَلَّ مِنۡهُ أَوۡ كَثُرَۚ نَصِیبࣰا مَّفۡرُوضࣰا\n",
    "translations": {
      "en": "MEN SHALL have a share in what parents and kinsfolk leave behind, and women shall have a share in what parents and kinsfolk leave behind, whether it be little or much - a share ordained [by God].",
      "ms": "",
      "id": "",
      "ar": "لِّلرِّجَالِ نَصِیبࣱ مِّمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَ وَلِلنِّسَاۤءِ نَصِیبࣱ مِّمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَ مِمَّا قَلَّ مِنۡهُ أَوۡ كَثُرَۚ نَصِیبࣰا مَّفۡرُوضࣰا\n"
    }
  },
  {
    "id": 501,
    "surahId": 4,
    "ayahNumber": 8,
    "arabicText": "وَإِذَا حَضَرَ ٱلۡقِسۡمَةَ أُو۟لُوا۟ ٱلۡقُرۡبَىٰ وَٱلۡیَتَـٰمَىٰ وَٱلۡمَسَـٰكِینُ فَٱرۡزُقُوهُم مِّنۡهُ وَقُولُوا۟ لَهُمۡ قَوۡلࣰا مَّعۡرُوفࣰا\n",
    "translations": {
      "en": "And when [other] near of kin and orphans and needy persons are present at the distribution [of inheritance], give them something thereof for their sustenance, and speak unto them in a kindly way.",
      "ms": "",
      "id": "",
      "ar": "وَإِذَا حَضَرَ ٱلۡقِسۡمَةَ أُو۟لُوا۟ ٱلۡقُرۡبَىٰ وَٱلۡیَتَـٰمَىٰ وَٱلۡمَسَـٰكِینُ فَٱرۡزُقُوهُم مِّنۡهُ وَقُولُوا۟ لَهُمۡ قَوۡلࣰا مَّعۡرُوفࣰا\n"
    }
  },
  {
    "id": 502,
    "surahId": 4,
    "ayahNumber": 9,
    "arabicText": "وَلۡیَخۡشَ ٱلَّذِینَ لَوۡ تَرَكُوا۟ مِنۡ خَلۡفِهِمۡ ذُرِّیَّةࣰ ضِعَـٰفًا خَافُوا۟ عَلَیۡهِمۡ فَلۡیَتَّقُوا۟ ٱللَّهَ وَلۡیَقُولُوا۟ قَوۡلࣰا سَدِیدًا\n",
    "translations": {
      "en": "And let them stand in awe [of God], those [legal heirs] - who, if they [themselves] had to leave behind weak offspring, would feel fear on their account - and let them remain conscious of God, and let them speak [to the poor] in a just manner.",
      "ms": "",
      "id": "",
      "ar": "وَلۡیَخۡشَ ٱلَّذِینَ لَوۡ تَرَكُوا۟ مِنۡ خَلۡفِهِمۡ ذُرِّیَّةࣰ ضِعَـٰفًا خَافُوا۟ عَلَیۡهِمۡ فَلۡیَتَّقُوا۟ ٱللَّهَ وَلۡیَقُولُوا۟ قَوۡلࣰا سَدِیدًا\n"
    }
  },
  {
    "id": 503,
    "surahId": 4,
    "ayahNumber": 10,
    "arabicText": "إِنَّ ٱلَّذِینَ یَأۡكُلُونَ أَمۡوَ ٰ⁠لَ ٱلۡیَتَـٰمَىٰ ظُلۡمًا إِنَّمَا یَأۡكُلُونَ فِی بُطُونِهِمۡ نَارࣰاۖ وَسَیَصۡلَوۡنَ سَعِیرࣰا\n",
    "translations": {
      "en": "Behold, those who sinfully devour the posses­sions of orphans but fill their bellies with fire: for [in the life to come] they will have to endure a blazing flame!",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ یَأۡكُلُونَ أَمۡوَ ٰ⁠لَ ٱلۡیَتَـٰمَىٰ ظُلۡمًا إِنَّمَا یَأۡكُلُونَ فِی بُطُونِهِمۡ نَارࣰاۖ وَسَیَصۡلَوۡنَ سَعِیرࣰا\n"
    }
  },
  {
    "id": 504,
    "surahId": 4,
    "ayahNumber": 11,
    "arabicText": "یُوصِیكُمُ ٱللَّهُ فِیۤ أَوۡلَـٰدِكُمۡۖ لِلذَّكَرِ مِثۡلُ حَظِّ ٱلۡأُنثَیَیۡنِۚ فَإِن كُنَّ نِسَاۤءࣰ فَوۡقَ ٱثۡنَتَیۡنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَۖ وَإِن كَانَتۡ وَ ٰ⁠حِدَةࣰ فَلَهَا ٱلنِّصۡفُۚ وَلِأَبَوَیۡهِ لِكُلِّ وَ ٰ⁠حِدࣲ مِّنۡهُمَا ٱلسُّدُسُ مِمَّا تَرَكَ إِن كَانَ لَهُۥ وَلَدࣱۚ فَإِن لَّمۡ یَكُن لَّهُۥ وَلَدࣱ وَوَرِثَهُۥۤ أَبَوَاهُ فَلِأُمِّهِ ٱلثُّلُثُۚ فَإِن كَانَ لَهُۥۤ إِخۡوَةࣱ فَلِأُمِّهِ ٱلسُّدُسُۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصِی بِهَاۤ أَوۡ دَیۡنٍۗ ءَابَاۤؤُكُمۡ وَأَبۡنَاۤؤُكُمۡ لَا تَدۡرُونَ أَیُّهُمۡ أَقۡرَبُ لَكُمۡ نَفۡعࣰاۚ فَرِیضَةࣰ مِّنَ ٱللَّهِۗ إِنَّ ٱللَّهَ كَانَ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "CONCERNING [the inheritance of] your children, God enjoins [this] upon you: The male shall have the equal of two females’ share; but if there are more than two females, they shall have two-thirds of what [their parents] leave behind; and if there is only one daughter, she shall have one-half thereof. And as for the parents [of the deceased], each of them shall have one-sixth of what he leaves behind, in the event of his having [left] a child; but if he has left no child and his parents are his [only] heirs, then his mother shall have one-third; and if he has brothers and sisters, then his mother shall have one-sixth after [the deduction of] any bequest he may have made, or any debt [he may have incurred]. As for your parents and your children - you know not which of them is more deserving of benefit from you: [therefore this] ordinance from God. Verily, God is all-knowing, wise.",
      "ms": "",
      "id": "",
      "ar": "یُوصِیكُمُ ٱللَّهُ فِیۤ أَوۡلَـٰدِكُمۡۖ لِلذَّكَرِ مِثۡلُ حَظِّ ٱلۡأُنثَیَیۡنِۚ فَإِن كُنَّ نِسَاۤءࣰ فَوۡقَ ٱثۡنَتَیۡنِ فَلَهُنَّ ثُلُثَا مَا تَرَكَۖ وَإِن كَانَتۡ وَ ٰ⁠حِدَةࣰ فَلَهَا ٱلنِّصۡفُۚ وَلِأَبَوَیۡهِ لِكُلِّ وَ ٰ⁠حِدࣲ مِّنۡهُمَا ٱلسُّدُسُ مِمَّا تَرَكَ إِن كَانَ لَهُۥ وَلَدࣱۚ فَإِن لَّمۡ یَكُن لَّهُۥ وَلَدࣱ وَوَرِثَهُۥۤ أَبَوَاهُ فَلِأُمِّهِ ٱلثُّلُثُۚ فَإِن كَانَ لَهُۥۤ إِخۡوَةࣱ فَلِأُمِّهِ ٱلسُّدُسُۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصِی بِهَاۤ أَوۡ دَیۡنٍۗ ءَابَاۤؤُكُمۡ وَأَبۡنَاۤؤُكُمۡ لَا تَدۡرُونَ أَیُّهُمۡ أَقۡرَبُ لَكُمۡ نَفۡعࣰاۚ فَرِیضَةࣰ مِّنَ ٱللَّهِۗ إِنَّ ٱللَّهَ كَانَ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 505,
    "surahId": 4,
    "ayahNumber": 12,
    "arabicText": "۞ وَلَكُمۡ نِصۡفُ مَا تَرَكَ أَزۡوَ ٰ⁠جُكُمۡ إِن لَّمۡ یَكُن لَّهُنَّ وَلَدࣱۚ فَإِن كَانَ لَهُنَّ وَلَدࣱ فَلَكُمُ ٱلرُّبُعُ مِمَّا تَرَكۡنَۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصِینَ بِهَاۤ أَوۡ دَیۡنࣲۚ وَلَهُنَّ ٱلرُّبُعُ مِمَّا تَرَكۡتُمۡ إِن لَّمۡ یَكُن لَّكُمۡ وَلَدࣱۚ فَإِن كَانَ لَكُمۡ وَلَدࣱ فَلَهُنَّ ٱلثُّمُنُ مِمَّا تَرَكۡتُمۚ مِّنۢ بَعۡدِ وَصِیَّةࣲ تُوصُونَ بِهَاۤ أَوۡ دَیۡنࣲۗ وَإِن كَانَ رَجُلࣱ یُورَثُ كَلَـٰلَةً أَوِ ٱمۡرَأَةࣱ وَلَهُۥۤ أَخٌ أَوۡ أُخۡتࣱ فَلِكُلِّ وَ ٰ⁠حِدࣲ مِّنۡهُمَا ٱلسُّدُسُۚ فَإِن كَانُوۤا۟ أَكۡثَرَ مِن ذَ ٰ⁠لِكَ فَهُمۡ شُرَكَاۤءُ فِی ٱلثُّلُثِۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصَىٰ بِهَاۤ أَوۡ دَیۡنٍ غَیۡرَ مُضَاۤرࣲّۚ وَصِیَّةࣰ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِیمٌ حَلِیمࣱ\n",
    "translations": {
      "en": "And you shall inherit one-half of what your wives leave behind, provided they have left no child; but if they have left a child, then you shall have one-quarter of what they leave behind, after [the deduction of] any bequest they may have made, or any debt [they may have incurred]. And your widows shall have one-quarter of what you leave behind, provided you have left no child; but if you have left a child, then they shall have one-eighth of what you leave behind, after [the deduction of] any bequest you may have made, or any debt [you may have incurred]. And if a man or a woman has no heir in the direct line, but has a brother or a sister, then each of these two shall inherit one-sixth; but if there are more than two, then they shall share in one-third [of the inheritance], after [the deduction of] any bequest that may have been made, or any debt [that may have been incurred], neither of which having been intended to harm [the heirs]. [This is] an injunction from God: and God is all-knowing, forbearing.",
      "ms": "",
      "id": "",
      "ar": "۞ وَلَكُمۡ نِصۡفُ مَا تَرَكَ أَزۡوَ ٰ⁠جُكُمۡ إِن لَّمۡ یَكُن لَّهُنَّ وَلَدࣱۚ فَإِن كَانَ لَهُنَّ وَلَدࣱ فَلَكُمُ ٱلرُّبُعُ مِمَّا تَرَكۡنَۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصِینَ بِهَاۤ أَوۡ دَیۡنࣲۚ وَلَهُنَّ ٱلرُّبُعُ مِمَّا تَرَكۡتُمۡ إِن لَّمۡ یَكُن لَّكُمۡ وَلَدࣱۚ فَإِن كَانَ لَكُمۡ وَلَدࣱ فَلَهُنَّ ٱلثُّمُنُ مِمَّا تَرَكۡتُمۚ مِّنۢ بَعۡدِ وَصِیَّةࣲ تُوصُونَ بِهَاۤ أَوۡ دَیۡنࣲۗ وَإِن كَانَ رَجُلࣱ یُورَثُ كَلَـٰلَةً أَوِ ٱمۡرَأَةࣱ وَلَهُۥۤ أَخٌ أَوۡ أُخۡتࣱ فَلِكُلِّ وَ ٰ⁠حِدࣲ مِّنۡهُمَا ٱلسُّدُسُۚ فَإِن كَانُوۤا۟ أَكۡثَرَ مِن ذَ ٰ⁠لِكَ فَهُمۡ شُرَكَاۤءُ فِی ٱلثُّلُثِۚ مِنۢ بَعۡدِ وَصِیَّةࣲ یُوصَىٰ بِهَاۤ أَوۡ دَیۡنٍ غَیۡرَ مُضَاۤرࣲّۚ وَصِیَّةࣰ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِیمٌ حَلِیمࣱ\n"
    }
  },
  {
    "id": 506,
    "surahId": 4,
    "ayahNumber": 13,
    "arabicText": "تِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن یُطِعِ ٱللَّهَ وَرَسُولَهُۥ یُدۡخِلۡهُ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۚ وَذَ ٰ⁠لِكَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n",
    "translations": {
      "en": "These are the bounds set by God. And whoever pays heed unto God and His Apostle, him will He bring into gardens through which running waters flow, therein to abide: and this is a triumph supreme.",
      "ms": "",
      "id": "",
      "ar": "تِلۡكَ حُدُودُ ٱللَّهِۚ وَمَن یُطِعِ ٱللَّهَ وَرَسُولَهُۥ یُدۡخِلۡهُ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۚ وَذَ ٰ⁠لِكَ ٱلۡفَوۡزُ ٱلۡعَظِیمُ\n"
    }
  },
  {
    "id": 507,
    "surahId": 4,
    "ayahNumber": 14,
    "arabicText": "وَمَن یَعۡصِ ٱللَّهَ وَرَسُولَهُۥ وَیَتَعَدَّ حُدُودَهُۥ یُدۡخِلۡهُ نَارًا خَـٰلِدࣰا فِیهَا وَلَهُۥ عَذَابࣱ مُّهِینࣱ\n",
    "translations": {
      "en": "And whoever rebels against God and His Apostle and transgresses His bounds, him will He commit unto fire, therein to abide; and shameful suffering awaits him.",
      "ms": "",
      "id": "",
      "ar": "وَمَن یَعۡصِ ٱللَّهَ وَرَسُولَهُۥ وَیَتَعَدَّ حُدُودَهُۥ یُدۡخِلۡهُ نَارًا خَـٰلِدࣰا فِیهَا وَلَهُۥ عَذَابࣱ مُّهِینࣱ\n"
    }
  },
  {
    "id": 508,
    "surahId": 4,
    "ayahNumber": 15,
    "arabicText": "وَٱلَّـٰتِی یَأۡتِینَ ٱلۡفَـٰحِشَةَ مِن نِّسَاۤىِٕكُمۡ فَٱسۡتَشۡهِدُوا۟ عَلَیۡهِنَّ أَرۡبَعَةࣰ مِّنكُمۡۖ فَإِن شَهِدُوا۟ فَأَمۡسِكُوهُنَّ فِی ٱلۡبُیُوتِ حَتَّىٰ یَتَوَفَّىٰهُنَّ ٱلۡمَوۡتُ أَوۡ یَجۡعَلَ ٱللَّهُ لَهُنَّ سَبِیلࣰا\n",
    "translations": {
      "en": "AND AS FOR those of your women who become guilty of immoral conduct, call upon four from among you who have witnessed their guilt; and if these bear witness thereto, confine the guilty women to their houses until death takes them away or God opens for them a way [through repentance].",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّـٰتِی یَأۡتِینَ ٱلۡفَـٰحِشَةَ مِن نِّسَاۤىِٕكُمۡ فَٱسۡتَشۡهِدُوا۟ عَلَیۡهِنَّ أَرۡبَعَةࣰ مِّنكُمۡۖ فَإِن شَهِدُوا۟ فَأَمۡسِكُوهُنَّ فِی ٱلۡبُیُوتِ حَتَّىٰ یَتَوَفَّىٰهُنَّ ٱلۡمَوۡتُ أَوۡ یَجۡعَلَ ٱللَّهُ لَهُنَّ سَبِیلࣰا\n"
    }
  },
  {
    "id": 509,
    "surahId": 4,
    "ayahNumber": 16,
    "arabicText": "وَٱلَّذَانِ یَأۡتِیَـٰنِهَا مِنكُمۡ فَـَٔاذُوهُمَاۖ فَإِن تَابَا وَأَصۡلَحَا فَأَعۡرِضُوا۟ عَنۡهُمَاۤۗ إِنَّ ٱللَّهَ كَانَ تَوَّابࣰا رَّحِیمًا\n",
    "translations": {
      "en": "And punish [thus] both of the guilty parties; but if they both repent and mend their ways, leave them alone: for, behold, God is an acceptor of repentance, a dispenser of grace.",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذَانِ یَأۡتِیَـٰنِهَا مِنكُمۡ فَـَٔاذُوهُمَاۖ فَإِن تَابَا وَأَصۡلَحَا فَأَعۡرِضُوا۟ عَنۡهُمَاۤۗ إِنَّ ٱللَّهَ كَانَ تَوَّابࣰا رَّحِیمًا\n"
    }
  },
  {
    "id": 510,
    "surahId": 4,
    "ayahNumber": 17,
    "arabicText": "إِنَّمَا ٱلتَّوۡبَةُ عَلَى ٱللَّهِ لِلَّذِینَ یَعۡمَلُونَ ٱلسُّوۤءَ بِجَهَـٰلَةࣲ ثُمَّ یَتُوبُونَ مِن قَرِیبࣲ فَأُو۟لَـٰۤىِٕكَ یَتُوبُ ٱللَّهُ عَلَیۡهِمۡۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "Verily, God's acceptance of repentance relates only to those who do evil out of ignorance and then repent before their time runs out: and it is they unto whom God will turn again in His mercy - for God is all-knowing, wise;",
      "ms": "",
      "id": "",
      "ar": "إِنَّمَا ٱلتَّوۡبَةُ عَلَى ٱللَّهِ لِلَّذِینَ یَعۡمَلُونَ ٱلسُّوۤءَ بِجَهَـٰلَةࣲ ثُمَّ یَتُوبُونَ مِن قَرِیبࣲ فَأُو۟لَـٰۤىِٕكَ یَتُوبُ ٱللَّهُ عَلَیۡهِمۡۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 511,
    "surahId": 4,
    "ayahNumber": 18,
    "arabicText": "وَلَیۡسَتِ ٱلتَّوۡبَةُ لِلَّذِینَ یَعۡمَلُونَ ٱلسَّیِّـَٔاتِ حَتَّىٰۤ إِذَا حَضَرَ أَحَدَهُمُ ٱلۡمَوۡتُ قَالَ إِنِّی تُبۡتُ ٱلۡـَٔـٰنَ وَلَا ٱلَّذِینَ یَمُوتُونَ وَهُمۡ كُفَّارٌۚ أُو۟لَـٰۤىِٕكَ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِیمࣰا\n",
    "translations": {
      "en": "whereas repentance shall not be accepted from those who do evil deeds until their dying hour and then say, \"Behold, I now repent\"; nor from those who die as deniers of the truth: it is these for whom We have readied grievous suffering.",
      "ms": "",
      "id": "",
      "ar": "وَلَیۡسَتِ ٱلتَّوۡبَةُ لِلَّذِینَ یَعۡمَلُونَ ٱلسَّیِّـَٔاتِ حَتَّىٰۤ إِذَا حَضَرَ أَحَدَهُمُ ٱلۡمَوۡتُ قَالَ إِنِّی تُبۡتُ ٱلۡـَٔـٰنَ وَلَا ٱلَّذِینَ یَمُوتُونَ وَهُمۡ كُفَّارٌۚ أُو۟لَـٰۤىِٕكَ أَعۡتَدۡنَا لَهُمۡ عَذَابًا أَلِیمࣰا\n"
    }
  },
  {
    "id": 512,
    "surahId": 4,
    "ayahNumber": 19,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا یَحِلُّ لَكُمۡ أَن تَرِثُوا۟ ٱلنِّسَاۤءَ كَرۡهࣰاۖ وَلَا تَعۡضُلُوهُنَّ لِتَذۡهَبُوا۟ بِبَعۡضِ مَاۤ ءَاتَیۡتُمُوهُنَّ إِلَّاۤ أَن یَأۡتِینَ بِفَـٰحِشَةࣲ مُّبَیِّنَةࣲۚ وَعَاشِرُوهُنَّ بِٱلۡمَعۡرُوفِۚ فَإِن كَرِهۡتُمُوهُنَّ فَعَسَىٰۤ أَن تَكۡرَهُوا۟ شَیۡـࣰٔا وَیَجۡعَلَ ٱللَّهُ فِیهِ خَیۡرࣰا كَثِیرࣰا\n",
    "translations": {
      "en": "O YOU who have attained to faith! It is not lawful for you to [try to] become heirs to your wives [by holding onto them] against their will; and neither shall you keep them under constraint with a view to taking away anything of what you may have given them, unless it be that they have become guilty, in an obvious man­ner, of immoral conduct. And consort with your wives in a goodly manner; for if you dislike them, it may well be that you dislike something which God might yet make a source of abundant good.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا یَحِلُّ لَكُمۡ أَن تَرِثُوا۟ ٱلنِّسَاۤءَ كَرۡهࣰاۖ وَلَا تَعۡضُلُوهُنَّ لِتَذۡهَبُوا۟ بِبَعۡضِ مَاۤ ءَاتَیۡتُمُوهُنَّ إِلَّاۤ أَن یَأۡتِینَ بِفَـٰحِشَةࣲ مُّبَیِّنَةࣲۚ وَعَاشِرُوهُنَّ بِٱلۡمَعۡرُوفِۚ فَإِن كَرِهۡتُمُوهُنَّ فَعَسَىٰۤ أَن تَكۡرَهُوا۟ شَیۡـࣰٔا وَیَجۡعَلَ ٱللَّهُ فِیهِ خَیۡرࣰا كَثِیرࣰا\n"
    }
  },
  {
    "id": 513,
    "surahId": 4,
    "ayahNumber": 20,
    "arabicText": "وَإِنۡ أَرَدتُّمُ ٱسۡتِبۡدَالَ زَوۡجࣲ مَّكَانَ زَوۡجࣲ وَءَاتَیۡتُمۡ إِحۡدَىٰهُنَّ قِنطَارࣰا فَلَا تَأۡخُذُوا۟ مِنۡهُ شَیۡـًٔاۚ أَتَأۡخُذُونَهُۥ بُهۡتَـٰنࣰا وَإِثۡمࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "But if you desire to give up a wife and to take another in her stead, do not take away anything of what you have given the first one, however much it may have been. Would you, perchance, take it away by slandering her and thus committing a manifest sin?",
      "ms": "",
      "id": "",
      "ar": "وَإِنۡ أَرَدتُّمُ ٱسۡتِبۡدَالَ زَوۡجࣲ مَّكَانَ زَوۡجࣲ وَءَاتَیۡتُمۡ إِحۡدَىٰهُنَّ قِنطَارࣰا فَلَا تَأۡخُذُوا۟ مِنۡهُ شَیۡـًٔاۚ أَتَأۡخُذُونَهُۥ بُهۡتَـٰنࣰا وَإِثۡمࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 514,
    "surahId": 4,
    "ayahNumber": 21,
    "arabicText": "وَكَیۡفَ تَأۡخُذُونَهُۥ وَقَدۡ أَفۡضَىٰ بَعۡضُكُمۡ إِلَىٰ بَعۡضࣲ وَأَخَذۡنَ مِنكُم مِّیثَـٰقًا غَلِیظࣰا\n",
    "translations": {
      "en": "And how could you take it away after you have given yourselves to one another, and she has received a most solemn pledge from you?",
      "ms": "",
      "id": "",
      "ar": "وَكَیۡفَ تَأۡخُذُونَهُۥ وَقَدۡ أَفۡضَىٰ بَعۡضُكُمۡ إِلَىٰ بَعۡضࣲ وَأَخَذۡنَ مِنكُم مِّیثَـٰقًا غَلِیظࣰا\n"
    }
  },
  {
    "id": 515,
    "surahId": 4,
    "ayahNumber": 22,
    "arabicText": "وَلَا تَنكِحُوا۟ مَا نَكَحَ ءَابَاۤؤُكُم مِّنَ ٱلنِّسَاۤءِ إِلَّا مَا قَدۡ سَلَفَۚ إِنَّهُۥ كَانَ فَـٰحِشَةࣰ وَمَقۡتࣰا وَسَاۤءَ سَبِیلًا\n",
    "translations": {
      "en": "AND DO NOT marry women whom your fathers have previously married - although what is past is past: this, verily, is a shameful deed, and a hateful thing, and an evil way.",
      "ms": "",
      "id": "",
      "ar": "وَلَا تَنكِحُوا۟ مَا نَكَحَ ءَابَاۤؤُكُم مِّنَ ٱلنِّسَاۤءِ إِلَّا مَا قَدۡ سَلَفَۚ إِنَّهُۥ كَانَ فَـٰحِشَةࣰ وَمَقۡتࣰا وَسَاۤءَ سَبِیلًا\n"
    }
  },
  {
    "id": 516,
    "surahId": 4,
    "ayahNumber": 23,
    "arabicText": "حُرِّمَتۡ عَلَیۡكُمۡ أُمَّهَـٰتُكُمۡ وَبَنَاتُكُمۡ وَأَخَوَ ٰ⁠تُكُمۡ وَعَمَّـٰتُكُمۡ وَخَـٰلَـٰتُكُمۡ وَبَنَاتُ ٱلۡأَخِ وَبَنَاتُ ٱلۡأُخۡتِ وَأُمَّهَـٰتُكُمُ ٱلَّـٰتِیۤ أَرۡضَعۡنَكُمۡ وَأَخَوَ ٰ⁠تُكُم مِّنَ ٱلرَّضَـٰعَةِ وَأُمَّهَـٰتُ نِسَاۤىِٕكُمۡ وَرَبَـٰۤىِٕبُكُمُ ٱلَّـٰتِی فِی حُجُورِكُم مِّن نِّسَاۤىِٕكُمُ ٱلَّـٰتِی دَخَلۡتُم بِهِنَّ فَإِن لَّمۡ تَكُونُوا۟ دَخَلۡتُم بِهِنَّ فَلَا جُنَاحَ عَلَیۡكُمۡ وَحَلَـٰۤىِٕلُ أَبۡنَاۤىِٕكُمُ ٱلَّذِینَ مِنۡ أَصۡلَـٰبِكُمۡ وَأَن تَجۡمَعُوا۟ بَیۡنَ ٱلۡأُخۡتَیۡنِ إِلَّا مَا قَدۡ سَلَفَۗ إِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "Forbidden to you are your mothers, and your daughters, and your sisters, and your aunts paternal and maternal, and a brother's daughters, and a sister's daughters; and your milk-mothers, and your milk-sisters; and the mothers of your wives; and your step-daughters - who are your foster children - born of your wives with whom you have consummated your marriage; but if you have not consummated your marriage, you will incur no sin [by marrying their daughters]; and [forbidden to you are] the spouses of the sons who have sprung from your loins; and [you are forbidden] to have two sisters [as your wives] at one and the same time - but what is past is past: for, behold, God is indeed much-forgiving, a dispenser of grace.",
      "ms": "",
      "id": "",
      "ar": "حُرِّمَتۡ عَلَیۡكُمۡ أُمَّهَـٰتُكُمۡ وَبَنَاتُكُمۡ وَأَخَوَ ٰ⁠تُكُمۡ وَعَمَّـٰتُكُمۡ وَخَـٰلَـٰتُكُمۡ وَبَنَاتُ ٱلۡأَخِ وَبَنَاتُ ٱلۡأُخۡتِ وَأُمَّهَـٰتُكُمُ ٱلَّـٰتِیۤ أَرۡضَعۡنَكُمۡ وَأَخَوَ ٰ⁠تُكُم مِّنَ ٱلرَّضَـٰعَةِ وَأُمَّهَـٰتُ نِسَاۤىِٕكُمۡ وَرَبَـٰۤىِٕبُكُمُ ٱلَّـٰتِی فِی حُجُورِكُم مِّن نِّسَاۤىِٕكُمُ ٱلَّـٰتِی دَخَلۡتُم بِهِنَّ فَإِن لَّمۡ تَكُونُوا۟ دَخَلۡتُم بِهِنَّ فَلَا جُنَاحَ عَلَیۡكُمۡ وَحَلَـٰۤىِٕلُ أَبۡنَاۤىِٕكُمُ ٱلَّذِینَ مِنۡ أَصۡلَـٰبِكُمۡ وَأَن تَجۡمَعُوا۟ بَیۡنَ ٱلۡأُخۡتَیۡنِ إِلَّا مَا قَدۡ سَلَفَۗ إِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 517,
    "surahId": 4,
    "ayahNumber": 24,
    "arabicText": "۞ وَٱلۡمُحۡصَنَـٰتُ مِنَ ٱلنِّسَاۤءِ إِلَّا مَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۖ كِتَـٰبَ ٱللَّهِ عَلَیۡكُمۡۚ وَأُحِلَّ لَكُم مَّا وَرَاۤءَ ذَ ٰ⁠لِكُمۡ أَن تَبۡتَغُوا۟ بِأَمۡوَ ٰ⁠لِكُم مُّحۡصِنِینَ غَیۡرَ مُسَـٰفِحِینَۚ فَمَا ٱسۡتَمۡتَعۡتُم بِهِۦ مِنۡهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِیضَةࣰۚ وَلَا جُنَاحَ عَلَیۡكُمۡ فِیمَا تَرَ ٰ⁠ضَیۡتُم بِهِۦ مِنۢ بَعۡدِ ٱلۡفَرِیضَةِۚ إِنَّ ٱللَّهَ كَانَ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "And [forbidden to you are] all married women other than those whom you rightfully possess [through wedlock]: this is God's ordinance, binding upon you. But lawful to you are all [women] beyond these, for you to seek out, offering them of your possessions, taking them in honest wedlock, and not in fornication. And unto those with whom you desire to enjoy marriage, you shall give the dowers due to them; but you will incur no sin if, after [having agreed upon] this lawful due, you freely agree with one another upon anything [else]: behold, God is indeed all-knowing, wise.",
      "ms": "",
      "id": "",
      "ar": "۞ وَٱلۡمُحۡصَنَـٰتُ مِنَ ٱلنِّسَاۤءِ إِلَّا مَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۖ كِتَـٰبَ ٱللَّهِ عَلَیۡكُمۡۚ وَأُحِلَّ لَكُم مَّا وَرَاۤءَ ذَ ٰ⁠لِكُمۡ أَن تَبۡتَغُوا۟ بِأَمۡوَ ٰ⁠لِكُم مُّحۡصِنِینَ غَیۡرَ مُسَـٰفِحِینَۚ فَمَا ٱسۡتَمۡتَعۡتُم بِهِۦ مِنۡهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِیضَةࣰۚ وَلَا جُنَاحَ عَلَیۡكُمۡ فِیمَا تَرَ ٰ⁠ضَیۡتُم بِهِۦ مِنۢ بَعۡدِ ٱلۡفَرِیضَةِۚ إِنَّ ٱللَّهَ كَانَ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 518,
    "surahId": 4,
    "ayahNumber": 25,
    "arabicText": "وَمَن لَّمۡ یَسۡتَطِعۡ مِنكُمۡ طَوۡلًا أَن یَنكِحَ ٱلۡمُحۡصَنَـٰتِ ٱلۡمُؤۡمِنَـٰتِ فَمِن مَّا مَلَكَتۡ أَیۡمَـٰنُكُم مِّن فَتَیَـٰتِكُمُ ٱلۡمُؤۡمِنَـٰتِۚ وَٱللَّهُ أَعۡلَمُ بِإِیمَـٰنِكُمۚ بَعۡضُكُم مِّنۢ بَعۡضࣲۚ فَٱنكِحُوهُنَّ بِإِذۡنِ أَهۡلِهِنَّ وَءَاتُوهُنَّ أُجُورَهُنَّ بِٱلۡمَعۡرُوفِ مُحۡصَنَـٰتٍ غَیۡرَ مُسَـٰفِحَـٰتࣲ وَلَا مُتَّخِذَ ٰ⁠تِ أَخۡدَانࣲۚ فَإِذَاۤ أُحۡصِنَّ فَإِنۡ أَتَیۡنَ بِفَـٰحِشَةࣲ فَعَلَیۡهِنَّ نِصۡفُ مَا عَلَى ٱلۡمُحۡصَنَـٰتِ مِنَ ٱلۡعَذَابِۚ ذَ ٰ⁠لِكَ لِمَنۡ خَشِیَ ٱلۡعَنَتَ مِنكُمۡۚ وَأَن تَصۡبِرُوا۟ خَیۡرࣱ لَّكُمۡۗ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ\n",
    "translations": {
      "en": "And as for those of you who, owing to cir­cumstances, are not in a position to marry free believing women, [let them marry] believing maidens from among those whom you rightfully possess. And God knows all about your faith; each one of you is an issue of the other. Marry them, then, with their people's leave, and give them their dowers in an equitable manner - they being women who give themselves in honest wedlock, not in fornication, nor as secret love-companions. And when they are married, and thereafter become guilty of immoral conduct, they shall be liable to half the penalty to which free married women are liable. This [permission to marry slave-girls applies] to those of you who fear lest they stumble into evil. But it is for your own good to persevere in patience [and to abstain from such marriages]: and God is much-forgiving, a dispenser of grace.",
      "ms": "",
      "id": "",
      "ar": "وَمَن لَّمۡ یَسۡتَطِعۡ مِنكُمۡ طَوۡلًا أَن یَنكِحَ ٱلۡمُحۡصَنَـٰتِ ٱلۡمُؤۡمِنَـٰتِ فَمِن مَّا مَلَكَتۡ أَیۡمَـٰنُكُم مِّن فَتَیَـٰتِكُمُ ٱلۡمُؤۡمِنَـٰتِۚ وَٱللَّهُ أَعۡلَمُ بِإِیمَـٰنِكُمۚ بَعۡضُكُم مِّنۢ بَعۡضࣲۚ فَٱنكِحُوهُنَّ بِإِذۡنِ أَهۡلِهِنَّ وَءَاتُوهُنَّ أُجُورَهُنَّ بِٱلۡمَعۡرُوفِ مُحۡصَنَـٰتٍ غَیۡرَ مُسَـٰفِحَـٰتࣲ وَلَا مُتَّخِذَ ٰ⁠تِ أَخۡدَانࣲۚ فَإِذَاۤ أُحۡصِنَّ فَإِنۡ أَتَیۡنَ بِفَـٰحِشَةࣲ فَعَلَیۡهِنَّ نِصۡفُ مَا عَلَى ٱلۡمُحۡصَنَـٰتِ مِنَ ٱلۡعَذَابِۚ ذَ ٰ⁠لِكَ لِمَنۡ خَشِیَ ٱلۡعَنَتَ مِنكُمۡۚ وَأَن تَصۡبِرُوا۟ خَیۡرࣱ لَّكُمۡۗ وَٱللَّهُ غَفُورࣱ رَّحِیمࣱ\n"
    }
  },
  {
    "id": 519,
    "surahId": 4,
    "ayahNumber": 26,
    "arabicText": "یُرِیدُ ٱللَّهُ لِیُبَیِّنَ لَكُمۡ وَیَهۡدِیَكُمۡ سُنَنَ ٱلَّذِینَ مِن قَبۡلِكُمۡ وَیَتُوبَ عَلَیۡكُمۡۗ وَٱللَّهُ عَلِیمٌ حَكِیمࣱ\n",
    "translations": {
      "en": "God wants to make [all this] clear unto you, and to guide you onto the [righteous] ways of life of those who preceded you, and to turn unto you in His mercy: for God is all-knowing, wise.",
      "ms": "",
      "id": "",
      "ar": "یُرِیدُ ٱللَّهُ لِیُبَیِّنَ لَكُمۡ وَیَهۡدِیَكُمۡ سُنَنَ ٱلَّذِینَ مِن قَبۡلِكُمۡ وَیَتُوبَ عَلَیۡكُمۡۗ وَٱللَّهُ عَلِیمٌ حَكِیمࣱ\n"
    }
  },
  {
    "id": 520,
    "surahId": 4,
    "ayahNumber": 27,
    "arabicText": "وَٱللَّهُ یُرِیدُ أَن یَتُوبَ عَلَیۡكُمۡ وَیُرِیدُ ٱلَّذِینَ یَتَّبِعُونَ ٱلشَّهَوَ ٰ⁠تِ أَن تَمِیلُوا۟ مَیۡلًا عَظِیمࣰا\n",
    "translations": {
      "en": "And God wants to turn unto you in His mercy, whereas those who follow [only] their own lusts want you to drift far away from the right path.",
      "ms": "",
      "id": "",
      "ar": "وَٱللَّهُ یُرِیدُ أَن یَتُوبَ عَلَیۡكُمۡ وَیُرِیدُ ٱلَّذِینَ یَتَّبِعُونَ ٱلشَّهَوَ ٰ⁠تِ أَن تَمِیلُوا۟ مَیۡلًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 521,
    "surahId": 4,
    "ayahNumber": 28,
    "arabicText": "یُرِیدُ ٱللَّهُ أَن یُخَفِّفَ عَنكُمۡۚ وَخُلِقَ ٱلۡإِنسَـٰنُ ضَعِیفࣰا\n",
    "translations": {
      "en": "God wants to lighten your burdens: for man has been created weak.",
      "ms": "",
      "id": "",
      "ar": "یُرِیدُ ٱللَّهُ أَن یُخَفِّفَ عَنكُمۡۚ وَخُلِقَ ٱلۡإِنسَـٰنُ ضَعِیفࣰا\n"
    }
  },
  {
    "id": 522,
    "surahId": 4,
    "ayahNumber": 29,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَأۡكُلُوۤا۟ أَمۡوَ ٰ⁠لَكُم بَیۡنَكُم بِٱلۡبَـٰطِلِ إِلَّاۤ أَن تَكُونَ تِجَـٰرَةً عَن تَرَاضࣲ مِّنكُمۡۚ وَلَا تَقۡتُلُوۤا۟ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِیمࣰا\n",
    "translations": {
      "en": "O YOU who have attained to faith! Do not devour one another's possessions wrongfully - not even by way of trade based on mutual agreement - and do not destroy one another: for, behold, God is indeed a dispenser of grace unto you!",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَأۡكُلُوۤا۟ أَمۡوَ ٰ⁠لَكُم بَیۡنَكُم بِٱلۡبَـٰطِلِ إِلَّاۤ أَن تَكُونَ تِجَـٰرَةً عَن تَرَاضࣲ مِّنكُمۡۚ وَلَا تَقۡتُلُوۤا۟ أَنفُسَكُمۡۚ إِنَّ ٱللَّهَ كَانَ بِكُمۡ رَحِیمࣰا\n"
    }
  },
  {
    "id": 523,
    "surahId": 4,
    "ayahNumber": 30,
    "arabicText": "وَمَن یَفۡعَلۡ ذَ ٰ⁠لِكَ عُدۡوَ ٰ⁠نࣰا وَظُلۡمࣰا فَسَوۡفَ نُصۡلِیهِ نَارࣰاۚ وَكَانَ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرًا\n",
    "translations": {
      "en": "And as for him who does this with malicious intent and a will to do wrong - him shall We, in time, cause to endure [suffering through] fire: for this is indeed easy for God.",
      "ms": "",
      "id": "",
      "ar": "وَمَن یَفۡعَلۡ ذَ ٰ⁠لِكَ عُدۡوَ ٰ⁠نࣰا وَظُلۡمࣰا فَسَوۡفَ نُصۡلِیهِ نَارࣰاۚ وَكَانَ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرًا\n"
    }
  },
  {
    "id": 524,
    "surahId": 4,
    "ayahNumber": 31,
    "arabicText": "إِن تَجۡتَنِبُوا۟ كَبَاۤىِٕرَ مَا تُنۡهَوۡنَ عَنۡهُ نُكَفِّرۡ عَنكُمۡ سَیِّـَٔاتِكُمۡ وَنُدۡخِلۡكُم مُّدۡخَلࣰا كَرِیمࣰا\n",
    "translations": {
      "en": "If you avoid the great sins, which you have been enjoined to shun, We shall efface your [minor] bad deeds, and shall cause you to enter an abode of glory.",
      "ms": "",
      "id": "",
      "ar": "إِن تَجۡتَنِبُوا۟ كَبَاۤىِٕرَ مَا تُنۡهَوۡنَ عَنۡهُ نُكَفِّرۡ عَنكُمۡ سَیِّـَٔاتِكُمۡ وَنُدۡخِلۡكُم مُّدۡخَلࣰا كَرِیمࣰا\n"
    }
  },
  {
    "id": 525,
    "surahId": 4,
    "ayahNumber": 32,
    "arabicText": "وَلَا تَتَمَنَّوۡا۟ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعۡضَكُمۡ عَلَىٰ بَعۡضࣲۚ لِّلرِّجَالِ نَصِیبࣱ مِّمَّا ٱكۡتَسَبُوا۟ۖ وَلِلنِّسَاۤءِ نَصِیبࣱ مِّمَّا ٱكۡتَسَبۡنَۚ وَسۡـَٔلُوا۟ ٱللَّهَ مِن فَضۡلِهِۦۤۚ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَیۡءٍ عَلِیمࣰا\n",
    "translations": {
      "en": "Hence, do not covet the bounties which God has bestowed more abundantly on some of you than on others. Men shall have a benefit from what they earn, and women shall have a benefit from what they earn. Ask, therefore, God [to give you] out of His bounty: behold, God has indeed full knowledge of everything.",
      "ms": "",
      "id": "",
      "ar": "وَلَا تَتَمَنَّوۡا۟ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعۡضَكُمۡ عَلَىٰ بَعۡضࣲۚ لِّلرِّجَالِ نَصِیبࣱ مِّمَّا ٱكۡتَسَبُوا۟ۖ وَلِلنِّسَاۤءِ نَصِیبࣱ مِّمَّا ٱكۡتَسَبۡنَۚ وَسۡـَٔلُوا۟ ٱللَّهَ مِن فَضۡلِهِۦۤۚ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَیۡءٍ عَلِیمࣰا\n"
    }
  },
  {
    "id": 526,
    "surahId": 4,
    "ayahNumber": 33,
    "arabicText": "وَلِكُلࣲّ جَعَلۡنَا مَوَ ٰ⁠لِیَ مِمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَۚ وَٱلَّذِینَ عَقَدَتۡ أَیۡمَـٰنُكُمۡ فَـَٔاتُوهُمۡ نَصِیبَهُمۡۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَیۡءࣲ شَهِیدًا\n",
    "translations": {
      "en": "And unto everyone have We appointed heirs to what he may leave behind: parents, and near kinsfolk, and those to whom you have pledged your troth give them, therefore, their share. Behold, God is indeed a witness unto everything.",
      "ms": "",
      "id": "",
      "ar": "وَلِكُلࣲّ جَعَلۡنَا مَوَ ٰ⁠لِیَ مِمَّا تَرَكَ ٱلۡوَ ٰ⁠لِدَانِ وَٱلۡأَقۡرَبُونَۚ وَٱلَّذِینَ عَقَدَتۡ أَیۡمَـٰنُكُمۡ فَـَٔاتُوهُمۡ نَصِیبَهُمۡۚ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَیۡءࣲ شَهِیدًا\n"
    }
  },
  {
    "id": 527,
    "surahId": 4,
    "ayahNumber": 34,
    "arabicText": "ٱلرِّجَالُ قَوَّ ٰ⁠مُونَ عَلَى ٱلنِّسَاۤءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضࣲ وَبِمَاۤ أَنفَقُوا۟ مِنۡ أَمۡوَ ٰ⁠لِهِمۡۚ فَٱلصَّـٰلِحَـٰتُ قَـٰنِتَـٰتٌ حَـٰفِظَـٰتࣱ لِّلۡغَیۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّـٰتِی تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِی ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُوا۟ عَلَیۡهِنَّ سَبِیلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِیࣰّا كَبِیرࣰا\n",
    "translations": {
      "en": "MEN SHALL take full care of women with the bounties which God has bestowed more abundantly on the former than on the latter, and with what they may spend out of their possessions. And the right­eous women are the truly devout ones, who guard the intimacy which God has [ordained to be] guar­ded. And as for those women whose ill-will you have reason to fear, admonish them [first]; then leave them alone in bed; then beat them; and if thereupon they pay you heed, do not seek to harm them. Behold, God is indeed most high, great!",
      "ms": "",
      "id": "",
      "ar": "ٱلرِّجَالُ قَوَّ ٰ⁠مُونَ عَلَى ٱلنِّسَاۤءِ بِمَا فَضَّلَ ٱللَّهُ بَعۡضَهُمۡ عَلَىٰ بَعۡضࣲ وَبِمَاۤ أَنفَقُوا۟ مِنۡ أَمۡوَ ٰ⁠لِهِمۡۚ فَٱلصَّـٰلِحَـٰتُ قَـٰنِتَـٰتٌ حَـٰفِظَـٰتࣱ لِّلۡغَیۡبِ بِمَا حَفِظَ ٱللَّهُۚ وَٱلَّـٰتِی تَخَافُونَ نُشُوزَهُنَّ فَعِظُوهُنَّ وَٱهۡجُرُوهُنَّ فِی ٱلۡمَضَاجِعِ وَٱضۡرِبُوهُنَّۖ فَإِنۡ أَطَعۡنَكُمۡ فَلَا تَبۡغُوا۟ عَلَیۡهِنَّ سَبِیلًاۗ إِنَّ ٱللَّهَ كَانَ عَلِیࣰّا كَبِیرࣰا\n"
    }
  },
  {
    "id": 528,
    "surahId": 4,
    "ayahNumber": 35,
    "arabicText": "وَإِنۡ خِفۡتُمۡ شِقَاقَ بَیۡنِهِمَا فَٱبۡعَثُوا۟ حَكَمࣰا مِّنۡ أَهۡلِهِۦ وَحَكَمࣰا مِّنۡ أَهۡلِهَاۤ إِن یُرِیدَاۤ إِصۡلَـٰحࣰا یُوَفِّقِ ٱللَّهُ بَیۡنَهُمَاۤۗ إِنَّ ٱللَّهَ كَانَ عَلِیمًا خَبِیرࣰا\n",
    "translations": {
      "en": "And if you have reason to fear that a breach might occur between a [married] couple, appoint an arbiter from among his people and an arbiter from among her people; if they both want to set things aright, God may bring about their reconciliation. Be­hold, God is indeed all-knowing, aware.",
      "ms": "",
      "id": "",
      "ar": "وَإِنۡ خِفۡتُمۡ شِقَاقَ بَیۡنِهِمَا فَٱبۡعَثُوا۟ حَكَمࣰا مِّنۡ أَهۡلِهِۦ وَحَكَمࣰا مِّنۡ أَهۡلِهَاۤ إِن یُرِیدَاۤ إِصۡلَـٰحࣰا یُوَفِّقِ ٱللَّهُ بَیۡنَهُمَاۤۗ إِنَّ ٱللَّهَ كَانَ عَلِیمًا خَبِیرࣰا\n"
    }
  },
  {
    "id": 529,
    "surahId": 4,
    "ayahNumber": 36,
    "arabicText": "۞ وَٱعۡبُدُوا۟ ٱللَّهَ وَلَا تُشۡرِكُوا۟ بِهِۦ شَیۡـࣰٔاۖ وَبِٱلۡوَ ٰ⁠لِدَیۡنِ إِحۡسَـٰنࣰا وَبِذِی ٱلۡقُرۡبَىٰ وَٱلۡیَتَـٰمَىٰ وَٱلۡمَسَـٰكِینِ وَٱلۡجَارِ ذِی ٱلۡقُرۡبَىٰ وَٱلۡجَارِ ٱلۡجُنُبِ وَٱلصَّاحِبِ بِٱلۡجَنۢبِ وَٱبۡنِ ٱلسَّبِیلِ وَمَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۗ إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ مُخۡتَالࣰا فَخُورًا\n",
    "translations": {
      "en": "AND WORSHIP God [alone], and do not ascribe divinity, in any way, to aught beside Him. And do good unto your parents, and near of kin, and unto orphans, and the needy, and the neighbour from among your own people, and the neighbour who is a stranger, and the friend by your side, and the wayfarer, and those whom you rightfully possess. Verily, God does not love any of those who, full of self-conceit, act in a boastful manner;",
      "ms": "",
      "id": "",
      "ar": "۞ وَٱعۡبُدُوا۟ ٱللَّهَ وَلَا تُشۡرِكُوا۟ بِهِۦ شَیۡـࣰٔاۖ وَبِٱلۡوَ ٰ⁠لِدَیۡنِ إِحۡسَـٰنࣰا وَبِذِی ٱلۡقُرۡبَىٰ وَٱلۡیَتَـٰمَىٰ وَٱلۡمَسَـٰكِینِ وَٱلۡجَارِ ذِی ٱلۡقُرۡبَىٰ وَٱلۡجَارِ ٱلۡجُنُبِ وَٱلصَّاحِبِ بِٱلۡجَنۢبِ وَٱبۡنِ ٱلسَّبِیلِ وَمَا مَلَكَتۡ أَیۡمَـٰنُكُمۡۗ إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ مُخۡتَالࣰا فَخُورًا\n"
    }
  },
  {
    "id": 530,
    "surahId": 4,
    "ayahNumber": 37,
    "arabicText": "ٱلَّذِینَ یَبۡخَلُونَ وَیَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِ وَیَكۡتُمُونَ مَاۤ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n",
    "translations": {
      "en": "[nor] those who are niggardly, and bid others to be niggardly, and conceal whatever God has bestowed upon them out of His bounty; and so We have readied shameful suffering for all who thus deny the truth.",
      "ms": "",
      "id": "",
      "ar": "ٱلَّذِینَ یَبۡخَلُونَ وَیَأۡمُرُونَ ٱلنَّاسَ بِٱلۡبُخۡلِ وَیَكۡتُمُونَ مَاۤ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۗ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n"
    }
  },
  {
    "id": 531,
    "surahId": 4,
    "ayahNumber": 38,
    "arabicText": "وَٱلَّذِینَ یُنفِقُونَ أَمۡوَ ٰ⁠لَهُمۡ رِئَاۤءَ ٱلنَّاسِ وَلَا یُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡیَوۡمِ ٱلۡـَٔاخِرِۗ وَمَن یَكُنِ ٱلشَّیۡطَـٰنُ لَهُۥ قَرِینࣰا فَسَاۤءَ قَرِینࣰا\n",
    "translations": {
      "en": "And [God does not love] those who spend their possessions on others [only] to be seen and praised by men, the while they believe neither in God nor in the Last Day; and he who has Satan for a soul-mate, how evil a soul-mate has he!",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذِینَ یُنفِقُونَ أَمۡوَ ٰ⁠لَهُمۡ رِئَاۤءَ ٱلنَّاسِ وَلَا یُؤۡمِنُونَ بِٱللَّهِ وَلَا بِٱلۡیَوۡمِ ٱلۡـَٔاخِرِۗ وَمَن یَكُنِ ٱلشَّیۡطَـٰنُ لَهُۥ قَرِینࣰا فَسَاۤءَ قَرِینࣰا\n"
    }
  },
  {
    "id": 532,
    "surahId": 4,
    "ayahNumber": 39,
    "arabicText": "وَمَاذَا عَلَیۡهِمۡ لَوۡ ءَامَنُوا۟ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ وَأَنفَقُوا۟ مِمَّا رَزَقَهُمُ ٱللَّهُۚ وَكَانَ ٱللَّهُ بِهِمۡ عَلِیمًا\n",
    "translations": {
      "en": "And what would they have to fear if they would but believe in God and the Last Day, and spend [in His way] out of what God has granted them as sustenance - since God has indeed full knowledge of them?",
      "ms": "",
      "id": "",
      "ar": "وَمَاذَا عَلَیۡهِمۡ لَوۡ ءَامَنُوا۟ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ وَأَنفَقُوا۟ مِمَّا رَزَقَهُمُ ٱللَّهُۚ وَكَانَ ٱللَّهُ بِهِمۡ عَلِیمًا\n"
    }
  },
  {
    "id": 533,
    "surahId": 4,
    "ayahNumber": 40,
    "arabicText": "إِنَّ ٱللَّهَ لَا یَظۡلِمُ مِثۡقَالَ ذَرَّةࣲۖ وَإِن تَكُ حَسَنَةࣰ یُضَـٰعِفۡهَا وَیُؤۡتِ مِن لَّدُنۡهُ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "Verily, God does not wrong [anyone] by as much as an atom's weight; and if there be a good deed, He will multiply it, and will bestow out of His grace a mighty reward.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱللَّهَ لَا یَظۡلِمُ مِثۡقَالَ ذَرَّةࣲۖ وَإِن تَكُ حَسَنَةࣰ یُضَـٰعِفۡهَا وَیُؤۡتِ مِن لَّدُنۡهُ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 534,
    "surahId": 4,
    "ayahNumber": 41,
    "arabicText": "فَكَیۡفَ إِذَا جِئۡنَا مِن كُلِّ أُمَّةِۭ بِشَهِیدࣲ وَجِئۡنَا بِكَ عَلَىٰ هَـٰۤؤُلَاۤءِ شَهِیدࣰا\n",
    "translations": {
      "en": "How, then, [will the sinners fare on Judgment Day,] when We shall bring forward witnesses from within every community, and bring thee [O Prophet] as witness against them?",
      "ms": "",
      "id": "",
      "ar": "فَكَیۡفَ إِذَا جِئۡنَا مِن كُلِّ أُمَّةِۭ بِشَهِیدࣲ وَجِئۡنَا بِكَ عَلَىٰ هَـٰۤؤُلَاۤءِ شَهِیدࣰا\n"
    }
  },
  {
    "id": 535,
    "surahId": 4,
    "ayahNumber": 42,
    "arabicText": "یَوۡمَىِٕذࣲ یَوَدُّ ٱلَّذِینَ كَفَرُوا۟ وَعَصَوُا۟ ٱلرَّسُولَ لَوۡ تُسَوَّىٰ بِهِمُ ٱلۡأَرۡضُ وَلَا یَكۡتُمُونَ ٱللَّهَ حَدِیثࣰا\n",
    "translations": {
      "en": "Those who were bent on denying the truth and paid no heed to the Apostle will on that Day wish that the earth would swallow them: but they shall not [be able to] conceal from God anything that has happened.",
      "ms": "",
      "id": "",
      "ar": "یَوۡمَىِٕذࣲ یَوَدُّ ٱلَّذِینَ كَفَرُوا۟ وَعَصَوُا۟ ٱلرَّسُولَ لَوۡ تُسَوَّىٰ بِهِمُ ٱلۡأَرۡضُ وَلَا یَكۡتُمُونَ ٱللَّهَ حَدِیثࣰا\n"
    }
  },
  {
    "id": 536,
    "surahId": 4,
    "ayahNumber": 43,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَقۡرَبُوا۟ ٱلصَّلَوٰةَ وَأَنتُمۡ سُكَـٰرَىٰ حَتَّىٰ تَعۡلَمُوا۟ مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِی سَبِیلٍ حَتَّىٰ تَغۡتَسِلُوا۟ۚ وَإِن كُنتُم مَّرۡضَىٰۤ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَاۤءَ أَحَدࣱ مِّنكُم مِّنَ ٱلۡغَاۤىِٕطِ أَوۡ لَـٰمَسۡتُمُ ٱلنِّسَاۤءَ فَلَمۡ تَجِدُوا۟ مَاۤءࣰ فَتَیَمَّمُوا۟ صَعِیدࣰا طَیِّبࣰا فَٱمۡسَحُوا۟ بِوُجُوهِكُمۡ وَأَیۡدِیكُمۡۗ إِنَّ ٱللَّهَ كَانَ عَفُوًّا غَفُورًا\n",
    "translations": {
      "en": "O YOU who have attained to faith! Do not attempt to pray while you are in a state of drunkenness, [but wait] until you know what you are saying; nor yet [while you are] in a state requiring total ablution, until you have bathed - except if you are travelling [and are unable to do so]. But if you are ill, or are travelling, or have just satisfied a want of nature, or have cohabited with a woman, and can find no water - then take resort to pure dust, passing [there­with] lightly over your face and your hands. Behold, God is indeed an absolver of sins, much-forgiving.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَقۡرَبُوا۟ ٱلصَّلَوٰةَ وَأَنتُمۡ سُكَـٰرَىٰ حَتَّىٰ تَعۡلَمُوا۟ مَا تَقُولُونَ وَلَا جُنُبًا إِلَّا عَابِرِی سَبِیلٍ حَتَّىٰ تَغۡتَسِلُوا۟ۚ وَإِن كُنتُم مَّرۡضَىٰۤ أَوۡ عَلَىٰ سَفَرٍ أَوۡ جَاۤءَ أَحَدࣱ مِّنكُم مِّنَ ٱلۡغَاۤىِٕطِ أَوۡ لَـٰمَسۡتُمُ ٱلنِّسَاۤءَ فَلَمۡ تَجِدُوا۟ مَاۤءࣰ فَتَیَمَّمُوا۟ صَعِیدࣰا طَیِّبࣰا فَٱمۡسَحُوا۟ بِوُجُوهِكُمۡ وَأَیۡدِیكُمۡۗ إِنَّ ٱللَّهَ كَانَ عَفُوًّا غَفُورًا\n"
    }
  },
  {
    "id": 537,
    "surahId": 4,
    "ayahNumber": 44,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ أُوتُوا۟ نَصِیبࣰا مِّنَ ٱلۡكِتَـٰبِ یَشۡتَرُونَ ٱلضَّلَـٰلَةَ وَیُرِیدُونَ أَن تَضِلُّوا۟ ٱلسَّبِیلَ\n",
    "translations": {
      "en": "ART THOU NOT aware of those who, having been granted their share of the divine writ, now barter it away for error, and want you [too] to lose your way?",
      "ms": "",
      "id": "",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ أُوتُوا۟ نَصِیبࣰا مِّنَ ٱلۡكِتَـٰبِ یَشۡتَرُونَ ٱلضَّلَـٰلَةَ وَیُرِیدُونَ أَن تَضِلُّوا۟ ٱلسَّبِیلَ\n"
    }
  },
  {
    "id": 538,
    "surahId": 4,
    "ayahNumber": 45,
    "arabicText": "وَٱللَّهُ أَعۡلَمُ بِأَعۡدَاۤىِٕكُمۡۚ وَكَفَىٰ بِٱللَّهِ وَلِیࣰّا وَكَفَىٰ بِٱللَّهِ نَصِیرࣰا\n",
    "translations": {
      "en": "But God knows best who are your enemies: and none can befriend as God does, and none can give succour as God does.",
      "ms": "",
      "id": "",
      "ar": "وَٱللَّهُ أَعۡلَمُ بِأَعۡدَاۤىِٕكُمۡۚ وَكَفَىٰ بِٱللَّهِ وَلِیࣰّا وَكَفَىٰ بِٱللَّهِ نَصِیرࣰا\n"
    }
  },
  {
    "id": 539,
    "surahId": 4,
    "ayahNumber": 46,
    "arabicText": "مِّنَ ٱلَّذِینَ هَادُوا۟ یُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَیَقُولُونَ سَمِعۡنَا وَعَصَیۡنَا وَٱسۡمَعۡ غَیۡرَ مُسۡمَعࣲ وَرَ ٰ⁠عِنَا لَیَّۢا بِأَلۡسِنَتِهِمۡ وَطَعۡنࣰا فِی ٱلدِّینِۚ وَلَوۡ أَنَّهُمۡ قَالُوا۟ سَمِعۡنَا وَأَطَعۡنَا وَٱسۡمَعۡ وَٱنظُرۡنَا لَكَانَ خَیۡرࣰا لَّهُمۡ وَأَقۡوَمَ وَلَـٰكِن لَّعَنَهُمُ ٱللَّهُ بِكُفۡرِهِمۡ فَلَا یُؤۡمِنُونَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "Among those of the Jewish faith there are some who distort the meaning of the [revealed] words, taking them out of their context and saying, [as it were,] \"We have heard, but we disobey,\" and, \"Hear without hearkening,” and, “Hearken thou unto us, (O Muhammad)” - thus making a play with their tongues, and implying that the [true] Faith is false. And had they but said, \"We have heard, and we pay heed,\" and \"Hear [us], and have patience with us,\" it would indeed have been for their own good, and more upright: but God has rejected them because of their refusal to acknowledge the truth - for it is in but few things that they believe.",
      "ms": "",
      "id": "",
      "ar": "مِّنَ ٱلَّذِینَ هَادُوا۟ یُحَرِّفُونَ ٱلۡكَلِمَ عَن مَّوَاضِعِهِۦ وَیَقُولُونَ سَمِعۡنَا وَعَصَیۡنَا وَٱسۡمَعۡ غَیۡرَ مُسۡمَعࣲ وَرَ ٰ⁠عِنَا لَیَّۢا بِأَلۡسِنَتِهِمۡ وَطَعۡنࣰا فِی ٱلدِّینِۚ وَلَوۡ أَنَّهُمۡ قَالُوا۟ سَمِعۡنَا وَأَطَعۡنَا وَٱسۡمَعۡ وَٱنظُرۡنَا لَكَانَ خَیۡرࣰا لَّهُمۡ وَأَقۡوَمَ وَلَـٰكِن لَّعَنَهُمُ ٱللَّهُ بِكُفۡرِهِمۡ فَلَا یُؤۡمِنُونَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 540,
    "surahId": 4,
    "ayahNumber": 47,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ ءَامِنُوا۟ بِمَا نَزَّلۡنَا مُصَدِّقࣰا لِّمَا مَعَكُم مِّن قَبۡلِ أَن نَّطۡمِسَ وُجُوهࣰا فَنَرُدَّهَا عَلَىٰۤ أَدۡبَارِهَاۤ أَوۡ نَلۡعَنَهُمۡ كَمَا لَعَنَّاۤ أَصۡحَـٰبَ ٱلسَّبۡتِۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولًا\n",
    "translations": {
      "en": "O you who have been granted revelation [aforetime]! Believe in what We have [now] bestowed from on high in confirmation of whatever [of the truth] you already possess, lest We efface your hopes and bring them to an end - just as We rejected those people who broke the Sabbath: for God's will is always done.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ ءَامِنُوا۟ بِمَا نَزَّلۡنَا مُصَدِّقࣰا لِّمَا مَعَكُم مِّن قَبۡلِ أَن نَّطۡمِسَ وُجُوهࣰا فَنَرُدَّهَا عَلَىٰۤ أَدۡبَارِهَاۤ أَوۡ نَلۡعَنَهُمۡ كَمَا لَعَنَّاۤ أَصۡحَـٰبَ ٱلسَّبۡتِۚ وَكَانَ أَمۡرُ ٱللَّهِ مَفۡعُولًا\n"
    }
  },
  {
    "id": 541,
    "surahId": 4,
    "ayahNumber": 48,
    "arabicText": "إِنَّ ٱللَّهَ لَا یَغۡفِرُ أَن یُشۡرَكَ بِهِۦ وَیَغۡفِرُ مَا دُونَ ذَ ٰ⁠لِكَ لِمَن یَشَاۤءُۚ وَمَن یُشۡرِكۡ بِٱللَّهِ فَقَدِ ٱفۡتَرَىٰۤ إِثۡمًا عَظِیمًا\n",
    "translations": {
      "en": "VERILY, God does not forgive the ascribing of divinity to aught beside Him, although He forgives any lesser sin unto whomever He wills: for he who ascribes divinity to aught beside God has indeed contrived an awesome sin.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱللَّهَ لَا یَغۡفِرُ أَن یُشۡرَكَ بِهِۦ وَیَغۡفِرُ مَا دُونَ ذَ ٰ⁠لِكَ لِمَن یَشَاۤءُۚ وَمَن یُشۡرِكۡ بِٱللَّهِ فَقَدِ ٱفۡتَرَىٰۤ إِثۡمًا عَظِیمًا\n"
    }
  },
  {
    "id": 542,
    "surahId": 4,
    "ayahNumber": 49,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ یُزَكُّونَ أَنفُسَهُمۚ بَلِ ٱللَّهُ یُزَكِّی مَن یَشَاۤءُ وَلَا یُظۡلَمُونَ فَتِیلًا\n",
    "translations": {
      "en": "Art thou not aware of those who consider themselves pure? Nay, but it is God who causes whomever He wills to grow in purity; and none shall be wronged by as much as a hair's breadth.",
      "ms": "",
      "id": "",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ یُزَكُّونَ أَنفُسَهُمۚ بَلِ ٱللَّهُ یُزَكِّی مَن یَشَاۤءُ وَلَا یُظۡلَمُونَ فَتِیلًا\n"
    }
  },
  {
    "id": 543,
    "surahId": 4,
    "ayahNumber": 50,
    "arabicText": "ٱنظُرۡ كَیۡفَ یَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَۖ وَكَفَىٰ بِهِۦۤ إِثۡمࣰا مُّبِینًا\n",
    "translations": {
      "en": "Behold how they attribute their own lying inventions to God - than which there is no sin more obvious.",
      "ms": "",
      "id": "",
      "ar": "ٱنظُرۡ كَیۡفَ یَفۡتَرُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَۖ وَكَفَىٰ بِهِۦۤ إِثۡمࣰا مُّبِینًا\n"
    }
  },
  {
    "id": 544,
    "surahId": 4,
    "ayahNumber": 51,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ أُوتُوا۟ نَصِیبࣰا مِّنَ ٱلۡكِتَـٰبِ یُؤۡمِنُونَ بِٱلۡجِبۡتِ وَٱلطَّـٰغُوتِ وَیَقُولُونَ لِلَّذِینَ كَفَرُوا۟ هَـٰۤؤُلَاۤءِ أَهۡدَىٰ مِنَ ٱلَّذِینَ ءَامَنُوا۟ سَبِیلًا\n",
    "translations": {
      "en": "Art thou not aware of those who, having been granted their share of the divine writ, [now] believe in baseless mysteries and in the powers of evil, and maintain that those who are bent on denying the truth are more surely guided than those who have attained to faith?",
      "ms": "",
      "id": "",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ أُوتُوا۟ نَصِیبࣰا مِّنَ ٱلۡكِتَـٰبِ یُؤۡمِنُونَ بِٱلۡجِبۡتِ وَٱلطَّـٰغُوتِ وَیَقُولُونَ لِلَّذِینَ كَفَرُوا۟ هَـٰۤؤُلَاۤءِ أَهۡدَىٰ مِنَ ٱلَّذِینَ ءَامَنُوا۟ سَبِیلًا\n"
    }
  },
  {
    "id": 545,
    "surahId": 4,
    "ayahNumber": 52,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ لَعَنَهُمُ ٱللَّهُۖ وَمَن یَلۡعَنِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ نَصِیرًا\n",
    "translations": {
      "en": "It is they whom God has rejected: and he whom God rejects shall find none to succour him.",
      "ms": "",
      "id": "",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ لَعَنَهُمُ ٱللَّهُۖ وَمَن یَلۡعَنِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ نَصِیرًا\n"
    }
  },
  {
    "id": 546,
    "surahId": 4,
    "ayahNumber": 53,
    "arabicText": "أَمۡ لَهُمۡ نَصِیبࣱ مِّنَ ٱلۡمُلۡكِ فَإِذࣰا لَّا یُؤۡتُونَ ٱلنَّاسَ نَقِیرًا\n",
    "translations": {
      "en": "Have they, perchance, a share in [God's] dominion? But [if they had], lo, they would not give to other people as much as [would fill] the groove of a date-stone!",
      "ms": "",
      "id": "",
      "ar": "أَمۡ لَهُمۡ نَصِیبࣱ مِّنَ ٱلۡمُلۡكِ فَإِذࣰا لَّا یُؤۡتُونَ ٱلنَّاسَ نَقِیرًا\n"
    }
  },
  {
    "id": 547,
    "surahId": 4,
    "ayahNumber": 54,
    "arabicText": "أَمۡ یَحۡسُدُونَ ٱلنَّاسَ عَلَىٰ مَاۤ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۖ فَقَدۡ ءَاتَیۡنَاۤ ءَالَ إِبۡرَ ٰ⁠هِیمَ ٱلۡكِتَـٰبَ وَٱلۡحِكۡمَةَ وَءَاتَیۡنَـٰهُم مُّلۡكًا عَظِیمࣰا\n",
    "translations": {
      "en": "Do they, perchance, envy other people for what God has granted them out of His bounty? But then, We did grant revelation and wisdom unto the House of Abraham, and We did bestow on them a mighty dominion:",
      "ms": "",
      "id": "",
      "ar": "أَمۡ یَحۡسُدُونَ ٱلنَّاسَ عَلَىٰ مَاۤ ءَاتَىٰهُمُ ٱللَّهُ مِن فَضۡلِهِۦۖ فَقَدۡ ءَاتَیۡنَاۤ ءَالَ إِبۡرَ ٰ⁠هِیمَ ٱلۡكِتَـٰبَ وَٱلۡحِكۡمَةَ وَءَاتَیۡنَـٰهُم مُّلۡكًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 548,
    "surahId": 4,
    "ayahNumber": 55,
    "arabicText": "فَمِنۡهُم مَّنۡ ءَامَنَ بِهِۦ وَمِنۡهُم مَّن صَدَّ عَنۡهُۚ وَكَفَىٰ بِجَهَنَّمَ سَعِیرًا\n",
    "translations": {
      "en": "and among them are such as [truly] believe in him, and among them are such as have turned away from him. And nothing could be as burning as [the fire of] hell:",
      "ms": "",
      "id": "",
      "ar": "فَمِنۡهُم مَّنۡ ءَامَنَ بِهِۦ وَمِنۡهُم مَّن صَدَّ عَنۡهُۚ وَكَفَىٰ بِجَهَنَّمَ سَعِیرًا\n"
    }
  },
  {
    "id": 549,
    "surahId": 4,
    "ayahNumber": 56,
    "arabicText": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ بِـَٔایَـٰتِنَا سَوۡفَ نُصۡلِیهِمۡ نَارࣰا كُلَّمَا نَضِجَتۡ جُلُودُهُم بَدَّلۡنَـٰهُمۡ جُلُودًا غَیۡرَهَا لِیَذُوقُوا۟ ٱلۡعَذَابَۗ إِنَّ ٱللَّهَ كَانَ عَزِیزًا حَكِیمࣰا\n",
    "translations": {
      "en": "for, verily, those who are bent on denying the truth of Our messages We shall, in time, cause to endure fire: [and] every time their skins are burnt off, We shall replace them with new skins, so that they may taste suffering [in full] Verily, God is almighty, wise.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ بِـَٔایَـٰتِنَا سَوۡفَ نُصۡلِیهِمۡ نَارࣰا كُلَّمَا نَضِجَتۡ جُلُودُهُم بَدَّلۡنَـٰهُمۡ جُلُودًا غَیۡرَهَا لِیَذُوقُوا۟ ٱلۡعَذَابَۗ إِنَّ ٱللَّهَ كَانَ عَزِیزًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 550,
    "surahId": 4,
    "ayahNumber": 57,
    "arabicText": "وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۖ لَّهُمۡ فِیهَاۤ أَزۡوَ ٰ⁠جࣱ مُّطَهَّرَةࣱۖ وَنُدۡخِلُهُمۡ ظِلࣰّا ظَلِیلًا\n",
    "translations": {
      "en": "But those who attain to faith and do righteous deeds We shall bring into gardens through which running waters flow, therein to abide beyond the count of time; there shall they have spouses pure: and [thus] We shall bring them unto happiness abounding.",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۖ لَّهُمۡ فِیهَاۤ أَزۡوَ ٰ⁠جࣱ مُّطَهَّرَةࣱۖ وَنُدۡخِلُهُمۡ ظِلࣰّا ظَلِیلًا\n"
    }
  },
  {
    "id": 551,
    "surahId": 4,
    "ayahNumber": 58,
    "arabicText": "۞ إِنَّ ٱللَّهَ یَأۡمُرُكُمۡ أَن تُؤَدُّوا۟ ٱلۡأَمَـٰنَـٰتِ إِلَىٰۤ أَهۡلِهَا وَإِذَا حَكَمۡتُم بَیۡنَ ٱلنَّاسِ أَن تَحۡكُمُوا۟ بِٱلۡعَدۡلِۚ إِنَّ ٱللَّهَ نِعِمَّا یَعِظُكُم بِهِۦۤۗ إِنَّ ٱللَّهَ كَانَ سَمِیعَۢا بَصِیرࣰا\n",
    "translations": {
      "en": "BEHOLD, God bids you to deliver all that you have been entrusted with unto those who are entitled thereto, and whenever you judge between people, to judge with justice. Verily, most excellent is what God exhorts you to do: verily, God is all-hearing, all-seeing!",
      "ms": "",
      "id": "",
      "ar": "۞ إِنَّ ٱللَّهَ یَأۡمُرُكُمۡ أَن تُؤَدُّوا۟ ٱلۡأَمَـٰنَـٰتِ إِلَىٰۤ أَهۡلِهَا وَإِذَا حَكَمۡتُم بَیۡنَ ٱلنَّاسِ أَن تَحۡكُمُوا۟ بِٱلۡعَدۡلِۚ إِنَّ ٱللَّهَ نِعِمَّا یَعِظُكُم بِهِۦۤۗ إِنَّ ٱللَّهَ كَانَ سَمِیعَۢا بَصِیرࣰا\n"
    }
  },
  {
    "id": 552,
    "surahId": 4,
    "ayahNumber": 59,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَطِیعُوا۟ ٱللَّهَ وَأَطِیعُوا۟ ٱلرَّسُولَ وَأُو۟لِی ٱلۡأَمۡرِ مِنكُمۡۖ فَإِن تَنَـٰزَعۡتُمۡ فِی شَیۡءࣲ فَرُدُّوهُ إِلَى ٱللَّهِ وَٱلرَّسُولِ إِن كُنتُمۡ تُؤۡمِنُونَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِۚ ذَ ٰ⁠لِكَ خَیۡرࣱ وَأَحۡسَنُ تَأۡوِیلًا\n",
    "translations": {
      "en": "O you who have attained to faith! Pay heed unto God, and pay heed unto the Apostle and unto those from among you who have been entrusted with authority; and if you are at variance over any matter, refer it unto God and the Apostle, if you [truly] believe in God and the Last Day. This is the best [for you], and best in the end.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَطِیعُوا۟ ٱللَّهَ وَأَطِیعُوا۟ ٱلرَّسُولَ وَأُو۟لِی ٱلۡأَمۡرِ مِنكُمۡۖ فَإِن تَنَـٰزَعۡتُمۡ فِی شَیۡءࣲ فَرُدُّوهُ إِلَى ٱللَّهِ وَٱلرَّسُولِ إِن كُنتُمۡ تُؤۡمِنُونَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِۚ ذَ ٰ⁠لِكَ خَیۡرࣱ وَأَحۡسَنُ تَأۡوِیلًا\n"
    }
  },
  {
    "id": 553,
    "surahId": 4,
    "ayahNumber": 60,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ یَزۡعُمُونَ أَنَّهُمۡ ءَامَنُوا۟ بِمَاۤ أُنزِلَ إِلَیۡكَ وَمَاۤ أُنزِلَ مِن قَبۡلِكَ یُرِیدُونَ أَن یَتَحَاكَمُوۤا۟ إِلَى ٱلطَّـٰغُوتِ وَقَدۡ أُمِرُوۤا۟ أَن یَكۡفُرُوا۟ بِهِۦۖ وَیُرِیدُ ٱلشَّیۡطَـٰنُ أَن یُضِلَّهُمۡ ضَلَـٰلَۢا بَعِیدࣰا\n",
    "translations": {
      "en": "ART THOU NOT aware of those who claim that they believe in what has been bestowed from on high upon thee, [O Prophet,] as well as in what was bestowed from on high before thee, [and yet] are willing to defer to the rule of the powers of evil - although they were bidden to deny it, seeing that Satan but wants to lead them far astray?",
      "ms": "",
      "id": "",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ یَزۡعُمُونَ أَنَّهُمۡ ءَامَنُوا۟ بِمَاۤ أُنزِلَ إِلَیۡكَ وَمَاۤ أُنزِلَ مِن قَبۡلِكَ یُرِیدُونَ أَن یَتَحَاكَمُوۤا۟ إِلَى ٱلطَّـٰغُوتِ وَقَدۡ أُمِرُوۤا۟ أَن یَكۡفُرُوا۟ بِهِۦۖ وَیُرِیدُ ٱلشَّیۡطَـٰنُ أَن یُضِلَّهُمۡ ضَلَـٰلَۢا بَعِیدࣰا\n"
    }
  },
  {
    "id": 554,
    "surahId": 4,
    "ayahNumber": 61,
    "arabicText": "وَإِذَا قِیلَ لَهُمۡ تَعَالَوۡا۟ إِلَىٰ مَاۤ أَنزَلَ ٱللَّهُ وَإِلَى ٱلرَّسُولِ رَأَیۡتَ ٱلۡمُنَـٰفِقِینَ یَصُدُّونَ عَنكَ صُدُودࣰا\n",
    "translations": {
      "en": "And so, whenever they are told, \"Come unto that which God has be­stowed from on high, and unto the Apostle,\" thou canst see these hypocrites turn away from thee with aversion.",
      "ms": "",
      "id": "",
      "ar": "وَإِذَا قِیلَ لَهُمۡ تَعَالَوۡا۟ إِلَىٰ مَاۤ أَنزَلَ ٱللَّهُ وَإِلَى ٱلرَّسُولِ رَأَیۡتَ ٱلۡمُنَـٰفِقِینَ یَصُدُّونَ عَنكَ صُدُودࣰا\n"
    }
  },
  {
    "id": 555,
    "surahId": 4,
    "ayahNumber": 62,
    "arabicText": "فَكَیۡفَ إِذَاۤ أَصَـٰبَتۡهُم مُّصِیبَةُۢ بِمَا قَدَّمَتۡ أَیۡدِیهِمۡ ثُمَّ جَاۤءُوكَ یَحۡلِفُونَ بِٱللَّهِ إِنۡ أَرَدۡنَاۤ إِلَّاۤ إِحۡسَـٰنࣰا وَتَوۡفِیقًا\n",
    "translations": {
      "en": "But how [will they fare] when calamity befalls them [on the Day of Judgment] because of what they have wrought in this world - whereupon they will come to thee, swearing by God, \"Our aim was but to do good, and to bring about harmony\"?",
      "ms": "",
      "id": "",
      "ar": "فَكَیۡفَ إِذَاۤ أَصَـٰبَتۡهُم مُّصِیبَةُۢ بِمَا قَدَّمَتۡ أَیۡدِیهِمۡ ثُمَّ جَاۤءُوكَ یَحۡلِفُونَ بِٱللَّهِ إِنۡ أَرَدۡنَاۤ إِلَّاۤ إِحۡسَـٰنࣰا وَتَوۡفِیقًا\n"
    }
  },
  {
    "id": 556,
    "surahId": 4,
    "ayahNumber": 63,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ یَعۡلَمُ ٱللَّهُ مَا فِی قُلُوبِهِمۡ فَأَعۡرِضۡ عَنۡهُمۡ وَعِظۡهُمۡ وَقُل لَّهُمۡ فِیۤ أَنفُسِهِمۡ قَوۡلَۢا بَلِیغࣰا\n",
    "translations": {
      "en": "As for them - God knows all that is in their hearts; so leave them alone, and admonish them, and speak unto them about themselves in a gravely search­ing manner:",
      "ms": "",
      "id": "",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ یَعۡلَمُ ٱللَّهُ مَا فِی قُلُوبِهِمۡ فَأَعۡرِضۡ عَنۡهُمۡ وَعِظۡهُمۡ وَقُل لَّهُمۡ فِیۤ أَنفُسِهِمۡ قَوۡلَۢا بَلِیغࣰا\n"
    }
  },
  {
    "id": 557,
    "surahId": 4,
    "ayahNumber": 64,
    "arabicText": "وَمَاۤ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا لِیُطَاعَ بِإِذۡنِ ٱللَّهِۚ وَلَوۡ أَنَّهُمۡ إِذ ظَّلَمُوۤا۟ أَنفُسَهُمۡ جَاۤءُوكَ فَٱسۡتَغۡفَرُوا۟ ٱللَّهَ وَٱسۡتَغۡفَرَ لَهُمُ ٱلرَّسُولُ لَوَجَدُوا۟ ٱللَّهَ تَوَّابࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "for We have never sent any apostle save that he should be heeded by God's leave. If, then, after having sinned against themselves, they would but come round to thee and ask God to forgive them - with the Apostle, too, praying that they be forgiven - they would assuredly find that God is an acceptor of repentance, a dispenser of grace.",
      "ms": "",
      "id": "",
      "ar": "وَمَاۤ أَرۡسَلۡنَا مِن رَّسُولٍ إِلَّا لِیُطَاعَ بِإِذۡنِ ٱللَّهِۚ وَلَوۡ أَنَّهُمۡ إِذ ظَّلَمُوۤا۟ أَنفُسَهُمۡ جَاۤءُوكَ فَٱسۡتَغۡفَرُوا۟ ٱللَّهَ وَٱسۡتَغۡفَرَ لَهُمُ ٱلرَّسُولُ لَوَجَدُوا۟ ٱللَّهَ تَوَّابࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 558,
    "surahId": 4,
    "ayahNumber": 65,
    "arabicText": "فَلَا وَرَبِّكَ لَا یُؤۡمِنُونَ حَتَّىٰ یُحَكِّمُوكَ فِیمَا شَجَرَ بَیۡنَهُمۡ ثُمَّ لَا یَجِدُوا۟ فِیۤ أَنفُسِهِمۡ حَرَجࣰا مِّمَّا قَضَیۡتَ وَیُسَلِّمُوا۟ تَسۡلِیمࣰا\n",
    "translations": {
      "en": "But nay, by thy Sustainer! They do not [really] believe unless they make thee [O Prophet] a judge of all on which they disagree among themselves, and then find in their hearts no bar to an acceptance of thy decision and give themselves up [to it] in utter self-surrender.",
      "ms": "",
      "id": "",
      "ar": "فَلَا وَرَبِّكَ لَا یُؤۡمِنُونَ حَتَّىٰ یُحَكِّمُوكَ فِیمَا شَجَرَ بَیۡنَهُمۡ ثُمَّ لَا یَجِدُوا۟ فِیۤ أَنفُسِهِمۡ حَرَجࣰا مِّمَّا قَضَیۡتَ وَیُسَلِّمُوا۟ تَسۡلِیمࣰا\n"
    }
  },
  {
    "id": 559,
    "surahId": 4,
    "ayahNumber": 66,
    "arabicText": "وَلَوۡ أَنَّا كَتَبۡنَا عَلَیۡهِمۡ أَنِ ٱقۡتُلُوۤا۟ أَنفُسَكُمۡ أَوِ ٱخۡرُجُوا۟ مِن دِیَـٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِیلࣱ مِّنۡهُمۡۖ وَلَوۡ أَنَّهُمۡ فَعَلُوا۟ مَا یُوعَظُونَ بِهِۦ لَكَانَ خَیۡرࣰا لَّهُمۡ وَأَشَدَّ تَثۡبِیتࣰا\n",
    "translations": {
      "en": "Yet if We were to ordain for them, \"Lay down your lives,\" or, \"Forsake your homelands,\" only a very few of them would do it - although, if they did what they are admonished to do, it would indeed be for their own good and apt to strengthen them greatly [in faith],",
      "ms": "",
      "id": "",
      "ar": "وَلَوۡ أَنَّا كَتَبۡنَا عَلَیۡهِمۡ أَنِ ٱقۡتُلُوۤا۟ أَنفُسَكُمۡ أَوِ ٱخۡرُجُوا۟ مِن دِیَـٰرِكُم مَّا فَعَلُوهُ إِلَّا قَلِیلࣱ مِّنۡهُمۡۖ وَلَوۡ أَنَّهُمۡ فَعَلُوا۟ مَا یُوعَظُونَ بِهِۦ لَكَانَ خَیۡرࣰا لَّهُمۡ وَأَشَدَّ تَثۡبِیتࣰا\n"
    }
  },
  {
    "id": 560,
    "surahId": 4,
    "ayahNumber": 67,
    "arabicText": "وَإِذࣰا لَّـَٔاتَیۡنَـٰهُم مِّن لَّدُنَّاۤ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "whereupon We should indeed grant them, out of Our grace, a mighty reward,",
      "ms": "",
      "id": "",
      "ar": "وَإِذࣰا لَّـَٔاتَیۡنَـٰهُم مِّن لَّدُنَّاۤ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 561,
    "surahId": 4,
    "ayahNumber": 68,
    "arabicText": "وَلَهَدَیۡنَـٰهُمۡ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n",
    "translations": {
      "en": "and indeed guide them onto a straight way.",
      "ms": "",
      "id": "",
      "ar": "وَلَهَدَیۡنَـٰهُمۡ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n"
    }
  },
  {
    "id": 562,
    "surahId": 4,
    "ayahNumber": 69,
    "arabicText": "وَمَن یُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُو۟لَـٰۤىِٕكَ مَعَ ٱلَّذِینَ أَنۡعَمَ ٱللَّهُ عَلَیۡهِم مِّنَ ٱلنَّبِیِّـۧنَ وَٱلصِّدِّیقِینَ وَٱلشُّهَدَاۤءِ وَٱلصَّـٰلِحِینَۚ وَحَسُنَ أُو۟لَـٰۤىِٕكَ رَفِیقࣰا\n",
    "translations": {
      "en": "For, all who pay heed unto God and the Apostle shall be among those upon whom God has bestowed His blessings: the prophets, and those who never deviated from the truth, and those who [with their lives] bore witness to the truth, and the right­eous ones: and how goodly a company are these!",
      "ms": "",
      "id": "",
      "ar": "وَمَن یُطِعِ ٱللَّهَ وَٱلرَّسُولَ فَأُو۟لَـٰۤىِٕكَ مَعَ ٱلَّذِینَ أَنۡعَمَ ٱللَّهُ عَلَیۡهِم مِّنَ ٱلنَّبِیِّـۧنَ وَٱلصِّدِّیقِینَ وَٱلشُّهَدَاۤءِ وَٱلصَّـٰلِحِینَۚ وَحَسُنَ أُو۟لَـٰۤىِٕكَ رَفِیقࣰا\n"
    }
  },
  {
    "id": 563,
    "surahId": 4,
    "ayahNumber": 70,
    "arabicText": "ذَ ٰ⁠لِكَ ٱلۡفَضۡلُ مِنَ ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ عَلِیمࣰا\n",
    "translations": {
      "en": "Such is the bounty of God - and none has the knowledge which God has.",
      "ms": "",
      "id": "",
      "ar": "ذَ ٰ⁠لِكَ ٱلۡفَضۡلُ مِنَ ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ عَلِیمࣰا\n"
    }
  },
  {
    "id": 564,
    "surahId": 4,
    "ayahNumber": 71,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ خُذُوا۟ حِذۡرَكُمۡ فَٱنفِرُوا۟ ثُبَاتٍ أَوِ ٱنفِرُوا۟ جَمِیعࣰا\n",
    "translations": {
      "en": "O YOU who have attained to faith! Be fully prepared against danger, whether you go to war in small groups or all together.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ خُذُوا۟ حِذۡرَكُمۡ فَٱنفِرُوا۟ ثُبَاتٍ أَوِ ٱنفِرُوا۟ جَمِیعࣰا\n"
    }
  },
  {
    "id": 565,
    "surahId": 4,
    "ayahNumber": 72,
    "arabicText": "وَإِنَّ مِنكُمۡ لَمَن لَّیُبَطِّئَنَّ فَإِنۡ أَصَـٰبَتۡكُم مُّصِیبَةࣱ قَالَ قَدۡ أَنۡعَمَ ٱللَّهُ عَلَیَّ إِذۡ لَمۡ أَكُن مَّعَهُمۡ شَهِیدࣰا\n",
    "translations": {
      "en": "And, behold, there are indeed among you such as would lag behind, and then, if calamity befalls you, say, \"God has bestowed His favour upon me in that I did not accompany them.\"",
      "ms": "",
      "id": "",
      "ar": "وَإِنَّ مِنكُمۡ لَمَن لَّیُبَطِّئَنَّ فَإِنۡ أَصَـٰبَتۡكُم مُّصِیبَةࣱ قَالَ قَدۡ أَنۡعَمَ ٱللَّهُ عَلَیَّ إِذۡ لَمۡ أَكُن مَّعَهُمۡ شَهِیدࣰا\n"
    }
  },
  {
    "id": 566,
    "surahId": 4,
    "ayahNumber": 73,
    "arabicText": "وَلَىِٕنۡ أَصَـٰبَكُمۡ فَضۡلࣱ مِّنَ ٱللَّهِ لَیَقُولَنَّ كَأَن لَّمۡ تَكُنۢ بَیۡنَكُمۡ وَبَیۡنَهُۥ مَوَدَّةࣱ یَـٰلَیۡتَنِی كُنتُ مَعَهُمۡ فَأَفُوزَ فَوۡزًا عَظِیمࣰا\n",
    "translations": {
      "en": "But if good fortune comes to you from God, such a person is sure to say - just as if there had never been any question of love between you and him -: \"Oh, would that I had been with them, and thus had a [share in their] mighty triumph!\"",
      "ms": "",
      "id": "",
      "ar": "وَلَىِٕنۡ أَصَـٰبَكُمۡ فَضۡلࣱ مِّنَ ٱللَّهِ لَیَقُولَنَّ كَأَن لَّمۡ تَكُنۢ بَیۡنَكُمۡ وَبَیۡنَهُۥ مَوَدَّةࣱ یَـٰلَیۡتَنِی كُنتُ مَعَهُمۡ فَأَفُوزَ فَوۡزًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 567,
    "surahId": 4,
    "ayahNumber": 74,
    "arabicText": "۞ فَلۡیُقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ ٱلَّذِینَ یَشۡرُونَ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا بِٱلۡـَٔاخِرَةِۚ وَمَن یُقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ فَیُقۡتَلۡ أَوۡ یَغۡلِبۡ فَسَوۡفَ نُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "Hence, let them fight in God's cause - all who are willing to barter the life of this world for the life to come: for unto him who fights in God's cause, whether he be slain or be victorious, We shall in time grant a mighty reward.",
      "ms": "",
      "id": "",
      "ar": "۞ فَلۡیُقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ ٱلَّذِینَ یَشۡرُونَ ٱلۡحَیَوٰةَ ٱلدُّنۡیَا بِٱلۡـَٔاخِرَةِۚ وَمَن یُقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ فَیُقۡتَلۡ أَوۡ یَغۡلِبۡ فَسَوۡفَ نُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 568,
    "surahId": 4,
    "ayahNumber": 75,
    "arabicText": "وَمَا لَكُمۡ لَا تُقَـٰتِلُونَ فِی سَبِیلِ ٱللَّهِ وَٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلرِّجَالِ وَٱلنِّسَاۤءِ وَٱلۡوِلۡدَ ٰ⁠نِ ٱلَّذِینَ یَقُولُونَ رَبَّنَاۤ أَخۡرِجۡنَا مِنۡ هَـٰذِهِ ٱلۡقَرۡیَةِ ٱلظَّالِمِ أَهۡلُهَا وَٱجۡعَل لَّنَا مِن لَّدُنكَ وَلِیࣰّا وَٱجۡعَل لَّنَا مِن لَّدُنكَ نَصِیرًا\n",
    "translations": {
      "en": "And how could you refuse to fight in the cause of God and of the utterly helpless men and women and children who are crying, \"O our Sustainer! Lead us forth [to freedom] out of this land whose people are oppressors, and raise for us, out of Thy grace, a protector, and raise for us, out of Thy grace, one who will bring us succour!\"",
      "ms": "",
      "id": "",
      "ar": "وَمَا لَكُمۡ لَا تُقَـٰتِلُونَ فِی سَبِیلِ ٱللَّهِ وَٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلرِّجَالِ وَٱلنِّسَاۤءِ وَٱلۡوِلۡدَ ٰ⁠نِ ٱلَّذِینَ یَقُولُونَ رَبَّنَاۤ أَخۡرِجۡنَا مِنۡ هَـٰذِهِ ٱلۡقَرۡیَةِ ٱلظَّالِمِ أَهۡلُهَا وَٱجۡعَل لَّنَا مِن لَّدُنكَ وَلِیࣰّا وَٱجۡعَل لَّنَا مِن لَّدُنكَ نَصِیرًا\n"
    }
  },
  {
    "id": 569,
    "surahId": 4,
    "ayahNumber": 76,
    "arabicText": "ٱلَّذِینَ ءَامَنُوا۟ یُقَـٰتِلُونَ فِی سَبِیلِ ٱللَّهِۖ وَٱلَّذِینَ كَفَرُوا۟ یُقَـٰتِلُونَ فِی سَبِیلِ ٱلطَّـٰغُوتِ فَقَـٰتِلُوۤا۟ أَوۡلِیَاۤءَ ٱلشَّیۡطَـٰنِۖ إِنَّ كَیۡدَ ٱلشَّیۡطَـٰنِ كَانَ ضَعِیفًا\n",
    "translations": {
      "en": "Those who have attained to faith fight in the cause of God, whereas those who are bent on denying the truth fight in the cause of the powers of evil. Fight, then, against those friends of Satan: verily, Satan's guile is weak indeed!",
      "ms": "",
      "id": "",
      "ar": "ٱلَّذِینَ ءَامَنُوا۟ یُقَـٰتِلُونَ فِی سَبِیلِ ٱللَّهِۖ وَٱلَّذِینَ كَفَرُوا۟ یُقَـٰتِلُونَ فِی سَبِیلِ ٱلطَّـٰغُوتِ فَقَـٰتِلُوۤا۟ أَوۡلِیَاۤءَ ٱلشَّیۡطَـٰنِۖ إِنَّ كَیۡدَ ٱلشَّیۡطَـٰنِ كَانَ ضَعِیفًا\n"
    }
  },
  {
    "id": 570,
    "surahId": 4,
    "ayahNumber": 77,
    "arabicText": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ قِیلَ لَهُمۡ كُفُّوۤا۟ أَیۡدِیَكُمۡ وَأَقِیمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَیۡهِمُ ٱلۡقِتَالُ إِذَا فَرِیقࣱ مِّنۡهُمۡ یَخۡشَوۡنَ ٱلنَّاسَ كَخَشۡیَةِ ٱللَّهِ أَوۡ أَشَدَّ خَشۡیَةࣰۚ وَقَالُوا۟ رَبَّنَا لِمَ كَتَبۡتَ عَلَیۡنَا ٱلۡقِتَالَ لَوۡلَاۤ أَخَّرۡتَنَاۤ إِلَىٰۤ أَجَلࣲ قَرِیبࣲۗ قُلۡ مَتَـٰعُ ٱلدُّنۡیَا قَلِیلࣱ وَٱلۡـَٔاخِرَةُ خَیۡرࣱ لِّمَنِ ٱتَّقَىٰ وَلَا تُظۡلَمُونَ فَتِیلًا\n",
    "translations": {
      "en": "ART THOU NOT aware of those who have been told, \"Curb your hands, and be constant in prayer, and render the purifying dues\"? But as soon as fighting [in God's cause] is ordained for them, lo, some of them stand in awe of men as one should stand in awe of God - or in even greater awe - and say, \"O our Sustainer! Why hast Thou ordained fighting for us? If only Thou hadst granted us a delay for a little while!\" Say: \"Brief is the enjoyment of this world, whereas the life to come is the best for all who are conscious of God - since none of you shall be wronged by as much as a hair's breadth.",
      "ms": "",
      "id": "",
      "ar": "أَلَمۡ تَرَ إِلَى ٱلَّذِینَ قِیلَ لَهُمۡ كُفُّوۤا۟ أَیۡدِیَكُمۡ وَأَقِیمُوا۟ ٱلصَّلَوٰةَ وَءَاتُوا۟ ٱلزَّكَوٰةَ فَلَمَّا كُتِبَ عَلَیۡهِمُ ٱلۡقِتَالُ إِذَا فَرِیقࣱ مِّنۡهُمۡ یَخۡشَوۡنَ ٱلنَّاسَ كَخَشۡیَةِ ٱللَّهِ أَوۡ أَشَدَّ خَشۡیَةࣰۚ وَقَالُوا۟ رَبَّنَا لِمَ كَتَبۡتَ عَلَیۡنَا ٱلۡقِتَالَ لَوۡلَاۤ أَخَّرۡتَنَاۤ إِلَىٰۤ أَجَلࣲ قَرِیبࣲۗ قُلۡ مَتَـٰعُ ٱلدُّنۡیَا قَلِیلࣱ وَٱلۡـَٔاخِرَةُ خَیۡرࣱ لِّمَنِ ٱتَّقَىٰ وَلَا تُظۡلَمُونَ فَتِیلًا\n"
    }
  },
  {
    "id": 571,
    "surahId": 4,
    "ayahNumber": 78,
    "arabicText": "أَیۡنَمَا تَكُونُوا۟ یُدۡرِككُّمُ ٱلۡمَوۡتُ وَلَوۡ كُنتُمۡ فِی بُرُوجࣲ مُّشَیَّدَةࣲۗ وَإِن تُصِبۡهُمۡ حَسَنَةࣱ یَقُولُوا۟ هَـٰذِهِۦ مِنۡ عِندِ ٱللَّهِۖ وَإِن تُصِبۡهُمۡ سَیِّئَةࣱ یَقُولُوا۟ هَـٰذِهِۦ مِنۡ عِندِكَۚ قُلۡ كُلࣱّ مِّنۡ عِندِ ٱللَّهِۖ فَمَالِ هَـٰۤؤُلَاۤءِ ٱلۡقَوۡمِ لَا یَكَادُونَ یَفۡقَهُونَ حَدِیثࣰا\n",
    "translations": {
      "en": "Wherever you may be, death will overtake you - even though you be in towers raised high. \"Yet, when a good thing happens to them, some [people] say, \"This is from God,\" whereas when evil befalls them, they say, \"This is from thee [O fellow­man]!” Say: \"All is from God.\" What, then, is amiss with these people that they are in no wise near to grasping the truth of what they are told?",
      "ms": "",
      "id": "",
      "ar": "أَیۡنَمَا تَكُونُوا۟ یُدۡرِككُّمُ ٱلۡمَوۡتُ وَلَوۡ كُنتُمۡ فِی بُرُوجࣲ مُّشَیَّدَةࣲۗ وَإِن تُصِبۡهُمۡ حَسَنَةࣱ یَقُولُوا۟ هَـٰذِهِۦ مِنۡ عِندِ ٱللَّهِۖ وَإِن تُصِبۡهُمۡ سَیِّئَةࣱ یَقُولُوا۟ هَـٰذِهِۦ مِنۡ عِندِكَۚ قُلۡ كُلࣱّ مِّنۡ عِندِ ٱللَّهِۖ فَمَالِ هَـٰۤؤُلَاۤءِ ٱلۡقَوۡمِ لَا یَكَادُونَ یَفۡقَهُونَ حَدِیثࣰا\n"
    }
  },
  {
    "id": 572,
    "surahId": 4,
    "ayahNumber": 79,
    "arabicText": "مَّاۤ أَصَابَكَ مِنۡ حَسَنَةࣲ فَمِنَ ٱللَّهِۖ وَمَاۤ أَصَابَكَ مِن سَیِّئَةࣲ فَمِن نَّفۡسِكَۚ وَأَرۡسَلۡنَـٰكَ لِلنَّاسِ رَسُولࣰاۚ وَكَفَىٰ بِٱللَّهِ شَهِیدࣰا\n",
    "translations": {
      "en": "Whatever good happens to thee is from God; and whatever evil befalls thee is from thyself. AND WE have sent thee [O Muhammad] as an apostle unto all mankind: and none can bear witness [thereto] as God does.",
      "ms": "",
      "id": "",
      "ar": "مَّاۤ أَصَابَكَ مِنۡ حَسَنَةࣲ فَمِنَ ٱللَّهِۖ وَمَاۤ أَصَابَكَ مِن سَیِّئَةࣲ فَمِن نَّفۡسِكَۚ وَأَرۡسَلۡنَـٰكَ لِلنَّاسِ رَسُولࣰاۚ وَكَفَىٰ بِٱللَّهِ شَهِیدࣰا\n"
    }
  },
  {
    "id": 573,
    "surahId": 4,
    "ayahNumber": 80,
    "arabicText": "مَّن یُطِعِ ٱلرَّسُولَ فَقَدۡ أَطَاعَ ٱللَّهَۖ وَمَن تَوَلَّىٰ فَمَاۤ أَرۡسَلۡنَـٰكَ عَلَیۡهِمۡ حَفِیظࣰا\n",
    "translations": {
      "en": "Whoever pays heed unto the Apostle pays heed unto God thereby; and as for those who turn away - We have not sent thee to be their keeper.",
      "ms": "",
      "id": "",
      "ar": "مَّن یُطِعِ ٱلرَّسُولَ فَقَدۡ أَطَاعَ ٱللَّهَۖ وَمَن تَوَلَّىٰ فَمَاۤ أَرۡسَلۡنَـٰكَ عَلَیۡهِمۡ حَفِیظࣰا\n"
    }
  },
  {
    "id": 574,
    "surahId": 4,
    "ayahNumber": 81,
    "arabicText": "وَیَقُولُونَ طَاعَةࣱ فَإِذَا بَرَزُوا۟ مِنۡ عِندِكَ بَیَّتَ طَاۤىِٕفَةࣱ مِّنۡهُمۡ غَیۡرَ ٱلَّذِی تَقُولُۖ وَٱللَّهُ یَكۡتُبُ مَا یُبَیِّتُونَۖ فَأَعۡرِضۡ عَنۡهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا\n",
    "translations": {
      "en": "And they say, \"We do pay heed unto thee'' - but when they leave thy presence, some of them devise, in the dark of night, [beliefs] other than thou art voicing; and all the while God records what they thus devise in the dark of night. Leave them, then, alone, and place thy trust in God: for none is as worthy of trust as God.",
      "ms": "",
      "id": "",
      "ar": "وَیَقُولُونَ طَاعَةࣱ فَإِذَا بَرَزُوا۟ مِنۡ عِندِكَ بَیَّتَ طَاۤىِٕفَةࣱ مِّنۡهُمۡ غَیۡرَ ٱلَّذِی تَقُولُۖ وَٱللَّهُ یَكۡتُبُ مَا یُبَیِّتُونَۖ فَأَعۡرِضۡ عَنۡهُمۡ وَتَوَكَّلۡ عَلَى ٱللَّهِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا\n"
    }
  },
  {
    "id": 575,
    "surahId": 4,
    "ayahNumber": 82,
    "arabicText": "أَفَلَا یَتَدَبَّرُونَ ٱلۡقُرۡءَانَۚ وَلَوۡ كَانَ مِنۡ عِندِ غَیۡرِ ٱللَّهِ لَوَجَدُوا۟ فِیهِ ٱخۡتِلَـٰفࣰا كَثِیرࣰا\n",
    "translations": {
      "en": "Will they not, then, try to understand this Qur’an? Had it issued from any but God, they would surely have found in it many an inner contradiction!",
      "ms": "",
      "id": "",
      "ar": "أَفَلَا یَتَدَبَّرُونَ ٱلۡقُرۡءَانَۚ وَلَوۡ كَانَ مِنۡ عِندِ غَیۡرِ ٱللَّهِ لَوَجَدُوا۟ فِیهِ ٱخۡتِلَـٰفࣰا كَثِیرࣰا\n"
    }
  },
  {
    "id": 576,
    "surahId": 4,
    "ayahNumber": 83,
    "arabicText": "وَإِذَا جَاۤءَهُمۡ أَمۡرࣱ مِّنَ ٱلۡأَمۡنِ أَوِ ٱلۡخَوۡفِ أَذَاعُوا۟ بِهِۦۖ وَلَوۡ رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰۤ أُو۟لِی ٱلۡأَمۡرِ مِنۡهُمۡ لَعَلِمَهُ ٱلَّذِینَ یَسۡتَنۢبِطُونَهُۥ مِنۡهُمۡۗ وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَیۡكُمۡ وَرَحۡمَتُهُۥ لَٱتَّبَعۡتُمُ ٱلشَّیۡطَـٰنَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "AND IF any [secret] matter pertaining to peace or war comes within their ken, they spread it abroad - whereas, if they would but refer it unto the Apostle and unto those from among the believers who have been entrusted with authority, such of them as are engaged in obtaining intelligence would indeed know [what to do with] it And but for God's bounty towards you, and His grace, all but a few of you would certainly have followed Satan.",
      "ms": "",
      "id": "",
      "ar": "وَإِذَا جَاۤءَهُمۡ أَمۡرࣱ مِّنَ ٱلۡأَمۡنِ أَوِ ٱلۡخَوۡفِ أَذَاعُوا۟ بِهِۦۖ وَلَوۡ رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰۤ أُو۟لِی ٱلۡأَمۡرِ مِنۡهُمۡ لَعَلِمَهُ ٱلَّذِینَ یَسۡتَنۢبِطُونَهُۥ مِنۡهُمۡۗ وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَیۡكُمۡ وَرَحۡمَتُهُۥ لَٱتَّبَعۡتُمُ ٱلشَّیۡطَـٰنَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 577,
    "surahId": 4,
    "ayahNumber": 84,
    "arabicText": "فَقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ لَا تُكَلَّفُ إِلَّا نَفۡسَكَۚ وَحَرِّضِ ٱلۡمُؤۡمِنِینَۖ عَسَى ٱللَّهُ أَن یَكُفَّ بَأۡسَ ٱلَّذِینَ كَفَرُوا۟ۚ وَٱللَّهُ أَشَدُّ بَأۡسࣰا وَأَشَدُّ تَنكِیلࣰا\n",
    "translations": {
      "en": "Fight thou, then, in God's cause - since thou art but responsible for thine own self - and inspire the believers to overcome all fear of death. God may well curb the might of those who are bent on denying the truth: for God is stronger in might, and stronger in ability to deter.",
      "ms": "",
      "id": "",
      "ar": "فَقَـٰتِلۡ فِی سَبِیلِ ٱللَّهِ لَا تُكَلَّفُ إِلَّا نَفۡسَكَۚ وَحَرِّضِ ٱلۡمُؤۡمِنِینَۖ عَسَى ٱللَّهُ أَن یَكُفَّ بَأۡسَ ٱلَّذِینَ كَفَرُوا۟ۚ وَٱللَّهُ أَشَدُّ بَأۡسࣰا وَأَشَدُّ تَنكِیلࣰا\n"
    }
  },
  {
    "id": 578,
    "surahId": 4,
    "ayahNumber": 85,
    "arabicText": "مَّن یَشۡفَعۡ شَفَـٰعَةً حَسَنَةࣰ یَكُن لَّهُۥ نَصِیبࣱ مِّنۡهَاۖ وَمَن یَشۡفَعۡ شَفَـٰعَةࣰ سَیِّئَةࣰ یَكُن لَّهُۥ كِفۡلࣱ مِّنۡهَاۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ مُّقِیتࣰا\n",
    "translations": {
      "en": "Whoever rallies to a good cause shall have a share in its blessings; and whoever rallies to an evil cause shall be answerable for his part in it: for, indeed, God watches over everything.",
      "ms": "",
      "id": "",
      "ar": "مَّن یَشۡفَعۡ شَفَـٰعَةً حَسَنَةࣰ یَكُن لَّهُۥ نَصِیبࣱ مِّنۡهَاۖ وَمَن یَشۡفَعۡ شَفَـٰعَةࣰ سَیِّئَةࣰ یَكُن لَّهُۥ كِفۡلࣱ مِّنۡهَاۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ مُّقِیتࣰا\n"
    }
  },
  {
    "id": 579,
    "surahId": 4,
    "ayahNumber": 86,
    "arabicText": "وَإِذَا حُیِّیتُم بِتَحِیَّةࣲ فَحَیُّوا۟ بِأَحۡسَنَ مِنۡهَاۤ أَوۡ رُدُّوهَاۤۗ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَیۡءٍ حَسِیبًا\n",
    "translations": {
      "en": "But when you are greeted with a greeting [of peace], answer with an even better greeting, or [at least] with the like thereof. Verily, God keeps count indeed of all things.",
      "ms": "",
      "id": "",
      "ar": "وَإِذَا حُیِّیتُم بِتَحِیَّةࣲ فَحَیُّوا۟ بِأَحۡسَنَ مِنۡهَاۤ أَوۡ رُدُّوهَاۤۗ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَیۡءٍ حَسِیبًا\n"
    }
  },
  {
    "id": 580,
    "surahId": 4,
    "ayahNumber": 87,
    "arabicText": "ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَۚ لَیَجۡمَعَنَّكُمۡ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ لَا رَیۡبَ فِیهِۗ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ حَدِیثࣰا\n",
    "translations": {
      "en": "God - save whom there is no deity - will surely gather you all together on the Day of Resurrection, [the coming of] which is beyond all doubt: and whose word could be truer than God's?",
      "ms": "",
      "id": "",
      "ar": "ٱللَّهُ لَاۤ إِلَـٰهَ إِلَّا هُوَۚ لَیَجۡمَعَنَّكُمۡ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ لَا رَیۡبَ فِیهِۗ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ حَدِیثࣰا\n"
    }
  },
  {
    "id": 581,
    "surahId": 4,
    "ayahNumber": 88,
    "arabicText": "۞ فَمَا لَكُمۡ فِی ٱلۡمُنَـٰفِقِینَ فِئَتَیۡنِ وَٱللَّهُ أَرۡكَسَهُم بِمَا كَسَبُوۤا۟ۚ أَتُرِیدُونَ أَن تَهۡدُوا۟ مَنۡ أَضَلَّ ٱللَّهُۖ وَمَن یُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِیلࣰا\n",
    "translations": {
      "en": "How, then, could you be of two minds about the hypocrites, seeing that God [Himself] has disowned them because of their guilt? Do you, perchance, seek to guide those whom God has let go astray - when for him whom God lets go astray thou canst never find any way?",
      "ms": "",
      "id": "",
      "ar": "۞ فَمَا لَكُمۡ فِی ٱلۡمُنَـٰفِقِینَ فِئَتَیۡنِ وَٱللَّهُ أَرۡكَسَهُم بِمَا كَسَبُوۤا۟ۚ أَتُرِیدُونَ أَن تَهۡدُوا۟ مَنۡ أَضَلَّ ٱللَّهُۖ وَمَن یُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِیلࣰا\n"
    }
  },
  {
    "id": 582,
    "surahId": 4,
    "ayahNumber": 89,
    "arabicText": "وَدُّوا۟ لَوۡ تَكۡفُرُونَ كَمَا كَفَرُوا۟ فَتَكُونُونَ سَوَاۤءࣰۖ فَلَا تَتَّخِذُوا۟ مِنۡهُمۡ أَوۡلِیَاۤءَ حَتَّىٰ یُهَاجِرُوا۟ فِی سَبِیلِ ٱللَّهِۚ فَإِن تَوَلَّوۡا۟ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَیۡثُ وَجَدتُّمُوهُمۡۖ وَلَا تَتَّخِذُوا۟ مِنۡهُمۡ وَلِیࣰّا وَلَا نَصِیرًا\n",
    "translations": {
      "en": "They would love to see you deny the truth even as they have denied it, so that you should be like them. Do not, therefore, take them for your allies until they forsake the domain of evil for the sake of God; and if they revert to [open] enmity, seize them and slay them wherever you may find them. And do not take any of them for your ally or giver of succour,",
      "ms": "",
      "id": "",
      "ar": "وَدُّوا۟ لَوۡ تَكۡفُرُونَ كَمَا كَفَرُوا۟ فَتَكُونُونَ سَوَاۤءࣰۖ فَلَا تَتَّخِذُوا۟ مِنۡهُمۡ أَوۡلِیَاۤءَ حَتَّىٰ یُهَاجِرُوا۟ فِی سَبِیلِ ٱللَّهِۚ فَإِن تَوَلَّوۡا۟ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَیۡثُ وَجَدتُّمُوهُمۡۖ وَلَا تَتَّخِذُوا۟ مِنۡهُمۡ وَلِیࣰّا وَلَا نَصِیرًا\n"
    }
  },
  {
    "id": 583,
    "surahId": 4,
    "ayahNumber": 90,
    "arabicText": "إِلَّا ٱلَّذِینَ یَصِلُونَ إِلَىٰ قَوۡمِۭ بَیۡنَكُمۡ وَبَیۡنَهُم مِّیثَـٰقٌ أَوۡ جَاۤءُوكُمۡ حَصِرَتۡ صُدُورُهُمۡ أَن یُقَـٰتِلُوكُمۡ أَوۡ یُقَـٰتِلُوا۟ قَوۡمَهُمۡۚ وَلَوۡ شَاۤءَ ٱللَّهُ لَسَلَّطَهُمۡ عَلَیۡكُمۡ فَلَقَـٰتَلُوكُمۡۚ فَإِنِ ٱعۡتَزَلُوكُمۡ فَلَمۡ یُقَـٰتِلُوكُمۡ وَأَلۡقَوۡا۟ إِلَیۡكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمۡ عَلَیۡهِمۡ سَبِیلࣰا\n",
    "translations": {
      "en": "unless it be such [of them] as have ties with people to whom you yourselves are bound by a covenant, or such as come unto you because their hearts shrink from [the thought of] making war either on you or on their own folk - although, if God had willed to make them stronger than you, they would certainly have made war on you. Thus, if they let you be, and do not make war on you, and offer you peace, God does not allow you to harm them.",
      "ms": "",
      "id": "",
      "ar": "إِلَّا ٱلَّذِینَ یَصِلُونَ إِلَىٰ قَوۡمِۭ بَیۡنَكُمۡ وَبَیۡنَهُم مِّیثَـٰقٌ أَوۡ جَاۤءُوكُمۡ حَصِرَتۡ صُدُورُهُمۡ أَن یُقَـٰتِلُوكُمۡ أَوۡ یُقَـٰتِلُوا۟ قَوۡمَهُمۡۚ وَلَوۡ شَاۤءَ ٱللَّهُ لَسَلَّطَهُمۡ عَلَیۡكُمۡ فَلَقَـٰتَلُوكُمۡۚ فَإِنِ ٱعۡتَزَلُوكُمۡ فَلَمۡ یُقَـٰتِلُوكُمۡ وَأَلۡقَوۡا۟ إِلَیۡكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمۡ عَلَیۡهِمۡ سَبِیلࣰا\n"
    }
  },
  {
    "id": 584,
    "surahId": 4,
    "ayahNumber": 91,
    "arabicText": "سَتَجِدُونَ ءَاخَرِینَ یُرِیدُونَ أَن یَأۡمَنُوكُمۡ وَیَأۡمَنُوا۟ قَوۡمَهُمۡ كُلَّ مَا رُدُّوۤا۟ إِلَى ٱلۡفِتۡنَةِ أُرۡكِسُوا۟ فِیهَاۚ فَإِن لَّمۡ یَعۡتَزِلُوكُمۡ وَیُلۡقُوۤا۟ إِلَیۡكُمُ ٱلسَّلَمَ وَیَكُفُّوۤا۟ أَیۡدِیَهُمۡ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَیۡثُ ثَقِفۡتُمُوهُمۡۚ وَأُو۟لَـٰۤىِٕكُمۡ جَعَلۡنَا لَكُمۡ عَلَیۡهِمۡ سُلۡطَـٰنࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "You will find [that there are] others who would like to be safe from you as well as safe from their own folk, [but who,] whenever they are faced anew with temptation to evil, plunge into it headlong. Hence, if they do not let you be, and do not offer you peace, and do not stay their hands, seize them and slay them whenever you come upon them: for it is against these that We have clearly empowered you [to make war].",
      "ms": "",
      "id": "",
      "ar": "سَتَجِدُونَ ءَاخَرِینَ یُرِیدُونَ أَن یَأۡمَنُوكُمۡ وَیَأۡمَنُوا۟ قَوۡمَهُمۡ كُلَّ مَا رُدُّوۤا۟ إِلَى ٱلۡفِتۡنَةِ أُرۡكِسُوا۟ فِیهَاۚ فَإِن لَّمۡ یَعۡتَزِلُوكُمۡ وَیُلۡقُوۤا۟ إِلَیۡكُمُ ٱلسَّلَمَ وَیَكُفُّوۤا۟ أَیۡدِیَهُمۡ فَخُذُوهُمۡ وَٱقۡتُلُوهُمۡ حَیۡثُ ثَقِفۡتُمُوهُمۡۚ وَأُو۟لَـٰۤىِٕكُمۡ جَعَلۡنَا لَكُمۡ عَلَیۡهِمۡ سُلۡطَـٰنࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 585,
    "surahId": 4,
    "ayahNumber": 92,
    "arabicText": "وَمَا كَانَ لِمُؤۡمِنٍ أَن یَقۡتُلَ مُؤۡمِنًا إِلَّا خَطَـࣰٔاۚ وَمَن قَتَلَ مُؤۡمِنًا خَطَـࣰٔا فَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲ وَدِیَةࣱ مُّسَلَّمَةٌ إِلَىٰۤ أَهۡلِهِۦۤ إِلَّاۤ أَن یَصَّدَّقُوا۟ۚ فَإِن كَانَ مِن قَوۡمٍ عَدُوࣲّ لَّكُمۡ وَهُوَ مُؤۡمِنࣱ فَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲۖ وَإِن كَانَ مِن قَوۡمِۭ بَیۡنَكُمۡ وَبَیۡنَهُم مِّیثَـٰقࣱ فَدِیَةࣱ مُّسَلَّمَةٌ إِلَىٰۤ أَهۡلِهِۦ وَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲۖ فَمَن لَّمۡ یَجِدۡ فَصِیَامُ شَهۡرَیۡنِ مُتَتَابِعَیۡنِ تَوۡبَةࣰ مِّنَ ٱللَّهِۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "AND IT IS not conceivable that a believer should slay another believer, unless it be by mistake. And upon him who has slain a believer by mistake there is the duty of freeing a believing soul from bondage and paying an indemnity to the victim's relations, unless they forgo it by way of charity. Now if the slain, while himself a believer, belonged to a people who are at war with you, [the penance shall be confined to] the freeing of a believing soul from bondage; whereas, if he belonged to a people to whom you are bound by a covenant, [it shall consist of] an indemnity to be paid to his relations in ad­dition to the freeing of a believing soul from bon­dage. And he who does not have the wherewithal shall fast [instead] for two consecutive months. (This is) the atonement ordained by God: and God is indeed all-knowing, wise.",
      "ms": "",
      "id": "",
      "ar": "وَمَا كَانَ لِمُؤۡمِنٍ أَن یَقۡتُلَ مُؤۡمِنًا إِلَّا خَطَـࣰٔاۚ وَمَن قَتَلَ مُؤۡمِنًا خَطَـࣰٔا فَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲ وَدِیَةࣱ مُّسَلَّمَةٌ إِلَىٰۤ أَهۡلِهِۦۤ إِلَّاۤ أَن یَصَّدَّقُوا۟ۚ فَإِن كَانَ مِن قَوۡمٍ عَدُوࣲّ لَّكُمۡ وَهُوَ مُؤۡمِنࣱ فَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲۖ وَإِن كَانَ مِن قَوۡمِۭ بَیۡنَكُمۡ وَبَیۡنَهُم مِّیثَـٰقࣱ فَدِیَةࣱ مُّسَلَّمَةٌ إِلَىٰۤ أَهۡلِهِۦ وَتَحۡرِیرُ رَقَبَةࣲ مُّؤۡمِنَةࣲۖ فَمَن لَّمۡ یَجِدۡ فَصِیَامُ شَهۡرَیۡنِ مُتَتَابِعَیۡنِ تَوۡبَةࣰ مِّنَ ٱللَّهِۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 586,
    "surahId": 4,
    "ayahNumber": 93,
    "arabicText": "وَمَن یَقۡتُلۡ مُؤۡمِنࣰا مُّتَعَمِّدࣰا فَجَزَاۤؤُهُۥ جَهَنَّمُ خَـٰلِدࣰا فِیهَا وَغَضِبَ ٱللَّهُ عَلَیۡهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِیمࣰا\n",
    "translations": {
      "en": "But whoever deliberately slays another be­liever, his requital shall be hell, therein to abide; and God will condemn him, and will reject him, and will prepare for him awesome suffering.",
      "ms": "",
      "id": "",
      "ar": "وَمَن یَقۡتُلۡ مُؤۡمِنࣰا مُّتَعَمِّدࣰا فَجَزَاۤؤُهُۥ جَهَنَّمُ خَـٰلِدࣰا فِیهَا وَغَضِبَ ٱللَّهُ عَلَیۡهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 587,
    "surahId": 4,
    "ayahNumber": 94,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا ضَرَبۡتُمۡ فِی سَبِیلِ ٱللَّهِ فَتَبَیَّنُوا۟ وَلَا تَقُولُوا۟ لِمَنۡ أَلۡقَىٰۤ إِلَیۡكُمُ ٱلسَّلَـٰمَ لَسۡتَ مُؤۡمِنࣰا تَبۡتَغُونَ عَرَضَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا فَعِندَ ٱللَّهِ مَغَانِمُ كَثِیرَةࣱۚ كَذَ ٰ⁠لِكَ كُنتُم مِّن قَبۡلُ فَمَنَّ ٱللَّهُ عَلَیۡكُمۡ فَتَبَیَّنُوۤا۟ۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n",
    "translations": {
      "en": "[Hence,] O you who have attained to faith, when you go forth [to war] in God's cause, use your discernment, and do not - out of a desire for the fleeting gains of this worldly life - say unto anyone who offers you the greeting of peace, \"Thou art not a believer\" for with God there are gains abundant. You, too, were once in the same condition - but God has been gracious unto you. Use, therefore, your discernment: verily, God is always aware of what you do.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِذَا ضَرَبۡتُمۡ فِی سَبِیلِ ٱللَّهِ فَتَبَیَّنُوا۟ وَلَا تَقُولُوا۟ لِمَنۡ أَلۡقَىٰۤ إِلَیۡكُمُ ٱلسَّلَـٰمَ لَسۡتَ مُؤۡمِنࣰا تَبۡتَغُونَ عَرَضَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا فَعِندَ ٱللَّهِ مَغَانِمُ كَثِیرَةࣱۚ كَذَ ٰ⁠لِكَ كُنتُم مِّن قَبۡلُ فَمَنَّ ٱللَّهُ عَلَیۡكُمۡ فَتَبَیَّنُوۤا۟ۚ إِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n"
    }
  },
  {
    "id": 588,
    "surahId": 4,
    "ayahNumber": 95,
    "arabicText": "لَّا یَسۡتَوِی ٱلۡقَـٰعِدُونَ مِنَ ٱلۡمُؤۡمِنِینَ غَیۡرُ أُو۟لِی ٱلضَّرَرِ وَٱلۡمُجَـٰهِدُونَ فِی سَبِیلِ ٱللَّهِ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡۚ فَضَّلَ ٱللَّهُ ٱلۡمُجَـٰهِدِینَ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡ عَلَى ٱلۡقَـٰعِدِینَ دَرَجَةࣰۚ وَكُلࣰّا وَعَدَ ٱللَّهُ ٱلۡحُسۡنَىٰۚ وَفَضَّلَ ٱللَّهُ ٱلۡمُجَـٰهِدِینَ عَلَى ٱلۡقَـٰعِدِینَ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "SUCH of the believers as remain passive - other than the disabled - cannot be deemed equal to those who strive hard in God's cause with their possessions and their lives: God has exalted those who strive hard with their possessions and their lives far above those who remain passive. Although God has promised the ultimate good unto all [believers], yet has God exalted those who strive hard above those who remain passive by [promising them] a mighty reward -",
      "ms": "",
      "id": "",
      "ar": "لَّا یَسۡتَوِی ٱلۡقَـٰعِدُونَ مِنَ ٱلۡمُؤۡمِنِینَ غَیۡرُ أُو۟لِی ٱلضَّرَرِ وَٱلۡمُجَـٰهِدُونَ فِی سَبِیلِ ٱللَّهِ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡۚ فَضَّلَ ٱللَّهُ ٱلۡمُجَـٰهِدِینَ بِأَمۡوَ ٰ⁠لِهِمۡ وَأَنفُسِهِمۡ عَلَى ٱلۡقَـٰعِدِینَ دَرَجَةࣰۚ وَكُلࣰّا وَعَدَ ٱللَّهُ ٱلۡحُسۡنَىٰۚ وَفَضَّلَ ٱللَّهُ ٱلۡمُجَـٰهِدِینَ عَلَى ٱلۡقَـٰعِدِینَ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 589,
    "surahId": 4,
    "ayahNumber": 96,
    "arabicText": "دَرَجَـٰتࣲ مِّنۡهُ وَمَغۡفِرَةࣰ وَرَحۡمَةࣰۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمًا\n",
    "translations": {
      "en": "[many] degrees thereof - and for­giveness of sins, and His grace; for God is indeed much-forgiving, a dispenser of grace.",
      "ms": "",
      "id": "",
      "ar": "دَرَجَـٰتࣲ مِّنۡهُ وَمَغۡفِرَةࣰ وَرَحۡمَةࣰۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمًا\n"
    }
  },
  {
    "id": 590,
    "surahId": 4,
    "ayahNumber": 97,
    "arabicText": "إِنَّ ٱلَّذِینَ تَوَفَّىٰهُمُ ٱلۡمَلَـٰۤىِٕكَةُ ظَالِمِیۤ أَنفُسِهِمۡ قَالُوا۟ فِیمَ كُنتُمۡۖ قَالُوا۟ كُنَّا مُسۡتَضۡعَفِینَ فِی ٱلۡأَرۡضِۚ قَالُوۤا۟ أَلَمۡ تَكُنۡ أَرۡضُ ٱللَّهِ وَ ٰ⁠سِعَةࣰ فَتُهَاجِرُوا۟ فِیهَاۚ فَأُو۟لَـٰۤىِٕكَ مَأۡوَىٰهُمۡ جَهَنَّمُۖ وَسَاۤءَتۡ مَصِیرًا\n",
    "translations": {
      "en": "Behold, those whom the angels gather in death while they are still sinning against themselves, [the angels] will ask, \"What was wrong with you?'' They will answer: \"We were too weak on earth.\" [The angels] will say: \"Was, then, God's earth not wide enough for you to forsake the domain of evil?\" For such, then, the goal is hell - and how evil a journey's end!",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ تَوَفَّىٰهُمُ ٱلۡمَلَـٰۤىِٕكَةُ ظَالِمِیۤ أَنفُسِهِمۡ قَالُوا۟ فِیمَ كُنتُمۡۖ قَالُوا۟ كُنَّا مُسۡتَضۡعَفِینَ فِی ٱلۡأَرۡضِۚ قَالُوۤا۟ أَلَمۡ تَكُنۡ أَرۡضُ ٱللَّهِ وَ ٰ⁠سِعَةࣰ فَتُهَاجِرُوا۟ فِیهَاۚ فَأُو۟لَـٰۤىِٕكَ مَأۡوَىٰهُمۡ جَهَنَّمُۖ وَسَاۤءَتۡ مَصِیرًا\n"
    }
  },
  {
    "id": 591,
    "surahId": 4,
    "ayahNumber": 98,
    "arabicText": "إِلَّا ٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلرِّجَالِ وَٱلنِّسَاۤءِ وَٱلۡوِلۡدَ ٰ⁠نِ لَا یَسۡتَطِیعُونَ حِیلَةࣰ وَلَا یَهۡتَدُونَ سَبِیلࣰا\n",
    "translations": {
      "en": "But excepted shall be the truly helpless - be they men or women or children - who cannot bring forth any strength and have not been shown the right way:",
      "ms": "",
      "id": "",
      "ar": "إِلَّا ٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلرِّجَالِ وَٱلنِّسَاۤءِ وَٱلۡوِلۡدَ ٰ⁠نِ لَا یَسۡتَطِیعُونَ حِیلَةࣰ وَلَا یَهۡتَدُونَ سَبِیلࣰا\n"
    }
  },
  {
    "id": 592,
    "surahId": 4,
    "ayahNumber": 99,
    "arabicText": "فَأُو۟لَـٰۤىِٕكَ عَسَى ٱللَّهُ أَن یَعۡفُوَ عَنۡهُمۡۚ وَكَانَ ٱللَّهُ عَفُوًّا غَفُورࣰا\n",
    "translations": {
      "en": "as for them, God may well efface their sin - for God is indeed an absolver of sins, much-forgiving.",
      "ms": "",
      "id": "",
      "ar": "فَأُو۟لَـٰۤىِٕكَ عَسَى ٱللَّهُ أَن یَعۡفُوَ عَنۡهُمۡۚ وَكَانَ ٱللَّهُ عَفُوًّا غَفُورࣰا\n"
    }
  },
  {
    "id": 593,
    "surahId": 4,
    "ayahNumber": 100,
    "arabicText": "۞ وَمَن یُهَاجِرۡ فِی سَبِیلِ ٱللَّهِ یَجِدۡ فِی ٱلۡأَرۡضِ مُرَ ٰ⁠غَمࣰا كَثِیرࣰا وَسَعَةࣰۚ وَمَن یَخۡرُجۡ مِنۢ بَیۡتِهِۦ مُهَاجِرًا إِلَى ٱللَّهِ وَرَسُولِهِۦ ثُمَّ یُدۡرِكۡهُ ٱلۡمَوۡتُ فَقَدۡ وَقَعَ أَجۡرُهُۥ عَلَى ٱللَّهِۗ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "And he who forsakes the domain of evil for the sake of God shall find on earth many a lonely road, as well as life abundant. And if anyone leaves his home, fleeing from evil unto God and His Apostle, and then death overtakes him - his reward is ready with God: for God iss indeed much-forgiving, a dis­penser of grace.",
      "ms": "",
      "id": "",
      "ar": "۞ وَمَن یُهَاجِرۡ فِی سَبِیلِ ٱللَّهِ یَجِدۡ فِی ٱلۡأَرۡضِ مُرَ ٰ⁠غَمࣰا كَثِیرࣰا وَسَعَةࣰۚ وَمَن یَخۡرُجۡ مِنۢ بَیۡتِهِۦ مُهَاجِرًا إِلَى ٱللَّهِ وَرَسُولِهِۦ ثُمَّ یُدۡرِكۡهُ ٱلۡمَوۡتُ فَقَدۡ وَقَعَ أَجۡرُهُۥ عَلَى ٱللَّهِۗ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 594,
    "surahId": 4,
    "ayahNumber": 101,
    "arabicText": "وَإِذَا ضَرَبۡتُمۡ فِی ٱلۡأَرۡضِ فَلَیۡسَ عَلَیۡكُمۡ جُنَاحٌ أَن تَقۡصُرُوا۟ مِنَ ٱلصَّلَوٰةِ إِنۡ خِفۡتُمۡ أَن یَفۡتِنَكُمُ ٱلَّذِینَ كَفَرُوۤا۟ۚ إِنَّ ٱلۡكَـٰفِرِینَ كَانُوا۟ لَكُمۡ عَدُوࣰّا مُّبِینࣰا\n",
    "translations": {
      "en": "AND WHEN you go forth [to war] on earth, you will incur no sin by shortening your prayers if you have reason to fear that those who are bent on denying the truth might suddenly fall upon you: for, verily, those who deny the truth are your open foes.",
      "ms": "",
      "id": "",
      "ar": "وَإِذَا ضَرَبۡتُمۡ فِی ٱلۡأَرۡضِ فَلَیۡسَ عَلَیۡكُمۡ جُنَاحٌ أَن تَقۡصُرُوا۟ مِنَ ٱلصَّلَوٰةِ إِنۡ خِفۡتُمۡ أَن یَفۡتِنَكُمُ ٱلَّذِینَ كَفَرُوۤا۟ۚ إِنَّ ٱلۡكَـٰفِرِینَ كَانُوا۟ لَكُمۡ عَدُوࣰّا مُّبِینࣰا\n"
    }
  },
  {
    "id": 595,
    "surahId": 4,
    "ayahNumber": 102,
    "arabicText": "وَإِذَا كُنتَ فِیهِمۡ فَأَقَمۡتَ لَهُمُ ٱلصَّلَوٰةَ فَلۡتَقُمۡ طَاۤىِٕفَةࣱ مِّنۡهُم مَّعَكَ وَلۡیَأۡخُذُوۤا۟ أَسۡلِحَتَهُمۡۖ فَإِذَا سَجَدُوا۟ فَلۡیَكُونُوا۟ مِن وَرَاۤىِٕكُمۡ وَلۡتَأۡتِ طَاۤىِٕفَةٌ أُخۡرَىٰ لَمۡ یُصَلُّوا۟ فَلۡیُصَلُّوا۟ مَعَكَ وَلۡیَأۡخُذُوا۟ حِذۡرَهُمۡ وَأَسۡلِحَتَهُمۡۗ وَدَّ ٱلَّذِینَ كَفَرُوا۟ لَوۡ تَغۡفُلُونَ عَنۡ أَسۡلِحَتِكُمۡ وَأَمۡتِعَتِكُمۡ فَیَمِیلُونَ عَلَیۡكُم مَّیۡلَةࣰ وَ ٰ⁠حِدَةࣰۚ وَلَا جُنَاحَ عَلَیۡكُمۡ إِن كَانَ بِكُمۡ أَذࣰى مِّن مَّطَرٍ أَوۡ كُنتُم مَّرۡضَىٰۤ أَن تَضَعُوۤا۟ أَسۡلِحَتَكُمۡۖ وَخُذُوا۟ حِذۡرَكُمۡۗ إِنَّ ٱللَّهَ أَعَدَّ لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n",
    "translations": {
      "en": "Thus, when thou art among the believers and about to lead them in prayer, let [only] part of them stand up with thee, retaining their arms. Then, after they have finished their prayer, let them provide you cover while another group, who have not yet prayed, shall come forward and pray with thee, being fully prepared against danger and retaining their arms: (for) those who are bent on denying the truth would love to see you oblivious of your arms and your equipment, so that they might fall upon you in a surprise attack. But it shall not be wrong for you to lay down your arms [while you pray] if you are troubled by rain or if you are ill; but [always] be fully prepared against danger. Verily, God has readied shameful suffering for all who deny the truth!",
      "ms": "",
      "id": "",
      "ar": "وَإِذَا كُنتَ فِیهِمۡ فَأَقَمۡتَ لَهُمُ ٱلصَّلَوٰةَ فَلۡتَقُمۡ طَاۤىِٕفَةࣱ مِّنۡهُم مَّعَكَ وَلۡیَأۡخُذُوۤا۟ أَسۡلِحَتَهُمۡۖ فَإِذَا سَجَدُوا۟ فَلۡیَكُونُوا۟ مِن وَرَاۤىِٕكُمۡ وَلۡتَأۡتِ طَاۤىِٕفَةٌ أُخۡرَىٰ لَمۡ یُصَلُّوا۟ فَلۡیُصَلُّوا۟ مَعَكَ وَلۡیَأۡخُذُوا۟ حِذۡرَهُمۡ وَأَسۡلِحَتَهُمۡۗ وَدَّ ٱلَّذِینَ كَفَرُوا۟ لَوۡ تَغۡفُلُونَ عَنۡ أَسۡلِحَتِكُمۡ وَأَمۡتِعَتِكُمۡ فَیَمِیلُونَ عَلَیۡكُم مَّیۡلَةࣰ وَ ٰ⁠حِدَةࣰۚ وَلَا جُنَاحَ عَلَیۡكُمۡ إِن كَانَ بِكُمۡ أَذࣰى مِّن مَّطَرٍ أَوۡ كُنتُم مَّرۡضَىٰۤ أَن تَضَعُوۤا۟ أَسۡلِحَتَكُمۡۖ وَخُذُوا۟ حِذۡرَكُمۡۗ إِنَّ ٱللَّهَ أَعَدَّ لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n"
    }
  },
  {
    "id": 596,
    "surahId": 4,
    "ayahNumber": 103,
    "arabicText": "فَإِذَا قَضَیۡتُمُ ٱلصَّلَوٰةَ فَٱذۡكُرُوا۟ ٱللَّهَ قِیَـٰمࣰا وَقُعُودࣰا وَعَلَىٰ جُنُوبِكُمۡۚ فَإِذَا ٱطۡمَأۡنَنتُمۡ فَأَقِیمُوا۟ ٱلصَّلَوٰةَۚ إِنَّ ٱلصَّلَوٰةَ كَانَتۡ عَلَى ٱلۡمُؤۡمِنِینَ كِتَـٰبࣰا مَّوۡقُوتࣰا\n",
    "translations": {
      "en": "And when you have finished your prayer, remember God - standing and sitting and lying down; and when you are once again secure, observe your prayers [fully]. Verily, for all believers prayer is indeed a sacred duty linked to particular times [of day].",
      "ms": "",
      "id": "",
      "ar": "فَإِذَا قَضَیۡتُمُ ٱلصَّلَوٰةَ فَٱذۡكُرُوا۟ ٱللَّهَ قِیَـٰمࣰا وَقُعُودࣰا وَعَلَىٰ جُنُوبِكُمۡۚ فَإِذَا ٱطۡمَأۡنَنتُمۡ فَأَقِیمُوا۟ ٱلصَّلَوٰةَۚ إِنَّ ٱلصَّلَوٰةَ كَانَتۡ عَلَى ٱلۡمُؤۡمِنِینَ كِتَـٰبࣰا مَّوۡقُوتࣰا\n"
    }
  },
  {
    "id": 597,
    "surahId": 4,
    "ayahNumber": 104,
    "arabicText": "وَلَا تَهِنُوا۟ فِی ٱبۡتِغَاۤءِ ٱلۡقَوۡمِۖ إِن تَكُونُوا۟ تَأۡلَمُونَ فَإِنَّهُمۡ یَأۡلَمُونَ كَمَا تَأۡلَمُونَۖ وَتَرۡجُونَ مِنَ ٱللَّهِ مَا لَا یَرۡجُونَۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمًا\n",
    "translations": {
      "en": "And be not faint of heart when you seek out the [enemy] host. If you happen to suffer pain, behold, they suffer pain even as you suffer it: but you are hoping [to receive] from God what they cannot hope for. And God is indeed all-knowing, wise.",
      "ms": "",
      "id": "",
      "ar": "وَلَا تَهِنُوا۟ فِی ٱبۡتِغَاۤءِ ٱلۡقَوۡمِۖ إِن تَكُونُوا۟ تَأۡلَمُونَ فَإِنَّهُمۡ یَأۡلَمُونَ كَمَا تَأۡلَمُونَۖ وَتَرۡجُونَ مِنَ ٱللَّهِ مَا لَا یَرۡجُونَۗ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمًا\n"
    }
  },
  {
    "id": 598,
    "surahId": 4,
    "ayahNumber": 105,
    "arabicText": "إِنَّاۤ أَنزَلۡنَاۤ إِلَیۡكَ ٱلۡكِتَـٰبَ بِٱلۡحَقِّ لِتَحۡكُمَ بَیۡنَ ٱلنَّاسِ بِمَاۤ أَرَىٰكَ ٱللَّهُۚ وَلَا تَكُن لِّلۡخَاۤىِٕنِینَ خَصِیمࣰا\n",
    "translations": {
      "en": "BEHOLD, We have bestowed upon thee from on high this divine writ, setting forth the truth, so that thou may judge between people in accordance with what God has taught thee. Hence, do not contend with those who are false to their trust,",
      "ms": "",
      "id": "",
      "ar": "إِنَّاۤ أَنزَلۡنَاۤ إِلَیۡكَ ٱلۡكِتَـٰبَ بِٱلۡحَقِّ لِتَحۡكُمَ بَیۡنَ ٱلنَّاسِ بِمَاۤ أَرَىٰكَ ٱللَّهُۚ وَلَا تَكُن لِّلۡخَاۤىِٕنِینَ خَصِیمࣰا\n"
    }
  },
  {
    "id": 599,
    "surahId": 4,
    "ayahNumber": 106,
    "arabicText": "وَٱسۡتَغۡفِرِ ٱللَّهَۖ إِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "but pray God to forgive [them]: behold, God is indeed much-forgiving, a dispenser of grace.",
      "ms": "",
      "id": "",
      "ar": "وَٱسۡتَغۡفِرِ ٱللَّهَۖ إِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 600,
    "surahId": 4,
    "ayahNumber": 107,
    "arabicText": "وَلَا تُجَـٰدِلۡ عَنِ ٱلَّذِینَ یَخۡتَانُونَ أَنفُسَهُمۡۚ إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ خَوَّانًا أَثِیمࣰا\n",
    "translations": {
      "en": "Yet do not argue in behalf of those who are false to their own selves: verily, God does not love those who betray their trust and persist in sinful ways.",
      "ms": "",
      "id": "",
      "ar": "وَلَا تُجَـٰدِلۡ عَنِ ٱلَّذِینَ یَخۡتَانُونَ أَنفُسَهُمۡۚ إِنَّ ٱللَّهَ لَا یُحِبُّ مَن كَانَ خَوَّانًا أَثِیمࣰا\n"
    }
  },
  {
    "id": 601,
    "surahId": 4,
    "ayahNumber": 108,
    "arabicText": "یَسۡتَخۡفُونَ مِنَ ٱلنَّاسِ وَلَا یَسۡتَخۡفُونَ مِنَ ٱللَّهِ وَهُوَ مَعَهُمۡ إِذۡ یُبَیِّتُونَ مَا لَا یَرۡضَىٰ مِنَ ٱلۡقَوۡلِۚ وَكَانَ ٱللَّهُ بِمَا یَعۡمَلُونَ مُحِیطًا\n",
    "translations": {
      "en": "They would conceal their doings from men; but from God they cannot conceal them - for He is with them whenever they devise, in the dark of night, all manner of beliefs which He does not approve. And God indeed encompasses [with His knowledge] whatever they do.",
      "ms": "",
      "id": "",
      "ar": "یَسۡتَخۡفُونَ مِنَ ٱلنَّاسِ وَلَا یَسۡتَخۡفُونَ مِنَ ٱللَّهِ وَهُوَ مَعَهُمۡ إِذۡ یُبَیِّتُونَ مَا لَا یَرۡضَىٰ مِنَ ٱلۡقَوۡلِۚ وَكَانَ ٱللَّهُ بِمَا یَعۡمَلُونَ مُحِیطًا\n"
    }
  },
  {
    "id": 602,
    "surahId": 4,
    "ayahNumber": 109,
    "arabicText": "هَـٰۤأَنتُمۡ هَـٰۤؤُلَاۤءِ جَـٰدَلۡتُمۡ عَنۡهُمۡ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا فَمَن یُجَـٰدِلُ ٱللَّهَ عَنۡهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ أَم مَّن یَكُونُ عَلَیۡهِمۡ وَكِیلࣰا\n",
    "translations": {
      "en": "Oh, you might well argue in their behalf in the life of this world: but who will argue in their behalf with God on the Day of Resurrection, or who will be their defender?",
      "ms": "",
      "id": "",
      "ar": "هَـٰۤأَنتُمۡ هَـٰۤؤُلَاۤءِ جَـٰدَلۡتُمۡ عَنۡهُمۡ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا فَمَن یُجَـٰدِلُ ٱللَّهَ عَنۡهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ أَم مَّن یَكُونُ عَلَیۡهِمۡ وَكِیلࣰا\n"
    }
  },
  {
    "id": 603,
    "surahId": 4,
    "ayahNumber": 110,
    "arabicText": "وَمَن یَعۡمَلۡ سُوۤءًا أَوۡ یَظۡلِمۡ نَفۡسَهُۥ ثُمَّ یَسۡتَغۡفِرِ ٱللَّهَ یَجِدِ ٱللَّهَ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "Yet he who does evil or [otherwise] sins against himself, and thereafter prays God to forgive him, shall find God much-forgiving, a dispenser of grace:",
      "ms": "",
      "id": "",
      "ar": "وَمَن یَعۡمَلۡ سُوۤءًا أَوۡ یَظۡلِمۡ نَفۡسَهُۥ ثُمَّ یَسۡتَغۡفِرِ ٱللَّهَ یَجِدِ ٱللَّهَ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 604,
    "surahId": 4,
    "ayahNumber": 111,
    "arabicText": "وَمَن یَكۡسِبۡ إِثۡمࣰا فَإِنَّمَا یَكۡسِبُهُۥ عَلَىٰ نَفۡسِهِۦۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "for he who commits a sin, commits it only to his own hurt; and God is indeed all-knowing, wise.",
      "ms": "",
      "id": "",
      "ar": "وَمَن یَكۡسِبۡ إِثۡمࣰا فَإِنَّمَا یَكۡسِبُهُۥ عَلَىٰ نَفۡسِهِۦۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 605,
    "surahId": 4,
    "ayahNumber": 112,
    "arabicText": "وَمَن یَكۡسِبۡ خَطِیۤـَٔةً أَوۡ إِثۡمࣰا ثُمَّ یَرۡمِ بِهِۦ بَرِیۤـࣰٔا فَقَدِ ٱحۡتَمَلَ بُهۡتَـٰنࣰا وَإِثۡمࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "But he who commits a fault or a sin and then throws the blame therefore on an innocent person, burdens himself with the guilt of calumny and [yet another] flagrant sin.",
      "ms": "",
      "id": "",
      "ar": "وَمَن یَكۡسِبۡ خَطِیۤـَٔةً أَوۡ إِثۡمࣰا ثُمَّ یَرۡمِ بِهِۦ بَرِیۤـࣰٔا فَقَدِ ٱحۡتَمَلَ بُهۡتَـٰنࣰا وَإِثۡمࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 606,
    "surahId": 4,
    "ayahNumber": 113,
    "arabicText": "وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَیۡكَ وَرَحۡمَتُهُۥ لَهَمَّت طَّاۤىِٕفَةࣱ مِّنۡهُمۡ أَن یُضِلُّوكَ وَمَا یُضِلُّونَ إِلَّاۤ أَنفُسَهُمۡۖ وَمَا یَضُرُّونَكَ مِن شَیۡءࣲۚ وَأَنزَلَ ٱللَّهُ عَلَیۡكَ ٱلۡكِتَـٰبَ وَٱلۡحِكۡمَةَ وَعَلَّمَكَ مَا لَمۡ تَكُن تَعۡلَمُۚ وَكَانَ فَضۡلُ ٱللَّهِ عَلَیۡكَ عَظِیمࣰا\n",
    "translations": {
      "en": "And but for God's favour upon thee and His grace, some of those [who are false to themselves] would indeed endeavour to lead thee astray; yet none but themselves do they lead astray. Nor can they harm thee in any way, since God has bestowed upon thee from on high this divine writ and [given thee] wisdom, and has imparted unto thee the knowledge of what thou didst not know. And God's favour upon thee is tremendous indeed.",
      "ms": "",
      "id": "",
      "ar": "وَلَوۡلَا فَضۡلُ ٱللَّهِ عَلَیۡكَ وَرَحۡمَتُهُۥ لَهَمَّت طَّاۤىِٕفَةࣱ مِّنۡهُمۡ أَن یُضِلُّوكَ وَمَا یُضِلُّونَ إِلَّاۤ أَنفُسَهُمۡۖ وَمَا یَضُرُّونَكَ مِن شَیۡءࣲۚ وَأَنزَلَ ٱللَّهُ عَلَیۡكَ ٱلۡكِتَـٰبَ وَٱلۡحِكۡمَةَ وَعَلَّمَكَ مَا لَمۡ تَكُن تَعۡلَمُۚ وَكَانَ فَضۡلُ ٱللَّهِ عَلَیۡكَ عَظِیمࣰا\n"
    }
  },
  {
    "id": 607,
    "surahId": 4,
    "ayahNumber": 114,
    "arabicText": "۞ لَّا خَیۡرَ فِی كَثِیرࣲ مِّن نَّجۡوَىٰهُمۡ إِلَّا مَنۡ أَمَرَ بِصَدَقَةٍ أَوۡ مَعۡرُوفٍ أَوۡ إِصۡلَـٰحِۭ بَیۡنَ ٱلنَّاسِۚ وَمَن یَفۡعَلۡ ذَ ٰ⁠لِكَ ٱبۡتِغَاۤءَ مَرۡضَاتِ ٱللَّهِ فَسَوۡفَ نُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "NO GOOD comes, as a rule, out of secret confabulations - saving such as are devoted to en­joining charity, or equitable dealings, or setting things to rights between people: and unto him who does this out of a longing for God's goodly acceptance We shall in time grant a mighty reward.",
      "ms": "",
      "id": "",
      "ar": "۞ لَّا خَیۡرَ فِی كَثِیرࣲ مِّن نَّجۡوَىٰهُمۡ إِلَّا مَنۡ أَمَرَ بِصَدَقَةٍ أَوۡ مَعۡرُوفٍ أَوۡ إِصۡلَـٰحِۭ بَیۡنَ ٱلنَّاسِۚ وَمَن یَفۡعَلۡ ذَ ٰ⁠لِكَ ٱبۡتِغَاۤءَ مَرۡضَاتِ ٱللَّهِ فَسَوۡفَ نُؤۡتِیهِ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 608,
    "surahId": 4,
    "ayahNumber": 115,
    "arabicText": "وَمَن یُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَیَّنَ لَهُ ٱلۡهُدَىٰ وَیَتَّبِعۡ غَیۡرَ سَبِیلِ ٱلۡمُؤۡمِنِینَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصۡلِهِۦ جَهَنَّمَۖ وَسَاۤءَتۡ مَصِیرًا\n",
    "translations": {
      "en": "But as for him who, after guidance has been vouchsafed to him, cuts himself off from the Apostle and follows a path other than that of the believers - him shall We leave unto that which he himself has chosen, and shall cause him to endure hell: and how evil a journey’s end!",
      "ms": "",
      "id": "",
      "ar": "وَمَن یُشَاقِقِ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَیَّنَ لَهُ ٱلۡهُدَىٰ وَیَتَّبِعۡ غَیۡرَ سَبِیلِ ٱلۡمُؤۡمِنِینَ نُوَلِّهِۦ مَا تَوَلَّىٰ وَنُصۡلِهِۦ جَهَنَّمَۖ وَسَاۤءَتۡ مَصِیرًا\n"
    }
  },
  {
    "id": 609,
    "surahId": 4,
    "ayahNumber": 116,
    "arabicText": "إِنَّ ٱللَّهَ لَا یَغۡفِرُ أَن یُشۡرَكَ بِهِۦ وَیَغۡفِرُ مَا دُونَ ذَ ٰ⁠لِكَ لِمَن یَشَاۤءُۚ وَمَن یُشۡرِكۡ بِٱللَّهِ فَقَدۡ ضَلَّ ضَلَـٰلَۢا بَعِیدًا\n",
    "translations": {
      "en": "VERILY, God does not forgive the ascribing of divinity to aught beside Him, although He forgives any lesser sin unto whomever He wills: for those who ascribe divinity to aught beside God have indeed gone far astray.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱللَّهَ لَا یَغۡفِرُ أَن یُشۡرَكَ بِهِۦ وَیَغۡفِرُ مَا دُونَ ذَ ٰ⁠لِكَ لِمَن یَشَاۤءُۚ وَمَن یُشۡرِكۡ بِٱللَّهِ فَقَدۡ ضَلَّ ضَلَـٰلَۢا بَعِیدًا\n"
    }
  },
  {
    "id": 610,
    "surahId": 4,
    "ayahNumber": 117,
    "arabicText": "إِن یَدۡعُونَ مِن دُونِهِۦۤ إِلَّاۤ إِنَـٰثࣰا وَإِن یَدۡعُونَ إِلَّا شَیۡطَـٰنࣰا مَّرِیدࣰا\n",
    "translations": {
      "en": "In His stead, they invoke only life­less symbols - thus invoking none but a rebellious Satan",
      "ms": "",
      "id": "",
      "ar": "إِن یَدۡعُونَ مِن دُونِهِۦۤ إِلَّاۤ إِنَـٰثࣰا وَإِن یَدۡعُونَ إِلَّا شَیۡطَـٰنࣰا مَّرِیدࣰا\n"
    }
  },
  {
    "id": 611,
    "surahId": 4,
    "ayahNumber": 118,
    "arabicText": "لَّعَنَهُ ٱللَّهُۘ وَقَالَ لَأَتَّخِذَنَّ مِنۡ عِبَادِكَ نَصِیبࣰا مَّفۡرُوضࣰا\n",
    "translations": {
      "en": "whom God has rejected for having said, \"Verily, of Thy servants I shall most certainly take my due share,",
      "ms": "",
      "id": "",
      "ar": "لَّعَنَهُ ٱللَّهُۘ وَقَالَ لَأَتَّخِذَنَّ مِنۡ عِبَادِكَ نَصِیبࣰا مَّفۡرُوضࣰا\n"
    }
  },
  {
    "id": 612,
    "surahId": 4,
    "ayahNumber": 119,
    "arabicText": "وَلَأُضِلَّنَّهُمۡ وَلَأُمَنِّیَنَّهُمۡ وَلَـَٔامُرَنَّهُمۡ فَلَیُبَتِّكُنَّ ءَاذَانَ ٱلۡأَنۡعَـٰمِ وَلَـَٔامُرَنَّهُمۡ فَلَیُغَیِّرُنَّ خَلۡقَ ٱللَّهِۚ وَمَن یَتَّخِذِ ٱلشَّیۡطَـٰنَ وَلِیࣰّا مِّن دُونِ ٱللَّهِ فَقَدۡ خَسِرَ خُسۡرَانࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "and shall lead them astray, and fill them with vain desires; and I shall command them - and they will cut off the ears of cattle [in idolatrous sacrifice]; and I shall command them - and they will corrupt God's creation!\" But all who take Satan rather than God for their master do indeed, most clearly, lose all:",
      "ms": "",
      "id": "",
      "ar": "وَلَأُضِلَّنَّهُمۡ وَلَأُمَنِّیَنَّهُمۡ وَلَـَٔامُرَنَّهُمۡ فَلَیُبَتِّكُنَّ ءَاذَانَ ٱلۡأَنۡعَـٰمِ وَلَـَٔامُرَنَّهُمۡ فَلَیُغَیِّرُنَّ خَلۡقَ ٱللَّهِۚ وَمَن یَتَّخِذِ ٱلشَّیۡطَـٰنَ وَلِیࣰّا مِّن دُونِ ٱللَّهِ فَقَدۡ خَسِرَ خُسۡرَانࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 613,
    "surahId": 4,
    "ayahNumber": 120,
    "arabicText": "یَعِدُهُمۡ وَیُمَنِّیهِمۡۖ وَمَا یَعِدُهُمُ ٱلشَّیۡطَـٰنُ إِلَّا غُرُورًا\n",
    "translations": {
      "en": "he holds out promises to them, and fills them with vain desires: yet whatever Satan promises them is but meant to delude the mind.",
      "ms": "",
      "id": "",
      "ar": "یَعِدُهُمۡ وَیُمَنِّیهِمۡۖ وَمَا یَعِدُهُمُ ٱلشَّیۡطَـٰنُ إِلَّا غُرُورًا\n"
    }
  },
  {
    "id": 614,
    "surahId": 4,
    "ayahNumber": 121,
    "arabicText": "أُو۟لَـٰۤىِٕكَ مَأۡوَىٰهُمۡ جَهَنَّمُ وَلَا یَجِدُونَ عَنۡهَا مَحِیصࣰا\n",
    "translations": {
      "en": "Such as these have hell for their goal: and they shall find no way to escape therefrom.",
      "ms": "",
      "id": "",
      "ar": "أُو۟لَـٰۤىِٕكَ مَأۡوَىٰهُمۡ جَهَنَّمُ وَلَا یَجِدُونَ عَنۡهَا مَحِیصࣰا\n"
    }
  },
  {
    "id": 615,
    "surahId": 4,
    "ayahNumber": 122,
    "arabicText": "وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۖ وَعۡدَ ٱللَّهِ حَقࣰّاۚ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ قِیلࣰا\n",
    "translations": {
      "en": "Yet those who attain to faith and do righteous deeds We shall bring into gardens through which running waters flow, therein to abide beyond the count of time: this is, in truth, God's promise - and whose word could be truer than God's?",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَنُدۡخِلُهُمۡ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۖ وَعۡدَ ٱللَّهِ حَقࣰّاۚ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ قِیلࣰا\n"
    }
  },
  {
    "id": 616,
    "surahId": 4,
    "ayahNumber": 123,
    "arabicText": "لَّیۡسَ بِأَمَانِیِّكُمۡ وَلَاۤ أَمَانِیِّ أَهۡلِ ٱلۡكِتَـٰبِۗ مَن یَعۡمَلۡ سُوۤءࣰا یُجۡزَ بِهِۦ وَلَا یَجِدۡ لَهُۥ مِن دُونِ ٱللَّهِ وَلِیࣰّا وَلَا نَصِیرࣰا\n",
    "translations": {
      "en": "It may not accord with your wishful thinking - nor with the wishful thinking of the fol­lowers of earlier revelation - [that] he who does evil shall be requited for it, and shall find none to protect him from God, and none to bring him succour,",
      "ms": "",
      "id": "",
      "ar": "لَّیۡسَ بِأَمَانِیِّكُمۡ وَلَاۤ أَمَانِیِّ أَهۡلِ ٱلۡكِتَـٰبِۗ مَن یَعۡمَلۡ سُوۤءࣰا یُجۡزَ بِهِۦ وَلَا یَجِدۡ لَهُۥ مِن دُونِ ٱللَّهِ وَلِیࣰّا وَلَا نَصِیرࣰا\n"
    }
  },
  {
    "id": 617,
    "surahId": 4,
    "ayahNumber": 124,
    "arabicText": "وَمَن یَعۡمَلۡ مِنَ ٱلصَّـٰلِحَـٰتِ مِن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَأُو۟لَـٰۤىِٕكَ یَدۡخُلُونَ ٱلۡجَنَّةَ وَلَا یُظۡلَمُونَ نَقِیرࣰا\n",
    "translations": {
      "en": "whereas anyone - be it man or woman - who does [whatever he can] of good deeds and is a believer withal, shall enter paradise, and shall not be wronged by as much as [would fill] the groove of a date-stone.",
      "ms": "",
      "id": "",
      "ar": "وَمَن یَعۡمَلۡ مِنَ ٱلصَّـٰلِحَـٰتِ مِن ذَكَرٍ أَوۡ أُنثَىٰ وَهُوَ مُؤۡمِنࣱ فَأُو۟لَـٰۤىِٕكَ یَدۡخُلُونَ ٱلۡجَنَّةَ وَلَا یُظۡلَمُونَ نَقِیرࣰا\n"
    }
  },
  {
    "id": 618,
    "surahId": 4,
    "ayahNumber": 125,
    "arabicText": "وَمَنۡ أَحۡسَنُ دِینࣰا مِّمَّنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ وَهُوَ مُحۡسِنࣱ وَٱتَّبَعَ مِلَّةَ إِبۡرَ ٰ⁠هِیمَ حَنِیفࣰاۗ وَٱتَّخَذَ ٱللَّهُ إِبۡرَ ٰ⁠هِیمَ خَلِیلࣰا\n",
    "translations": {
      "en": "And who could be of better faith than he who surrenders his whole being unto God and is a doer of good withal, and follows the creed of Abraham, who turned away from all that is false - seeing that God exalted Abraham with His love?",
      "ms": "",
      "id": "",
      "ar": "وَمَنۡ أَحۡسَنُ دِینࣰا مِّمَّنۡ أَسۡلَمَ وَجۡهَهُۥ لِلَّهِ وَهُوَ مُحۡسِنࣱ وَٱتَّبَعَ مِلَّةَ إِبۡرَ ٰ⁠هِیمَ حَنِیفࣰاۗ وَٱتَّخَذَ ٱللَّهُ إِبۡرَ ٰ⁠هِیمَ خَلِیلࣰا\n"
    }
  },
  {
    "id": 619,
    "surahId": 4,
    "ayahNumber": 126,
    "arabicText": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ بِكُلِّ شَیۡءࣲ مُّحِیطࣰا\n",
    "translations": {
      "en": "For, unto God belongs all that is in the heavens and all that is on earth; and, indeed, God encompasses everything.",
      "ms": "",
      "id": "",
      "ar": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ بِكُلِّ شَیۡءࣲ مُّحِیطࣰا\n"
    }
  },
  {
    "id": 620,
    "surahId": 4,
    "ayahNumber": 127,
    "arabicText": "وَیَسۡتَفۡتُونَكَ فِی ٱلنِّسَاۤءِۖ قُلِ ٱللَّهُ یُفۡتِیكُمۡ فِیهِنَّ وَمَا یُتۡلَىٰ عَلَیۡكُمۡ فِی ٱلۡكِتَـٰبِ فِی یَتَـٰمَى ٱلنِّسَاۤءِ ٱلَّـٰتِی لَا تُؤۡتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرۡغَبُونَ أَن تَنكِحُوهُنَّ وَٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلۡوِلۡدَ ٰ⁠نِ وَأَن تَقُومُوا۟ لِلۡیَتَـٰمَىٰ بِٱلۡقِسۡطِۚ وَمَا تَفۡعَلُوا۟ مِنۡ خَیۡرࣲ فَإِنَّ ٱللَّهَ كَانَ بِهِۦ عَلِیمࣰا\n",
    "translations": {
      "en": "AND THEY will ask thee to enlighten them about the laws concerning women. Say: \"God [Himself] en­lightens you about the laws concerning them\"- for [His will is shown] in what is being conveyed unto you through this divine writ about orphan women [in your charge], to whom - because you yourselves may be desirous of marrying them - you do not give that which has been ordained for them; and about help­less children; and about your duty to treat orphans with equity. And whatever good you may do - be­hold, God has indeed full knowledge thereof.",
      "ms": "",
      "id": "",
      "ar": "وَیَسۡتَفۡتُونَكَ فِی ٱلنِّسَاۤءِۖ قُلِ ٱللَّهُ یُفۡتِیكُمۡ فِیهِنَّ وَمَا یُتۡلَىٰ عَلَیۡكُمۡ فِی ٱلۡكِتَـٰبِ فِی یَتَـٰمَى ٱلنِّسَاۤءِ ٱلَّـٰتِی لَا تُؤۡتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرۡغَبُونَ أَن تَنكِحُوهُنَّ وَٱلۡمُسۡتَضۡعَفِینَ مِنَ ٱلۡوِلۡدَ ٰ⁠نِ وَأَن تَقُومُوا۟ لِلۡیَتَـٰمَىٰ بِٱلۡقِسۡطِۚ وَمَا تَفۡعَلُوا۟ مِنۡ خَیۡرࣲ فَإِنَّ ٱللَّهَ كَانَ بِهِۦ عَلِیمࣰا\n"
    }
  },
  {
    "id": 621,
    "surahId": 4,
    "ayahNumber": 128,
    "arabicText": "وَإِنِ ٱمۡرَأَةٌ خَافَتۡ مِنۢ بَعۡلِهَا نُشُوزًا أَوۡ إِعۡرَاضࣰا فَلَا جُنَاحَ عَلَیۡهِمَاۤ أَن یُصۡلِحَا بَیۡنَهُمَا صُلۡحࣰاۚ وَٱلصُّلۡحُ خَیۡرࣱۗ وَأُحۡضِرَتِ ٱلۡأَنفُسُ ٱلشُّحَّۚ وَإِن تُحۡسِنُوا۟ وَتَتَّقُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n",
    "translations": {
      "en": "And if a woman has reason to fear ill-treat­ment from her husband, or that he might turn away from her, it shall not be wrong for the two to set things peacefully to rights between themselves: for peace is best, and selfishness is ever-present in human souls. But if you do good and are conscious of Him - behold, God is indeed aware of all that you do.",
      "ms": "",
      "id": "",
      "ar": "وَإِنِ ٱمۡرَأَةٌ خَافَتۡ مِنۢ بَعۡلِهَا نُشُوزًا أَوۡ إِعۡرَاضࣰا فَلَا جُنَاحَ عَلَیۡهِمَاۤ أَن یُصۡلِحَا بَیۡنَهُمَا صُلۡحࣰاۚ وَٱلصُّلۡحُ خَیۡرࣱۗ وَأُحۡضِرَتِ ٱلۡأَنفُسُ ٱلشُّحَّۚ وَإِن تُحۡسِنُوا۟ وَتَتَّقُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n"
    }
  },
  {
    "id": 622,
    "surahId": 4,
    "ayahNumber": 129,
    "arabicText": "وَلَن تَسۡتَطِیعُوۤا۟ أَن تَعۡدِلُوا۟ بَیۡنَ ٱلنِّسَاۤءِ وَلَوۡ حَرَصۡتُمۡۖ فَلَا تَمِیلُوا۟ كُلَّ ٱلۡمَیۡلِ فَتَذَرُوهَا كَٱلۡمُعَلَّقَةِۚ وَإِن تُصۡلِحُوا۟ وَتَتَّقُوا۟ فَإِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "And it will not be within your power to treat your wives with equal fairness, however much you may desire it; and so, do not allow yourselves to incline towards one to the exclusion of the other, leaving her in a state, as it were, of having and not having a husband. But if you put things to rights and are conscious of Him - behold, God is indeed much-forgiving, a dispenser of grace.",
      "ms": "",
      "id": "",
      "ar": "وَلَن تَسۡتَطِیعُوۤا۟ أَن تَعۡدِلُوا۟ بَیۡنَ ٱلنِّسَاۤءِ وَلَوۡ حَرَصۡتُمۡۖ فَلَا تَمِیلُوا۟ كُلَّ ٱلۡمَیۡلِ فَتَذَرُوهَا كَٱلۡمُعَلَّقَةِۚ وَإِن تُصۡلِحُوا۟ وَتَتَّقُوا۟ فَإِنَّ ٱللَّهَ كَانَ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 623,
    "surahId": 4,
    "ayahNumber": 130,
    "arabicText": "وَإِن یَتَفَرَّقَا یُغۡنِ ٱللَّهُ كُلࣰّا مِّن سَعَتِهِۦۚ وَكَانَ ٱللَّهُ وَ ٰ⁠سِعًا حَكِیمࣰا\n",
    "translations": {
      "en": "And if husband and wife do separate, God shall provide for each of them out of His abundance: for God is indeed infinite, wise,",
      "ms": "",
      "id": "",
      "ar": "وَإِن یَتَفَرَّقَا یُغۡنِ ٱللَّهُ كُلࣰّا مِّن سَعَتِهِۦۚ وَكَانَ ٱللَّهُ وَ ٰ⁠سِعًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 624,
    "surahId": 4,
    "ayahNumber": 131,
    "arabicText": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ وَلَقَدۡ وَصَّیۡنَا ٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ مِن قَبۡلِكُمۡ وَإِیَّاكُمۡ أَنِ ٱتَّقُوا۟ ٱللَّهَۚ وَإِن تَكۡفُرُوا۟ فَإِنَّ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ غَنِیًّا حَمِیدࣰا\n",
    "translations": {
      "en": "and unto God belongs all that is in the heavens and all that is on earth. AND, INDEED, We have enjoined upon those who were granted revelation before your time, as well as upon yourselves, to remain conscious of God. And if you deny Him - behold, unto God belongs all that is in the heavens and all that is on earth, and God is indeed self-sufficient, ever to be praised.",
      "ms": "",
      "id": "",
      "ar": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ وَلَقَدۡ وَصَّیۡنَا ٱلَّذِینَ أُوتُوا۟ ٱلۡكِتَـٰبَ مِن قَبۡلِكُمۡ وَإِیَّاكُمۡ أَنِ ٱتَّقُوا۟ ٱللَّهَۚ وَإِن تَكۡفُرُوا۟ فَإِنَّ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ غَنِیًّا حَمِیدࣰا\n"
    }
  },
  {
    "id": 625,
    "surahId": 4,
    "ayahNumber": 132,
    "arabicText": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا\n",
    "translations": {
      "en": "And unto God belongs all that is in the heavens and all that is on earth; and none is as worthy of trust as God.",
      "ms": "",
      "id": "",
      "ar": "وَلِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۚ وَكَفَىٰ بِٱللَّهِ وَكِیلًا\n"
    }
  },
  {
    "id": 626,
    "surahId": 4,
    "ayahNumber": 133,
    "arabicText": "إِن یَشَأۡ یُذۡهِبۡكُمۡ أَیُّهَا ٱلنَّاسُ وَیَأۡتِ بِـَٔاخَرِینَۚ وَكَانَ ٱللَّهُ عَلَىٰ ذَ ٰ⁠لِكَ قَدِیرࣰا\n",
    "translations": {
      "en": "If He so wills, He can cause you, O mankind, to disappear, and bring forth other beings [in your stead]: for God has indeed the power to do this.",
      "ms": "",
      "id": "",
      "ar": "إِن یَشَأۡ یُذۡهِبۡكُمۡ أَیُّهَا ٱلنَّاسُ وَیَأۡتِ بِـَٔاخَرِینَۚ وَكَانَ ٱللَّهُ عَلَىٰ ذَ ٰ⁠لِكَ قَدِیرࣰا\n"
    }
  },
  {
    "id": 627,
    "surahId": 4,
    "ayahNumber": 134,
    "arabicText": "مَّن كَانَ یُرِیدُ ثَوَابَ ٱلدُّنۡیَا فَعِندَ ٱللَّهِ ثَوَابُ ٱلدُّنۡیَا وَٱلۡـَٔاخِرَةِۚ وَكَانَ ٱللَّهُ سَمِیعَۢا بَصِیرࣰا\n",
    "translations": {
      "en": "If one desires the rewards of this world, [let him remember that] with God are the rewards of [both] this world and the life to come: and God is indeed all-hearing, all-seeing.",
      "ms": "",
      "id": "",
      "ar": "مَّن كَانَ یُرِیدُ ثَوَابَ ٱلدُّنۡیَا فَعِندَ ٱللَّهِ ثَوَابُ ٱلدُّنۡیَا وَٱلۡـَٔاخِرَةِۚ وَكَانَ ٱللَّهُ سَمِیعَۢا بَصِیرࣰا\n"
    }
  },
  {
    "id": 628,
    "surahId": 4,
    "ayahNumber": 135,
    "arabicText": "۞ یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ كُونُوا۟ قَوَّ ٰ⁠مِینَ بِٱلۡقِسۡطِ شُهَدَاۤءَ لِلَّهِ وَلَوۡ عَلَىٰۤ أَنفُسِكُمۡ أَوِ ٱلۡوَ ٰ⁠لِدَیۡنِ وَٱلۡأَقۡرَبِینَۚ إِن یَكُنۡ غَنِیًّا أَوۡ فَقِیرࣰا فَٱللَّهُ أَوۡلَىٰ بِهِمَاۖ فَلَا تَتَّبِعُوا۟ ٱلۡهَوَىٰۤ أَن تَعۡدِلُوا۟ۚ وَإِن تَلۡوُۥۤا۟ أَوۡ تُعۡرِضُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n",
    "translations": {
      "en": "O YOU who have attained to faith! Be ever steadfast in upholding equity, bearing witness to the truth for the sake of God, even though it be against your own selves or your parents and kinsfolk. Whether the person concerned be rich or poor, God's claim takes precedence over [the claims of] either of them. Do not, then, follow your own desires, lest you swerve from justice: for if you distort [the truth], behold, God is indeed aware of all that you do!",
      "ms": "",
      "id": "",
      "ar": "۞ یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ كُونُوا۟ قَوَّ ٰ⁠مِینَ بِٱلۡقِسۡطِ شُهَدَاۤءَ لِلَّهِ وَلَوۡ عَلَىٰۤ أَنفُسِكُمۡ أَوِ ٱلۡوَ ٰ⁠لِدَیۡنِ وَٱلۡأَقۡرَبِینَۚ إِن یَكُنۡ غَنِیًّا أَوۡ فَقِیرࣰا فَٱللَّهُ أَوۡلَىٰ بِهِمَاۖ فَلَا تَتَّبِعُوا۟ ٱلۡهَوَىٰۤ أَن تَعۡدِلُوا۟ۚ وَإِن تَلۡوُۥۤا۟ أَوۡ تُعۡرِضُوا۟ فَإِنَّ ٱللَّهَ كَانَ بِمَا تَعۡمَلُونَ خَبِیرࣰا\n"
    }
  },
  {
    "id": 629,
    "surahId": 4,
    "ayahNumber": 136,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ ءَامِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَٱلۡكِتَـٰبِ ٱلَّذِی نَزَّلَ عَلَىٰ رَسُولِهِۦ وَٱلۡكِتَـٰبِ ٱلَّذِیۤ أَنزَلَ مِن قَبۡلُۚ وَمَن یَكۡفُرۡ بِٱللَّهِ وَمَلَـٰۤىِٕكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ فَقَدۡ ضَلَّ ضَلَـٰلَۢا بَعِیدًا\n",
    "translations": {
      "en": "O you who have attained to faith! Hold fast unto your belief in God and His Apostle, and in the divine writ which He has bestowed from on high upon His Apostle, step by step, as well as in the revelation which He sent down aforetime: for he who denies God, and His angels, and His revelations, and His apostles, and the Last Day, has indeed gone far astray.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ ءَامِنُوا۟ بِٱللَّهِ وَرَسُولِهِۦ وَٱلۡكِتَـٰبِ ٱلَّذِی نَزَّلَ عَلَىٰ رَسُولِهِۦ وَٱلۡكِتَـٰبِ ٱلَّذِیۤ أَنزَلَ مِن قَبۡلُۚ وَمَن یَكۡفُرۡ بِٱللَّهِ وَمَلَـٰۤىِٕكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ فَقَدۡ ضَلَّ ضَلَـٰلَۢا بَعِیدًا\n"
    }
  },
  {
    "id": 630,
    "surahId": 4,
    "ayahNumber": 137,
    "arabicText": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ ثُمَّ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ ثُمَّ ٱزۡدَادُوا۟ كُفۡرࣰا لَّمۡ یَكُنِ ٱللَّهُ لِیَغۡفِرَ لَهُمۡ وَلَا لِیَهۡدِیَهُمۡ سَبِیلَۢا\n",
    "translations": {
      "en": "Behold, as for those who come to believe, and then deny the truth, and again come to believe, and again deny the truth, and thereafter grow stubborn in their denial of the truth - God will not forgive them, nor will He guide them in any way.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ ثُمَّ ءَامَنُوا۟ ثُمَّ كَفَرُوا۟ ثُمَّ ٱزۡدَادُوا۟ كُفۡرࣰا لَّمۡ یَكُنِ ٱللَّهُ لِیَغۡفِرَ لَهُمۡ وَلَا لِیَهۡدِیَهُمۡ سَبِیلَۢا\n"
    }
  },
  {
    "id": 631,
    "surahId": 4,
    "ayahNumber": 138,
    "arabicText": "بَشِّرِ ٱلۡمُنَـٰفِقِینَ بِأَنَّ لَهُمۡ عَذَابًا أَلِیمًا\n",
    "translations": {
      "en": "Announce thou to such hypocrites that grievous suffering awaits them.",
      "ms": "",
      "id": "",
      "ar": "بَشِّرِ ٱلۡمُنَـٰفِقِینَ بِأَنَّ لَهُمۡ عَذَابًا أَلِیمًا\n"
    }
  },
  {
    "id": 632,
    "surahId": 4,
    "ayahNumber": 139,
    "arabicText": "ٱلَّذِینَ یَتَّخِذُونَ ٱلۡكَـٰفِرِینَ أَوۡلِیَاۤءَ مِن دُونِ ٱلۡمُؤۡمِنِینَۚ أَیَبۡتَغُونَ عِندَهُمُ ٱلۡعِزَّةَ فَإِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِیعࣰا\n",
    "translations": {
      "en": "As for those who take the deniers of the truth for their allies in preference to the believers - do they hope to be honoured by them when, behold, all honour belongs to God [alone]?",
      "ms": "",
      "id": "",
      "ar": "ٱلَّذِینَ یَتَّخِذُونَ ٱلۡكَـٰفِرِینَ أَوۡلِیَاۤءَ مِن دُونِ ٱلۡمُؤۡمِنِینَۚ أَیَبۡتَغُونَ عِندَهُمُ ٱلۡعِزَّةَ فَإِنَّ ٱلۡعِزَّةَ لِلَّهِ جَمِیعࣰا\n"
    }
  },
  {
    "id": 633,
    "surahId": 4,
    "ayahNumber": 140,
    "arabicText": "وَقَدۡ نَزَّلَ عَلَیۡكُمۡ فِی ٱلۡكِتَـٰبِ أَنۡ إِذَا سَمِعۡتُمۡ ءَایَـٰتِ ٱللَّهِ یُكۡفَرُ بِهَا وَیُسۡتَهۡزَأُ بِهَا فَلَا تَقۡعُدُوا۟ مَعَهُمۡ حَتَّىٰ یَخُوضُوا۟ فِی حَدِیثٍ غَیۡرِهِۦۤ إِنَّكُمۡ إِذࣰا مِّثۡلُهُمۡۗ إِنَّ ٱللَّهَ جَامِعُ ٱلۡمُنَـٰفِقِینَ وَٱلۡكَـٰفِرِینَ فِی جَهَنَّمَ جَمِیعًا\n",
    "translations": {
      "en": "And, indeed, He has enjoined upon you in this divine writ that whenever you hear people deny the truth of God's messages and mock at them, you shall avoid their company until they begin to talk of other things - or else, verily, you will become like them. Behold, together with those who deny the truth God will gather in hell the hypocrites,",
      "ms": "",
      "id": "",
      "ar": "وَقَدۡ نَزَّلَ عَلَیۡكُمۡ فِی ٱلۡكِتَـٰبِ أَنۡ إِذَا سَمِعۡتُمۡ ءَایَـٰتِ ٱللَّهِ یُكۡفَرُ بِهَا وَیُسۡتَهۡزَأُ بِهَا فَلَا تَقۡعُدُوا۟ مَعَهُمۡ حَتَّىٰ یَخُوضُوا۟ فِی حَدِیثٍ غَیۡرِهِۦۤ إِنَّكُمۡ إِذࣰا مِّثۡلُهُمۡۗ إِنَّ ٱللَّهَ جَامِعُ ٱلۡمُنَـٰفِقِینَ وَٱلۡكَـٰفِرِینَ فِی جَهَنَّمَ جَمِیعًا\n"
    }
  },
  {
    "id": 634,
    "surahId": 4,
    "ayahNumber": 141,
    "arabicText": "ٱلَّذِینَ یَتَرَبَّصُونَ بِكُمۡ فَإِن كَانَ لَكُمۡ فَتۡحࣱ مِّنَ ٱللَّهِ قَالُوۤا۟ أَلَمۡ نَكُن مَّعَكُمۡ وَإِن كَانَ لِلۡكَـٰفِرِینَ نَصِیبࣱ قَالُوۤا۟ أَلَمۡ نَسۡتَحۡوِذۡ عَلَیۡكُمۡ وَنَمۡنَعۡكُم مِّنَ ٱلۡمُؤۡمِنِینَۚ فَٱللَّهُ یَحۡكُمُ بَیۡنَكُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِۗ وَلَن یَجۡعَلَ ٱللَّهُ لِلۡكَـٰفِرِینَ عَلَى ٱلۡمُؤۡمِنِینَ سَبِیلًا\n",
    "translations": {
      "en": "who but wait to see what betides you: thus, if triumph comes to you from God, they say, \"Were we not on your side?\"- whereas if those who deny the truth are in luck, they say [to them], \"Have we not earned your affection by defending you against those be­lievers?'' But God will judge between you all on the Day of Resurrection; and never will God allow those who deny the truth to harm the believers.",
      "ms": "",
      "id": "",
      "ar": "ٱلَّذِینَ یَتَرَبَّصُونَ بِكُمۡ فَإِن كَانَ لَكُمۡ فَتۡحࣱ مِّنَ ٱللَّهِ قَالُوۤا۟ أَلَمۡ نَكُن مَّعَكُمۡ وَإِن كَانَ لِلۡكَـٰفِرِینَ نَصِیبࣱ قَالُوۤا۟ أَلَمۡ نَسۡتَحۡوِذۡ عَلَیۡكُمۡ وَنَمۡنَعۡكُم مِّنَ ٱلۡمُؤۡمِنِینَۚ فَٱللَّهُ یَحۡكُمُ بَیۡنَكُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِۗ وَلَن یَجۡعَلَ ٱللَّهُ لِلۡكَـٰفِرِینَ عَلَى ٱلۡمُؤۡمِنِینَ سَبِیلًا\n"
    }
  },
  {
    "id": 635,
    "surahId": 4,
    "ayahNumber": 142,
    "arabicText": "إِنَّ ٱلۡمُنَـٰفِقِینَ یُخَـٰدِعُونَ ٱللَّهَ وَهُوَ خَـٰدِعُهُمۡ وَإِذَا قَامُوۤا۟ إِلَى ٱلصَّلَوٰةِ قَامُوا۟ كُسَالَىٰ یُرَاۤءُونَ ٱلنَّاسَ وَلَا یَذۡكُرُونَ ٱللَّهَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "Behold, the hypocrites seek to deceive God - the while it is He who causes them to be deceived [by themselves] And when they rise to pray, they rise reluctantly, only to be seen and praised by men, remembering God but seldom,",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلۡمُنَـٰفِقِینَ یُخَـٰدِعُونَ ٱللَّهَ وَهُوَ خَـٰدِعُهُمۡ وَإِذَا قَامُوۤا۟ إِلَى ٱلصَّلَوٰةِ قَامُوا۟ كُسَالَىٰ یُرَاۤءُونَ ٱلنَّاسَ وَلَا یَذۡكُرُونَ ٱللَّهَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 636,
    "surahId": 4,
    "ayahNumber": 143,
    "arabicText": "مُّذَبۡذَبِینَ بَیۡنَ ذَ ٰ⁠لِكَ لَاۤ إِلَىٰ هَـٰۤؤُلَاۤءِ وَلَاۤ إِلَىٰ هَـٰۤؤُلَاۤءِۚ وَمَن یُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِیلࣰا\n",
    "translations": {
      "en": "wavering be­tween this and that, [true] neither to these nor those. But for him whom God lets go astray thou canst never find any way.",
      "ms": "",
      "id": "",
      "ar": "مُّذَبۡذَبِینَ بَیۡنَ ذَ ٰ⁠لِكَ لَاۤ إِلَىٰ هَـٰۤؤُلَاۤءِ وَلَاۤ إِلَىٰ هَـٰۤؤُلَاۤءِۚ وَمَن یُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِیلࣰا\n"
    }
  },
  {
    "id": 637,
    "surahId": 4,
    "ayahNumber": 144,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ ٱلۡكَـٰفِرِینَ أَوۡلِیَاۤءَ مِن دُونِ ٱلۡمُؤۡمِنِینَۚ أَتُرِیدُونَ أَن تَجۡعَلُوا۟ لِلَّهِ عَلَیۡكُمۡ سُلۡطَـٰنࣰا مُّبِینًا\n",
    "translations": {
      "en": "O you who have attained to faith! Do not take the deniers of the truth for your allies in preference to the believers! Do you want to place before God a manifest proof of your guilt?",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ ٱلۡكَـٰفِرِینَ أَوۡلِیَاۤءَ مِن دُونِ ٱلۡمُؤۡمِنِینَۚ أَتُرِیدُونَ أَن تَجۡعَلُوا۟ لِلَّهِ عَلَیۡكُمۡ سُلۡطَـٰنࣰا مُّبِینًا\n"
    }
  },
  {
    "id": 638,
    "surahId": 4,
    "ayahNumber": 145,
    "arabicText": "إِنَّ ٱلۡمُنَـٰفِقِینَ فِی ٱلدَّرۡكِ ٱلۡأَسۡفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمۡ نَصِیرًا\n",
    "translations": {
      "en": "Verily, the hypocrites shall be in the lowest depth of the fire, and thou wilt find none who could succour them.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلۡمُنَـٰفِقِینَ فِی ٱلدَّرۡكِ ٱلۡأَسۡفَلِ مِنَ ٱلنَّارِ وَلَن تَجِدَ لَهُمۡ نَصِیرًا\n"
    }
  },
  {
    "id": 639,
    "surahId": 4,
    "ayahNumber": 146,
    "arabicText": "إِلَّا ٱلَّذِینَ تَابُوا۟ وَأَصۡلَحُوا۟ وَٱعۡتَصَمُوا۟ بِٱللَّهِ وَأَخۡلَصُوا۟ دِینَهُمۡ لِلَّهِ فَأُو۟لَـٰۤىِٕكَ مَعَ ٱلۡمُؤۡمِنِینَۖ وَسَوۡفَ یُؤۡتِ ٱللَّهُ ٱلۡمُؤۡمِنِینَ أَجۡرًا عَظِیمࣰا\n",
    "translations": {
      "en": "But excepted shall be they who repent, and live righteously, and hold fast unto God, and grow sincere in their faith in God alone: for these shall be one with the believers - and in time God will grant to all believers a mighty reward.",
      "ms": "",
      "id": "",
      "ar": "إِلَّا ٱلَّذِینَ تَابُوا۟ وَأَصۡلَحُوا۟ وَٱعۡتَصَمُوا۟ بِٱللَّهِ وَأَخۡلَصُوا۟ دِینَهُمۡ لِلَّهِ فَأُو۟لَـٰۤىِٕكَ مَعَ ٱلۡمُؤۡمِنِینَۖ وَسَوۡفَ یُؤۡتِ ٱللَّهُ ٱلۡمُؤۡمِنِینَ أَجۡرًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 640,
    "surahId": 4,
    "ayahNumber": 147,
    "arabicText": "مَّا یَفۡعَلُ ٱللَّهُ بِعَذَابِكُمۡ إِن شَكَرۡتُمۡ وَءَامَنتُمۡۚ وَكَانَ ٱللَّهُ شَاكِرًا عَلِیمࣰا\n",
    "translations": {
      "en": "Why would God cause you to suffer [for your past sins] if you are grateful and attain to belief - seeing that God is always responsive to gratitude, all-knowing?",
      "ms": "",
      "id": "",
      "ar": "مَّا یَفۡعَلُ ٱللَّهُ بِعَذَابِكُمۡ إِن شَكَرۡتُمۡ وَءَامَنتُمۡۚ وَكَانَ ٱللَّهُ شَاكِرًا عَلِیمࣰا\n"
    }
  },
  {
    "id": 641,
    "surahId": 4,
    "ayahNumber": 148,
    "arabicText": "۞ لَّا یُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوۤءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِیعًا عَلِیمًا\n",
    "translations": {
      "en": "God does not like any evil to be mentioned openly, unless it be by him who has been wronged (thereby) And God is indeed all-hearing, all-knowing,",
      "ms": "",
      "id": "",
      "ar": "۞ لَّا یُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ بِٱلسُّوۤءِ مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِیعًا عَلِیمًا\n"
    }
  },
  {
    "id": 642,
    "surahId": 4,
    "ayahNumber": 149,
    "arabicText": "إِن تُبۡدُوا۟ خَیۡرًا أَوۡ تُخۡفُوهُ أَوۡ تَعۡفُوا۟ عَن سُوۤءࣲ فَإِنَّ ٱللَّهَ كَانَ عَفُوࣰّا قَدِیرًا\n",
    "translations": {
      "en": "whether you do good openly or in secret, or pardon others for evil [done unto you]: for, behold, God is indeed an absolver of sins, infinite in His power.",
      "ms": "",
      "id": "",
      "ar": "إِن تُبۡدُوا۟ خَیۡرًا أَوۡ تُخۡفُوهُ أَوۡ تَعۡفُوا۟ عَن سُوۤءࣲ فَإِنَّ ٱللَّهَ كَانَ عَفُوࣰّا قَدِیرًا\n"
    }
  },
  {
    "id": 643,
    "surahId": 4,
    "ayahNumber": 150,
    "arabicText": "إِنَّ ٱلَّذِینَ یَكۡفُرُونَ بِٱللَّهِ وَرُسُلِهِۦ وَیُرِیدُونَ أَن یُفَرِّقُوا۟ بَیۡنَ ٱللَّهِ وَرُسُلِهِۦ وَیَقُولُونَ نُؤۡمِنُ بِبَعۡضࣲ وَنَكۡفُرُ بِبَعۡضࣲ وَیُرِیدُونَ أَن یَتَّخِذُوا۟ بَیۡنَ ذَ ٰ⁠لِكَ سَبِیلًا\n",
    "translations": {
      "en": "VERILY, those who deny God and His apostles by endeavouring to make a distinction between [belief in] God and [belief in] His apostles, and who say, \"We believe in the one but we deny the other,\" and want to pursue a path in-between -",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ یَكۡفُرُونَ بِٱللَّهِ وَرُسُلِهِۦ وَیُرِیدُونَ أَن یُفَرِّقُوا۟ بَیۡنَ ٱللَّهِ وَرُسُلِهِۦ وَیَقُولُونَ نُؤۡمِنُ بِبَعۡضࣲ وَنَكۡفُرُ بِبَعۡضࣲ وَیُرِیدُونَ أَن یَتَّخِذُوا۟ بَیۡنَ ذَ ٰ⁠لِكَ سَبِیلًا\n"
    }
  },
  {
    "id": 644,
    "surahId": 4,
    "ayahNumber": 151,
    "arabicText": "أُو۟لَـٰۤىِٕكَ هُمُ ٱلۡكَـٰفِرُونَ حَقࣰّاۚ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n",
    "translations": {
      "en": "it is they, they who are truly denying the truth: and for those who deny the truth We have readied shameful suffering.",
      "ms": "",
      "id": "",
      "ar": "أُو۟لَـٰۤىِٕكَ هُمُ ٱلۡكَـٰفِرُونَ حَقࣰّاۚ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ عَذَابࣰا مُّهِینࣰا\n"
    }
  },
  {
    "id": 645,
    "surahId": 4,
    "ayahNumber": 152,
    "arabicText": "وَٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَرُسُلِهِۦ وَلَمۡ یُفَرِّقُوا۟ بَیۡنَ أَحَدࣲ مِّنۡهُمۡ أُو۟لَـٰۤىِٕكَ سَوۡفَ یُؤۡتِیهِمۡ أُجُورَهُمۡۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n",
    "translations": {
      "en": "But as for those who believe in God and His apostles and make no distinction between any of them - unto them, in time, will He grant their re­wards [in full]. And God is indeed much-forgiving, a dispenser of grace.",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَرُسُلِهِۦ وَلَمۡ یُفَرِّقُوا۟ بَیۡنَ أَحَدࣲ مِّنۡهُمۡ أُو۟لَـٰۤىِٕكَ سَوۡفَ یُؤۡتِیهِمۡ أُجُورَهُمۡۚ وَكَانَ ٱللَّهُ غَفُورࣰا رَّحِیمࣰا\n"
    }
  },
  {
    "id": 646,
    "surahId": 4,
    "ayahNumber": 153,
    "arabicText": "یَسۡـَٔلُكَ أَهۡلُ ٱلۡكِتَـٰبِ أَن تُنَزِّلَ عَلَیۡهِمۡ كِتَـٰبࣰا مِّنَ ٱلسَّمَاۤءِۚ فَقَدۡ سَأَلُوا۟ مُوسَىٰۤ أَكۡبَرَ مِن ذَ ٰ⁠لِكَ فَقَالُوۤا۟ أَرِنَا ٱللَّهَ جَهۡرَةࣰ فَأَخَذَتۡهُمُ ٱلصَّـٰعِقَةُ بِظُلۡمِهِمۡۚ ثُمَّ ٱتَّخَذُوا۟ ٱلۡعِجۡلَ مِنۢ بَعۡدِ مَا جَاۤءَتۡهُمُ ٱلۡبَیِّنَـٰتُ فَعَفَوۡنَا عَن ذَ ٰ⁠لِكَۚ وَءَاتَیۡنَا مُوسَىٰ سُلۡطَـٰنࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "THE FOLLOWERS of the Old Testament demand of thee [O Prophet] that thou cause a revelation to be sent down to them from heaven. And an even greater thing than this did they demand of Moses when they said, \"Make us see God face to face\" - whereupon the thunderbolt of punishment overtook them for this their wickedness. After that, they took to worshipping the [golden] calf - and this after all evidence of the truth had come unto them! None the less, We effaced this [sin of theirs], and vouchsafed unto Moses a clear proof [of the truth],",
      "ms": "",
      "id": "",
      "ar": "یَسۡـَٔلُكَ أَهۡلُ ٱلۡكِتَـٰبِ أَن تُنَزِّلَ عَلَیۡهِمۡ كِتَـٰبࣰا مِّنَ ٱلسَّمَاۤءِۚ فَقَدۡ سَأَلُوا۟ مُوسَىٰۤ أَكۡبَرَ مِن ذَ ٰ⁠لِكَ فَقَالُوۤا۟ أَرِنَا ٱللَّهَ جَهۡرَةࣰ فَأَخَذَتۡهُمُ ٱلصَّـٰعِقَةُ بِظُلۡمِهِمۡۚ ثُمَّ ٱتَّخَذُوا۟ ٱلۡعِجۡلَ مِنۢ بَعۡدِ مَا جَاۤءَتۡهُمُ ٱلۡبَیِّنَـٰتُ فَعَفَوۡنَا عَن ذَ ٰ⁠لِكَۚ وَءَاتَیۡنَا مُوسَىٰ سُلۡطَـٰنࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 647,
    "surahId": 4,
    "ayahNumber": 154,
    "arabicText": "وَرَفَعۡنَا فَوۡقَهُمُ ٱلطُّورَ بِمِیثَـٰقِهِمۡ وَقُلۡنَا لَهُمُ ٱدۡخُلُوا۟ ٱلۡبَابَ سُجَّدࣰا وَقُلۡنَا لَهُمۡ لَا تَعۡدُوا۟ فِی ٱلسَّبۡتِ وَأَخَذۡنَا مِنۡهُم مِّیثَـٰقًا غَلِیظࣰا\n",
    "translations": {
      "en": "raising Mount Sinai high above them in witness of their solemn pledge. And We said unto them, “Enter the gate humbly”; and We told them, \"Do not break the Sabbath-law\"; and We accepted from them a most solemn pledge.",
      "ms": "",
      "id": "",
      "ar": "وَرَفَعۡنَا فَوۡقَهُمُ ٱلطُّورَ بِمِیثَـٰقِهِمۡ وَقُلۡنَا لَهُمُ ٱدۡخُلُوا۟ ٱلۡبَابَ سُجَّدࣰا وَقُلۡنَا لَهُمۡ لَا تَعۡدُوا۟ فِی ٱلسَّبۡتِ وَأَخَذۡنَا مِنۡهُم مِّیثَـٰقًا غَلِیظࣰا\n"
    }
  },
  {
    "id": 648,
    "surahId": 4,
    "ayahNumber": 155,
    "arabicText": "فَبِمَا نَقۡضِهِم مِّیثَـٰقَهُمۡ وَكُفۡرِهِم بِـَٔایَـٰتِ ٱللَّهِ وَقَتۡلِهِمُ ٱلۡأَنۢبِیَاۤءَ بِغَیۡرِ حَقࣲّ وَقَوۡلِهِمۡ قُلُوبُنَا غُلۡفُۢۚ بَلۡ طَبَعَ ٱللَّهُ عَلَیۡهَا بِكُفۡرِهِمۡ فَلَا یُؤۡمِنُونَ إِلَّا قَلِیلࣰا\n",
    "translations": {
      "en": "And so, [We punished them] for the break­ing of their pledge, and their refusal to acknowledge God's messages, and their slaying of prophets against all right, and their boast, \"Our hearts are already full of knowledge\"- nay, but God has sealed their hearts in result of their denial of the truth, and [now] they believe in but few things -;",
      "ms": "",
      "id": "",
      "ar": "فَبِمَا نَقۡضِهِم مِّیثَـٰقَهُمۡ وَكُفۡرِهِم بِـَٔایَـٰتِ ٱللَّهِ وَقَتۡلِهِمُ ٱلۡأَنۢبِیَاۤءَ بِغَیۡرِ حَقࣲّ وَقَوۡلِهِمۡ قُلُوبُنَا غُلۡفُۢۚ بَلۡ طَبَعَ ٱللَّهُ عَلَیۡهَا بِكُفۡرِهِمۡ فَلَا یُؤۡمِنُونَ إِلَّا قَلِیلࣰا\n"
    }
  },
  {
    "id": 649,
    "surahId": 4,
    "ayahNumber": 156,
    "arabicText": "وَبِكُفۡرِهِمۡ وَقَوۡلِهِمۡ عَلَىٰ مَرۡیَمَ بُهۡتَـٰنًا عَظِیمࣰا\n",
    "translations": {
      "en": "and for their refusal to acknowledge the truth, and the awesome calumny which they utter against Mary,",
      "ms": "",
      "id": "",
      "ar": "وَبِكُفۡرِهِمۡ وَقَوۡلِهِمۡ عَلَىٰ مَرۡیَمَ بُهۡتَـٰنًا عَظِیمࣰا\n"
    }
  },
  {
    "id": 650,
    "surahId": 4,
    "ayahNumber": 157,
    "arabicText": "وَقَوۡلِهِمۡ إِنَّا قَتَلۡنَا ٱلۡمَسِیحَ عِیسَى ٱبۡنَ مَرۡیَمَ رَسُولَ ٱللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَـٰكِن شُبِّهَ لَهُمۡۚ وَإِنَّ ٱلَّذِینَ ٱخۡتَلَفُوا۟ فِیهِ لَفِی شَكࣲّ مِّنۡهُۚ مَا لَهُم بِهِۦ مِنۡ عِلۡمٍ إِلَّا ٱتِّبَاعَ ٱلظَّنِّۚ وَمَا قَتَلُوهُ یَقِینَۢا\n",
    "translations": {
      "en": "and their boast, \"Behold, we have slain the Christ Jesus, son of Mary, [who claimed to be] an apostle of God!\" However, they did not slay him, and neither did they crucify him, but it only seemed to them [as if it had been] so; and, verily, those who hold conflict­ing views thereon are indeed confused, having no [real] knowledge thereof, and following mere con­jecture. For, of a certainty, they did not slay him:",
      "ms": "",
      "id": "",
      "ar": "وَقَوۡلِهِمۡ إِنَّا قَتَلۡنَا ٱلۡمَسِیحَ عِیسَى ٱبۡنَ مَرۡیَمَ رَسُولَ ٱللَّهِ وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَـٰكِن شُبِّهَ لَهُمۡۚ وَإِنَّ ٱلَّذِینَ ٱخۡتَلَفُوا۟ فِیهِ لَفِی شَكࣲّ مِّنۡهُۚ مَا لَهُم بِهِۦ مِنۡ عِلۡمٍ إِلَّا ٱتِّبَاعَ ٱلظَّنِّۚ وَمَا قَتَلُوهُ یَقِینَۢا\n"
    }
  },
  {
    "id": 651,
    "surahId": 4,
    "ayahNumber": 158,
    "arabicText": "بَل رَّفَعَهُ ٱللَّهُ إِلَیۡهِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n",
    "translations": {
      "en": "nay, God exalted him unto Himself - and God is indeed almighty, wise.",
      "ms": "",
      "id": "",
      "ar": "بَل رَّفَعَهُ ٱللَّهُ إِلَیۡهِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 652,
    "surahId": 4,
    "ayahNumber": 159,
    "arabicText": "وَإِن مِّنۡ أَهۡلِ ٱلۡكِتَـٰبِ إِلَّا لَیُؤۡمِنَنَّ بِهِۦ قَبۡلَ مَوۡتِهِۦۖ وَیَوۡمَ ٱلۡقِیَـٰمَةِ یَكُونُ عَلَیۡهِمۡ شَهِیدࣰا\n",
    "translations": {
      "en": "Yet there is not one of the followers of earlier revelation who does not, at the moment of his death, grasp the truth about Jesus; and on the Day of Resurrection he [himself] shall bear witness to the truth against them.",
      "ms": "",
      "id": "",
      "ar": "وَإِن مِّنۡ أَهۡلِ ٱلۡكِتَـٰبِ إِلَّا لَیُؤۡمِنَنَّ بِهِۦ قَبۡلَ مَوۡتِهِۦۖ وَیَوۡمَ ٱلۡقِیَـٰمَةِ یَكُونُ عَلَیۡهِمۡ شَهِیدࣰا\n"
    }
  },
  {
    "id": 653,
    "surahId": 4,
    "ayahNumber": 160,
    "arabicText": "فَبِظُلۡمࣲ مِّنَ ٱلَّذِینَ هَادُوا۟ حَرَّمۡنَا عَلَیۡهِمۡ طَیِّبَـٰتٍ أُحِلَّتۡ لَهُمۡ وَبِصَدِّهِمۡ عَن سَبِیلِ ٱللَّهِ كَثِیرࣰا\n",
    "translations": {
      "en": "So, then, for the wickedness committed by those who followed the Jewish faith did We deny unto them certain of the good things of life which [aforetime] had been allowed to them; and [We did this] for their having so often turned away from the path of God,",
      "ms": "",
      "id": "",
      "ar": "فَبِظُلۡمࣲ مِّنَ ٱلَّذِینَ هَادُوا۟ حَرَّمۡنَا عَلَیۡهِمۡ طَیِّبَـٰتٍ أُحِلَّتۡ لَهُمۡ وَبِصَدِّهِمۡ عَن سَبِیلِ ٱللَّهِ كَثِیرࣰا\n"
    }
  },
  {
    "id": 654,
    "surahId": 4,
    "ayahNumber": 161,
    "arabicText": "وَأَخۡذِهِمُ ٱلرِّبَوٰا۟ وَقَدۡ نُهُوا۟ عَنۡهُ وَأَكۡلِهِمۡ أَمۡوَ ٰ⁠لَ ٱلنَّاسِ بِٱلۡبَـٰطِلِۚ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ مِنۡهُمۡ عَذَابًا أَلِیمࣰا\n",
    "translations": {
      "en": "and [for] their taking usury although it had been forbidden to them, and their wrongful devouring of other people's possessions. And for those from among them who [continue to] deny the truth We have readied grievous suffering.",
      "ms": "",
      "id": "",
      "ar": "وَأَخۡذِهِمُ ٱلرِّبَوٰا۟ وَقَدۡ نُهُوا۟ عَنۡهُ وَأَكۡلِهِمۡ أَمۡوَ ٰ⁠لَ ٱلنَّاسِ بِٱلۡبَـٰطِلِۚ وَأَعۡتَدۡنَا لِلۡكَـٰفِرِینَ مِنۡهُمۡ عَذَابًا أَلِیمࣰا\n"
    }
  },
  {
    "id": 655,
    "surahId": 4,
    "ayahNumber": 162,
    "arabicText": "لَّـٰكِنِ ٱلرَّ ٰ⁠سِخُونَ فِی ٱلۡعِلۡمِ مِنۡهُمۡ وَٱلۡمُؤۡمِنُونَ یُؤۡمِنُونَ بِمَاۤ أُنزِلَ إِلَیۡكَ وَمَاۤ أُنزِلَ مِن قَبۡلِكَۚ وَٱلۡمُقِیمِینَ ٱلصَّلَوٰةَۚ وَٱلۡمُؤۡتُونَ ٱلزَّكَوٰةَ وَٱلۡمُؤۡمِنُونَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ أُو۟لَـٰۤىِٕكَ سَنُؤۡتِیهِمۡ أَجۡرًا عَظِیمًا\n",
    "translations": {
      "en": "But as for those from among them who are deeply rooted in knowledge, and the believers who believe in that which has been bestowed upon thee from on high as well as that which was bestowed from on high before thee, and those who are [es­pecially] constant in prayer, and spend in charity, and all who believe in God and the Last Day - these it is unto whom We shall grant a mighty reward.",
      "ms": "",
      "id": "",
      "ar": "لَّـٰكِنِ ٱلرَّ ٰ⁠سِخُونَ فِی ٱلۡعِلۡمِ مِنۡهُمۡ وَٱلۡمُؤۡمِنُونَ یُؤۡمِنُونَ بِمَاۤ أُنزِلَ إِلَیۡكَ وَمَاۤ أُنزِلَ مِن قَبۡلِكَۚ وَٱلۡمُقِیمِینَ ٱلصَّلَوٰةَۚ وَٱلۡمُؤۡتُونَ ٱلزَّكَوٰةَ وَٱلۡمُؤۡمِنُونَ بِٱللَّهِ وَٱلۡیَوۡمِ ٱلۡـَٔاخِرِ أُو۟لَـٰۤىِٕكَ سَنُؤۡتِیهِمۡ أَجۡرًا عَظِیمًا\n"
    }
  },
  {
    "id": 656,
    "surahId": 4,
    "ayahNumber": 163,
    "arabicText": "۞ إِنَّاۤ أَوۡحَیۡنَاۤ إِلَیۡكَ كَمَاۤ أَوۡحَیۡنَاۤ إِلَىٰ نُوحࣲ وَٱلنَّبِیِّـۧنَ مِنۢ بَعۡدِهِۦۚ وَأَوۡحَیۡنَاۤ إِلَىٰۤ إِبۡرَ ٰ⁠هِیمَ وَإِسۡمَـٰعِیلَ وَإِسۡحَـٰقَ وَیَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَعِیسَىٰ وَأَیُّوبَ وَیُونُسَ وَهَـٰرُونَ وَسُلَیۡمَـٰنَۚ وَءَاتَیۡنَا دَاوُۥدَ زَبُورࣰا\n",
    "translations": {
      "en": "BEHOLD, We have inspired thee [O Prophet] just as We inspired Noah and all the prophets after him - as We inspired Abraham, and Ishmael, and Isaac, and Jacob, and their descendants, including Jesus and Job, and Jonah, and Aaron, and Solomon; and as We vouchsafed unto David a book of divine wisdom;",
      "ms": "",
      "id": "",
      "ar": "۞ إِنَّاۤ أَوۡحَیۡنَاۤ إِلَیۡكَ كَمَاۤ أَوۡحَیۡنَاۤ إِلَىٰ نُوحࣲ وَٱلنَّبِیِّـۧنَ مِنۢ بَعۡدِهِۦۚ وَأَوۡحَیۡنَاۤ إِلَىٰۤ إِبۡرَ ٰ⁠هِیمَ وَإِسۡمَـٰعِیلَ وَإِسۡحَـٰقَ وَیَعۡقُوبَ وَٱلۡأَسۡبَاطِ وَعِیسَىٰ وَأَیُّوبَ وَیُونُسَ وَهَـٰرُونَ وَسُلَیۡمَـٰنَۚ وَءَاتَیۡنَا دَاوُۥدَ زَبُورࣰا\n"
    }
  },
  {
    "id": 657,
    "surahId": 4,
    "ayahNumber": 164,
    "arabicText": "وَرُسُلࣰا قَدۡ قَصَصۡنَـٰهُمۡ عَلَیۡكَ مِن قَبۡلُ وَرُسُلࣰا لَّمۡ نَقۡصُصۡهُمۡ عَلَیۡكَۚ وَكَلَّمَ ٱللَّهُ مُوسَىٰ تَكۡلِیمࣰا\n",
    "translations": {
      "en": "and as [We inspired other] apostles whom We have mentioned to thee ere this, as well as apostles whom We have not mentioned to thee; and as God spoke His word unto Moses:",
      "ms": "",
      "id": "",
      "ar": "وَرُسُلࣰا قَدۡ قَصَصۡنَـٰهُمۡ عَلَیۡكَ مِن قَبۡلُ وَرُسُلࣰا لَّمۡ نَقۡصُصۡهُمۡ عَلَیۡكَۚ وَكَلَّمَ ٱللَّهُ مُوسَىٰ تَكۡلِیمࣰا\n"
    }
  },
  {
    "id": 658,
    "surahId": 4,
    "ayahNumber": 165,
    "arabicText": "رُّسُلࣰا مُّبَشِّرِینَ وَمُنذِرِینَ لِئَلَّا یَكُونَ لِلنَّاسِ عَلَى ٱللَّهِ حُجَّةُۢ بَعۡدَ ٱلرُّسُلِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n",
    "translations": {
      "en": "[We sent all these] apostles as heralds of glad tidings and as warners, so that men might have no excuse before God after [the coming of] these apostles: and God is indeed al­mighty, wise.",
      "ms": "",
      "id": "",
      "ar": "رُّسُلࣰا مُّبَشِّرِینَ وَمُنذِرِینَ لِئَلَّا یَكُونَ لِلنَّاسِ عَلَى ٱللَّهِ حُجَّةُۢ بَعۡدَ ٱلرُّسُلِۚ وَكَانَ ٱللَّهُ عَزِیزًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 659,
    "surahId": 4,
    "ayahNumber": 166,
    "arabicText": "لَّـٰكِنِ ٱللَّهُ یَشۡهَدُ بِمَاۤ أَنزَلَ إِلَیۡكَۖ أَنزَلَهُۥ بِعِلۡمِهِۦۖ وَٱلۡمَلَـٰۤىِٕكَةُ یَشۡهَدُونَۚ وَكَفَىٰ بِٱللَّهِ شَهِیدًا\n",
    "translations": {
      "en": "However it be, God [Himself] bears witness to the truth of what He has bestowed from on high upon thee: out of His own wisdom has He bestowed it from on high, with the angels bearing witness thereto - although none can bear witness as God does.",
      "ms": "",
      "id": "",
      "ar": "لَّـٰكِنِ ٱللَّهُ یَشۡهَدُ بِمَاۤ أَنزَلَ إِلَیۡكَۖ أَنزَلَهُۥ بِعِلۡمِهِۦۖ وَٱلۡمَلَـٰۤىِٕكَةُ یَشۡهَدُونَۚ وَكَفَىٰ بِٱللَّهِ شَهِیدًا\n"
    }
  },
  {
    "id": 660,
    "surahId": 4,
    "ayahNumber": 167,
    "arabicText": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ قَدۡ ضَلُّوا۟ ضَلَـٰلَۢا بَعِیدًا\n",
    "translations": {
      "en": "Behold, those who are bent on denying the truth and on turning others away from the path of God have indeed gone far astray.",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ قَدۡ ضَلُّوا۟ ضَلَـٰلَۢا بَعِیدًا\n"
    }
  },
  {
    "id": 661,
    "surahId": 4,
    "ayahNumber": 168,
    "arabicText": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَظَلَمُوا۟ لَمۡ یَكُنِ ٱللَّهُ لِیَغۡفِرَ لَهُمۡ وَلَا لِیَهۡدِیَهُمۡ طَرِیقًا\n",
    "translations": {
      "en": "Behold, those who are bent on denying the truth and on evildoing - God will indeed not forgive them, nor will He guide them onto any road",
      "ms": "",
      "id": "",
      "ar": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَظَلَمُوا۟ لَمۡ یَكُنِ ٱللَّهُ لِیَغۡفِرَ لَهُمۡ وَلَا لِیَهۡدِیَهُمۡ طَرِیقًا\n"
    }
  },
  {
    "id": 662,
    "surahId": 4,
    "ayahNumber": 169,
    "arabicText": "إِلَّا طَرِیقَ جَهَنَّمَ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۚ وَكَانَ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرࣰا\n",
    "translations": {
      "en": "but the road that leads to hell, therein to abide beyond the count of time: and this is indeed easy for God.",
      "ms": "",
      "id": "",
      "ar": "إِلَّا طَرِیقَ جَهَنَّمَ خَـٰلِدِینَ فِیهَاۤ أَبَدࣰاۚ وَكَانَ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرࣰا\n"
    }
  },
  {
    "id": 663,
    "surahId": 4,
    "ayahNumber": 170,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَكُمُ ٱلرَّسُولُ بِٱلۡحَقِّ مِن رَّبِّكُمۡ فَـَٔامِنُوا۟ خَیۡرࣰا لَّكُمۡۚ وَإِن تَكۡفُرُوا۟ فَإِنَّ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n",
    "translations": {
      "en": "O mankind! The Apostle has now come unto you with the truth from your Sustainer: believe, then, for your own good! And if you deny the truth - behold, unto God belongs all that is in the heavens and all that is on earth, and God is indeed all-knowing, wise!",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَكُمُ ٱلرَّسُولُ بِٱلۡحَقِّ مِن رَّبِّكُمۡ فَـَٔامِنُوا۟ خَیۡرࣰا لَّكُمۡۚ وَإِن تَكۡفُرُوا۟ فَإِنَّ لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِیمًا حَكِیمࣰا\n"
    }
  },
  {
    "id": 664,
    "surahId": 4,
    "ayahNumber": 171,
    "arabicText": "یَـٰۤأَهۡلَ ٱلۡكِتَـٰبِ لَا تَغۡلُوا۟ فِی دِینِكُمۡ وَلَا تَقُولُوا۟ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِیحُ عِیسَى ٱبۡنُ مَرۡیَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥۤ أَلۡقَىٰهَاۤ إِلَىٰ مَرۡیَمَ وَرُوحࣱ مِّنۡهُۖ فَـَٔامِنُوا۟ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُوا۟ ثَلَـٰثَةٌۚ ٱنتَهُوا۟ خَیۡرࣰا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۖ سُبۡحَـٰنَهُۥۤ أَن یَكُونَ لَهُۥ وَلَدࣱۘ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِیلࣰا\n",
    "translations": {
      "en": "O FOLLOWERS of the Gospel! Do not overstep the bounds [of truth] in your religious beliefs, and do not say of God anything but the truth. The Christ Jesus, son of Mary, was but God's Apostle - [the fulfilment of] His promise which He had conveyed unto Mary - and a soul created by Him. Believe, then, in God and His apostles, and do not say, \"[God is] a trinity\". Desist [from this assertion] for your own good. God is but One God; utterly remote is He, in His glory, from having a son: unto Him belongs all that is in the heavens and all that is on earth; and none is as worthy of trust as God.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَهۡلَ ٱلۡكِتَـٰبِ لَا تَغۡلُوا۟ فِی دِینِكُمۡ وَلَا تَقُولُوا۟ عَلَى ٱللَّهِ إِلَّا ٱلۡحَقَّۚ إِنَّمَا ٱلۡمَسِیحُ عِیسَى ٱبۡنُ مَرۡیَمَ رَسُولُ ٱللَّهِ وَكَلِمَتُهُۥۤ أَلۡقَىٰهَاۤ إِلَىٰ مَرۡیَمَ وَرُوحࣱ مِّنۡهُۖ فَـَٔامِنُوا۟ بِٱللَّهِ وَرُسُلِهِۦۖ وَلَا تَقُولُوا۟ ثَلَـٰثَةٌۚ ٱنتَهُوا۟ خَیۡرࣰا لَّكُمۡۚ إِنَّمَا ٱللَّهُ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۖ سُبۡحَـٰنَهُۥۤ أَن یَكُونَ لَهُۥ وَلَدࣱۘ لَّهُۥ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِۗ وَكَفَىٰ بِٱللَّهِ وَكِیلࣰا\n"
    }
  },
  {
    "id": 665,
    "surahId": 4,
    "ayahNumber": 172,
    "arabicText": "لَّن یَسۡتَنكِفَ ٱلۡمَسِیحُ أَن یَكُونَ عَبۡدࣰا لِّلَّهِ وَلَا ٱلۡمَلَـٰۤىِٕكَةُ ٱلۡمُقَرَّبُونَۚ وَمَن یَسۡتَنكِفۡ عَنۡ عِبَادَتِهِۦ وَیَسۡتَكۡبِرۡ فَسَیَحۡشُرُهُمۡ إِلَیۡهِ جَمِیعࣰا\n",
    "translations": {
      "en": "Never did the Christ feel too proud to be God's servant, nor do the angels who are near unto Him. And those who feel too proud to serve Him and glory in their arrogance [should know that on Judgment Day] He will gather them all unto Himself:",
      "ms": "",
      "id": "",
      "ar": "لَّن یَسۡتَنكِفَ ٱلۡمَسِیحُ أَن یَكُونَ عَبۡدࣰا لِّلَّهِ وَلَا ٱلۡمَلَـٰۤىِٕكَةُ ٱلۡمُقَرَّبُونَۚ وَمَن یَسۡتَنكِفۡ عَنۡ عِبَادَتِهِۦ وَیَسۡتَكۡبِرۡ فَسَیَحۡشُرُهُمۡ إِلَیۡهِ جَمِیعࣰا\n"
    }
  },
  {
    "id": 666,
    "surahId": 4,
    "ayahNumber": 173,
    "arabicText": "فَأَمَّا ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فَیُوَفِّیهِمۡ أُجُورَهُمۡ وَیَزِیدُهُم مِّن فَضۡلِهِۦۖ وَأَمَّا ٱلَّذِینَ ٱسۡتَنكَفُوا۟ وَٱسۡتَكۡبَرُوا۟ فَیُعَذِّبُهُمۡ عَذَابًا أَلِیمࣰا وَلَا یَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِیࣰّا وَلَا نَصِیرࣰا\n",
    "translations": {
      "en": "whereupon unto those who attained to faith and did good deeds He will grant their just rewards, and give them yet more out of His bounty; whereas those who felt too proud and gloried in their arrogance He will chastise with grievous suffering: and they shall find none to protect them from God, and none to bring them succour.",
      "ms": "",
      "id": "",
      "ar": "فَأَمَّا ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فَیُوَفِّیهِمۡ أُجُورَهُمۡ وَیَزِیدُهُم مِّن فَضۡلِهِۦۖ وَأَمَّا ٱلَّذِینَ ٱسۡتَنكَفُوا۟ وَٱسۡتَكۡبَرُوا۟ فَیُعَذِّبُهُمۡ عَذَابًا أَلِیمࣰا وَلَا یَجِدُونَ لَهُم مِّن دُونِ ٱللَّهِ وَلِیࣰّا وَلَا نَصِیرࣰا\n"
    }
  },
  {
    "id": 667,
    "surahId": 4,
    "ayahNumber": 174,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَكُم بُرۡهَـٰنࣱ مِّن رَّبِّكُمۡ وَأَنزَلۡنَاۤ إِلَیۡكُمۡ نُورࣰا مُّبِینࣰا\n",
    "translations": {
      "en": "O MANKIND! A manifestation of the truth has now come unto you from your Sustainer, and We have sent down unto you a clear light.",
      "ms": "",
      "id": "",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ قَدۡ جَاۤءَكُم بُرۡهَـٰنࣱ مِّن رَّبِّكُمۡ وَأَنزَلۡنَاۤ إِلَیۡكُمۡ نُورࣰا مُّبِینࣰا\n"
    }
  },
  {
    "id": 668,
    "surahId": 4,
    "ayahNumber": 175,
    "arabicText": "فَأَمَّا ٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَٱعۡتَصَمُوا۟ بِهِۦ فَسَیُدۡخِلُهُمۡ فِی رَحۡمَةࣲ مِّنۡهُ وَفَضۡلࣲ وَیَهۡدِیهِمۡ إِلَیۡهِ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n",
    "translations": {
      "en": "And as for those who have attained to faith in God and hold fast unto Him - He will enfold them within His grace and bounty, and guide them unto Himself by a straight way.",
      "ms": "",
      "id": "",
      "ar": "فَأَمَّا ٱلَّذِینَ ءَامَنُوا۟ بِٱللَّهِ وَٱعۡتَصَمُوا۟ بِهِۦ فَسَیُدۡخِلُهُمۡ فِی رَحۡمَةࣲ مِّنۡهُ وَفَضۡلࣲ وَیَهۡدِیهِمۡ إِلَیۡهِ صِرَ ٰ⁠طࣰا مُّسۡتَقِیمࣰا\n"
    }
  },
  {
    "id": 669,
    "surahId": 4,
    "ayahNumber": 176,
    "arabicText": "یَسۡتَفۡتُونَكَ قُلِ ٱللَّهُ یُفۡتِیكُمۡ فِی ٱلۡكَلَـٰلَةِۚ إِنِ ٱمۡرُؤٌا۟ هَلَكَ لَیۡسَ لَهُۥ وَلَدࣱ وَلَهُۥۤ أُخۡتࣱ فَلَهَا نِصۡفُ مَا تَرَكَۚ وَهُوَ یَرِثُهَاۤ إِن لَّمۡ یَكُن لَّهَا وَلَدࣱۚ فَإِن كَانَتَا ٱثۡنَتَیۡنِ فَلَهُمَا ٱلثُّلُثَانِ مِمَّا تَرَكَۚ وَإِن كَانُوۤا۟ إِخۡوَةࣰ رِّجَالࣰا وَنِسَاۤءࣰ فَلِلذَّكَرِ مِثۡلُ حَظِّ ٱلۡأُنثَیَیۡنِۗ یُبَیِّنُ ٱللَّهُ لَكُمۡ أَن تَضِلُّوا۟ۗ وَٱللَّهُ بِكُلِّ شَیۡءٍ عَلِیمُۢ\n",
    "translations": {
      "en": "THEY WILL ASK thee to enlighten them. Say: \"God enlightens you [thus] about the laws concerning [inheritance from] those who leave no heir in the direct line: If a man dies childless and has a sister, she shall inherit one-half of what he has left, just as he shall inherit from her if she dies childless. But if there are two sisters, both [together] shall have two-thirds of what he has left; and if there are brothers and sisters, then the male shall have the equal of two females' share.\" God makes [all this] clear unto you, lest you go astray; and God knows everything.",
      "ms": "",
      "id": "",
      "ar": "یَسۡتَفۡتُونَكَ قُلِ ٱللَّهُ یُفۡتِیكُمۡ فِی ٱلۡكَلَـٰلَةِۚ إِنِ ٱمۡرُؤٌا۟ هَلَكَ لَیۡسَ لَهُۥ وَلَدࣱ وَلَهُۥۤ أُخۡتࣱ فَلَهَا نِصۡفُ مَا تَرَكَۚ وَهُوَ یَرِثُهَاۤ إِن لَّمۡ یَكُن لَّهَا وَلَدࣱۚ فَإِن كَانَتَا ٱثۡنَتَیۡنِ فَلَهُمَا ٱلثُّلُثَانِ مِمَّا تَرَكَۚ وَإِن كَانُوۤا۟ إِخۡوَةࣰ رِّجَالࣰا وَنِسَاۤءࣰ فَلِلذَّكَرِ مِثۡلُ حَظِّ ٱلۡأُنثَیَیۡنِۗ یُبَیِّنُ ٱللَّهُ لَكُمۡ أَن تَضِلُّوا۟ۗ وَٱللَّهُ بِكُلِّ شَیۡءٍ عَلِیمُۢ\n"
    }
  }
]