[
  {
    "id": 1708,
    "surahId": 13,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤمۤرۚ تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِۗ وَٱلَّذِیۤ أُنزِلَ إِلَیۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Alif. Lam. Mim. Ra. THESE ARE MESSAGES of revelation: and what has been bestowed upon thee from on high by thy Sustainer is the truth-yet most people will not believe [in it]?",
      "ms": "",
      "id": "",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤمۤرۚ تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِۗ وَٱلَّذِیۤ أُنزِلَ إِلَیۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 1709,
    "surahId": 13,
    "ayahNumber": 2,
    "arabicText": "ٱللَّهُ ٱلَّذِی رَفَعَ ٱلسَّمَـٰوَ ٰ⁠تِ بِغَیۡرِ عَمَدࣲ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلࣱّ یَجۡرِی لِأَجَلࣲ مُّسَمࣰّىۚ یُدَبِّرُ ٱلۡأَمۡرَ یُفَصِّلُ ٱلۡـَٔایَـٰتِ لَعَلَّكُم بِلِقَاۤءِ رَبِّكُمۡ تُوقِنُونَ\n",
    "translations": {
      "en": "It is God who has raised the heavens without any supports that you could see, and is established on the throne of His almightiness; and He [it is who] has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him]. He governs all that exists. Clearly does He spell out these messages, so that you might be certain in your innermost that you are destined to meet your Sustainer [on Judgment Day].",
      "ms": "",
      "id": "",
      "ar": "ٱللَّهُ ٱلَّذِی رَفَعَ ٱلسَّمَـٰوَ ٰ⁠تِ بِغَیۡرِ عَمَدࣲ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلࣱّ یَجۡرِی لِأَجَلࣲ مُّسَمࣰّىۚ یُدَبِّرُ ٱلۡأَمۡرَ یُفَصِّلُ ٱلۡـَٔایَـٰتِ لَعَلَّكُم بِلِقَاۤءِ رَبِّكُمۡ تُوقِنُونَ\n"
    }
  },
  {
    "id": 1710,
    "surahId": 13,
    "ayahNumber": 3,
    "arabicText": "وَهُوَ ٱلَّذِی مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِیهَا رَوَ ٰ⁠سِیَ وَأَنۡهَـٰرࣰاۖ وَمِن كُلِّ ٱلثَّمَرَ ٰ⁠تِ جَعَلَ فِیهَا زَوۡجَیۡنِ ٱثۡنَیۡنِۖ یُغۡشِی ٱلَّیۡلَ ٱلنَّهَارَۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَتَفَكَّرُونَ\n",
    "translations": {
      "en": "And it is He who has spread the earth wide and placed on it firm mountains and running waters, and created thereon two sexes of every [kind of] plant; [and it is He who] causes the night to cover the day. Verily, in all this there are messages indeed for people who think!",
      "ms": "",
      "id": "",
      "ar": "وَهُوَ ٱلَّذِی مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِیهَا رَوَ ٰ⁠سِیَ وَأَنۡهَـٰرࣰاۖ وَمِن كُلِّ ٱلثَّمَرَ ٰ⁠تِ جَعَلَ فِیهَا زَوۡجَیۡنِ ٱثۡنَیۡنِۖ یُغۡشِی ٱلَّیۡلَ ٱلنَّهَارَۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَتَفَكَّرُونَ\n"
    }
  },
  {
    "id": 1711,
    "surahId": 13,
    "ayahNumber": 4,
    "arabicText": "وَفِی ٱلۡأَرۡضِ قِطَعࣱ مُّتَجَـٰوِرَ ٰ⁠تࣱ وَجَنَّـٰتࣱ مِّنۡ أَعۡنَـٰبࣲ وَزَرۡعࣱ وَنَخِیلࣱ صِنۡوَانࣱ وَغَیۡرُ صِنۡوَانࣲ یُسۡقَىٰ بِمَاۤءࣲ وَ ٰ⁠حِدࣲ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضࣲ فِی ٱلۡأُكُلِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَعۡقِلُونَ\n",
    "translations": {
      "en": "And there are on earth [many] tracts of land close by one another [and yet widely differing from one another]; and [there are on it] vinyards, and fields of grain, and date-palms growing in clusters from one root or standing alone, [all] watered with the same water: and yet, some of them have We favoured above others by way of the food [which they provide for man and beast]. Verily, in all this there are messages indeed for people who use their reason!",
      "ms": "",
      "id": "",
      "ar": "وَفِی ٱلۡأَرۡضِ قِطَعࣱ مُّتَجَـٰوِرَ ٰ⁠تࣱ وَجَنَّـٰتࣱ مِّنۡ أَعۡنَـٰبࣲ وَزَرۡعࣱ وَنَخِیلࣱ صِنۡوَانࣱ وَغَیۡرُ صِنۡوَانࣲ یُسۡقَىٰ بِمَاۤءࣲ وَ ٰ⁠حِدࣲ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضࣲ فِی ٱلۡأُكُلِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1712,
    "surahId": 13,
    "ayahNumber": 5,
    "arabicText": "۞ وَإِن تَعۡجَبۡ فَعَجَبࣱ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَ ٰ⁠بًا أَءِنَّا لَفِی خَلۡقࣲ جَدِیدٍۗ أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ كَفَرُوا۟ بِرَبِّهِمۡۖ وَأُو۟لَـٰۤىِٕكَ ٱلۡأَغۡلَـٰلُ فِیۤ أَعۡنَاقِهِمۡۖ وَأُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلنَّارِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n",
    "translations": {
      "en": "BUT IF thou art amazed [at the marvels of God's creation], amazing, too, is their saying, \"What! After we have become dust, shall we indeed be [restored to life] in a new act of creation?\" It is they who [thus show that they] are bent on denying their Sustainer; and it is they who carry the shackles [of their own making] around their necks; and it is they who are destined for the fire, therein to abide.",
      "ms": "",
      "id": "",
      "ar": "۞ وَإِن تَعۡجَبۡ فَعَجَبࣱ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَ ٰ⁠بًا أَءِنَّا لَفِی خَلۡقࣲ جَدِیدٍۗ أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ كَفَرُوا۟ بِرَبِّهِمۡۖ وَأُو۟لَـٰۤىِٕكَ ٱلۡأَغۡلَـٰلُ فِیۤ أَعۡنَاقِهِمۡۖ وَأُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلنَّارِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n"
    }
  },
  {
    "id": 1713,
    "surahId": 13,
    "ayahNumber": 6,
    "arabicText": "وَیَسۡتَعۡجِلُونَكَ بِٱلسَّیِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَـٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةࣲ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِیدُ ٱلۡعِقَابِ\n",
    "translations": {
      "en": "And [since, O Prophet, they are bent on denying the truth,] they challenge thee to hasten the coming upon them of evil instead of [hoping for] good although [they ought to know that] the exemplary punishments [which they now deride] have indeed come to pass before their time. Now, behold, thy Sustainer is full of forgiveness unto men despite all their evildoing: but, behold, thy Sustainer is [also] truly severe in retribution!",
      "ms": "",
      "id": "",
      "ar": "وَیَسۡتَعۡجِلُونَكَ بِٱلسَّیِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَـٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةࣲ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِیدُ ٱلۡعِقَابِ\n"
    }
  },
  {
    "id": 1714,
    "surahId": 13,
    "ayahNumber": 7,
    "arabicText": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۤۗ إِنَّمَاۤ أَنتَ مُنذِرࣱۖ وَلِكُلِّ قَوۡمٍ هَادٍ\n",
    "translations": {
      "en": "However, they who are bent on denying the truth [refuse to believe and] say, \"Why has no miraculous sign ever been bestowed on him from on high by his Sustainer?\" [But] thou art only a warmer; and [in God] all people have a guide.",
      "ms": "",
      "id": "",
      "ar": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۤۗ إِنَّمَاۤ أَنتَ مُنذِرࣱۖ وَلِكُلِّ قَوۡمٍ هَادٍ\n"
    }
  },
  {
    "id": 1715,
    "surahId": 13,
    "ayahNumber": 8,
    "arabicText": "ٱللَّهُ یَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِیضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَیۡءٍ عِندَهُۥ بِمِقۡدَارٍ\n",
    "translations": {
      "en": "God knows what any female bears [in her womb], and by how much the wombs may fall short [in gestation], and by how much they may increase [the average period]: for with Him everything is [created] in accordance with its scope and purpose.",
      "ms": "",
      "id": "",
      "ar": "ٱللَّهُ یَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِیضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَیۡءٍ عِندَهُۥ بِمِقۡدَارٍ\n"
    }
  },
  {
    "id": 1716,
    "surahId": 13,
    "ayahNumber": 9,
    "arabicText": "عَـٰلِمُ ٱلۡغَیۡبِ وَٱلشَّهَـٰدَةِ ٱلۡكَبِیرُ ٱلۡمُتَعَالِ\n",
    "translations": {
      "en": "He knows all that is beyond the reach of a created being's perception as well as all that can be witnessed by a creature's senses or mind -the Great One, the One far above anything that is or could ever be!",
      "ms": "",
      "id": "",
      "ar": "عَـٰلِمُ ٱلۡغَیۡبِ وَٱلشَّهَـٰدَةِ ٱلۡكَبِیرُ ٱلۡمُتَعَالِ\n"
    }
  },
  {
    "id": 1717,
    "surahId": 13,
    "ayahNumber": 10,
    "arabicText": "سَوَاۤءࣱ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۭ بِٱلَّیۡلِ وَسَارِبُۢ بِٱلنَّهَارِ\n",
    "translations": {
      "en": "It is all alike [to Him] whether any of you conceals his thought or brings it into the open, and whether he seeks to hide [his evil deeds] under the cover of night or walks [boldly] in the light of day,",
      "ms": "",
      "id": "",
      "ar": "سَوَاۤءࣱ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۭ بِٱلَّیۡلِ وَسَارِبُۢ بِٱلنَّهَارِ\n"
    }
  },
  {
    "id": 1718,
    "surahId": 13,
    "ayahNumber": 11,
    "arabicText": "لَهُۥ مُعَقِّبَـٰتࣱ مِّنۢ بَیۡنِ یَدَیۡهِ وَمِنۡ خَلۡفِهِۦ یَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا یُغَیِّرُ مَا بِقَوۡمٍ حَتَّىٰ یُغَیِّرُوا۟ مَا بِأَنفُسِهِمۡۗ وَإِذَاۤ أَرَادَ ٱللَّهُ بِقَوۡمࣲ سُوۤءࣰا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ\n",
    "translations": {
      "en": "[thinking that] he has hosts of helpers-both such as can be perceived by him and such as are hidden from him -that could preserve him from whatever God may have willed. Verily, God does not change men's condition unless they change their inner selves; and when God wills people to suffer evil [in consequence of their own evil deeds], there is none who could avert it: for they have none who could protect them from Him.",
      "ms": "",
      "id": "",
      "ar": "لَهُۥ مُعَقِّبَـٰتࣱ مِّنۢ بَیۡنِ یَدَیۡهِ وَمِنۡ خَلۡفِهِۦ یَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا یُغَیِّرُ مَا بِقَوۡمٍ حَتَّىٰ یُغَیِّرُوا۟ مَا بِأَنفُسِهِمۡۗ وَإِذَاۤ أَرَادَ ٱللَّهُ بِقَوۡمࣲ سُوۤءࣰا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ\n"
    }
  },
  {
    "id": 1719,
    "surahId": 13,
    "ayahNumber": 12,
    "arabicText": "هُوَ ٱلَّذِی یُرِیكُمُ ٱلۡبَرۡقَ خَوۡفࣰا وَطَمَعࣰا وَیُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ\n",
    "translations": {
      "en": "HE IT IS who displays before you the lightning, to give rise to [both] fear and hope, and calls heavy clouds into being;",
      "ms": "",
      "id": "",
      "ar": "هُوَ ٱلَّذِی یُرِیكُمُ ٱلۡبَرۡقَ خَوۡفࣰا وَطَمَعࣰا وَیُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ\n"
    }
  },
  {
    "id": 1720,
    "surahId": 13,
    "ayahNumber": 13,
    "arabicText": "وَیُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَـٰۤىِٕكَةُ مِنۡ خِیفَتِهِۦ وَیُرۡسِلُ ٱلصَّوَ ٰ⁠عِقَ فَیُصِیبُ بِهَا مَن یَشَاۤءُ وَهُمۡ یُجَـٰدِلُونَ فِی ٱللَّهِ وَهُوَ شَدِیدُ ٱلۡمِحَالِ\n",
    "translations": {
      "en": "and the thunder extols His limitless glory and praises Him, and [so do] the angels, in awe of Him; and He [it is who] lets loose the thunderbolts and strikes with them whom He wills. And yet, they stubbornly argue about God, notwithstanding [all evidence] that He alone has the power to contrive whatever His unfathomable wisdom wills!",
      "ms": "",
      "id": "",
      "ar": "وَیُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَـٰۤىِٕكَةُ مِنۡ خِیفَتِهِۦ وَیُرۡسِلُ ٱلصَّوَ ٰ⁠عِقَ فَیُصِیبُ بِهَا مَن یَشَاۤءُ وَهُمۡ یُجَـٰدِلُونَ فِی ٱللَّهِ وَهُوَ شَدِیدُ ٱلۡمِحَالِ\n"
    }
  },
  {
    "id": 1721,
    "surahId": 13,
    "ayahNumber": 14,
    "arabicText": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِینَ یَدۡعُونَ مِن دُونِهِۦ لَا یَسۡتَجِیبُونَ لَهُم بِشَیۡءٍ إِلَّا كَبَـٰسِطِ كَفَّیۡهِ إِلَى ٱلۡمَاۤءِ لِیَبۡلُغَ فَاهُ وَمَا هُوَ بِبَـٰلِغِهِۦۚ وَمَا دُعَاۤءُ ٱلۡكَـٰفِرِینَ إِلَّا فِی ضَلَـٰلࣲ\n",
    "translations": {
      "en": "Unto Him [alone] is due all prayer aiming at the Ultimate Truth, since those [other beings or powers] whom men invoke instead of God cannot respond to them in any way - [so that he who invokes them is] but like one who stretches his open hands towards water, [hoping] that it will reach his mouth, the while it never reaches him. Hence, the prayer of those who deny the truth amounts to no more than losing oneself in grievous error.",
      "ms": "",
      "id": "",
      "ar": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِینَ یَدۡعُونَ مِن دُونِهِۦ لَا یَسۡتَجِیبُونَ لَهُم بِشَیۡءٍ إِلَّا كَبَـٰسِطِ كَفَّیۡهِ إِلَى ٱلۡمَاۤءِ لِیَبۡلُغَ فَاهُ وَمَا هُوَ بِبَـٰلِغِهِۦۚ وَمَا دُعَاۤءُ ٱلۡكَـٰفِرِینَ إِلَّا فِی ضَلَـٰلࣲ\n"
    }
  },
  {
    "id": 1722,
    "surahId": 13,
    "ayahNumber": 15,
    "arabicText": "وَلِلَّهِ یَسۡجُدُ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ طَوۡعࣰا وَكَرۡهࣰا وَظِلَـٰلُهُم بِٱلۡغُدُوِّ وَٱلۡـَٔاصَالِ ۩\n",
    "translations": {
      "en": "And before God prostrate themselves, willingly or unwillingly, all [things and beings] that are in the heavens and on earth, as do their shadows in the mornings and the evenings.",
      "ms": "",
      "id": "",
      "ar": "وَلِلَّهِ یَسۡجُدُ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ طَوۡعࣰا وَكَرۡهࣰا وَظِلَـٰلُهُم بِٱلۡغُدُوِّ وَٱلۡـَٔاصَالِ ۩\n"
    }
  },
  {
    "id": 1723,
    "surahId": 13,
    "ayahNumber": 16,
    "arabicText": "قُلۡ مَن رَّبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦۤ أَوۡلِیَاۤءَ لَا یَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعࣰا وَلَا ضَرࣰّاۚ قُلۡ هَلۡ یَسۡتَوِی ٱلۡأَعۡمَىٰ وَٱلۡبَصِیرُ أَمۡ هَلۡ تَسۡتَوِی ٱلظُّلُمَـٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُوا۟ لِلَّهِ شُرَكَاۤءَ خَلَقُوا۟ كَخَلۡقِهِۦ فَتَشَـٰبَهَ ٱلۡخَلۡقُ عَلَیۡهِمۡۚ قُلِ ٱللَّهُ خَـٰلِقُ كُلِّ شَیۡءࣲ وَهُوَ ٱلۡوَ ٰ⁠حِدُ ٱلۡقَهَّـٰرُ\n",
    "translations": {
      "en": "Say: \"Who is the Sustainer of the heavens and the earth?\" Say: \"[It is] God.\" Say: \"[Why,] then, do you take for your protectors, instead of Him, such as have it not within their power to bring benefit to, or avert harm from, themselves?\" Say: \"Can the blind and the seeing be deemed equal? -or can the depths of darkness and the light be deemed equal?\" Or do they [really] believe that there are, side by side with God, other divine powers that have created the like of what He creates, so that this act of creation appears to them to be similar [to His]? Say: \"God is the Creator of all things; and He is the One who holds absolute sway over all that exists.\"",
      "ms": "",
      "id": "",
      "ar": "قُلۡ مَن رَّبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦۤ أَوۡلِیَاۤءَ لَا یَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعࣰا وَلَا ضَرࣰّاۚ قُلۡ هَلۡ یَسۡتَوِی ٱلۡأَعۡمَىٰ وَٱلۡبَصِیرُ أَمۡ هَلۡ تَسۡتَوِی ٱلظُّلُمَـٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُوا۟ لِلَّهِ شُرَكَاۤءَ خَلَقُوا۟ كَخَلۡقِهِۦ فَتَشَـٰبَهَ ٱلۡخَلۡقُ عَلَیۡهِمۡۚ قُلِ ٱللَّهُ خَـٰلِقُ كُلِّ شَیۡءࣲ وَهُوَ ٱلۡوَ ٰ⁠حِدُ ٱلۡقَهَّـٰرُ\n"
    }
  },
  {
    "id": 1724,
    "surahId": 13,
    "ayahNumber": 17,
    "arabicText": "أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَسَالَتۡ أَوۡدِیَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّیۡلُ زَبَدࣰا رَّابِیࣰاۖ وَمِمَّا یُوقِدُونَ عَلَیۡهِ فِی ٱلنَّارِ ٱبۡتِغَاۤءَ حِلۡیَةٍ أَوۡ مَتَـٰعࣲ زَبَدࣱ مِّثۡلُهُۥۚ كَذَ ٰ⁠لِكَ یَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَـٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَیَذۡهَبُ جُفَاۤءࣰۖ وَأَمَّا مَا یَنفَعُ ٱلنَّاسَ فَیَمۡكُثُ فِی ٱلۡأَرۡضِۚ كَذَ ٰ⁠لِكَ یَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ\n",
    "translations": {
      "en": "[Whenever] He sends down water from the sky, and [once-dry] river-beds are running high according to their measure, the stream carries scum on its surface; and, likewise, from that [metal] which they smelt in the fire in order to make ornaments or utensils, [there rises] scum. In this way does God set forth the parable of truth and falsehood: for, as far as the scum is concerned, it passes away as [does all] dross; but that which is of benefit to man abides on earth. In this way does God set forth the parables",
      "ms": "",
      "id": "",
      "ar": "أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَسَالَتۡ أَوۡدِیَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّیۡلُ زَبَدࣰا رَّابِیࣰاۖ وَمِمَّا یُوقِدُونَ عَلَیۡهِ فِی ٱلنَّارِ ٱبۡتِغَاۤءَ حِلۡیَةٍ أَوۡ مَتَـٰعࣲ زَبَدࣱ مِّثۡلُهُۥۚ كَذَ ٰ⁠لِكَ یَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَـٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَیَذۡهَبُ جُفَاۤءࣰۖ وَأَمَّا مَا یَنفَعُ ٱلنَّاسَ فَیَمۡكُثُ فِی ٱلۡأَرۡضِۚ كَذَ ٰ⁠لِكَ یَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ\n"
    }
  },
  {
    "id": 1725,
    "surahId": 13,
    "ayahNumber": 18,
    "arabicText": "لِلَّذِینَ ٱسۡتَجَابُوا۟ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِینَ لَمۡ یَسۡتَجِیبُوا۟ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِی ٱلۡأَرۡضِ جَمِیعࣰا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡا۟ بِهِۦۤۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ سُوۤءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ\n",
    "translations": {
      "en": "of those who have responded to their Sustainer with a goodly response, and of those who did not respond to Him. [As for the latter,] if they possessed all that is on earth, and twice as much, they would surely offer it as ransom [on the Day of Judgment]: a most evil reckoning awaits them, and their goal is hell: and how evil a resting-place!",
      "ms": "",
      "id": "",
      "ar": "لِلَّذِینَ ٱسۡتَجَابُوا۟ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِینَ لَمۡ یَسۡتَجِیبُوا۟ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِی ٱلۡأَرۡضِ جَمِیعࣰا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡا۟ بِهِۦۤۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ سُوۤءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ\n"
    }
  },
  {
    "id": 1726,
    "surahId": 13,
    "ayahNumber": 19,
    "arabicText": "۞ أَفَمَن یَعۡلَمُ أَنَّمَاۤ أُنزِلَ إِلَیۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰۤۚ إِنَّمَا یَتَذَكَّرُ أُو۟لُوا۟ ٱلۡأَلۡبَـٰبِ\n",
    "translations": {
      "en": "CAN, THEN, he who knows that whatever has been bestowed from on high upon thee by thy Sustainer is the truth be deemed equal to one who is blind? Only they who are endowed with insight keep this in mind:",
      "ms": "",
      "id": "",
      "ar": "۞ أَفَمَن یَعۡلَمُ أَنَّمَاۤ أُنزِلَ إِلَیۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰۤۚ إِنَّمَا یَتَذَكَّرُ أُو۟لُوا۟ ٱلۡأَلۡبَـٰبِ\n"
    }
  },
  {
    "id": 1727,
    "surahId": 13,
    "ayahNumber": 20,
    "arabicText": "ٱلَّذِینَ یُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا یَنقُضُونَ ٱلۡمِیثَـٰقَ\n",
    "translations": {
      "en": "they who are true to their bond with God and never break their covenant;",
      "ms": "",
      "id": "",
      "ar": "ٱلَّذِینَ یُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا یَنقُضُونَ ٱلۡمِیثَـٰقَ\n"
    }
  },
  {
    "id": 1728,
    "surahId": 13,
    "ayahNumber": 21,
    "arabicText": "وَٱلَّذِینَ یَصِلُونَ مَاۤ أَمَرَ ٱللَّهُ بِهِۦۤ أَن یُوصَلَ وَیَخۡشَوۡنَ رَبَّهُمۡ وَیَخَافُونَ سُوۤءَ ٱلۡحِسَابِ\n",
    "translations": {
      "en": "and who keep together what God has bidden to be joined, and stand in awe of their Sustainer and fear the most evil reckoning [which awaits such as do not respond to Him];",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذِینَ یَصِلُونَ مَاۤ أَمَرَ ٱللَّهُ بِهِۦۤ أَن یُوصَلَ وَیَخۡشَوۡنَ رَبَّهُمۡ وَیَخَافُونَ سُوۤءَ ٱلۡحِسَابِ\n"
    }
  },
  {
    "id": 1729,
    "surahId": 13,
    "ayahNumber": 22,
    "arabicText": "وَٱلَّذِینَ صَبَرُوا۟ ٱبۡتِغَاۤءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقۡنَـٰهُمۡ سِرࣰّا وَعَلَانِیَةࣰ وَیَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّیِّئَةَ أُو۟لَـٰۤىِٕكَ لَهُمۡ عُقۡبَى ٱلدَّارِ\n",
    "translations": {
      "en": "and who are patient in adversity out of a longing for their Sustainer's countenance, and are constant in prayer, and spend on others, secretly and openly, out of what We provide for them as sustenance, and [who] repel evil with good. It is these that shall find their fulfilment in the hereafter:",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذِینَ صَبَرُوا۟ ٱبۡتِغَاۤءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقۡنَـٰهُمۡ سِرࣰّا وَعَلَانِیَةࣰ وَیَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّیِّئَةَ أُو۟لَـٰۤىِٕكَ لَهُمۡ عُقۡبَى ٱلدَّارِ\n"
    }
  },
  {
    "id": 1730,
    "surahId": 13,
    "ayahNumber": 23,
    "arabicText": "جَنَّـٰتُ عَدۡنࣲ یَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَاۤىِٕهِمۡ وَأَزۡوَ ٰ⁠جِهِمۡ وَذُرِّیَّـٰتِهِمۡۖ وَٱلۡمَلَـٰۤىِٕكَةُ یَدۡخُلُونَ عَلَیۡهِم مِّن كُلِّ بَابࣲ\n",
    "translations": {
      "en": "gardens of perpetual bliss, which they shall enter together with the righteous from among their parents, their spouses, and their offspring; and the angels will come unto them from every gate [and will say]:",
      "ms": "",
      "id": "",
      "ar": "جَنَّـٰتُ عَدۡنࣲ یَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَاۤىِٕهِمۡ وَأَزۡوَ ٰ⁠جِهِمۡ وَذُرِّیَّـٰتِهِمۡۖ وَٱلۡمَلَـٰۤىِٕكَةُ یَدۡخُلُونَ عَلَیۡهِم مِّن كُلِّ بَابࣲ\n"
    }
  },
  {
    "id": 1731,
    "surahId": 13,
    "ayahNumber": 24,
    "arabicText": "سَلَـٰمٌ عَلَیۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ\n",
    "translations": {
      "en": "\"Peace be upon you, because you have persevered!\" How excellent, then, this fulfilment in the hereafter!",
      "ms": "",
      "id": "",
      "ar": "سَلَـٰمٌ عَلَیۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ\n"
    }
  },
  {
    "id": 1732,
    "surahId": 13,
    "ayahNumber": 25,
    "arabicText": "وَٱلَّذِینَ یَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِیثَـٰقِهِۦ وَیَقۡطَعُونَ مَاۤ أَمَرَ ٱللَّهُ بِهِۦۤ أَن یُوصَلَ وَیُفۡسِدُونَ فِی ٱلۡأَرۡضِ أُو۟لَـٰۤىِٕكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوۤءُ ٱلدَّارِ\n",
    "translations": {
      "en": "But as for those who break their bond with God after it has been established [in their nature], and cut asunder what God has bidden to be joined, and spread corruption on earth -their due is rejection [by God], and theirs is a most evil fate [in the life to come].",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذِینَ یَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِیثَـٰقِهِۦ وَیَقۡطَعُونَ مَاۤ أَمَرَ ٱللَّهُ بِهِۦۤ أَن یُوصَلَ وَیُفۡسِدُونَ فِی ٱلۡأَرۡضِ أُو۟لَـٰۤىِٕكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوۤءُ ٱلدَّارِ\n"
    }
  },
  {
    "id": 1733,
    "surahId": 13,
    "ayahNumber": 26,
    "arabicText": "ٱللَّهُ یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ وَیَقۡدِرُۚ وَفَرِحُوا۟ بِٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَمَا ٱلۡحَیَوٰةُ ٱلدُّنۡیَا فِی ٱلۡـَٔاخِرَةِ إِلَّا مَتَـٰعࣱ\n",
    "translations": {
      "en": "GOD GRANTS abundant sustenance, or gives it in scant measure, unto whomever He wills; and they [who are given abundance] rejoice in the life of this world - even though, as compared with the life to come, the life of this world is nought but -a fleeting pleasure.",
      "ms": "",
      "id": "",
      "ar": "ٱللَّهُ یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ وَیَقۡدِرُۚ وَفَرِحُوا۟ بِٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَمَا ٱلۡحَیَوٰةُ ٱلدُّنۡیَا فِی ٱلۡـَٔاخِرَةِ إِلَّا مَتَـٰعࣱ\n"
    }
  },
  {
    "id": 1734,
    "surahId": 13,
    "ayahNumber": 27,
    "arabicText": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ یُضِلُّ مَن یَشَاۤءُ وَیَهۡدِیۤ إِلَیۡهِ مَنۡ أَنَابَ\n",
    "translations": {
      "en": "NOW THOSE who are bent on denying the truth [of the Prophet's message] say, \"Why has no miraculous sign ever been bestowed upon him from on high by his Sustainer?\" Say: \"Behold, God lets go astray him who wills [to go astray], just as He guides unto Himself all who turn unto Him-",
      "ms": "",
      "id": "",
      "ar": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ یُضِلُّ مَن یَشَاۤءُ وَیَهۡدِیۤ إِلَیۡهِ مَنۡ أَنَابَ\n"
    }
  },
  {
    "id": 1735,
    "surahId": 13,
    "ayahNumber": 28,
    "arabicText": "ٱلَّذِینَ ءَامَنُوا۟ وَتَطۡمَىِٕنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَىِٕنُّ ٱلۡقُلُوبُ\n",
    "translations": {
      "en": "those who believe, and whose hearts find their rest in the remembrance of God - for, verily, in the remembrance of God [men's] hearts do find their rest-:",
      "ms": "",
      "id": "",
      "ar": "ٱلَّذِینَ ءَامَنُوا۟ وَتَطۡمَىِٕنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَىِٕنُّ ٱلۡقُلُوبُ\n"
    }
  },
  {
    "id": 1736,
    "surahId": 13,
    "ayahNumber": 29,
    "arabicText": "ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَـَٔابࣲ\n",
    "translations": {
      "en": "[and so it is that] they who attain to faith and do righteous deeds are destined for happiness [in this world] and the most beauteous of all goals [in the life to come]!\"",
      "ms": "",
      "id": "",
      "ar": "ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَـَٔابࣲ\n"
    }
  },
  {
    "id": 1737,
    "surahId": 13,
    "ayahNumber": 30,
    "arabicText": "كَذَ ٰ⁠لِكَ أَرۡسَلۡنَـٰكَ فِیۤ أُمَّةࣲ قَدۡ خَلَتۡ مِن قَبۡلِهَاۤ أُمَمࣱ لِّتَتۡلُوَا۟ عَلَیۡهِمُ ٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ وَهُمۡ یَكۡفُرُونَ بِٱلرَّحۡمَـٰنِۚ قُلۡ هُوَ رَبِّی لَاۤ إِلَـٰهَ إِلَّا هُوَ عَلَیۡهِ تَوَكَّلۡتُ وَإِلَیۡهِ مَتَابِ\n",
    "translations": {
      "en": "Thus have We raised thee [O Muhammad] as Our Apostle amidst a community [of unbelievers] before whose time [similar] communities have come and gone, so that thou might propound to them what We have revealed unto thee: for [in their ignorance] they deny the Most Gracious! Say: \"He is my Sustainer. There is no deity save Him. In Him have I placed my trust, and unto Him is my recourse!\"",
      "ms": "",
      "id": "",
      "ar": "كَذَ ٰ⁠لِكَ أَرۡسَلۡنَـٰكَ فِیۤ أُمَّةࣲ قَدۡ خَلَتۡ مِن قَبۡلِهَاۤ أُمَمࣱ لِّتَتۡلُوَا۟ عَلَیۡهِمُ ٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ وَهُمۡ یَكۡفُرُونَ بِٱلرَّحۡمَـٰنِۚ قُلۡ هُوَ رَبِّی لَاۤ إِلَـٰهَ إِلَّا هُوَ عَلَیۡهِ تَوَكَّلۡتُ وَإِلَیۡهِ مَتَابِ\n"
    }
  },
  {
    "id": 1738,
    "surahId": 13,
    "ayahNumber": 31,
    "arabicText": "وَلَوۡ أَنَّ قُرۡءَانࣰا سُیِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِیعًاۗ أَفَلَمۡ یَا۟یۡـَٔسِ ٱلَّذِینَ ءَامَنُوۤا۟ أَن لَّوۡ یَشَاۤءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِیعࣰاۗ وَلَا یَزَالُ ٱلَّذِینَ كَفَرُوا۟ تُصِیبُهُم بِمَا صَنَعُوا۟ قَارِعَةٌ أَوۡ تَحُلُّ قَرِیبࣰا مِّن دَارِهِمۡ حَتَّىٰ یَأۡتِیَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا یُخۡلِفُ ٱلۡمِیعَادَ\n",
    "translations": {
      "en": "Yet even if [they should listen to] a [divine] discourse by which mountains could be moved, or the earth cleft asunder, or the dead made to speak - [they who are bent on denying the truth would still refuse to believe in it]! Nay, but God alone has the power to decide what shall be. Have, then, they who have attained to faith not yet come to know that, had God so willed; He would indeed have guided all mankind aright? But as for those who are bent on denying the truth-in result of their [evil] deeds, sudden calamities will always befall them or will alight close to their homes; [and this will continue] until God's promise [of resurrection] is fulfilled: verily, God never fails to fulfil His promise!",
      "ms": "",
      "id": "",
      "ar": "وَلَوۡ أَنَّ قُرۡءَانࣰا سُیِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِیعًاۗ أَفَلَمۡ یَا۟یۡـَٔسِ ٱلَّذِینَ ءَامَنُوۤا۟ أَن لَّوۡ یَشَاۤءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِیعࣰاۗ وَلَا یَزَالُ ٱلَّذِینَ كَفَرُوا۟ تُصِیبُهُم بِمَا صَنَعُوا۟ قَارِعَةٌ أَوۡ تَحُلُّ قَرِیبࣰا مِّن دَارِهِمۡ حَتَّىٰ یَأۡتِیَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا یُخۡلِفُ ٱلۡمِیعَادَ\n"
    }
  },
  {
    "id": 1739,
    "surahId": 13,
    "ayahNumber": 32,
    "arabicText": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلࣲ مِّن قَبۡلِكَ فَأَمۡلَیۡتُ لِلَّذِینَ كَفَرُوا۟ ثُمَّ أَخَذۡتُهُمۡۖ فَكَیۡفَ كَانَ عِقَابِ\n",
    "translations": {
      "en": "And, indeed, [even] before thy time have [God's] apostles been derided, and for a while I gave rein to those who were [thus] bent on denying the truth: but then I took them to task - and how awesome was My retribution!",
      "ms": "",
      "id": "",
      "ar": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلࣲ مِّن قَبۡلِكَ فَأَمۡلَیۡتُ لِلَّذِینَ كَفَرُوا۟ ثُمَّ أَخَذۡتُهُمۡۖ فَكَیۡفَ كَانَ عِقَابِ\n"
    }
  },
  {
    "id": 1740,
    "surahId": 13,
    "ayahNumber": 33,
    "arabicText": "أَفَمَنۡ هُوَ قَاۤىِٕمٌ عَلَىٰ كُلِّ نَفۡسِۭ بِمَا كَسَبَتۡۗ وَجَعَلُوا۟ لِلَّهِ شُرَكَاۤءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّـُٔونَهُۥ بِمَا لَا یَعۡلَمُ فِی ٱلۡأَرۡضِ أَم بِظَـٰهِرࣲ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُیِّنَ لِلَّذِینَ كَفَرُوا۟ مَكۡرُهُمۡ وَصُدُّوا۟ عَنِ ٱلسَّبِیلِۗ وَمَن یُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادࣲ\n",
    "translations": {
      "en": "IS, THEN, HE who has every living being in His almighty care, [dealing with each] according to what it deserves -[is, then, He like anything else that exists]? And yet, they ascribe to other beings a share in God's divinity! Say: \"Give them any name [you please]: but do you [really think that you could] inform Him of anything on earth that He does not know-or [do you] but play with words?, Nay, goodly seems their false imagery to those who are bent on denying the truth, and so they are turned away from the [right] path: and he whom God lets go astray can never find any guide.",
      "ms": "",
      "id": "",
      "ar": "أَفَمَنۡ هُوَ قَاۤىِٕمٌ عَلَىٰ كُلِّ نَفۡسِۭ بِمَا كَسَبَتۡۗ وَجَعَلُوا۟ لِلَّهِ شُرَكَاۤءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّـُٔونَهُۥ بِمَا لَا یَعۡلَمُ فِی ٱلۡأَرۡضِ أَم بِظَـٰهِرࣲ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُیِّنَ لِلَّذِینَ كَفَرُوا۟ مَكۡرُهُمۡ وَصُدُّوا۟ عَنِ ٱلسَّبِیلِۗ وَمَن یُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادࣲ\n"
    }
  },
  {
    "id": 1741,
    "surahId": 13,
    "ayahNumber": 34,
    "arabicText": "لَّهُمۡ عَذَابࣱ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۖ وَلَعَذَابُ ٱلۡـَٔاخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقࣲ\n",
    "translations": {
      "en": "For such, there is suffering in the life of this world; but, truly, [their] suffering in the life to come will be harder still, and they will have none to shield them from God.",
      "ms": "",
      "id": "",
      "ar": "لَّهُمۡ عَذَابࣱ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۖ وَلَعَذَابُ ٱلۡـَٔاخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقࣲ\n"
    }
  },
  {
    "id": 1742,
    "surahId": 13,
    "ayahNumber": 35,
    "arabicText": "۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِی وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ أُكُلُهَا دَاۤىِٕمࣱ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِینَ ٱتَّقَوا۟ۚ وَّعُقۡبَى ٱلۡكَـٰفِرِینَ ٱلنَّارُ\n",
    "translations": {
      "en": "THE PARABLE of the paradise promised to those who are conscious of God [is that of a garden] through which running waters flow: [but, unlike an earthly garden,] its fruits will be everlasting, and [so will be] its shade. Such will be the destiny of those who remain conscious of God-just as the destiny of those who deny the truth will be the fire.",
      "ms": "",
      "id": "",
      "ar": "۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِی وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ أُكُلُهَا دَاۤىِٕمࣱ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِینَ ٱتَّقَوا۟ۚ وَّعُقۡبَى ٱلۡكَـٰفِرِینَ ٱلنَّارُ\n"
    }
  },
  {
    "id": 1743,
    "surahId": 13,
    "ayahNumber": 36,
    "arabicText": "وَٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ یَفۡرَحُونَ بِمَاۤ أُنزِلَ إِلَیۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن یُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَاۤ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَاۤ أُشۡرِكَ بِهِۦۤۚ إِلَیۡهِ أَدۡعُوا۟ وَإِلَیۡهِ مَـَٔابِ\n",
    "translations": {
      "en": "Hence, they unto whom We have vouchsafed this revelation rejoice at all that has been bestowed upon thee [O Prophet] from on high; but among the followers of other creeds there are such as deny the validity of some of it. Say [unto them, O Prophet]: \"I have only been bidden to worship God, and not to ascribe divine. powers to aught beside Him: unto Him do I call [all mankind], and He is my goal!\"",
      "ms": "",
      "id": "",
      "ar": "وَٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ یَفۡرَحُونَ بِمَاۤ أُنزِلَ إِلَیۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن یُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَاۤ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَاۤ أُشۡرِكَ بِهِۦۤۚ إِلَیۡهِ أَدۡعُوا۟ وَإِلَیۡهِ مَـَٔابِ\n"
    }
  },
  {
    "id": 1744,
    "surahId": 13,
    "ayahNumber": 37,
    "arabicText": "وَكَذَ ٰ⁠لِكَ أَنزَلۡنَـٰهُ حُكۡمًا عَرَبِیࣰّاۚ وَلَىِٕنِ ٱتَّبَعۡتَ أَهۡوَاۤءَهُم بَعۡدَ مَا جَاۤءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِیࣲّ وَلَا وَاقࣲ\n",
    "translations": {
      "en": "Thus, then, have We bestowed from on high this [divine writ] as an ordinance in the Arabic tongue. And, indeed, if thou shouldst defer to men's likes and dislikes after all the [divine] knowledge that has come unto thee, thou wouldst have none to protect thee from God, and none to shield thee [from Him].",
      "ms": "",
      "id": "",
      "ar": "وَكَذَ ٰ⁠لِكَ أَنزَلۡنَـٰهُ حُكۡمًا عَرَبِیࣰّاۚ وَلَىِٕنِ ٱتَّبَعۡتَ أَهۡوَاۤءَهُم بَعۡدَ مَا جَاۤءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِیࣲّ وَلَا وَاقࣲ\n"
    }
  },
  {
    "id": 1745,
    "surahId": 13,
    "ayahNumber": 38,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلࣰا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَ ٰ⁠جࣰا وَذُرِّیَّةࣰۚ وَمَا كَانَ لِرَسُولٍ أَن یَأۡتِیَ بِـَٔایَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلࣲ كِتَابࣱ\n",
    "translations": {
      "en": "And, truly, We sent forth apostles before thee, and We appointed for them wives and offspring; and it was not given to any apostle to produce a miracle save at God's behest. Every age has had its revelation:",
      "ms": "",
      "id": "",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلࣰا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَ ٰ⁠جࣰا وَذُرِّیَّةࣰۚ وَمَا كَانَ لِرَسُولٍ أَن یَأۡتِیَ بِـَٔایَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلࣲ كِتَابࣱ\n"
    }
  },
  {
    "id": 1746,
    "surahId": 13,
    "ayahNumber": 39,
    "arabicText": "یَمۡحُوا۟ ٱللَّهُ مَا یَشَاۤءُ وَیُثۡبِتُۖ وَعِندَهُۥۤ أُمُّ ٱلۡكِتَـٰبِ\n",
    "translations": {
      "en": "God annuls or confirms whatever He wills [of His earlier messages] -for with Him is the source of all revelation.",
      "ms": "",
      "id": "",
      "ar": "یَمۡحُوا۟ ٱللَّهُ مَا یَشَاۤءُ وَیُثۡبِتُۖ وَعِندَهُۥۤ أُمُّ ٱلۡكِتَـٰبِ\n"
    }
  },
  {
    "id": 1747,
    "surahId": 13,
    "ayahNumber": 40,
    "arabicText": "وَإِن مَّا نُرِیَنَّكَ بَعۡضَ ٱلَّذِی نَعِدُهُمۡ أَوۡ نَتَوَفَّیَنَّكَ فَإِنَّمَا عَلَیۡكَ ٱلۡبَلَـٰغُ وَعَلَیۡنَا ٱلۡحِسَابُ\n",
    "translations": {
      "en": "BUT WHETHER We let thee see [in thy lifetime, O Prophet, the fulfilment of] some of what We have promised them, or whether We cause thee to die [before its fulfilment] - thy duty is no more than to deliver the message; and the reckoning is Ours.",
      "ms": "",
      "id": "",
      "ar": "وَإِن مَّا نُرِیَنَّكَ بَعۡضَ ٱلَّذِی نَعِدُهُمۡ أَوۡ نَتَوَفَّیَنَّكَ فَإِنَّمَا عَلَیۡكَ ٱلۡبَلَـٰغُ وَعَلَیۡنَا ٱلۡحِسَابُ\n"
    }
  },
  {
    "id": 1748,
    "surahId": 13,
    "ayahNumber": 41,
    "arabicText": "أَوَلَمۡ یَرَوۡا۟ أَنَّا نَأۡتِی ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ یَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِیعُ ٱلۡحِسَابِ\n",
    "translations": {
      "en": "Have, then, they [who deny the truth] never yet seen how We visit the earth [with Our punishment], gradually depriving it of all that is best thereon? For, [when] God judges, there is no power that could repel His judgment: and swift in reckoning is He!",
      "ms": "",
      "id": "",
      "ar": "أَوَلَمۡ یَرَوۡا۟ أَنَّا نَأۡتِی ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ یَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِیعُ ٱلۡحِسَابِ\n"
    }
  },
  {
    "id": 1749,
    "surahId": 13,
    "ayahNumber": 42,
    "arabicText": "وَقَدۡ مَكَرَ ٱلَّذِینَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِیعࣰاۖ یَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسࣲۗ وَسَیَعۡلَمُ ٱلۡكُفَّـٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ\n",
    "translations": {
      "en": "Now those who lived before these [sinners] did, too, devise many a blasphemy -but the most subtle devising is that of God, who knows what each human being deserves: and the deniers of the truth will [in time] come to know to whom the future belongs.",
      "ms": "",
      "id": "",
      "ar": "وَقَدۡ مَكَرَ ٱلَّذِینَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِیعࣰاۖ یَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسࣲۗ وَسَیَعۡلَمُ ٱلۡكُفَّـٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ\n"
    }
  },
  {
    "id": 1750,
    "surahId": 13,
    "ayahNumber": 43,
    "arabicText": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَسۡتَ مُرۡسَلࣰاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِیدَۢا بَیۡنِی وَبَیۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَـٰبِ\n",
    "translations": {
      "en": "And [if] they who are bent on denying the truth say [unto thee, O Prophet], \"Thou hast not been sent [by God]\", say thou: \"None can bear witness between me and you as God does; and [none can bear witness as does] he who truly understands this divine writ.",
      "ms": "",
      "id": "",
      "ar": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَسۡتَ مُرۡسَلࣰاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِیدَۢا بَیۡنِی وَبَیۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَـٰبِ\n"
    }
  }
]