[
  {
    "id": 3470,
    "surahId": 31,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤمۤ\n",
    "translations": {
      "en": "Alif. Lam. Mim.",
      "ms": "Alif, Laam, Miim.",
      "id": "Alif Laam Miim",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤمۤ\n"
    }
  },
  {
    "id": 3471,
    "surahId": 31,
    "ayahNumber": 2,
    "arabicText": "تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِ ٱلۡحَكِیمِ\n",
    "translations": {
      "en": "THESE ARE MESSAGES of the divine writ, full of wisdom,",
      "ms": "Ini ialah ayat-ayat Kitab (Al-Quran) yang mengandungi hikmat-hikmat dan kebenaran yang tetap kukuh,",
      "id": "Inilah ayat-ayat Al Quran yang mengandung hikmat,",
      "ar": "تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِ ٱلۡحَكِیمِ\n"
    }
  },
  {
    "id": 3472,
    "surahId": 31,
    "ayahNumber": 3,
    "arabicText": "هُدࣰى وَرَحۡمَةࣰ لِّلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "providing guidance and grace unto the doers of good",
      "ms": "Menjadi hidayah petunjuk dan rahmat bagi orang-orang yang sedia mengerjakan amal-amal yang baik",
      "id": "menjadi petunjuk dan rahmat bagi orang-orang yang berbuat kebaikan,",
      "ar": "هُدࣰى وَرَحۡمَةࣰ لِّلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 3473,
    "surahId": 31,
    "ayahNumber": 4,
    "arabicText": "ٱلَّذِینَ یُقِیمُونَ ٱلصَّلَوٰةَ وَیُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡـَٔاخِرَةِ هُمۡ یُوقِنُونَ\n",
    "translations": {
      "en": "who are constant in prayer and dispense charity: for it is they, they who in their innermost are certain of the life to come!",
      "ms": "Iaitu orang-orang yang mendirikan sembahyang, dan memberi zakat, serta mereka yakin tentang adanya hari akhirat.",
      "id": "(yaitu) orang-orang yang mendirikan shalat, menunaikan zakat dan mereka yakin akan adanya negeri akhirat.",
      "ar": "ٱلَّذِینَ یُقِیمُونَ ٱلصَّلَوٰةَ وَیُؤۡتُونَ ٱلزَّكَوٰةَ وَهُم بِٱلۡـَٔاخِرَةِ هُمۡ یُوقِنُونَ\n"
    }
  },
  {
    "id": 3474,
    "surahId": 31,
    "ayahNumber": 5,
    "arabicText": "أُو۟لَـٰۤىِٕكَ عَلَىٰ هُدࣰى مِّن رَّبِّهِمۡۖ وَأُو۟لَـٰۤىِٕكَ هُمُ ٱلۡمُفۡلِحُونَ\n",
    "translations": {
      "en": "It is they who follow the guidance [that comes to them] from their Sustainer; and it is they, they who shall attain to a happy state!",
      "ms": "Mereka itulah yang tetap mendapat hidayah petunjuk dari Tuhan mereka, dan merekalah orang-orang yang berjaya.",
      "id": "Mereka itulah orang-orang yang tetap mendapat petunjuk dari Tuhannya dan mereka itulah orang-orang yang beruntung.",
      "ar": "أُو۟لَـٰۤىِٕكَ عَلَىٰ هُدࣰى مِّن رَّبِّهِمۡۖ وَأُو۟لَـٰۤىِٕكَ هُمُ ٱلۡمُفۡلِحُونَ\n"
    }
  },
  {
    "id": 3475,
    "surahId": 31,
    "ayahNumber": 6,
    "arabicText": "وَمِنَ ٱلنَّاسِ مَن یَشۡتَرِی لَهۡوَ ٱلۡحَدِیثِ لِیُضِلَّ عَن سَبِیلِ ٱللَّهِ بِغَیۡرِ عِلۡمࣲ وَیَتَّخِذَهَا هُزُوًاۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ عَذَابࣱ مُّهِینࣱ\n",
    "translations": {
      "en": "But among men there is many a one that prefers a mere play with words [to divine guidance], so as to lead [those] without knowledge astray from the path of God, and to turn it to ridicule: for such there is shameful suffering in store.",
      "ms": "Dan ada di antara manusia: orang yang memilih serta membelanjakan hartanya kepada cerita-cerita dan perkara-perkara hiburan yang melalaikan; yang berakibat menyesatkan (dirinya dan orang ramai) dari ugama Allah dengan tidak berdasarkan sebarang pengetahuan; dan ada pula orang yang menjadikan ugama Allah itu sebagai ejek-ejekan; merekalah orang-orang yang akan beroleh azab yang menghinakan.",
      "id": "Dan di antara manusia (ada) orang yang mempergunakan perkataan yang tidak berguna untuk menyesatkan (manusia) dari jalan Allah tanpa pengetahuan dan menjadikan jalan Allah itu olok-olokan. Mereka itu akan memperoleh azab yang menghinakan.",
      "ar": "وَمِنَ ٱلنَّاسِ مَن یَشۡتَرِی لَهۡوَ ٱلۡحَدِیثِ لِیُضِلَّ عَن سَبِیلِ ٱللَّهِ بِغَیۡرِ عِلۡمࣲ وَیَتَّخِذَهَا هُزُوًاۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ عَذَابࣱ مُّهِینࣱ\n"
    }
  },
  {
    "id": 3476,
    "surahId": 31,
    "ayahNumber": 7,
    "arabicText": "وَإِذَا تُتۡلَىٰ عَلَیۡهِ ءَایَـٰتُنَا وَلَّىٰ مُسۡتَكۡبِرࣰا كَأَن لَّمۡ یَسۡمَعۡهَا كَأَنَّ فِیۤ أُذُنَیۡهِ وَقۡرࣰاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِیمٍ\n",
    "translations": {
      "en": "For, whenever Our messages are conveyed to such a one, he turns away in his arrogance as though he had not heard them - as though there were deafness in his ears. Give him, then, the tiding of grievous suffering [in the life to come].",
      "ms": "Dan apabila dibacakan kepadanya ayat-ayat Kami, berpalinglah dia dengan angkuhnya, seoleh-oleh ada penyumbat pada kedua telinganya; maka gembirakanlah dia dengan balasan azab yang tidak terperi sakitnya.",
      "id": "Dan apabila dibacakan kepadanya ayat-ayat Kami dia berpaling dengan menyombongkan diri seolah-olah dia belum mendengarnya, seakan-akan ada sumbat di kedua telinganya; maka beri kabar gembiralah dia dengan azab yang pedih.",
      "ar": "وَإِذَا تُتۡلَىٰ عَلَیۡهِ ءَایَـٰتُنَا وَلَّىٰ مُسۡتَكۡبِرࣰا كَأَن لَّمۡ یَسۡمَعۡهَا كَأَنَّ فِیۤ أُذُنَیۡهِ وَقۡرࣰاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِیمٍ\n"
    }
  },
  {
    "id": 3477,
    "surahId": 31,
    "ayahNumber": 8,
    "arabicText": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ لَهُمۡ جَنَّـٰتُ ٱلنَّعِیمِ\n",
    "translations": {
      "en": "[As against this,] verily, those who attain to faith and do righteous deeds shall have gardens of bliss,",
      "ms": "Sesungguhnya orang-orang yang beriman dan beramal soleh, mereka akan beroleh Syurga yang penuh dengan berbagai nikmat,",
      "id": "Sesungguhnya orang-orang yang beriman dan mengerjakan amal-amal saleh, bagi mereka surga-surga yang penuh kenikmatan,",
      "ar": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ لَهُمۡ جَنَّـٰتُ ٱلنَّعِیمِ\n"
    }
  },
  {
    "id": 3478,
    "surahId": 31,
    "ayahNumber": 9,
    "arabicText": "خَـٰلِدِینَ فِیهَاۖ وَعۡدَ ٱللَّهِ حَقࣰّاۚ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n",
    "translations": {
      "en": "to abide therein in accordance with God’s true promise: for He alone is almighty, truly wise.",
      "ms": "kekalan mereka di dalamnya. Demikian dijanjikan Allah - janji yang tetap benar; dan Dia lah jua yang Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Kekal mereka di dalamnya; sebagai janji Allah yang benar. Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.",
      "ar": "خَـٰلِدِینَ فِیهَاۖ وَعۡدَ ٱللَّهِ حَقࣰّاۚ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n"
    }
  },
  {
    "id": 3479,
    "surahId": 31,
    "ayahNumber": 10,
    "arabicText": "خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ بِغَیۡرِ عَمَدࣲ تَرَوۡنَهَاۖ وَأَلۡقَىٰ فِی ٱلۡأَرۡضِ رَوَ ٰ⁠سِیَ أَن تَمِیدَ بِكُمۡ وَبَثَّ فِیهَا مِن كُلِّ دَاۤبَّةࣲۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَنۢبَتۡنَا فِیهَا مِن كُلِّ زَوۡجࣲ كَرِیمٍ\n",
    "translations": {
      "en": "He [it is who] has created the skies without any supports that you could see, and has placed firm mountains upon the earth, lest it sway with you, and has caused all manner of living creatures to multiply thereon. And We send down water from the skies, and thus We cause every noble kind [of life] to grow on earth.",
      "ms": "Ia menciptakan langit dengan tidak bertiang sebagaimana yang kamu melihatnya; dan Ia mengadakan di bumi gunung-ganang yang menetapnya supaya bumi itu tidak menghayun-hayunkan kamu; dan Ia biakkan padanya berbagai jenis binatang. Dan Kami menurunkan hujan dari langit, lalu Kami tumbuhkan di bumi berbagai jenis tanaman yang memberi banyak manfaat.",
      "id": "Dia menciptakan langit tanpa tiang yang kamu melihatnya dan Dia meletakkan gunung-gunung (di permukaan) bumi supaya bumi itu tidak menggoyangkan kamu; dan memperkembang biakkan padanya segala macam jenis binatang. Dan Kami turunkan air hujan dari langit, lalu Kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik.",
      "ar": "خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ بِغَیۡرِ عَمَدࣲ تَرَوۡنَهَاۖ وَأَلۡقَىٰ فِی ٱلۡأَرۡضِ رَوَ ٰ⁠سِیَ أَن تَمِیدَ بِكُمۡ وَبَثَّ فِیهَا مِن كُلِّ دَاۤبَّةࣲۚ وَأَنزَلۡنَا مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَنۢبَتۡنَا فِیهَا مِن كُلِّ زَوۡجࣲ كَرِیمٍ\n"
    }
  },
  {
    "id": 3480,
    "surahId": 31,
    "ayahNumber": 11,
    "arabicText": "هَـٰذَا خَلۡقُ ٱللَّهِ فَأَرُونِی مَاذَا خَلَقَ ٱلَّذِینَ مِن دُونِهِۦۚ بَلِ ٱلظَّـٰلِمُونَ فِی ضَلَـٰلࣲ مُّبِینࣲ\n",
    "translations": {
      "en": "[All] this is God’s creation: show Me, then, what others than He may have created! Nay, but the evildoers are obviously lost in error!",
      "ms": "Ini (semuanya adalah) ciptaan Allah, maka cubalah kamu tunjukkan kepadaKu apakah yang telah diciptakan oleh makhluk-makhluk yang lain daripadaNya (yang kamu sembah itu)? (Tidak ada sesuatu pun) bahkan orang-orang yang zalim (dengan perbuatan syiriknya) itu berada dalam kesesatan yang jelas nyata.",
      "id": "Inilah ciptaan Allah, maka perlihatkanlah olehmu kepadaku apa yang telah diciptakan oleh sembahan-sembahan(mu) selain Allah. Sebenarnya orang-orang yang zalim itu berada di dalam kesesatan yang nyata.",
      "ar": "هَـٰذَا خَلۡقُ ٱللَّهِ فَأَرُونِی مَاذَا خَلَقَ ٱلَّذِینَ مِن دُونِهِۦۚ بَلِ ٱلظَّـٰلِمُونَ فِی ضَلَـٰلࣲ مُّبِینࣲ\n"
    }
  },
  {
    "id": 3481,
    "surahId": 31,
    "ayahNumber": 12,
    "arabicText": "وَلَقَدۡ ءَاتَیۡنَا لُقۡمَـٰنَ ٱلۡحِكۡمَةَ أَنِ ٱشۡكُرۡ لِلَّهِۚ وَمَن یَشۡكُرۡ فَإِنَّمَا یَشۡكُرُ لِنَفۡسِهِۦۖ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِیٌّ حَمِیدࣱ\n",
    "translations": {
      "en": "and, indeed, we granted this wisdom unto Luq­man: “Be grateful unto God - for he who is grateful [unto Him] is but grateful for the good of his own self; whereas he who chooses to be ungrateful [ought to know that], verily, God is self-sufficient, ever to be praised!”",
      "ms": "Dan sesungguhnya Kami telah memberi kepada Luqman, hikmat kebijaksanaan, (serta Kami perintahkan kepadanya): Bersyukurlah kepada Allah (akan segala nikmatNya kepadamu)\". Dan sesiapa yang bersyukur maka faedahnya itu hanyalah terpulang kepada dirinya sendiri, dan sesiapa yang tidak bersyukur (maka tidaklah menjadi hal kepada Allah), kerana sesungguhnya Allah Maha Kaya, lagi Maha Terpuji.",
      "id": "Dan sesungguhnya telah Kami berikan hikmat kepada Luqman, yaitu: \"Bersyukurlah kepada Allah. Dan barangsiapa yang bersyukur (kepada Allah), maka sesungguhnya ia bersyukur untuk dirinya sendiri; dan barangsiapa yang tidak bersyukur, maka sesungguhnya Allah Maha Kaya lagi Maha Terpuji\".",
      "ar": "وَلَقَدۡ ءَاتَیۡنَا لُقۡمَـٰنَ ٱلۡحِكۡمَةَ أَنِ ٱشۡكُرۡ لِلَّهِۚ وَمَن یَشۡكُرۡ فَإِنَّمَا یَشۡكُرُ لِنَفۡسِهِۦۖ وَمَن كَفَرَ فَإِنَّ ٱللَّهَ غَنِیٌّ حَمِیدࣱ\n"
    }
  },
  {
    "id": 3482,
    "surahId": 31,
    "ayahNumber": 13,
    "arabicText": "وَإِذۡ قَالَ لُقۡمَـٰنُ لِٱبۡنِهِۦ وَهُوَ یَعِظُهُۥ یَـٰبُنَیَّ لَا تُشۡرِكۡ بِٱللَّهِۖ إِنَّ ٱلشِّرۡكَ لَظُلۡمٌ عَظِیمࣱ\n",
    "translations": {
      "en": "And, lo, Luqman spoke thus unto his son, admonishing him: “O my dear son! Do not ascribe divine powers to aught beside God: for, behold, such [a false] ascribing of divinity is indeed an awesome wrong!",
      "ms": "Dan (ingatlah) ketika Luqman berkata kepada anaknya, semasa ia memberi nasihat kepadanya:\" Wahai anak kesayanganku, janganlah engkau mempersekutukan Allah (dengan sesuatu yang lain), sesungguhnya perbuatan syirik itu adalah satu kezaliman yang besar\".",
      "id": "Dan (ingatlah) ketika Luqman berkata kepada anaknya, di waktu ia memberi pelajaran kepadanya: \"Hai anakku, janganlah kamu mempersekutukan Allah, sesungguhnya mempersekutukan (Allah) adalah benar-benar kezaliman yang besar\".",
      "ar": "وَإِذۡ قَالَ لُقۡمَـٰنُ لِٱبۡنِهِۦ وَهُوَ یَعِظُهُۥ یَـٰبُنَیَّ لَا تُشۡرِكۡ بِٱللَّهِۖ إِنَّ ٱلشِّرۡكَ لَظُلۡمٌ عَظِیمࣱ\n"
    }
  },
  {
    "id": 3483,
    "surahId": 31,
    "ayahNumber": 14,
    "arabicText": "وَوَصَّیۡنَا ٱلۡإِنسَـٰنَ بِوَ ٰ⁠لِدَیۡهِ حَمَلَتۡهُ أُمُّهُۥ وَهۡنًا عَلَىٰ وَهۡنࣲ وَفِصَـٰلُهُۥ فِی عَامَیۡنِ أَنِ ٱشۡكُرۡ لِی وَلِوَ ٰ⁠لِدَیۡكَ إِلَیَّ ٱلۡمَصِیرُ\n",
    "translations": {
      "en": "“And [God says:] ‘We have enjoined upon man goodness towards his parents: his mother bore him by bearing strain upon strain, and his utter dependence on her lasted two years: [hence, O man,] be grateful towards Me and towards thy parents, [and remember that] with Me is all journeys’ end.",
      "ms": "Dan Kami wajibkan manusia berbuat baik kepada kedua ibu bapanya; ibunya telah mengandungnya dengan menanggung kelemahan demi kelemahan (dari awal mengandung hingga akhir menyusunya), dan tempoh menceraikan susunya ialah dalam masa dua tahun; (dengan yang demikian) bersyukurlah kepadaKu dan kepada kedua ibubapamu; dan (ingatlah), kepada Akulah jua tempat kembali (untuk menerima balasan).",
      "id": "Dan Kami perintahkan kepada manusia (berbuat baik) kepada dua orang ibu-bapaknya; ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah, dan menyapihnya dalam dua tahun. Bersyukurlah kepada-Ku dan kepada dua orang ibu bapakmu, hanya kepada-Kulah kembalimu.",
      "ar": "وَوَصَّیۡنَا ٱلۡإِنسَـٰنَ بِوَ ٰ⁠لِدَیۡهِ حَمَلَتۡهُ أُمُّهُۥ وَهۡنًا عَلَىٰ وَهۡنࣲ وَفِصَـٰلُهُۥ فِی عَامَیۡنِ أَنِ ٱشۡكُرۡ لِی وَلِوَ ٰ⁠لِدَیۡكَ إِلَیَّ ٱلۡمَصِیرُ\n"
    }
  },
  {
    "id": 3484,
    "surahId": 31,
    "ayahNumber": 15,
    "arabicText": "وَإِن جَـٰهَدَاكَ عَلَىٰۤ أَن تُشۡرِكَ بِی مَا لَیۡسَ لَكَ بِهِۦ عِلۡمࣱ فَلَا تُطِعۡهُمَاۖ وَصَاحِبۡهُمَا فِی ٱلدُّنۡیَا مَعۡرُوفࣰاۖ وَٱتَّبِعۡ سَبِیلَ مَنۡ أَنَابَ إِلَیَّۚ ثُمَّ إِلَیَّ مَرۡجِعُكُمۡ فَأُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ\n",
    "translations": {
      "en": "“‘[Revere thy parents;] yet should they endeavour to make thee ascribe divinity, side by side with Me, to something which thy mind cannot accept [as divine], obey them not; but [even then] bear them company in this world’s life with kindness, and follow the path of those who turn towards Me. In the end, unto Me you all must return; and thereupon I shall make you [truly] understand all that you were doing [in life].’",
      "ms": "Dan jika mereka berdua mendesakmu supaya engkau mempersekutukan denganKu sesuatu yang engkau - dengan fikiran sihatmu - tidak mengetahui sungguh adanya maka janganlah engkau taat kepada mereka; dan bergaulah dengan mereka di dunia dengan cara yang baik. Dan turutlah jalan orang-orang yang rujuk kembali kepadaKu (dengan tauhid dan amal-amal yang soleh). Kemudian kepada Akulah tempat kembali kamu semuanya, maka Aku akan menerangkan kepada kamu segala yang kamu telah kerjakan.",
      "id": "Dan jika keduanya memaksamu untuk mempersekutukan dengan Aku sesuatu yang tidak ada pengetahuanmu tentang itu, maka janganlah kamu mengikuti keduanya, dan pergaulilah keduanya di dunia dengan baik, dan ikutilah jalan orang yang kembali kepada-Ku, kemudian hanya kepada-Kulah kembalimu, maka Kuberitakan kepadamu apa yang telah kamu kerjakan.",
      "ar": "وَإِن جَـٰهَدَاكَ عَلَىٰۤ أَن تُشۡرِكَ بِی مَا لَیۡسَ لَكَ بِهِۦ عِلۡمࣱ فَلَا تُطِعۡهُمَاۖ وَصَاحِبۡهُمَا فِی ٱلدُّنۡیَا مَعۡرُوفࣰاۖ وَٱتَّبِعۡ سَبِیلَ مَنۡ أَنَابَ إِلَیَّۚ ثُمَّ إِلَیَّ مَرۡجِعُكُمۡ فَأُنَبِّئُكُم بِمَا كُنتُمۡ تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 3485,
    "surahId": 31,
    "ayahNumber": 16,
    "arabicText": "یَـٰبُنَیَّ إِنَّهَاۤ إِن تَكُ مِثۡقَالَ حَبَّةࣲ مِّنۡ خَرۡدَلࣲ فَتَكُن فِی صَخۡرَةٍ أَوۡ فِی ٱلسَّمَـٰوَ ٰ⁠تِ أَوۡ فِی ٱلۡأَرۡضِ یَأۡتِ بِهَا ٱللَّهُۚ إِنَّ ٱللَّهَ لَطِیفٌ خَبِیرࣱ\n",
    "translations": {
      "en": "“O my dear son,” [continued Luqman,] “verily, if there be but the weight of a mustard-seed, and though it be [hidden] in a rock, or in the skies, or in the earth, God will bring it to light: for, behold, God is unfathomable [in His wisdom], all-aware",
      "ms": "(Luqman menasihati anaknya dengan berkata): \"Wahai anak kesayanganku, sesungguhnya jika ada sesuatu perkara (yang baik atau yang buruk) sekalipun seberat bijih sawi, serta ia tersembunyi di dalam batu besar atau di langit atau pun di bumi, sudah tetap akan dibawa oleh Allah (untuk dihakimi dan dibalasNya); kerana sesungguhnya Allah Maha Halus pengetahuanNya; lagi Amat Meliputi akan segala yang tersembunyi.",
      "id": "(Luqman berkata): \"Hai anakku, sesungguhnya jika ada (sesuatu perbuatan) seberat biji sawi, dan berada dalam batu atau di langit atau di dalam bumi, niscaya Allah akan mendatangkannya (membalasinya). Sesungguhnya Allah Maha Halus lagi Maha Mengetahui.",
      "ar": "یَـٰبُنَیَّ إِنَّهَاۤ إِن تَكُ مِثۡقَالَ حَبَّةࣲ مِّنۡ خَرۡدَلࣲ فَتَكُن فِی صَخۡرَةٍ أَوۡ فِی ٱلسَّمَـٰوَ ٰ⁠تِ أَوۡ فِی ٱلۡأَرۡضِ یَأۡتِ بِهَا ٱللَّهُۚ إِنَّ ٱللَّهَ لَطِیفٌ خَبِیرࣱ\n"
    }
  },
  {
    "id": 3486,
    "surahId": 31,
    "ayahNumber": 17,
    "arabicText": "یَـٰبُنَیَّ أَقِمِ ٱلصَّلَوٰةَ وَأۡمُرۡ بِٱلۡمَعۡرُوفِ وَٱنۡهَ عَنِ ٱلۡمُنكَرِ وَٱصۡبِرۡ عَلَىٰ مَاۤ أَصَابَكَۖ إِنَّ ذَ ٰ⁠لِكَ مِنۡ عَزۡمِ ٱلۡأُمُورِ\n",
    "translations": {
      "en": "“O my dear son! Be constant in prayer, and enjoin the doing of what is right and forbid the doing of what is wrong, and bear in patience whatever [ill] may befall thee: this, behold, is something to set one’s heart upon!",
      "ms": "\"Wahai anak kesayanganku, dirikanlah sembahyang, dan suruhlah berbuat kebaikan, serta laranglah daripada melakukan perbuatan yang mungkar, dan bersabarlah atas segala bala bencana yang menimpamu. Sesungguhnya yang demikian itu adalah dari perkara-perkara yang dikehendaki diambil berat melakukannya.",
      "id": "Hai anakku, dirikanlah shalat dan suruhlah (manusia) mengerjakan yang baik dan cegahlah (mereka) dari perbuatan yang mungkar dan bersabarlah terhadap apa yang menimpa kamu. Sesungguhnya yang demikian itu termasuk hal-hal yang diwajibkan (oleh Allah).",
      "ar": "یَـٰبُنَیَّ أَقِمِ ٱلصَّلَوٰةَ وَأۡمُرۡ بِٱلۡمَعۡرُوفِ وَٱنۡهَ عَنِ ٱلۡمُنكَرِ وَٱصۡبِرۡ عَلَىٰ مَاۤ أَصَابَكَۖ إِنَّ ذَ ٰ⁠لِكَ مِنۡ عَزۡمِ ٱلۡأُمُورِ\n"
    }
  },
  {
    "id": 3487,
    "surahId": 31,
    "ayahNumber": 18,
    "arabicText": "وَلَا تُصَعِّرۡ خَدَّكَ لِلنَّاسِ وَلَا تَمۡشِ فِی ٱلۡأَرۡضِ مَرَحًاۖ إِنَّ ٱللَّهَ لَا یُحِبُّ كُلَّ مُخۡتَالࣲ فَخُورࣲ\n",
    "translations": {
      "en": "“And turn not thy cheek away from people in [false] pride, and walk not haughtily on earth: for, behold, God does not love anyone who, out of self- conceit, acts in a boastful manner.",
      "ms": "\"Dan janganlah engkau memalingkan mukamu (kerana memandang rendah) kepada manusia, dan janganlah engkau berjalan di bumi dengan berlagak sombong; sesungguhnya Allah tidak suka kepada tiap-tiap orang yang sombong takbur, lagi membanggakan diri.",
      "id": "Dan janganlah kamu memalingkan mukamu dari manusia (karena sombong) dan janganlah kamu berjalan di muka bumi dengan angkuh. Sesungguhnya Allah tidak menyukai orang-orang yang sombong lagi membanggakan diri.",
      "ar": "وَلَا تُصَعِّرۡ خَدَّكَ لِلنَّاسِ وَلَا تَمۡشِ فِی ٱلۡأَرۡضِ مَرَحًاۖ إِنَّ ٱللَّهَ لَا یُحِبُّ كُلَّ مُخۡتَالࣲ فَخُورࣲ\n"
    }
  },
  {
    "id": 3488,
    "surahId": 31,
    "ayahNumber": 19,
    "arabicText": "وَٱقۡصِدۡ فِی مَشۡیِكَ وَٱغۡضُضۡ مِن صَوۡتِكَۚ إِنَّ أَنكَرَ ٱلۡأَصۡوَ ٰ⁠تِ لَصَوۡتُ ٱلۡحَمِیرِ\n",
    "translations": {
      "en": "“Hence, be modest in thy bearing, and lower thy voice: for, behold, the ugliest of all voices is the [loud] voice of asses…”",
      "ms": "\"Dan sederhanakanlah langkahmu semasa berjalan, juga rendahkanlah suaramu (semasa berkata-kata), sesungguhnya seburuk-buruk suara ialah suara keldai\".",
      "id": "Dan sederhanalah kamu dalam berjalan dan lunakkanlah suaramu. Sesungguhnya seburuk-buruk suara ialah suara keledai.",
      "ar": "وَٱقۡصِدۡ فِی مَشۡیِكَ وَٱغۡضُضۡ مِن صَوۡتِكَۚ إِنَّ أَنكَرَ ٱلۡأَصۡوَ ٰ⁠تِ لَصَوۡتُ ٱلۡحَمِیرِ\n"
    }
  },
  {
    "id": 3489,
    "surahId": 31,
    "ayahNumber": 20,
    "arabicText": "أَلَمۡ تَرَوۡا۟ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِ وَأَسۡبَغَ عَلَیۡكُمۡ نِعَمَهُۥ ظَـٰهِرَةࣰ وَبَاطِنَةࣰۗ وَمِنَ ٱلنَّاسِ مَن یُجَـٰدِلُ فِی ٱللَّهِ بِغَیۡرِ عِلۡمࣲ وَلَا هُدࣰى وَلَا كِتَـٰبࣲ مُّنِیرࣲ\n",
    "translations": {
      "en": "ARE YOU NOT aware that God has made subservient to you all that is in the heavens and all that is on earth, and has lavished upon you His blessings, both outward and inward? And yet, among men there is many a one that argues about God without having any knowledge [of Him], without any guidance, and without any light-giving revelation;",
      "ms": "Tidakkah kamu memperhatikan bahawa Allah telah memudahkan untuk kegunaan kamu apa yang ada di langit dan yang ada di bumi, dan telah melimpahkan kepada kami nikmat-nimatNya yang zahir dan yang batin? Dalam pada itu, ada di antara manusia orang yang membantah mengenai (sifat-sifat) Allah dengan tidak berdasarkan sebarang pengetahuan atau sebarang petunjuk; dan tidak juga berdasarkan mana-mana Kitab Allah yang menerangi kebenaran.",
      "id": "Tidakkah kamu perhatikan sesungguhnya Allah telah menundukkan untuk (kepentingan)mu apa yang di langit dan apa yang di bumi dan menyempurnakan untukmu nikmat-Nya lahir dan batin. Dan di antara manusia ada yang membantah tentang (keesaan) Allah tanpa ilmu pengetahuan atau petunjuk dan tanpa Kitab yang memberi penerangan.",
      "ar": "أَلَمۡ تَرَوۡا۟ أَنَّ ٱللَّهَ سَخَّرَ لَكُم مَّا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِ وَأَسۡبَغَ عَلَیۡكُمۡ نِعَمَهُۥ ظَـٰهِرَةࣰ وَبَاطِنَةࣰۗ وَمِنَ ٱلنَّاسِ مَن یُجَـٰدِلُ فِی ٱللَّهِ بِغَیۡرِ عِلۡمࣲ وَلَا هُدࣰى وَلَا كِتَـٰبࣲ مُّنِیرࣲ\n"
    }
  },
  {
    "id": 3490,
    "surahId": 31,
    "ayahNumber": 21,
    "arabicText": "وَإِذَا قِیلَ لَهُمُ ٱتَّبِعُوا۟ مَاۤ أَنزَلَ ٱللَّهُ قَالُوا۟ بَلۡ نَتَّبِعُ مَا وَجَدۡنَا عَلَیۡهِ ءَابَاۤءَنَاۤۚ أَوَلَوۡ كَانَ ٱلشَّیۡطَـٰنُ یَدۡعُوهُمۡ إِلَىٰ عَذَابِ ٱلسَّعِیرِ\n",
    "translations": {
      "en": "and when such [people] are told to follow that which God has bestowed from on high, they answer, “Nay, we shall follow that which we found our forefathers believing in and doing!” Why - [would you follow your forefathers] even if Satan had invited them unto the suffering of the blazing flame?",
      "ms": "Dan apabila dikatakan kepada mereka (yang ingkar): \"Turutlah akan apa yang telah diturunkan oleh Allah\" mereka menjawab:\" (Tidak), bahkan Kami hanya menurut apa yang Kami dapati datuk nenek kami melakukannya\". Patutkah mereka (menurut datuk neneknya) sekalipun Syaitan mengajak mereka itu (melakukan perbuatan yang menjerumuskan mereka) ke dalam azab api neraka yang marak menjulang?",
      "id": "Dan apabila dikatakan kepada mereka: \"Ikutilah apa yang diturunkan Allah\". Mereka menjawab: \"(Tidak), tapi kami (hanya) mengikuti apa yang kami dapati bapak-bapak kami mengerjakannya\". Dan apakah mereka (akan mengikuti bapak-bapak mereka) walaupun syaitan itu menyeru mereka ke dalam siksa api yang menyala-nyala (neraka)?",
      "ar": "وَإِذَا قِیلَ لَهُمُ ٱتَّبِعُوا۟ مَاۤ أَنزَلَ ٱللَّهُ قَالُوا۟ بَلۡ نَتَّبِعُ مَا وَجَدۡنَا عَلَیۡهِ ءَابَاۤءَنَاۤۚ أَوَلَوۡ كَانَ ٱلشَّیۡطَـٰنُ یَدۡعُوهُمۡ إِلَىٰ عَذَابِ ٱلسَّعِیرِ\n"
    }
  },
  {
    "id": 3491,
    "surahId": 31,
    "ayahNumber": 22,
    "arabicText": "۞ وَمَن یُسۡلِمۡ وَجۡهَهُۥۤ إِلَى ٱللَّهِ وَهُوَ مُحۡسِنࣱ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰۗ وَإِلَى ٱللَّهِ عَـٰقِبَةُ ٱلۡأُمُورِ\n",
    "translations": {
      "en": "Now whoever surrenders his whole being unto God, and is a doer of good withal, has indeed taken hold of a support most unfailing: for with God rests the final outcome of all events.",
      "ms": "Dan sesiapa yang berserah diri bulat-bulat kepada Allah (dengan ikhlas) sedang ia berusaha mengerjakan kebaikan, maka sesungguhnya ia telah berpegang kepada simpulan (tali ugama) yang teguh dan (ingatlah) kepada Allah jualah kesudahan segala urusan.",
      "id": "Dan barangsiapa yang menyerahkan dirinya kepada Allah, sedang dia orang yang berbuat kebaikan, maka sesungguhnya ia telah berpegang kepada buhul tali yang kokoh. Dan hanya kepada Allah-lah kesudahan segala urusan.",
      "ar": "۞ وَمَن یُسۡلِمۡ وَجۡهَهُۥۤ إِلَى ٱللَّهِ وَهُوَ مُحۡسِنࣱ فَقَدِ ٱسۡتَمۡسَكَ بِٱلۡعُرۡوَةِ ٱلۡوُثۡقَىٰۗ وَإِلَى ٱللَّهِ عَـٰقِبَةُ ٱلۡأُمُورِ\n"
    }
  },
  {
    "id": 3492,
    "surahId": 31,
    "ayahNumber": 23,
    "arabicText": "وَمَن كَفَرَ فَلَا یَحۡزُنكَ كُفۡرُهُۥۤۚ إِلَیۡنَا مَرۡجِعُهُمۡ فَنُنَبِّئُهُم بِمَا عَمِلُوۤا۟ۚ إِنَّ ٱللَّهَ عَلِیمُۢ بِذَاتِ ٱلصُّدُورِ\n",
    "translations": {
      "en": "But as for him who is bent on denying the truth - let not his denial grieve thee: unto Us they must return, and then We shall make them [truly] understand all that they were doing [in life]: for, verily, God has full knowledge of what is in the hearts [of men].",
      "ms": "Dan sesiapa yang kufur ingkar, maka janganlah engkau (wahai Muhammad) berdukacita tentang kekufurannya itu; kepada Kamilah tempat kembalinya mereka, kemudian Kami akan memberitahu kepada mereka tentang apa yang mereka telah kerjakan. Sesungguhnya Allah Maha Mengetahui akan segala (isi hati) yang terkandung di dalam dada.",
      "id": "Dan barangsiapa kafir maka kekafirannya itu janganlah menyedihkanmu. Hanya kepada Kami-lah mereka kembali, lalu Kami beritakan kepada mereka apa yang telah mereka kerjakan. Sesungguhnya Allah Maha Mengetahui segala isi hati.",
      "ar": "وَمَن كَفَرَ فَلَا یَحۡزُنكَ كُفۡرُهُۥۤۚ إِلَیۡنَا مَرۡجِعُهُمۡ فَنُنَبِّئُهُم بِمَا عَمِلُوۤا۟ۚ إِنَّ ٱللَّهَ عَلِیمُۢ بِذَاتِ ٱلصُّدُورِ\n"
    }
  },
  {
    "id": 3493,
    "surahId": 31,
    "ayahNumber": 24,
    "arabicText": "نُمَتِّعُهُمۡ قَلِیلࣰا ثُمَّ نَضۡطَرُّهُمۡ إِلَىٰ عَذَابٍ غَلِیظࣲ\n",
    "translations": {
      "en": "We will let them enjoy them­selves for a short while - but in the end We shall drive them into suffering severe.",
      "ms": "Kami akan berikan mereka menikmati kesenangan bagi sementara (di dunia), kemudian Kami akan memaksa mereka (dengan menyeretnya) ke dalam azab yang amat berat.",
      "id": "Kami biarkan mereka bersenang-senang sebentar, kemudian Kami paksa mereka (masuk) ke dalam siksa yang keras.",
      "ar": "نُمَتِّعُهُمۡ قَلِیلࣰا ثُمَّ نَضۡطَرُّهُمۡ إِلَىٰ عَذَابٍ غَلِیظࣲ\n"
    }
  },
  {
    "id": 3494,
    "surahId": 31,
    "ayahNumber": 25,
    "arabicText": "وَلَىِٕن سَأَلۡتَهُم مَّنۡ خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ لَیَقُولُنَّ ٱللَّهُۚ قُلِ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "AND THUS it is [with most people]: if thou ask them, “Who is it that has created the heavens and the earth?” - they will surely answer, “God.” Say: “[Then you ought to know that] all praise is due to God!”- for most of them do not know [what this implies].",
      "ms": "Dan sesungguhnya jika engkau (wahai Muhammad) bertanya kepada mereka (yang musyrik) itu: \"Siapakah yang menciptakan langit dan bumi?\" Sudah tentu mereka akan menjawab: \"Allah\". Ucapkanlah (wahai Muhammad): \"Alhamdulillah\" (sebagai bersyukur disebabkan pengakuan mereka yang demikian - tidak mengingkari Allah), bahkan kebanyakan mereka tidak mengetahui (hakikat tauhid dan pengertian syirik).",
      "id": "Dan sesungguhnya jika kamu tanyakan kepada mereka: \"Siapakah yang menciptakan langit dan bumi?\" Tentu mereka akan menjawab: \"Allah\". Katakanlah: \"Segala puji bagi Allah\"; tetapi kebanyakan mereka tidak mengetahui.",
      "ar": "وَلَىِٕن سَأَلۡتَهُم مَّنۡ خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ لَیَقُولُنَّ ٱللَّهُۚ قُلِ ٱلۡحَمۡدُ لِلَّهِۚ بَلۡ أَكۡثَرُهُمۡ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 3495,
    "surahId": 31,
    "ayahNumber": 26,
    "arabicText": "لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ إِنَّ ٱللَّهَ هُوَ ٱلۡغَنِیُّ ٱلۡحَمِیدُ\n",
    "translations": {
      "en": "Unto God belongs all that is in the heavens and on earth. Verily, God alone is self-sufficient, the One to whom all praise is due!",
      "ms": "Allah jua yang memiliki segala yang ada di langit dan di bumi; sesungguhnya Allah Dia lah jua yang Maha Kaya, lagi sentiasa Terpuji.",
      "id": "Kepunyaan Allah-lah apa yang di langit dan yang di bumi. Sesungguhnya Allah Dialah Yang Maha Kaya lagi Maha Terpuji.",
      "ar": "لِلَّهِ مَا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ إِنَّ ٱللَّهَ هُوَ ٱلۡغَنِیُّ ٱلۡحَمِیدُ\n"
    }
  },
  {
    "id": 3496,
    "surahId": 31,
    "ayahNumber": 27,
    "arabicText": "وَلَوۡ أَنَّمَا فِی ٱلۡأَرۡضِ مِن شَجَرَةٍ أَقۡلَـٰمࣱ وَٱلۡبَحۡرُ یَمُدُّهُۥ مِنۢ بَعۡدِهِۦ سَبۡعَةُ أَبۡحُرࣲ مَّا نَفِدَتۡ كَلِمَـٰتُ ٱللَّهِۚ إِنَّ ٱللَّهَ عَزِیزٌ حَكِیمࣱ\n",
    "translations": {
      "en": "And if all the trees on earth were pens, and the sea [were] ink, with seven [morel seas yet added to it, the words of God would not be exhausted: for, verily, God is almighty, wise.",
      "ms": "Dan sekiranya segala pohon yang ada di bumi menjadi pena, dan segala lautan (menjadi tinta), dengan dibantu kepadanya tujuh lautan lagi sesudah itu, nescaya tidak akan habis Kalimah-kalimah Allah itu ditulis. Sesungguhnya Allah Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Dan seandainya pohon-pohon di bumi menjadi pena dan laut (menjadi tinta), ditambahkan kepadanya tujuh laut (lagi) sesudah (kering)nya, niscaya tidak akan habis-habisnya (dituliskan) kalimat Allah. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana.",
      "ar": "وَلَوۡ أَنَّمَا فِی ٱلۡأَرۡضِ مِن شَجَرَةٍ أَقۡلَـٰمࣱ وَٱلۡبَحۡرُ یَمُدُّهُۥ مِنۢ بَعۡدِهِۦ سَبۡعَةُ أَبۡحُرࣲ مَّا نَفِدَتۡ كَلِمَـٰتُ ٱللَّهِۚ إِنَّ ٱللَّهَ عَزِیزٌ حَكِیمࣱ\n"
    }
  },
  {
    "id": 3497,
    "surahId": 31,
    "ayahNumber": 28,
    "arabicText": "مَّا خَلۡقُكُمۡ وَلَا بَعۡثُكُمۡ إِلَّا كَنَفۡسࣲ وَ ٰ⁠حِدَةٍۚ إِنَّ ٱللَّهَ سَمِیعُۢ بَصِیرٌ\n",
    "translations": {
      "en": "[For Him,] the creation of you all and the resurrection of you all is but like [the creation and resurrection of] a single soul: for, verily, God is all-hearing, all-seeing.",
      "ms": "(Bagi Allah Yang Maha Kuasa) soal menciptakan kamu semua (dari tiada kepada ada), dan soal membangkitkan kamu hidup semula sesudah mati, tidak ada apa-apa sukarnya, hanyalah seperti (mencipta dan menghidupkan semula) seorang manusia sahaja. Sesungguhnya Allah Maha Mendengar, lagi Maha Melihat.",
      "id": "Tidaklah Allah menciptakan dan membangkitkan kamu (dari dalam kubur) itu melainkan hanyalah seperti (menciptakan dan membangkitkan) satu jiwa saja. Sesungguhnya Allah Maha Mendengar lagi Maha Melihat.",
      "ar": "مَّا خَلۡقُكُمۡ وَلَا بَعۡثُكُمۡ إِلَّا كَنَفۡسࣲ وَ ٰ⁠حِدَةٍۚ إِنَّ ٱللَّهَ سَمِیعُۢ بَصِیرٌ\n"
    }
  },
  {
    "id": 3498,
    "surahId": 31,
    "ayahNumber": 29,
    "arabicText": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ یُولِجُ ٱلَّیۡلَ فِی ٱلنَّهَارِ وَیُولِجُ ٱلنَّهَارَ فِی ٱلَّیۡلِ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلࣱّ یَجۡرِیۤ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى وَأَنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ خَبِیرࣱ\n",
    "translations": {
      "en": "Art thou not aware that it is God who makes the night grow longer by shortening the day, and makes the day grow longer by shortening the night, and that He has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him] and that God is fully aware of all that you do?",
      "ms": "Tidakkah engkau memerhatikan bahawa Allah memasukkan malam pada siang dan memasukkan siang pada malam (silih berganti), dan Ia memudahkan matahari dan bulan (untuk faedah makhluk-makhlukNya)? Tiap-tiap satu dari keduanya beredar untuk suatu masa yang telah ditetapkan. Dan (ingatlah) sesungguhnya Allah Maha Mengetahui dengan mendalam akan apa yang kamu lakukan.",
      "id": "Tidakkah kamu memperhatikan, bahwa sesungguhnya Allah memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan Dia tundukkan matahari dan bulan masing-masing berjalan sampai kepada waktu yang ditentukan, dan sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.",
      "ar": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ یُولِجُ ٱلَّیۡلَ فِی ٱلنَّهَارِ وَیُولِجُ ٱلنَّهَارَ فِی ٱلَّیۡلِ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلࣱّ یَجۡرِیۤ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّى وَأَنَّ ٱللَّهَ بِمَا تَعۡمَلُونَ خَبِیرࣱ\n"
    }
  },
  {
    "id": 3499,
    "surahId": 31,
    "ayahNumber": 30,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّ مَا یَدۡعُونَ مِن دُونِهِ ٱلۡبَـٰطِلُ وَأَنَّ ٱللَّهَ هُوَ ٱلۡعَلِیُّ ٱلۡكَبِیرُ\n",
    "translations": {
      "en": "Thus it is, because God alone is the Ultimate Truth, so that all that men invoke instead of Him is sheer falsehood; and because God alone is exalted, truly great!",
      "ms": "Bersifatnya Allah dengan penuh kekuasaan dan luas ilmu pengetahuan itu kerana bahawasanya Allah Dia lah sahaja Tuhan Yang Sebenar-benarnya, dan bahawa segala yang mereka sembah selain dari Allah adalah palsu belaka. Dan (ingatlah) sesungguhnya Allah Dia lah Yang Maha Tinggi keadaanNya, lagi Maha Besar (kekuasaanNya).",
      "id": "Demikianlah, karena sesungguhnya Allah, Dialah yang hak dan sesungguhnya apa saja yang mereka seru selain dari Allah itulah yang batil; dan sesungguhnya Allah Dialah Yang Maha Tinggi lagi Maha Besar.",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّ ٱللَّهَ هُوَ ٱلۡحَقُّ وَأَنَّ مَا یَدۡعُونَ مِن دُونِهِ ٱلۡبَـٰطِلُ وَأَنَّ ٱللَّهَ هُوَ ٱلۡعَلِیُّ ٱلۡكَبِیرُ\n"
    }
  },
  {
    "id": 3500,
    "surahId": 31,
    "ayahNumber": 31,
    "arabicText": "أَلَمۡ تَرَ أَنَّ ٱلۡفُلۡكَ تَجۡرِی فِی ٱلۡبَحۡرِ بِنِعۡمَتِ ٱللَّهِ لِیُرِیَكُم مِّنۡ ءَایَـٰتِهِۦۤۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّكُلِّ صَبَّارࣲ شَكُورࣲ\n",
    "translations": {
      "en": "Art thou not aware how the ships speed through the sea by God’s favour, so that He might show you some of His wonders? Herein, behold, there are messages indeed for all who are wholly patient in adversity and deeply grate­ful [to God].",
      "ms": "Tidakkah engkau memerhatikan bahawasanya kapal-kapal belayar di laut dengan nikmat Kurnia Allah, untuk diperlihatkan kepada kamu sebahagian dari tanda-tanda kemurahanNya? Sesungguhnya yang demikian itu mengandungi keterangan-keterangan dan bukti (untuk berfikir) bagi tiap-tiap (mukmin) yang tetap teguh pendiriannya, lagi sentiasa bersyukur.",
      "id": "Tidakkah kamu memperhatikan bahwa sesungguhnya kapal itu berlayar di laut dengan nikmat Allah, supaya diperlihatkan-Nya kepadamu sebahagian dari tanda-tanda (kekuasaan)-Nya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi semua orang yang sangat sabar lagi banyak bersyukur.",
      "ar": "أَلَمۡ تَرَ أَنَّ ٱلۡفُلۡكَ تَجۡرِی فِی ٱلۡبَحۡرِ بِنِعۡمَتِ ٱللَّهِ لِیُرِیَكُم مِّنۡ ءَایَـٰتِهِۦۤۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّكُلِّ صَبَّارࣲ شَكُورࣲ\n"
    }
  },
  {
    "id": 3501,
    "surahId": 31,
    "ayahNumber": 32,
    "arabicText": "وَإِذَا غَشِیَهُم مَّوۡجࣱ كَٱلظُّلَلِ دَعَوُا۟ ٱللَّهَ مُخۡلِصِینَ لَهُ ٱلدِّینَ فَلَمَّا نَجَّىٰهُمۡ إِلَى ٱلۡبَرِّ فَمِنۡهُم مُّقۡتَصِدࣱۚ وَمَا یَجۡحَدُ بِـَٔایَـٰتِنَاۤ إِلَّا كُلُّ خَتَّارࣲ كَفُورࣲ\n",
    "translations": {
      "en": "For [thus it is with most men:] when the waves engulf them like shadows [of death], they call unto God, sincere [at that moment] in their faith in Him alone: but as soon as He has brought them safe ashore, some of them stop half-way [between belief and unbelief] Yet none could knowingly reject Our messages unless he be utterly perfidious, ingrate.",
      "ms": "Dan (orang-orang yang tidak bersifat demikian) apabila mereka dirempuh serta diliputi oleh ombak yang besar seperti kelompok-kelompok awan menyerkup, pada saat itu mereka semua berdoa kepada Allah dengan mengikhlaskan kepercayaan mereka kepadaNya semata-mata. Kemudian bila sahaja Allah menyelamatkan mereka ke darat maka sebahagian sahaja di antara mereka yang bersikap adil (lalu bersyukur kepada Allah serta mengesakanNya). Dan sememangnya tiada yang mengingkari bukti-bukti kemurahan Kami melainkan tiap-tiap orang yang bersifat pemungkir janji, lagi amat tidak mengenang budi.",
      "id": "Dan apabila mereka dilamun ombak yang besar seperti gunung, mereka menyeru Allah dengan memurnikan ketaatan kepada-Nya maka tatkala Allah menyelamatkan mereka sampai di daratan, lalu sebagian mereka tetap menempuh jalan yang lurus. Dan tidak ada yang mengingkari ayat-ayat Kami selain orang-orang yang tidak setia lagi ingkar.",
      "ar": "وَإِذَا غَشِیَهُم مَّوۡجࣱ كَٱلظُّلَلِ دَعَوُا۟ ٱللَّهَ مُخۡلِصِینَ لَهُ ٱلدِّینَ فَلَمَّا نَجَّىٰهُمۡ إِلَى ٱلۡبَرِّ فَمِنۡهُم مُّقۡتَصِدࣱۚ وَمَا یَجۡحَدُ بِـَٔایَـٰتِنَاۤ إِلَّا كُلُّ خَتَّارࣲ كَفُورࣲ\n"
    }
  },
  {
    "id": 3502,
    "surahId": 31,
    "ayahNumber": 33,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمۡ وَٱخۡشَوۡا۟ یَوۡمࣰا لَّا یَجۡزِی وَالِدٌ عَن وَلَدِهِۦ وَلَا مَوۡلُودٌ هُوَ جَازٍ عَن وَالِدِهِۦ شَیۡـًٔاۚ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّۖ فَلَا تَغُرَّنَّكُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَا وَلَا یَغُرَّنَّكُم بِٱللَّهِ ٱلۡغَرُورُ\n",
    "translations": {
      "en": "O MEN! Be conscious of your Sustainer, and stand in awe of the Day on which no parent will be of any avail to his child, nor a child will in the least avail his parent! Verily, God’s promise [of resurrection] is true in­deed: let not, then, the life of this world deludes you, and let not [your own] deceptive thoughts about God delude you!",
      "ms": "Wahai sekalian manusia, bertaqwalah kepada Tuhan kamu, dan takutilah akan hari (akhirat) yang padanya seseorang ibu atau bapa tidak dapat melepaskan anaknya dari azab dosanya, dan seorang anak pula tidak dapat melepaskan ibu atau bapanya dari azab dosa masing-masing sedikit pun. Sesungguhnya janji Allah itu adalah benar, maka janganlah kamu diperdayakan oleh kehidupan dunia, dan jangan pula kamu diperdayakan oleh bisikan dan ajakan Syaitan yang menyebabkan kamu berani melanggar perintah Allah.",
      "id": "Hai manusia, bertakwalah kepada Tuhanmu dan takutilah suatu hari yang (pada hari itu) seorang bapak tidak dapat menolong anaknya dan seorang anak tidak dapat (pula) menolong bapaknya sedikitpun. Sesungguhnya janji Allah adalah benar, maka janganlah sekali-kali kehidupan dunia memperdayakan kamu, dan jangan (pula) penipu (syaitan) memperdayakan kamu dalam (mentaati) Allah.",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ ٱتَّقُوا۟ رَبَّكُمۡ وَٱخۡشَوۡا۟ یَوۡمࣰا لَّا یَجۡزِی وَالِدٌ عَن وَلَدِهِۦ وَلَا مَوۡلُودٌ هُوَ جَازٍ عَن وَالِدِهِۦ شَیۡـًٔاۚ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّۖ فَلَا تَغُرَّنَّكُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَا وَلَا یَغُرَّنَّكُم بِٱللَّهِ ٱلۡغَرُورُ\n"
    }
  },
  {
    "id": 3503,
    "surahId": 31,
    "ayahNumber": 34,
    "arabicText": "إِنَّ ٱللَّهَ عِندَهُۥ عِلۡمُ ٱلسَّاعَةِ وَیُنَزِّلُ ٱلۡغَیۡثَ وَیَعۡلَمُ مَا فِی ٱلۡأَرۡحَامِۖ وَمَا تَدۡرِی نَفۡسࣱ مَّاذَا تَكۡسِبُ غَدࣰاۖ وَمَا تَدۡرِی نَفۡسُۢ بِأَیِّ أَرۡضࣲ تَمُوتُۚ إِنَّ ٱللَّهَ عَلِیمٌ خَبِیرُۢ\n",
    "translations": {
      "en": "Verily, with God alone rests the knowledge of when the Last Hour will come: and He [it is who] sends down rain; and He [alone] knows what is in the wombs: whereas no one knows what he will reap tomorrow, and no one knows in what land he will die, Verily. God [alone] is all-knowing, all-aware.",
      "ms": "Sesungguhnya di sisi Allah pengetahuan yang tepat tentang hari kiamat. Dan Dia lah jua yang menurunkan hujan, dan yang mengetahui dengan sebenar-benarnya tentang apa yang ada dalam rahim (ibu yang mengandung). Dan tiada seseorang pun yang betul mengetahui apa yang akan diusahakannya esok (sama ada baik atau jahat); dan tiada seorangpun yang dapat mengetahui di bumi negeri manakah ia akan mati. Sesungguhnya Allah Maha Mengetahui, lagi Amat Meliputi pengetahuanNya.",
      "id": "Sesungguhnya Allah, hanya pada sisi-Nya sajalah pengetahuan tentang Hari Kiamat; dan Dialah Yang menurunkan hujan, dan mengetahui apa yang ada dalam rahim. Dan tiada seorangpun yang dapat mengetahui (dengan pasti) apa yang akan diusahakannya besok. Dan tiada seorangpun yang dapat mengetahui di bumi mana dia akan mati. Sesungguhnya Allah Maha Mengetahui lagi Maha Mengenal.",
      "ar": "إِنَّ ٱللَّهَ عِندَهُۥ عِلۡمُ ٱلسَّاعَةِ وَیُنَزِّلُ ٱلۡغَیۡثَ وَیَعۡلَمُ مَا فِی ٱلۡأَرۡحَامِۖ وَمَا تَدۡرِی نَفۡسࣱ مَّاذَا تَكۡسِبُ غَدࣰاۖ وَمَا تَدۡرِی نَفۡسُۢ بِأَیِّ أَرۡضࣲ تَمُوتُۚ إِنَّ ٱللَّهَ عَلِیمٌ خَبِیرُۢ\n"
    }
  }
]