[
  {
    "id": 3661,
    "surahId": 35,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱلۡحَمۡدُ لِلَّهِ فَاطِرِ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ جَاعِلِ ٱلۡمَلَـٰۤىِٕكَةِ رُسُلًا أُو۟لِیۤ أَجۡنِحَةࣲ مَّثۡنَىٰ وَثُلَـٰثَ وَرُبَـٰعَۚ یَزِیدُ فِی ٱلۡخَلۡقِ مَا یَشَاۤءُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n",
    "translations": {
      "en": "ALL PRAISE is due to God, Originator of the heavens and the earth, who causes the angels to be (His) message-bearers, endowed with wings, two, or three, or four. [Unceasingly] He adds to His creation whatever He wills: for, verily, God has the power to will anything.",
      "ms": "Segala puji tertentu bagi Allah yang menciptakan langit dan bumi, yang menjadikan malaikat utusan-utusan yang bersayap: dua, tiga dan empat; Ia menambah pada bentuk kejadian makhluk yang diciptakanNya apa jua yang dikehendakiNya. Sesungguhnya Allah Maha Kuasa atas tiap-tiap sesuatu.",
      "id": "Segala puji bagi Allah Pencipta langit dan bumi, Yang menjadikan malaikat sebagai utusan-utusan (untuk mengurus berbagai macam urusan) yang mempunyai sayap, masing-masing (ada yang) dua, tiga dan empat. Allah menambahkan pada ciptaan-Nya apa yang dikehendaki-Nya. Sesungguhnya Allah Maha Kuasa atas segala sesuatu.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱلۡحَمۡدُ لِلَّهِ فَاطِرِ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ جَاعِلِ ٱلۡمَلَـٰۤىِٕكَةِ رُسُلًا أُو۟لِیۤ أَجۡنِحَةࣲ مَّثۡنَىٰ وَثُلَـٰثَ وَرُبَـٰعَۚ یَزِیدُ فِی ٱلۡخَلۡقِ مَا یَشَاۤءُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n"
    }
  },
  {
    "id": 3662,
    "surahId": 35,
    "ayahNumber": 2,
    "arabicText": "مَّا یَفۡتَحِ ٱللَّهُ لِلنَّاسِ مِن رَّحۡمَةࣲ فَلَا مُمۡسِكَ لَهَاۖ وَمَا یُمۡسِكۡ فَلَا مُرۡسِلَ لَهُۥ مِنۢ بَعۡدِهِۦۚ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n",
    "translations": {
      "en": "Whatever grace God opens up to man, none can withhold it; and whatever He withholds, none can henceforth release: for He alone is almighty, truly wise.",
      "ms": "Apa jua jenis rahmat yang dibukakan oleh Allah kepada manusia, maka tidak ada sesuatupun yang dapat menahannya; dan apa jua yang ditahan oleh Allah maka tidak ada sesuatupun yang dapat melepaskannya sesudah itu. Dan (ingatlah) Dia lah sahaja yang Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorangpun yang dapat menahannya; dan apa saja yang ditahan oleh Allah maka tidak seorangpun yang sanggup melepaskannya sesudah itu. Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.",
      "ar": "مَّا یَفۡتَحِ ٱللَّهُ لِلنَّاسِ مِن رَّحۡمَةࣲ فَلَا مُمۡسِكَ لَهَاۖ وَمَا یُمۡسِكۡ فَلَا مُرۡسِلَ لَهُۥ مِنۢ بَعۡدِهِۦۚ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n"
    }
  },
  {
    "id": 3663,
    "surahId": 35,
    "ayahNumber": 3,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ ٱذۡكُرُوا۟ نِعۡمَتَ ٱللَّهِ عَلَیۡكُمۡۚ هَلۡ مِنۡ خَـٰلِقٍ غَیۡرُ ٱللَّهِ یَرۡزُقُكُم مِّنَ ٱلسَّمَاۤءِ وَٱلۡأَرۡضِۚ لَاۤ إِلَـٰهَ إِلَّا هُوَۖ فَأَنَّىٰ تُؤۡفَكُونَ\n",
    "translations": {
      "en": "O men! Call to mind the blessings which God has bestowed upon you! Is there any creator, other than God, that could provide for you sustenance out of heaven and earth? There is no deity save Him: and yet, how perverted are your minds!",
      "ms": "Wahai umat manusia, kenangkanlah nikmat Allah yang telah dikurniakanNya kepada kamu; tidak ada sama sekali yang menciptakan sesuatu selain daripada Allah; Ia memberi rezeki kepada kamu dari langit dan bumi. Tiada Tuhan melainkan Dia, maka mengapa kamu rela dipalingkan (dari menyembahnya)?",
      "id": "Hai manusia, ingatlah akan nikmat Allah kepadamu. Adakah pencipta selain Allah yang dapat memberikan rezeki kepada kamu dari langit dan bumi? Tidak ada Tuhan selain Dia; maka mengapakah kamu berpaling (dari ketauhidan)?",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ ٱذۡكُرُوا۟ نِعۡمَتَ ٱللَّهِ عَلَیۡكُمۡۚ هَلۡ مِنۡ خَـٰلِقٍ غَیۡرُ ٱللَّهِ یَرۡزُقُكُم مِّنَ ٱلسَّمَاۤءِ وَٱلۡأَرۡضِۚ لَاۤ إِلَـٰهَ إِلَّا هُوَۖ فَأَنَّىٰ تُؤۡفَكُونَ\n"
    }
  },
  {
    "id": 3664,
    "surahId": 35,
    "ayahNumber": 4,
    "arabicText": "وَإِن یُكَذِّبُوكَ فَقَدۡ كُذِّبَتۡ رُسُلࣱ مِّن قَبۡلِكَۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ\n",
    "translations": {
      "en": "But if they [whose minds are perverted] give thee the lie, [O Prophet, remember that] even so, before thy time, have [other] apostles been given the lie: for [the unbelievers always refuse to admit that] all things go back to God [as their source].",
      "ms": "Dan jika mereka mendustakanmu (wahai Muhammad), maka sesungguhnya Rasul-rasul yang terdahulu sebelummu telah juga didustakan (oleh kaumnya masing-masing). Dan (Ingatlah), kepada Allah jualah dikembalikan segala urusan.",
      "id": "Dan jika mereka mendustakan kamu (sesudah kamu beri peringatan) maka sungguh telah didustakan pula rasul-rasul sebelum kamu. Dan hanya kepada Allahlah dikembalikan segala urusan.",
      "ar": "وَإِن یُكَذِّبُوكَ فَقَدۡ كُذِّبَتۡ رُسُلࣱ مِّن قَبۡلِكَۚ وَإِلَى ٱللَّهِ تُرۡجَعُ ٱلۡأُمُورُ\n"
    }
  },
  {
    "id": 3665,
    "surahId": 35,
    "ayahNumber": 5,
    "arabicText": "یَـٰۤأَیُّهَا ٱلنَّاسُ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّۖ فَلَا تَغُرَّنَّكُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَا وَلَا یَغُرَّنَّكُم بِٱللَّهِ ٱلۡغَرُورُ\n",
    "translations": {
      "en": "O men! Verily, God’s promise [of resurrection] is true indeed: let not, then, the life of this world delude you, and let not [your own] deceptive thoughts about God delude you!",
      "ms": "Wahai umat manusia, sesungguhnya janji Allah (membalas amal kamu) adalah benar; maka janganlah kamu diperdayakan oleh kemewahan hidup di dunia, dan janganlah Syaitan yang menjadi sebesar-besar penipu itu berpeluang menyebabkan kamu terpedaya dengan (kemurahan) Allah (lalu kamu lalai dan menderhaka).",
      "id": "Hai manusia, sesungguhnya janji Allah adalah benar, maka sekali-kali janganlah kehidupan dunia memperdayakan kamu dan sekali-kali janganlah syaitan yang pandai menipu, memperdayakan kamu tentang Allah.",
      "ar": "یَـٰۤأَیُّهَا ٱلنَّاسُ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّۖ فَلَا تَغُرَّنَّكُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَا وَلَا یَغُرَّنَّكُم بِٱللَّهِ ٱلۡغَرُورُ\n"
    }
  },
  {
    "id": 3666,
    "surahId": 35,
    "ayahNumber": 6,
    "arabicText": "إِنَّ ٱلشَّیۡطَـٰنَ لَكُمۡ عَدُوࣱّ فَٱتَّخِذُوهُ عَدُوًّاۚ إِنَّمَا یَدۡعُوا۟ حِزۡبَهُۥ لِیَكُونُوا۟ مِنۡ أَصۡحَـٰبِ ٱلسَّعِیرِ\n",
    "translations": {
      "en": "Behold, Satan is a foe unto you: so treat him as a foe. He but calls on his followers to the end that they might find themselves among such as are des­tined for the blazing flame –",
      "ms": "Sesungguhnya Syaitan adalah musuh bagi kamu, maka jadikanlah dia musuh (yang mesti dijauhi tipu dayanya); sebenarnya dia hanyalah mengajak golongannya supaya menjadi dari penduduk neraka.",
      "id": "Sesungguhnya syaitan itu adalah musuh bagimu, maka anggaplah ia musuh(mu), karena sesungguhnya syaitan-syaitan itu hanya mengajak golongannya supaya mereka menjadi penghuni neraka yang menyala-nyala",
      "ar": "إِنَّ ٱلشَّیۡطَـٰنَ لَكُمۡ عَدُوࣱّ فَٱتَّخِذُوهُ عَدُوًّاۚ إِنَّمَا یَدۡعُوا۟ حِزۡبَهُۥ لِیَكُونُوا۟ مِنۡ أَصۡحَـٰبِ ٱلسَّعِیرِ\n"
    }
  },
  {
    "id": 3667,
    "surahId": 35,
    "ayahNumber": 7,
    "arabicText": "ٱلَّذِینَ كَفَرُوا۟ لَهُمۡ عَذَابࣱ شَدِیدࣱۖ وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ لَهُم مَّغۡفِرَةࣱ وَأَجۡرࣱ كَبِیرٌ\n",
    "translations": {
      "en": "[seeing that] for those who are bent on denying the truth there is suffering severe in store, just as for those who have attained to faith and do righteous deeds there is forgiveness of sins, and a great reward.",
      "ms": "Orang-orang yang kafir, bagi mereka azab yang berat; dan orang-orang yang beriman serta beramal soleh, bagi mereka keampunan dan pahala yang besar.",
      "id": "Orang-orang yang kafir bagi mereka azab yang keras. Dan orang-orang yang beriman dan mengerjakan amal saleh bagi mereka ampunan dan pahala yang besar.",
      "ar": "ٱلَّذِینَ كَفَرُوا۟ لَهُمۡ عَذَابࣱ شَدِیدࣱۖ وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ لَهُم مَّغۡفِرَةࣱ وَأَجۡرࣱ كَبِیرٌ\n"
    }
  },
  {
    "id": 3668,
    "surahId": 35,
    "ayahNumber": 8,
    "arabicText": "أَفَمَن زُیِّنَ لَهُۥ سُوۤءُ عَمَلِهِۦ فَرَءَاهُ حَسَنࣰاۖ فَإِنَّ ٱللَّهَ یُضِلُّ مَن یَشَاۤءُ وَیَهۡدِی مَن یَشَاۤءُۖ فَلَا تَذۡهَبۡ نَفۡسُكَ عَلَیۡهِمۡ حَسَرَ ٰ⁠تٍۚ إِنَّ ٱللَّهَ عَلِیمُۢ بِمَا یَصۡنَعُونَ\n",
    "translations": {
      "en": "Is, then, he to whom the evil of his own doings is [so] alluring that [in the end] he regards it as good [anything but a follower of Satan]? For, verily, God lets go astray him that wills [to go astray], just as He guides him that wills [to be guided]. Hence, [O believer,] do not waste thyself in sorrowing over them: verily, God has full knowledge of all that they do!",
      "ms": "Maka (fikirkanlah) adakah orang yang diperelokkan kepadanya amal buruknya (oleh Syaitan) lalu ia memandangnya dan mempercayainya baik, (bolehkah disifatkan sebagai orang yang menjalankan peraturan yang ditetapkan Allah untuk memberi hidayah kepadanya, atau sebaliknya) ? Kerana sesungguhnya Allah menyesatkan sesiapa yang dikehendakiNya, dan Ia juga memberi hidayah petunjuk kepada sesiapa yang dikehendakiNya. Oleh itu, janganlah engkau membinasakan dirimu (wahai Muhammad) kerana menanggung dukacita terhadap kesesatan mereka. Sesungguhnya Allah Maha Mengetahui akan apa yang mereka kerjakan.",
      "id": "Maka apakah orang yang dijadikan (syaitan) menganggap baik pekerjaannya yang buruk lalu dia meyakini pekerjaan itu baik, (sama dengan orang yang tidak ditipu oleh syaitan)? Maka sesungguhnya Allah menyesatkan siapa yang dikehendaki-Nya dan menunjuki siapa yang dikehendaki-Nya; maka janganlah dirimu binasa karena kesedihan terhadap mereka. Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat.",
      "ar": "أَفَمَن زُیِّنَ لَهُۥ سُوۤءُ عَمَلِهِۦ فَرَءَاهُ حَسَنࣰاۖ فَإِنَّ ٱللَّهَ یُضِلُّ مَن یَشَاۤءُ وَیَهۡدِی مَن یَشَاۤءُۖ فَلَا تَذۡهَبۡ نَفۡسُكَ عَلَیۡهِمۡ حَسَرَ ٰ⁠تٍۚ إِنَّ ٱللَّهَ عَلِیمُۢ بِمَا یَصۡنَعُونَ\n"
    }
  },
  {
    "id": 3669,
    "surahId": 35,
    "ayahNumber": 9,
    "arabicText": "وَٱللَّهُ ٱلَّذِیۤ أَرۡسَلَ ٱلرِّیَـٰحَ فَتُثِیرُ سَحَابࣰا فَسُقۡنَـٰهُ إِلَىٰ بَلَدࣲ مَّیِّتࣲ فَأَحۡیَیۡنَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۚ كَذَ ٰ⁠لِكَ ٱلنُّشُورُ\n",
    "translations": {
      "en": "AND [remember:] it is God who sends forth the winds, so that they raise a cloud, whereupon We drive it towards dead land and thereby give life to the earth after it had been lifeless: even thus shall resur­rection be!",
      "ms": "Dan Allah jualah yang menghantarkan angin, lalu angin itu menggerakkan awan, kemudian Kami halakan awan itu ke negeri yang mati (yang kering kontang); lalu Kami hidupkan bumi sesudah matinya dengan (hujan dari awan) itu. Sedemikian itu pula kebangkitan manusia (hidup semula sesudah mati).",
      "id": "Dan Allah, Dialah Yang mengirimkan angin; lalu angin itu menggerakkan awan, maka Kami halau awan itu kesuatu negeri yang mati lalu Kami hidupkan bumi setelah matinya dengan hujan itu. Demikianlah kebangkitan itu.",
      "ar": "وَٱللَّهُ ٱلَّذِیۤ أَرۡسَلَ ٱلرِّیَـٰحَ فَتُثِیرُ سَحَابࣰا فَسُقۡنَـٰهُ إِلَىٰ بَلَدࣲ مَّیِّتࣲ فَأَحۡیَیۡنَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَاۚ كَذَ ٰ⁠لِكَ ٱلنُّشُورُ\n"
    }
  },
  {
    "id": 3670,
    "surahId": 35,
    "ayahNumber": 10,
    "arabicText": "مَن كَانَ یُرِیدُ ٱلۡعِزَّةَ فَلِلَّهِ ٱلۡعِزَّةُ جَمِیعًاۚ إِلَیۡهِ یَصۡعَدُ ٱلۡكَلِمُ ٱلطَّیِّبُ وَٱلۡعَمَلُ ٱلصَّـٰلِحُ یَرۡفَعُهُۥۚ وَٱلَّذِینَ یَمۡكُرُونَ ٱلسَّیِّـَٔاتِ لَهُمۡ عَذَابࣱ شَدِیدࣱۖ وَمَكۡرُ أُو۟لَـٰۤىِٕكَ هُوَ یَبُورُ\n",
    "translations": {
      "en": "He who desires might and glory [ought to know that] all might and glory belong to God [alone]. Unto Him ascend all good words, and the righteous deed does He exalt. But as for those who cunningly devise evil deeds - suffering severe awaits them; and all their devising is bound to come to nought.",
      "ms": "Sesiapa yang mahukan kemuliaan (maka hendaklah ia berusaha mencarinya dengan jalan mematuhi perintah Allah), kerana bagi Allah jualah segala kemuliaan. Kepada Allah lah naiknya segala perkataan yang baik (yang menegaskan iman dan tauhid, untuk dimasukkan ke dalam kira-kira balasan), dan amal yang soleh pula di angkatnya naik (sebagai amal yang makbul - yang memberi kemuliaan kepada yang melakukannya). Dan sebaliknya: orang-orang yang merancangkan kejahatan (untuk mendapat kemuliaan), adalah bagi mereka azab seksa yang berat; dan rancangan jahat mereka (kalau berkesan) akan rosak binasa.",
      "id": "Barangsiapa yang menghendaki kemuliaan, maka bagi Allah-lah kemuliaan itu semuanya. Kepada-Nya-lah naik perkataan-perkataan yang baik dan amal yang saleh dinaikkan-Nya. Dan orang-orang yang merencanakan kejahatan bagi mereka azab yang keras. Dan rencana jahat mereka akan hancur.",
      "ar": "مَن كَانَ یُرِیدُ ٱلۡعِزَّةَ فَلِلَّهِ ٱلۡعِزَّةُ جَمِیعًاۚ إِلَیۡهِ یَصۡعَدُ ٱلۡكَلِمُ ٱلطَّیِّبُ وَٱلۡعَمَلُ ٱلصَّـٰلِحُ یَرۡفَعُهُۥۚ وَٱلَّذِینَ یَمۡكُرُونَ ٱلسَّیِّـَٔاتِ لَهُمۡ عَذَابࣱ شَدِیدࣱۖ وَمَكۡرُ أُو۟لَـٰۤىِٕكَ هُوَ یَبُورُ\n"
    }
  },
  {
    "id": 3671,
    "surahId": 35,
    "ayahNumber": 11,
    "arabicText": "وَٱللَّهُ خَلَقَكُم مِّن تُرَابࣲ ثُمَّ مِن نُّطۡفَةࣲ ثُمَّ جَعَلَكُمۡ أَزۡوَ ٰ⁠جࣰاۚ وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَمَا یُعَمَّرُ مِن مُّعَمَّرࣲ وَلَا یُنقَصُ مِنۡ عُمُرِهِۦۤ إِلَّا فِی كِتَـٰبٍۚ إِنَّ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرࣱ\n",
    "translations": {
      "en": "And [remember:] God creates [every one of] you out of dust, then out of a drop of sperm; and then He fashions you into either of the two sexes. And no female conceives or gives birth unless it be with His knowledge; and none that is long-lived has his days lengthened - and neither is aught lessened of his days - unless it be thus laid down in [God’s] decree: for, behold, all this is easy for God.",
      "ms": "Dan Allah menciptakan kamu dari tanah, kemudian dari (setitis) air benih, kemudian Ia menjadikan kamu berpasangan (lelaki dan perempuan). Dan tiada mengandung seseorang perempuan (juga seekor betina), dan tidak pula satu-satunya melahirkan (anak yang dikandungnya) melainkan dengan keadaan yang diketahui Allah. Dan tidak diberikan seseorang berumur panjang, juga tidak dijadikan seseorang pendek umurnya, melainkan ada kadarnya di dalam Kitab Ilahi. Sesungguhnya yang demikian itu mudah sahaja kepada Allah.",
      "id": "Dan Allah menciptakan kamu dari tanah kemudian dari air mani, kemudian Dia menjadikan kamu berpasangan (laki-laki dan perempuan). Dan tidak ada seorang perempuanpun mengandung dan tidak (pula) melahirkan melainkan dengan sepengetahuan-Nya. Dan sekali-kali tidak dipanjangkan umur seorang yang berumur panjang dan tidak pula dikurangi umurnya, melainkan (sudah ditetapkan) dalam Kitab (Lauh Mahfuzh). Sesungguhnya yang demikian itu bagi Allah adalah mudah.",
      "ar": "وَٱللَّهُ خَلَقَكُم مِّن تُرَابࣲ ثُمَّ مِن نُّطۡفَةࣲ ثُمَّ جَعَلَكُمۡ أَزۡوَ ٰ⁠جࣰاۚ وَمَا تَحۡمِلُ مِنۡ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلۡمِهِۦۚ وَمَا یُعَمَّرُ مِن مُّعَمَّرࣲ وَلَا یُنقَصُ مِنۡ عُمُرِهِۦۤ إِلَّا فِی كِتَـٰبٍۚ إِنَّ ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ یَسِیرࣱ\n"
    }
  },
  {
    "id": 3672,
    "surahId": 35,
    "ayahNumber": 12,
    "arabicText": "وَمَا یَسۡتَوِی ٱلۡبَحۡرَانِ هَـٰذَا عَذۡبࣱ فُرَاتࣱ سَاۤىِٕغࣱ شَرَابُهُۥ وَهَـٰذَا مِلۡحٌ أُجَاجࣱۖ وَمِن كُلࣲّ تَأۡكُلُونَ لَحۡمࣰا طَرِیࣰّا وَتَسۡتَخۡرِجُونَ حِلۡیَةࣰ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ فِیهِ مَوَاخِرَ لِتَبۡتَغُوا۟ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ\n",
    "translations": {
      "en": "[Easy is it for Him to create likeness and variety:] thus, the two great bodies of water [on earth] are not alike the one sweet, thirst-allaying, pleasant to drink, and the other salty and bitter: and yet, from either of them do you eat fresh meat, and [from either] you take gems which you may wear; and on either thou canst see ships ploughing through the waves, so that you might [be able to] go forth in quest of some of His bounty, and thus have cause to be grateful.",
      "ms": "Dan tidaklah sama keadaan dua laut (sekalipun satu jenisnya), yang satu tawar lagi memuaskan dahaga serta sesuai diminum, sementara yang satu lagi masin lagi pahit. Dan (kedua-duanya itu berfaedah kepada kamu): dari tiap-tiap satunya kamu dapat makan daging yang lembut - hidup-hidup, dan dapat pula kamu mengeluarkan benda-benda perhiasan untuk kamu memakainya; (selain itu) engkau melihat pula kapal-kapal membelah air belayar padanya; (diadakan semuanya itu) supaya kamu dapat mencari rezeki dari limpah kurnia Allah, dan supaya kamu bersyukur.",
      "id": "Dan tiada sama (antara) dua laut; yang ini tawar, segar, sedap diminum dan yang lain asin lagi pahit. Dan dari masing-masing laut itu kamu dapat memakan daging yang segar dan kamu dapat mengeluarkan perhiasan yang dapat kamu memakainya, dan pada masing-masingnya kamu lihat kapal-kapal berlayar membelah laut supaya kamu dapat mencari karunia-Nya dan supaya kamu bersyukur.",
      "ar": "وَمَا یَسۡتَوِی ٱلۡبَحۡرَانِ هَـٰذَا عَذۡبࣱ فُرَاتࣱ سَاۤىِٕغࣱ شَرَابُهُۥ وَهَـٰذَا مِلۡحٌ أُجَاجࣱۖ وَمِن كُلࣲّ تَأۡكُلُونَ لَحۡمࣰا طَرِیࣰّا وَتَسۡتَخۡرِجُونَ حِلۡیَةࣰ تَلۡبَسُونَهَاۖ وَتَرَى ٱلۡفُلۡكَ فِیهِ مَوَاخِرَ لِتَبۡتَغُوا۟ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ\n"
    }
  },
  {
    "id": 3673,
    "surahId": 35,
    "ayahNumber": 13,
    "arabicText": "یُولِجُ ٱلَّیۡلَ فِی ٱلنَّهَارِ وَیُولِجُ ٱلنَّهَارَ فِی ٱلَّیۡلِ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلࣱّ یَجۡرِی لِأَجَلࣲ مُّسَمࣰّىۚ ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمۡ لَهُ ٱلۡمُلۡكُۚ وَٱلَّذِینَ تَدۡعُونَ مِن دُونِهِۦ مَا یَمۡلِكُونَ مِن قِطۡمِیرٍ\n",
    "translations": {
      "en": "He makes the night grow longer by shortening the day, and He makes the day grow longer by shortening the night; and He has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him]. Thus is God, your Sustainer: unto Him belongs all dominion - whereas those whom you invoke instead of Him do not own so much as the husk of a date-stone!",
      "ms": "Allah jua yang memasukkan malam pada siang dan memasukkan siang pada malam (silih berganti), dan Ia yang memudahkan peredaran matahari dan bulan; tiap-tiap satu dari keduanya beredar untuk suatu masa yang telah ditetapkan. Yang melakukan semuanya itu ialah Allah Tuhan kamu, bagiNyalah kuasa pemerintahan; sedang mereka yang kamu sembah - yang lain dari Allah - tidak mempunyai sesuatu pun walau senipis selaput biji kurma.",
      "id": "Dia memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan menundukkan matahari dan bulan, masing-masing berjalan menurut waktu yang ditentukan. Yang (berbuat) demikian itulah Allah Tuhanmu, kepunyaan-Nya-lah kerajaan. Dan orang-orang yang kamu seru (sembah) selain Allah tiada mempunyai apa-apa walaupun setipis kulit ari.",
      "ar": "یُولِجُ ٱلَّیۡلَ فِی ٱلنَّهَارِ وَیُولِجُ ٱلنَّهَارَ فِی ٱلَّیۡلِ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلࣱّ یَجۡرِی لِأَجَلࣲ مُّسَمࣰّىۚ ذَ ٰ⁠لِكُمُ ٱللَّهُ رَبُّكُمۡ لَهُ ٱلۡمُلۡكُۚ وَٱلَّذِینَ تَدۡعُونَ مِن دُونِهِۦ مَا یَمۡلِكُونَ مِن قِطۡمِیرٍ\n"
    }
  },
  {
    "id": 3674,
    "surahId": 35,
    "ayahNumber": 14,
    "arabicText": "إِن تَدۡعُوهُمۡ لَا یَسۡمَعُوا۟ دُعَاۤءَكُمۡ وَلَوۡ سَمِعُوا۟ مَا ٱسۡتَجَابُوا۟ لَكُمۡۖ وَیَوۡمَ ٱلۡقِیَـٰمَةِ یَكۡفُرُونَ بِشِرۡكِكُمۡۚ وَلَا یُنَبِّئُكَ مِثۡلُ خَبِیرࣲ\n",
    "translations": {
      "en": "If you invoke them, they do not hear your call; and even if they could hear, they would not [be able to] respond to you. And [withal,] on the Day of Resurrection they will utterly disown your having associated them with God. And none can make thee understand [the truth] like the One who is all-aware.",
      "ms": "Kalau kamu memohon kepada mereka (yang kamu sembah itu): mereka tidak mendengar permohonan kamu, dan kalaulah mereka mendengar pun, mereka tidak dapat memberikan apa yang kamu pohonkan itu; dan pada hari kiamat pula mereka mengingkari perbuatan syirik kamu. Dan (ingatlah) tidak ada yang dapat memberi tahu kepadamu (wahai Muhammad, akan hakikat yang sebenarnya) seperti yang diberikan Allah Yang Maha Mendalam PengetahuanNya.",
      "id": "Jika kamu menyeru mereka, mereka tiada mendengar seruanmu; dan kalau mereka mendengar, mereka tidak dapat memperkenankan permintaanmu. Dan dihari kiamat mereka akan mengingkari kemusyirikanmu dan tidak ada yang dapat memberi keterangan kepadamu sebagai yang diberikan oleh Yang Maha Mengetahui.",
      "ar": "إِن تَدۡعُوهُمۡ لَا یَسۡمَعُوا۟ دُعَاۤءَكُمۡ وَلَوۡ سَمِعُوا۟ مَا ٱسۡتَجَابُوا۟ لَكُمۡۖ وَیَوۡمَ ٱلۡقِیَـٰمَةِ یَكۡفُرُونَ بِشِرۡكِكُمۡۚ وَلَا یُنَبِّئُكَ مِثۡلُ خَبِیرࣲ\n"
    }
  },
  {
    "id": 3675,
    "surahId": 35,
    "ayahNumber": 15,
    "arabicText": "۞ یَـٰۤأَیُّهَا ٱلنَّاسُ أَنتُمُ ٱلۡفُقَرَاۤءُ إِلَى ٱللَّهِۖ وَٱللَّهُ هُوَ ٱلۡغَنِیُّ ٱلۡحَمِیدُ\n",
    "translations": {
      "en": "O men! It is you, who stand in need of God, whereas He alone is self-sufficient, the One to whom all praise is due.",
      "ms": "(Oleh kerana Allah menguasai segala-galanya, maka) wahai umat manusia, kamulah yang sentiasa berhajat kepada Allah (dalam segala perkara), sedang Allah Dia lah sahaja Yang Maha Kaya, lagi Maha Terpuji.",
      "id": "Hai manusia, kamulah yang berkehendak kepada Allah; dan Allah Dialah Yang Maha Kaya (tidak memerlukan sesuatu) lagi Maha Terpuji.",
      "ar": "۞ یَـٰۤأَیُّهَا ٱلنَّاسُ أَنتُمُ ٱلۡفُقَرَاۤءُ إِلَى ٱللَّهِۖ وَٱللَّهُ هُوَ ٱلۡغَنِیُّ ٱلۡحَمِیدُ\n"
    }
  },
  {
    "id": 3676,
    "surahId": 35,
    "ayahNumber": 16,
    "arabicText": "إِن یَشَأۡ یُذۡهِبۡكُمۡ وَیَأۡتِ بِخَلۡقࣲ جَدِیدࣲ\n",
    "translations": {
      "en": "If He so wills, He can do away with you and bring forth a new mankind [in your stead]:",
      "ms": "Jika Ia mahu, nescaya Ia membinasakan kamu dan mendatangkan makhluk yang baharu.",
      "id": "Jika Dia menghendaki, niscaya Dia memusnahkan kamu dan mendatangkan makhluk yang baru (untuk menggantikan kamu).",
      "ar": "إِن یَشَأۡ یُذۡهِبۡكُمۡ وَیَأۡتِ بِخَلۡقࣲ جَدِیدࣲ\n"
    }
  },
  {
    "id": 3677,
    "surahId": 35,
    "ayahNumber": 17,
    "arabicText": "وَمَا ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ بِعَزِیزࣲ\n",
    "translations": {
      "en": "nor is this difficult for God.",
      "ms": "Dan (perlaksanaan) yang demikian itu tidaklah sukar bagi Allah.",
      "id": "Dan yang demikian itu sekali-kali tidak sulit bagi Allah.",
      "ar": "وَمَا ذَ ٰ⁠لِكَ عَلَى ٱللَّهِ بِعَزِیزࣲ\n"
    }
  },
  {
    "id": 3678,
    "surahId": 35,
    "ayahNumber": 18,
    "arabicText": "وَلَا تَزِرُ وَازِرَةࣱ وِزۡرَ أُخۡرَىٰۚ وَإِن تَدۡعُ مُثۡقَلَةٌ إِلَىٰ حِمۡلِهَا لَا یُحۡمَلۡ مِنۡهُ شَیۡءࣱ وَلَوۡ كَانَ ذَا قُرۡبَىٰۤۗ إِنَّمَا تُنذِرُ ٱلَّذِینَ یَخۡشَوۡنَ رَبَّهُم بِٱلۡغَیۡبِ وَأَقَامُوا۟ ٱلصَّلَوٰةَۚ وَمَن تَزَكَّىٰ فَإِنَّمَا یَتَزَكَّىٰ لِنَفۡسِهِۦۚ وَإِلَى ٱللَّهِ ٱلۡمَصِیرُ\n",
    "translations": {
      "en": "AND NO BEARER of burdens shall be made to bear another’s burden; and if one weighed down by his load calls upon [another] to help him carry it, nothing thereof may be carried [by that other], even if it be one’s near of kin. Hence, thou canst [truly] warn only those who stand in awe of their Sustainer although He is beyond the reach of their perception, and are constant in prayer, and [know that] whoever grows in purity, attains to purity but for the good of his own self, and [that] with God is all journeys’ end.",
      "ms": "Dan (ketahuilah), seseorang pemikul tldak akan memikul dosa perbuatan orang lain; dan jika seseorang yang berat tanggungnya (dengan dosa), memanggil (orang lain) untuk menolong memikul sama bebanan itu, tidak akan dapat dipikul sedikitpun daripadanya, walaupun orang yang diminta pertolongannya itu dari kerabatnya sendiri. Sesungguhnya engkau (wahai Muhammad) hanyalah memberi peringatan kepada orang-orang yang takut (melanggar hukum-hukum) Tuhan semasa mereka tidak dilihat orang dan semasa mereka tidak melihat azab Tuhan, serta mereka mendirikan sembahyang. Dan sesiapa yang membersihkan dirinya (dari segala yang dilarang) maka sesungguhnya ia melakukan pembersihan itu untuk kebaikan dirinya sendiri dan (ingatlah), kepada Allah jualah tempat kembali.",
      "id": "Dan orang yang berdosa tidak akan memikul dosa orang lain. Dan jika seseorang yang berat dosanya memanggil (orang lain) untuk memikul dosanya itu tiadalah akan dipikulkan untuknya sedikitpun meskipun (yang dipanggilnya itu) kaum kerabatnya. Sesungguhnya yang dapat kamu beri peringatan hanya orang-orang yang takut kepada azab Tuhannya (sekalipun) mereka tidak melihat-Nya dan mereka mendirikan sembahyang. Dan barangsiapa yang mensucikan dirinya, sesungguhnya ia mensucikan diri untuk kebaikan dirinya sendiri. Dan kepada Allahlah kembali(mu).",
      "ar": "وَلَا تَزِرُ وَازِرَةࣱ وِزۡرَ أُخۡرَىٰۚ وَإِن تَدۡعُ مُثۡقَلَةٌ إِلَىٰ حِمۡلِهَا لَا یُحۡمَلۡ مِنۡهُ شَیۡءࣱ وَلَوۡ كَانَ ذَا قُرۡبَىٰۤۗ إِنَّمَا تُنذِرُ ٱلَّذِینَ یَخۡشَوۡنَ رَبَّهُم بِٱلۡغَیۡبِ وَأَقَامُوا۟ ٱلصَّلَوٰةَۚ وَمَن تَزَكَّىٰ فَإِنَّمَا یَتَزَكَّىٰ لِنَفۡسِهِۦۚ وَإِلَى ٱللَّهِ ٱلۡمَصِیرُ\n"
    }
  },
  {
    "id": 3679,
    "surahId": 35,
    "ayahNumber": 19,
    "arabicText": "وَمَا یَسۡتَوِی ٱلۡأَعۡمَىٰ وَٱلۡبَصِیرُ\n",
    "translations": {
      "en": "For [thus it is:] the blind and the seeing are not equal;",
      "ms": "Dan tidaklah sama orang buat dengan orang yang melihat.",
      "id": "Dan tidaklah sama orang yang buta dengan orang yang melihat.",
      "ar": "وَمَا یَسۡتَوِی ٱلۡأَعۡمَىٰ وَٱلۡبَصِیرُ\n"
    }
  },
  {
    "id": 3680,
    "surahId": 35,
    "ayahNumber": 20,
    "arabicText": "وَلَا ٱلظُّلُمَـٰتُ وَلَا ٱلنُّورُ\n",
    "translations": {
      "en": "nor are the depths of darkness and the light;",
      "ms": "Dan tidaklah sama gelap-gelita dengan cahaya yang terang-benderang,",
      "id": "dan tidak (pula) sama gelap gulita dengan cahaya,",
      "ar": "وَلَا ٱلظُّلُمَـٰتُ وَلَا ٱلنُّورُ\n"
    }
  },
  {
    "id": 3681,
    "surahId": 35,
    "ayahNumber": 21,
    "arabicText": "وَلَا ٱلظِّلُّ وَلَا ٱلۡحَرُورُ\n",
    "translations": {
      "en": "nor the [cooling] shade and the scorching heat:",
      "ms": "Dan tidaklah sama suasana yang teduh dengan yang kencang panasnya.",
      "id": "dan tidak (pula) sama yang teduh dengan yang panas,",
      "ar": "وَلَا ٱلظِّلُّ وَلَا ٱلۡحَرُورُ\n"
    }
  },
  {
    "id": 3682,
    "surahId": 35,
    "ayahNumber": 22,
    "arabicText": "وَمَا یَسۡتَوِی ٱلۡأَحۡیَاۤءُ وَلَا ٱلۡأَمۡوَ ٰ⁠تُۚ إِنَّ ٱللَّهَ یُسۡمِعُ مَن یَشَاۤءُۖ وَمَاۤ أَنتَ بِمُسۡمِعࣲ مَّن فِی ٱلۡقُبُورِ\n",
    "translations": {
      "en": "and neither are equal the living and the dead [of heart]. Behold, [O Muhammad,] God can make hear whomever He wills, whereas thou canst not make hear such as are [dead of heart like the dead] in their graves:",
      "ms": "Dan (Demikianlah pula) tidaklah sama orang-orang yang hidup dengan orang-orang yang mati. Sesungguhnya Allah, (menurut undang-undang peraturanNya), dapat menjadikan sesiapa yang dikehendakinya mendengar (ajaran-ajaran Kitab Allah serta menerimanya), dan (engkau wahai Muhammad) tidak dapat menjadikan orang-orang yang di dalam kubur mendengar (dan menerimanya).",
      "id": "dan tidak (pula) sama orang-orang yang hidup dan orang-orang yang mati. Sesungguhnya Allah memberi pendengaran kepada siapa yang dikehendaki-Nya dan kamu sekali-kali tiada sanggup menjadikan orang yang didalam kubur dapat mendengar.",
      "ar": "وَمَا یَسۡتَوِی ٱلۡأَحۡیَاۤءُ وَلَا ٱلۡأَمۡوَ ٰ⁠تُۚ إِنَّ ٱللَّهَ یُسۡمِعُ مَن یَشَاۤءُۖ وَمَاۤ أَنتَ بِمُسۡمِعࣲ مَّن فِی ٱلۡقُبُورِ\n"
    }
  },
  {
    "id": 3683,
    "surahId": 35,
    "ayahNumber": 23,
    "arabicText": "إِنۡ أَنتَ إِلَّا نَذِیرٌ\n",
    "translations": {
      "en": "thou art nothing but a warner.",
      "ms": "Engkau tidak lain hanyalah seorang Rasul pemberi ingatan dan amaran.",
      "id": "Kamu tidak lain hanyalah seorang pemberi peringatan.",
      "ar": "إِنۡ أَنتَ إِلَّا نَذِیرٌ\n"
    }
  },
  {
    "id": 3684,
    "surahId": 35,
    "ayahNumber": 24,
    "arabicText": "إِنَّاۤ أَرۡسَلۡنَـٰكَ بِٱلۡحَقِّ بَشِیرࣰا وَنَذِیرࣰاۚ وَإِن مِّنۡ أُمَّةٍ إِلَّا خَلَا فِیهَا نَذِیرࣱ\n",
    "translations": {
      "en": "Verily, We have sent thee with the truth, as a bearer of glad tidings and a warner: for there never was any community but a warner has [lived and] passed away in its midst.",
      "ms": "Sesungguhnya Kami mengutusmu dengan (Ugama) yang benar, sebagai pembawa berita gembira (kepada orang-orang yang beriman) dan pemberi amaran (kepada orang-orang yang ingkar); dan tidak ada, sesuatu umat pun melainkan telah ada dalam kalangannya dahulu seorang Rasul pemberi ingatan dan amaran.",
      "id": "Sesungguhnya Kami mengutus kamu dengan membawa kebenaran sebagai pembawa berita gembira dan sebagai pemberi peringatan. Dan tidak ada suatu umatpun melainkan telah ada padanya seorang pemberi peringatan.",
      "ar": "إِنَّاۤ أَرۡسَلۡنَـٰكَ بِٱلۡحَقِّ بَشِیرࣰا وَنَذِیرࣰاۚ وَإِن مِّنۡ أُمَّةٍ إِلَّا خَلَا فِیهَا نَذِیرࣱ\n"
    }
  },
  {
    "id": 3685,
    "surahId": 35,
    "ayahNumber": 25,
    "arabicText": "وَإِن یُكَذِّبُوكَ فَقَدۡ كَذَّبَ ٱلَّذِینَ مِن قَبۡلِهِمۡ جَاۤءَتۡهُمۡ رُسُلُهُم بِٱلۡبَیِّنَـٰتِ وَبِٱلزُّبُرِ وَبِٱلۡكِتَـٰبِ ٱلۡمُنِیرِ\n",
    "translations": {
      "en": "And if they give thee the lie - even so gave the lie to the truth [many of] those who lived before their time, [when] there came unto them their apostles with all evidence of the truth, and with books of divine wisdom, and with light-giving revelation;",
      "ms": "Dan jika mereka (yang kafir itu) mendustakanmu, (maka yang demikian itu tidaklah menjadi hal) kerana sesungguhnya orang-orang yang terdahulu sebelum mereka telah juga mendustakan (Rasul masing-masing), mereka telah didatangi Rasul-rasulnya dengan membawa keterangan-keterangan (mukjizat) yang nyata dan Kitab-kitab (nasihat pengajaran) serta Kitab-kitab (syariat) yang terang jelas.",
      "id": "Dan jika mereka mendustakan kamu, maka sesungguhnya orang-orang yang sebelum mereka telah mendustakan (rasul-rasulnya); kepada mereka telah datang rasul-rasulnya dengan membawa mukjizat yang nyata, zubur, dan kitab yang memberi penjelasan yang sempurna.",
      "ar": "وَإِن یُكَذِّبُوكَ فَقَدۡ كَذَّبَ ٱلَّذِینَ مِن قَبۡلِهِمۡ جَاۤءَتۡهُمۡ رُسُلُهُم بِٱلۡبَیِّنَـٰتِ وَبِٱلزُّبُرِ وَبِٱلۡكِتَـٰبِ ٱلۡمُنِیرِ\n"
    }
  },
  {
    "id": 3686,
    "surahId": 35,
    "ayahNumber": 26,
    "arabicText": "ثُمَّ أَخَذۡتُ ٱلَّذِینَ كَفَرُوا۟ۖ فَكَیۡفَ كَانَ نَكِیرِ\n",
    "translations": {
      "en": "[but] in the end I took to task all those who were bent on denying the truth: and how awesome was My rejection!",
      "ms": "Kemudian Aku timpakan orang-orang kafir itu dengan azab yang membinasakan, maka perhatikanlah bagaimana buruknya akibat kemurkaanKu (menimpa mereka).",
      "id": "Kemudian Aku azab orang-orang yang kafir; maka (lihatlah) bagaimana (hebatnya) akibat kemurkaan-Ku.",
      "ar": "ثُمَّ أَخَذۡتُ ٱلَّذِینَ كَفَرُوا۟ۖ فَكَیۡفَ كَانَ نَكِیرِ\n"
    }
  },
  {
    "id": 3687,
    "surahId": 35,
    "ayahNumber": 27,
    "arabicText": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَخۡرَجۡنَا بِهِۦ ثَمَرَ ٰ⁠تࣲ مُّخۡتَلِفًا أَلۡوَ ٰ⁠نُهَاۚ وَمِنَ ٱلۡجِبَالِ جُدَدُۢ بِیضࣱ وَحُمۡرࣱ مُّخۡتَلِفٌ أَلۡوَ ٰ⁠نُهَا وَغَرَابِیبُ سُودࣱ\n",
    "translations": {
      "en": "ART THOU NOT aware that God sends down water from the skies, whereby We bring forth fruits of many hues - just as in the mountains there are streaks of white and red of various shades, as well as (others) raven-black,",
      "ms": "Tidakkah engkau melihat bahawa Allah menurunkan hujan dari langit, lalu Kami keluarkan dengan air hujan itu buah-buahan yang berlainan jenis dan rupanya; dan di antara gunung-ganang pula ada yang mempunyai jalur-jalur serta lorong-lorong putih dan merah, yang berlainan warnanya (tua dan muda) dan ada juga yang hitam legam;",
      "id": "Tidakkah kamu melihat bahwasanya Allah menurunkan hujan dari langit lalu Kami hasilkan dengan hujan itu buah-buahan yang beraneka macam jenisnya. Dan di antara gunung-gunung itu ada garis-garis putih dan merah yang beraneka macam warnanya dan ada (pula) yang hitam pekat.",
      "ar": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَأَخۡرَجۡنَا بِهِۦ ثَمَرَ ٰ⁠تࣲ مُّخۡتَلِفًا أَلۡوَ ٰ⁠نُهَاۚ وَمِنَ ٱلۡجِبَالِ جُدَدُۢ بِیضࣱ وَحُمۡرࣱ مُّخۡتَلِفٌ أَلۡوَ ٰ⁠نُهَا وَغَرَابِیبُ سُودࣱ\n"
    }
  },
  {
    "id": 3688,
    "surahId": 35,
    "ayahNumber": 28,
    "arabicText": "وَمِنَ ٱلنَّاسِ وَٱلدَّوَاۤبِّ وَٱلۡأَنۡعَـٰمِ مُخۡتَلِفٌ أَلۡوَ ٰ⁠نُهُۥ كَذَ ٰ⁠لِكَۗ إِنَّمَا یَخۡشَى ٱللَّهَ مِنۡ عِبَادِهِ ٱلۡعُلَمَـٰۤؤُا۟ۗ إِنَّ ٱللَّهَ عَزِیزٌ غَفُورٌ\n",
    "translations": {
      "en": "and (as) there are in men, and in crawling beasts, and in cattle, too, many hues? Of all His servants, only such as are endowed with [innate] knowledge stand [truly] in awe of God: [for they alone comprehend that,] verily, God is almighty, much-forgiving.",
      "ms": "Dan demikian pula di antara manusia dan binatang-binatang yang melata serta binatang-binatang ternak, ada yang berlainan jenis dan warnanya? Sebenarnya yang menaruh bimbang dan takut (melanggar perintah) Allah dari kalangan hamba-hambaNya hanyalah orang-orang yang berilmu. Sesungguhnya Allah Maha Kuasa, lagi Maha Pengampun.",
      "id": "Dan demikian (pula) di antara manusia, binatang-binatang melata dan binatang-binatang ternak ada yang bermacam-macam warnanya (dan jenisnya). Sesungguhnya yang takut kepada Allah di antara hamba-hamba-Nya, hanyalah ulama. Sesungguhnya Allah Maha Perkasa lagi Maha Pengampun.",
      "ar": "وَمِنَ ٱلنَّاسِ وَٱلدَّوَاۤبِّ وَٱلۡأَنۡعَـٰمِ مُخۡتَلِفٌ أَلۡوَ ٰ⁠نُهُۥ كَذَ ٰ⁠لِكَۗ إِنَّمَا یَخۡشَى ٱللَّهَ مِنۡ عِبَادِهِ ٱلۡعُلَمَـٰۤؤُا۟ۗ إِنَّ ٱللَّهَ عَزِیزٌ غَفُورٌ\n"
    }
  },
  {
    "id": 3689,
    "surahId": 35,
    "ayahNumber": 29,
    "arabicText": "إِنَّ ٱلَّذِینَ یَتۡلُونَ كِتَـٰبَ ٱللَّهِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقۡنَـٰهُمۡ سِرࣰّا وَعَلَانِیَةࣰ یَرۡجُونَ تِجَـٰرَةࣰ لَّن تَبُورَ\n",
    "translations": {
      "en": "(It is) they who [truly] follow God’s revelation, and are constant in prayer, and spend on others, secretly and openly, out of what We provide for them as sustenance - it is they who may look forward to a bargain that can never fail,",
      "ms": "Sesungguhnya orang-orang yang selalu membaca Kitab Allah dan tetap mendirikan sembahyang serta mendermakan dari apa yang Kami kurniakan kepada mereka, secara bersembunyi atau secara terbuka, mereka (dengan amalan yang demikian) mengharapkan sejenis perniagaan yang tidak akan mengalami kerugian;",
      "id": "Sesungguhnya orang-orang yang selalu membaca kitab Allah dan mendirikan shalat dan menafkahkan sebahagian dari rezeki yang Kami anugerahkan kepada mereka dengan diam-diam dan terang-terangan, mereka itu mengharapkan perniagaan yang tidak akan merugi,",
      "ar": "إِنَّ ٱلَّذِینَ یَتۡلُونَ كِتَـٰبَ ٱللَّهِ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقۡنَـٰهُمۡ سِرࣰّا وَعَلَانِیَةࣰ یَرۡجُونَ تِجَـٰرَةࣰ لَّن تَبُورَ\n"
    }
  },
  {
    "id": 3690,
    "surahId": 35,
    "ayahNumber": 30,
    "arabicText": "لِیُوَفِّیَهُمۡ أُجُورَهُمۡ وَیَزِیدَهُم مِّن فَضۡلِهِۦۤۚ إِنَّهُۥ غَفُورࣱ شَكُورࣱ\n",
    "translations": {
      "en": "since He will grant them their just rewards, and give them yet more out of His bounty: for, verily, He is much-forgiving, ever-responsive to gratitude.",
      "ms": "Supaya Allah menyempurnakan pahala mereka dan menambahi mereka dari limpah kurniaNya. Sesungguhnya Allah Maha Pengampun, lagi sentiasa membalas dengan sebaik-baiknya (akan orang-orang yang bersyukur kepadaNya).",
      "id": "agar Allah menyempurnakan kepada mereka pahala mereka dan menambah kepada mereka dari karunia-Nya. Sesungguhnya Allah Maha Pengampun lagi Maha Mensyukuri.",
      "ar": "لِیُوَفِّیَهُمۡ أُجُورَهُمۡ وَیَزِیدَهُم مِّن فَضۡلِهِۦۤۚ إِنَّهُۥ غَفُورࣱ شَكُورࣱ\n"
    }
  },
  {
    "id": 3691,
    "surahId": 35,
    "ayahNumber": 31,
    "arabicText": "وَٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ مِنَ ٱلۡكِتَـٰبِ هُوَ ٱلۡحَقُّ مُصَدِّقࣰا لِّمَا بَیۡنَ یَدَیۡهِۗ إِنَّ ٱللَّهَ بِعِبَادِهِۦ لَخَبِیرُۢ بَصِیرࣱ\n",
    "translations": {
      "en": "And [know that] all of the divine writ with which We have inspired thee is the very truth, confirming the truth of whatever there still remains of earlier revelations for, behold, of [the needs of] His servants God is fully aware, all-seeing.",
      "ms": "Dan Al-Quran yang Kami wahyukan kepadamu (wahai Muhammad) ialah yang benar (segala-galanya) yang tetap mengesahkan Kitab-kitab yang diturunkan sebelumnya. Sesungguhnya Allah Maha Mengetahui dengan sedalam-dalamnya akan keadaan sekalian hambaNya, lagi Maha Melihat dan memerhatikan.",
      "id": "Dan apa yang telah Kami wahyukan kepadamu yaitu Al Kitab (Al Quran) itulah yang benar, dengan membenarkan kitab-kitab yang sebelumnya. Sesungguhnya Allah benar-benar Maha Mengetahui lagi Maha Melihat (keadaan) hamba-hamba-Nya.",
      "ar": "وَٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ مِنَ ٱلۡكِتَـٰبِ هُوَ ٱلۡحَقُّ مُصَدِّقࣰا لِّمَا بَیۡنَ یَدَیۡهِۗ إِنَّ ٱللَّهَ بِعِبَادِهِۦ لَخَبِیرُۢ بَصِیرࣱ\n"
    }
  },
  {
    "id": 3692,
    "surahId": 35,
    "ayahNumber": 32,
    "arabicText": "ثُمَّ أَوۡرَثۡنَا ٱلۡكِتَـٰبَ ٱلَّذِینَ ٱصۡطَفَیۡنَا مِنۡ عِبَادِنَاۖ فَمِنۡهُمۡ ظَالِمࣱ لِّنَفۡسِهِۦ وَمِنۡهُم مُّقۡتَصِدࣱ وَمِنۡهُمۡ سَابِقُۢ بِٱلۡخَیۡرَ ٰ⁠تِ بِإِذۡنِ ٱللَّهِۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡفَضۡلُ ٱلۡكَبِیرُ\n",
    "translations": {
      "en": "And so, We have bestowed this divine writ as a heritage unto such of Our servants as We chose: and among them are some who sin against themselves; and some who keep half-way [between right and wrong]; and some who, by God’s leave, are fore­most in deeds of goodness: [and] this, indeed, is a merit most high!",
      "ms": "Kemudian Kami jadikan Al-Quran itu diwarisi oleh orang-orang yang Kami pilih dari kalangan hamba-hamba Kami; maka di antara mereka ada yang berlaku zalim kepada dirinya sendiri (dengan tidak mengindahkan ajaran Al-Quran), dan di antaranya ada yang bersikap sederhana, dan di antaranya pula ada yang mendahului (orang lain) dalam berbuat kebaikan dengan izin Allah. Yang demikian itu ialah limpah kurnia yang besar (dari Allah semata-mata).",
      "id": "Kemudian Kitab itu Kami wariskan kepada orang-orang yang Kami pilih di antara hamba-hamba Kami, lalu di antara mereka ada yang menganiaya diri mereka sendiri dan di antara mereka ada yang pertengahan dan diantara mereka ada (pula) yang lebih dahulu berbuat kebaikan dengan izin Allah. Yang demikian itu adalah karunia yang amat besar.",
      "ar": "ثُمَّ أَوۡرَثۡنَا ٱلۡكِتَـٰبَ ٱلَّذِینَ ٱصۡطَفَیۡنَا مِنۡ عِبَادِنَاۖ فَمِنۡهُمۡ ظَالِمࣱ لِّنَفۡسِهِۦ وَمِنۡهُم مُّقۡتَصِدࣱ وَمِنۡهُمۡ سَابِقُۢ بِٱلۡخَیۡرَ ٰ⁠تِ بِإِذۡنِ ٱللَّهِۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡفَضۡلُ ٱلۡكَبِیرُ\n"
    }
  },
  {
    "id": 3693,
    "surahId": 35,
    "ayahNumber": 33,
    "arabicText": "جَنَّـٰتُ عَدۡنࣲ یَدۡخُلُونَهَا یُحَلَّوۡنَ فِیهَا مِنۡ أَسَاوِرَ مِن ذَهَبࣲ وَلُؤۡلُؤࣰاۖ وَلِبَاسُهُمۡ فِیهَا حَرِیرࣱ\n",
    "translations": {
      "en": "[Hence,] gardens of perpetual bliss will they enter, therein to be adorned with bracelets of gold and pearls, and therein to be clad in raiments of silk;",
      "ms": "(Balasan mereka ialah) Syurga - syurga \" Adn \", yang mereka akan masukinya; mereka dihiaskan di dalamnya dengan gelang-gelang tangan dari emas dan mutiara; dan pakaian mereka di situ adalah dari sutera.",
      "id": "(Bagi mereka) surga 'Adn mereka masuk ke dalamnya, di dalamnya mereka diberi perhiasan dengan gelang-gelang dari emas, dan dengan mutiara, dan pakaian mereka didalamnya adalah sutera.",
      "ar": "جَنَّـٰتُ عَدۡنࣲ یَدۡخُلُونَهَا یُحَلَّوۡنَ فِیهَا مِنۡ أَسَاوِرَ مِن ذَهَبࣲ وَلُؤۡلُؤࣰاۖ وَلِبَاسُهُمۡ فِیهَا حَرِیرࣱ\n"
    }
  },
  {
    "id": 3694,
    "surahId": 35,
    "ayahNumber": 34,
    "arabicText": "وَقَالُوا۟ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِیۤ أَذۡهَبَ عَنَّا ٱلۡحَزَنَۖ إِنَّ رَبَّنَا لَغَفُورࣱ شَكُورٌ\n",
    "translations": {
      "en": "and they will say: “All praise is due to God, who has caused all sorrow to leave us: for, verily, our Sustainer is indeed much-forgiving, ever-responsive to gratitude –",
      "ms": "Dan (sebagai bersyukur) berkatalah mereka: \"Segala puji tertentu bagi Allah, yang telah menghapuskan perasaan dukacita dari kami; Sesungguhnya Tuhan kami Maha Pengampun, lagi sentiasa memberi balasan yang sebaik-baiknya (kepada orang-orang yang taat);",
      "id": "Dan mereka berkata: \"Segala puji bagi Allah yang telah menghilangkan duka cita dari kami. Sesungguhnya Tuhan kami benar-benar Maha Pengampum lagi Maha Mensyukuri.",
      "ar": "وَقَالُوا۟ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِیۤ أَذۡهَبَ عَنَّا ٱلۡحَزَنَۖ إِنَّ رَبَّنَا لَغَفُورࣱ شَكُورٌ\n"
    }
  },
  {
    "id": 3695,
    "surahId": 35,
    "ayahNumber": 35,
    "arabicText": "ٱلَّذِیۤ أَحَلَّنَا دَارَ ٱلۡمُقَامَةِ مِن فَضۡلِهِۦ لَا یَمَسُّنَا فِیهَا نَصَبࣱ وَلَا یَمَسُّنَا فِیهَا لُغُوبࣱ\n",
    "translations": {
      "en": "He who, out of His bounty, has made us alight in this abode of life enduring, wherein no struggle can assail us, and wherein no weariness can touch us!”",
      "ms": "Tuhan yang telah menempatkan kami di tempat tinggal yang kekal, dengan limpah kurniaNya semata-mata. Kami tidak akan merasa penat lelah di situ, dan Kami juga di situ tidak akan merasa letih lesu\".",
      "id": "Yang menempatkan kami dalam tempat yang kekal (surga) dari karunia-Nya; didalamnya kami tiada merasa lelah dan tiada pula merasa lesu\".",
      "ar": "ٱلَّذِیۤ أَحَلَّنَا دَارَ ٱلۡمُقَامَةِ مِن فَضۡلِهِۦ لَا یَمَسُّنَا فِیهَا نَصَبࣱ وَلَا یَمَسُّنَا فِیهَا لُغُوبࣱ\n"
    }
  },
  {
    "id": 3696,
    "surahId": 35,
    "ayahNumber": 36,
    "arabicText": "وَٱلَّذِینَ كَفَرُوا۟ لَهُمۡ نَارُ جَهَنَّمَ لَا یُقۡضَىٰ عَلَیۡهِمۡ فَیَمُوتُوا۟ وَلَا یُخَفَّفُ عَنۡهُم مِّنۡ عَذَابِهَاۚ كَذَ ٰ⁠لِكَ نَجۡزِی كُلَّ كَفُورࣲ\n",
    "translations": {
      "en": "But as for those who are bent on denying the truth - the fire of hell awaits them: no end shall be put to their lives so that they could die, nor shall aught of the suffering caused by that [fire] be lightened for them: thus shall We requite all who are bereft of gratitude.",
      "ms": "Dan orang-orang yang kafir, bagi mereka neraka Jahannam; mereka tidak dijatuhkan hukuman bunuh supaya mereka mati (dan terlepas dari seksa), dan tidak pula diringankan azab neraka itu dari mereka; dan demikianlah Kami membalas tiap-tiap orang yang melampau kufurnya.",
      "id": "Dan orang-orang kafir bagi mereka neraka Jahannam. Mereka tidak dibinasakan sehingga mereka mati dan tidak (pula) diringankan dari mereka azabnya. Demikianlah Kami membalas setiap orang yang sangat kafir.",
      "ar": "وَٱلَّذِینَ كَفَرُوا۟ لَهُمۡ نَارُ جَهَنَّمَ لَا یُقۡضَىٰ عَلَیۡهِمۡ فَیَمُوتُوا۟ وَلَا یُخَفَّفُ عَنۡهُم مِّنۡ عَذَابِهَاۚ كَذَ ٰ⁠لِكَ نَجۡزِی كُلَّ كَفُورࣲ\n"
    }
  },
  {
    "id": 3697,
    "surahId": 35,
    "ayahNumber": 37,
    "arabicText": "وَهُمۡ یَصۡطَرِخُونَ فِیهَا رَبَّنَاۤ أَخۡرِجۡنَا نَعۡمَلۡ صَـٰلِحًا غَیۡرَ ٱلَّذِی كُنَّا نَعۡمَلُۚ أَوَلَمۡ نُعَمِّرۡكُم مَّا یَتَذَكَّرُ فِیهِ مَن تَذَكَّرَ وَجَاۤءَكُمُ ٱلنَّذِیرُۖ فَذُوقُوا۟ فَمَا لِلظَّـٰلِمِینَ مِن نَّصِیرٍ\n",
    "translations": {
      "en": "And in that [hell] they will cry aloud: “O our Sustainer! Cause us to come out [of this suffering]! We shall [henceforth] do good deeds, not such as we were wont to do [aforetime]!” [But We shall answer:] “Did We not grant you a life long enough so that whoever was willing to take thought could bethink himself? And [withal,] a war­ner had come unto you! Taste, then, [the fruit of your evil deeds]: for evildoers shall have none to succour them!”",
      "ms": "Dan mereka menjerit-jerit di dalam neraka itu (sambil merayu): \"Wahai Tuhan kami, keluarkanlah kami (dari azab ini); kami akan mengerjakan amal-amal yang soleh, yang lain dari apa yang kami pernah kerjakan. (lalu Allah menempelak mereka): \"Bukankah Kami telah melanjutkan umur kamu dan memberikan masa yang cukup untuk berfikir dan beringat padanya oleh sesiapa yang suka berfikir dan beringat? Dan kamu pula telah didatangi oleh Rasul (Kami) yang memberi amaran oleh itu, rasalah (azab seksa), kerana orang-orang yang zalim tidak akan beroleh sesiapapun yang dapat memberikan pertolongan\".",
      "id": "Dan mereka berteriak di dalam neraka itu: \"Ya Tuhan kami, keluarkanlah kami niscaya kami akan mengerjakan amal yang saleh berlainan dengan yang telah kami kerjakan\". Dan apakah Kami tidak memanjangkan umurmu dalam masa yang cukup untuk berfikir bagi orang yang mau berfikir, dan (apakah tidak) datang kepada kamu pemberi peringatan? maka rasakanlah (azab Kami) dan tidak ada bagi orang-orang yang zalim seorang penolongpun.",
      "ar": "وَهُمۡ یَصۡطَرِخُونَ فِیهَا رَبَّنَاۤ أَخۡرِجۡنَا نَعۡمَلۡ صَـٰلِحًا غَیۡرَ ٱلَّذِی كُنَّا نَعۡمَلُۚ أَوَلَمۡ نُعَمِّرۡكُم مَّا یَتَذَكَّرُ فِیهِ مَن تَذَكَّرَ وَجَاۤءَكُمُ ٱلنَّذِیرُۖ فَذُوقُوا۟ فَمَا لِلظَّـٰلِمِینَ مِن نَّصِیرٍ\n"
    }
  },
  {
    "id": 3698,
    "surahId": 35,
    "ayahNumber": 38,
    "arabicText": "إِنَّ ٱللَّهَ عَـٰلِمُ غَیۡبِ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ إِنَّهُۥ عَلِیمُۢ بِذَاتِ ٱلصُّدُورِ\n",
    "translations": {
      "en": "Verily, God knows the hidden reality of the heavens and the earth: [and,] behold, He has full knowledge of what is in the hearts [of men].",
      "ms": "Sesungguhnya Allah mengetahui segala rahsia di langit dan di bumi; sesungguhnya Ia mengetahui akan segala (isi hati) yang terkandung di dalam dada.",
      "id": "Sesungguhnya Allah mengetahui yang tersembunyi di langit dan di bumi. Sesungguhnya Dia Maha Mengetahui segala isi hati.",
      "ar": "إِنَّ ٱللَّهَ عَـٰلِمُ غَیۡبِ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ إِنَّهُۥ عَلِیمُۢ بِذَاتِ ٱلصُّدُورِ\n"
    }
  },
  {
    "id": 3699,
    "surahId": 35,
    "ayahNumber": 39,
    "arabicText": "هُوَ ٱلَّذِی جَعَلَكُمۡ خَلَـٰۤىِٕفَ فِی ٱلۡأَرۡضِۚ فَمَن كَفَرَ فَعَلَیۡهِ كُفۡرُهُۥۖ وَلَا یَزِیدُ ٱلۡكَـٰفِرِینَ كُفۡرُهُمۡ عِندَ رَبِّهِمۡ إِلَّا مَقۡتࣰاۖ وَلَا یَزِیدُ ٱلۡكَـٰفِرِینَ كُفۡرُهُمۡ إِلَّا خَسَارࣰا\n",
    "translations": {
      "en": "He it is who has made you inherit the earth. Hence, he who is bent on denying the truth [of God’s oneness and uniqueness ought to know that] this denial of his will fall back upon him: for their [per­sistent] denial of this truth does but add to the deniers’ loathsomeness in their Sustainer’s sight and, thus, their denial of this truth does but add to the deniers’ loss.",
      "ms": "Dia lah yang menjadikan kamu orang-orang yang berkuasa di muka bumi silih berganti; oleh itu sesiapa yang kufur ingkar maka balasan kufurnya itu akan menimpa dirinya sendiri; dan orang-orang yang kafir, kufurnya tidak menambahkan mereka di sisi Tuhan mereka melainkan kemurkaan dan kehinaan; dan juga orang-orang yang kafir itu, kufurnya tidak menambahkan mereka melainkan kerugian jua.",
      "id": "Dialah yang menjadikan kamu khalifah-khalifah di muka bumi. Barangsiapa yang kafir, maka (akibat) kekafirannya menimpa dirinya sendiri. Dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kemurkaan pada sisi Tuhannya dan kekafiran orang-orang yang kafir itu tidak lain hanyalah akan menambah kerugian mereka belaka.",
      "ar": "هُوَ ٱلَّذِی جَعَلَكُمۡ خَلَـٰۤىِٕفَ فِی ٱلۡأَرۡضِۚ فَمَن كَفَرَ فَعَلَیۡهِ كُفۡرُهُۥۖ وَلَا یَزِیدُ ٱلۡكَـٰفِرِینَ كُفۡرُهُمۡ عِندَ رَبِّهِمۡ إِلَّا مَقۡتࣰاۖ وَلَا یَزِیدُ ٱلۡكَـٰفِرِینَ كُفۡرُهُمۡ إِلَّا خَسَارࣰا\n"
    }
  },
  {
    "id": 3700,
    "surahId": 35,
    "ayahNumber": 40,
    "arabicText": "قُلۡ أَرَءَیۡتُمۡ شُرَكَاۤءَكُمُ ٱلَّذِینَ تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِی مَاذَا خَلَقُوا۟ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكࣱ فِی ٱلسَّمَـٰوَ ٰ⁠تِ أَمۡ ءَاتَیۡنَـٰهُمۡ كِتَـٰبࣰا فَهُمۡ عَلَىٰ بَیِّنَتࣲ مِّنۡهُۚ بَلۡ إِن یَعِدُ ٱلظَّـٰلِمُونَ بَعۡضُهُم بَعۡضًا إِلَّا غُرُورًا\n",
    "translations": {
      "en": "Say: “Have you ever [really] considered those beings and forces to whom you ascribe a share in God’s divinity, [and] whom you invoke beside God? Show me what it is that they have created on earth - or do [you claim that] they have a share in [govern­ing] the heavens?” Have We ever vouchsafed them a divine writ on which they could rely as evidence [in support of their views]? Nay, [the hope which] the evildoers hold out to one another [is] nothing but a delusion.",
      "ms": "Katakanlah (wahai Muhammad): \"Sudahkah kamu mengetahui kekuasaan dan kelayakan makhluk-makhluk yang kamu jadikan sekutu-sekutu, yang kamu seru dan sembah selain Allah? Tunjukkanlah kepadaku apa yang mereka telah ciptakan dari bahagian bumi ini?. Atau adakah mereka mempunyai sebarang perkongsian (dengan Allah) dalam mencipta dan menguruskan langit? Atau pernahkah Kami memberi mereka sebuah Kitab (mengakui mereka menjadi kongsi Kami), maka (dengan itu menjadilah) perkongsian mereka berdasarkan keterangan yang terdapat dari Kitab itu? \"(Tidak ada sesuatu alasan pun) bahkan orang-orang yang zalim itu, terpedaya dengan kata-kata yang disebutkan oleh setengahnya kepada yang lain, kata-kata yang hanya menjanjikan perkara yang tidak benar.",
      "id": "Katakanlah: \"Terangkanlah kepada-Ku tentang sekutu-sekutumu yang kamu seru selain Allah. Perlihatkanlah kepada-Ku (bahagian) manakah dari bumi ini yang telah mereka ciptakan ataukah mereka mempunyai saham dalam (penciptaan) langit atau adakah Kami memberi kepada mereka sebuah Kitab sehingga mereka mendapat keterangan-keterangan yang jelas daripadanya? Sebenarnya orang-orang yang zalim itu sebahagian dari mereka tidak menjanjikan kepada sebahagian yang lain, melainkan tipuan belaka\".",
      "ar": "قُلۡ أَرَءَیۡتُمۡ شُرَكَاۤءَكُمُ ٱلَّذِینَ تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِی مَاذَا خَلَقُوا۟ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكࣱ فِی ٱلسَّمَـٰوَ ٰ⁠تِ أَمۡ ءَاتَیۡنَـٰهُمۡ كِتَـٰبࣰا فَهُمۡ عَلَىٰ بَیِّنَتࣲ مِّنۡهُۚ بَلۡ إِن یَعِدُ ٱلظَّـٰلِمُونَ بَعۡضُهُم بَعۡضًا إِلَّا غُرُورًا\n"
    }
  },
  {
    "id": 3701,
    "surahId": 35,
    "ayahNumber": 41,
    "arabicText": "۞ إِنَّ ٱللَّهَ یُمۡسِكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ أَن تَزُولَاۚ وَلَىِٕن زَالَتَاۤ إِنۡ أَمۡسَكَهُمَا مِنۡ أَحَدࣲ مِّنۢ بَعۡدِهِۦۤۚ إِنَّهُۥ كَانَ حَلِیمًا غَفُورࣰا\n",
    "translations": {
      "en": "Verily, it is God [alone] who upholds the celestial bodies and the earth, lest they deviate [from their orbits] - for if they should ever deviate, there is none that could uphold them after He will have ceased to do so. [But,] verily, He is ever-forbearing, much-for­giving!",
      "ms": "Sesungguhnya Allah menahan dan memelihara langit dan bumi supaya tidak berganjak dari peraturan dan keadaan yang ditetapkan baginya; dan jika keduanya (ditakdirkan) berganjak maka tidak ada sesiapapun yang dapat menahannya daripada berlaku demikian selain dari Allah. Sesungguhnya Ia Maha Penyabar, lagi Maha Pengampun.",
      "id": "Sesungguhnya Allah menahan langit dan bumi supaya jangan lenyap; dan sungguh jika keduanya akan lenyap tidak ada seorangpun yang dapat menahan keduanya selain Allah. Sesungguhnya Dia adalah Maha Penyantun lagi Maha Pengampun.",
      "ar": "۞ إِنَّ ٱللَّهَ یُمۡسِكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ أَن تَزُولَاۚ وَلَىِٕن زَالَتَاۤ إِنۡ أَمۡسَكَهُمَا مِنۡ أَحَدࣲ مِّنۢ بَعۡدِهِۦۤۚ إِنَّهُۥ كَانَ حَلِیمًا غَفُورࣰا\n"
    }
  },
  {
    "id": 3702,
    "surahId": 35,
    "ayahNumber": 42,
    "arabicText": "وَأَقۡسَمُوا۟ بِٱللَّهِ جَهۡدَ أَیۡمَـٰنِهِمۡ لَىِٕن جَاۤءَهُمۡ نَذِیرࣱ لَّیَكُونُنَّ أَهۡدَىٰ مِنۡ إِحۡدَى ٱلۡأُمَمِۖ فَلَمَّا جَاۤءَهُمۡ نَذِیرࣱ مَّا زَادَهُمۡ إِلَّا نُفُورًا\n",
    "translations": {
      "en": "As it is, they [who are averse to the truth often] swear by God with their most solemn oaths that if a warner should ever come to them, they would follow his guidance better than any of the communities [of old had followed the warner sent to them]: but now that a warner has come unto them, [his call] but increases their aversion,",
      "ms": "Dan mereka bersumpah dengan nama Allah dengan sebebar-benar sumpahnya: demi sesungguhnya jika datang kepada mereka seorang Rasul pemberi ingatan dan amaran, sudah tentu mereka akan menjadi orang-orang yang lebih betul jalan ugamanya dari sebarang umat yang lain. Setelah datang kepada mereka seorang Rasul pemberi ingatan dan amaran, (maka kedatangannya itu) hanya menyebabkan mereka bertambah liar dari kebenaran,",
      "id": "Dan mereka bersumpah dengan nama Allah dengan sekuat-kuat sumpah; sesungguhnya jika datang kepada mereka seorang pemberi peringatan, niscaya mereka akan lebih mendapat petunjuk dari salah satu umat-umat (yang lain). Tatkala datang kepada mereka pemberi peringatan, maka kedatangannya itu tidak menambah kepada mereka, kecuali jauhnya mereka dari (kebenaran),",
      "ar": "وَأَقۡسَمُوا۟ بِٱللَّهِ جَهۡدَ أَیۡمَـٰنِهِمۡ لَىِٕن جَاۤءَهُمۡ نَذِیرࣱ لَّیَكُونُنَّ أَهۡدَىٰ مِنۡ إِحۡدَى ٱلۡأُمَمِۖ فَلَمَّا جَاۤءَهُمۡ نَذِیرࣱ مَّا زَادَهُمۡ إِلَّا نُفُورًا\n"
    }
  },
  {
    "id": 3703,
    "surahId": 35,
    "ayahNumber": 43,
    "arabicText": "ٱسۡتِكۡبَارࣰا فِی ٱلۡأَرۡضِ وَمَكۡرَ ٱلسَّیِّىِٕۚ وَلَا یَحِیقُ ٱلۡمَكۡرُ ٱلسَّیِّئُ إِلَّا بِأَهۡلِهِۦۚ فَهَلۡ یَنظُرُونَ إِلَّا سُنَّتَ ٱلۡأَوَّلِینَۚ فَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَبۡدِیلࣰاۖ وَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَحۡوِیلًا\n",
    "translations": {
      "en": "their arro­gant behaviour on earth, and their devising of evil [arguments against God’s messages]. Yet [in the end,] such evil scheming will engulf none but its authors: and can they expect anything but [to be made to go] the way of those [sinners] of olden times? Thus [it is]: no change wilt thou ever find in God’s way; yea, no deviation wilt thou ever find in God’s way!",
      "ms": "Sambil bersikap sombong takbur di muka bumi dan berusaha merancangkan rancangan-rancangan jahat (terhadap Rasul itu), sedang rancangan yang jahat itu tidak menimpa melainkan orang yang menjalankannya. (Dengan keadaan yang demikian, maka) tidak ada yang mereka tunggu selain daripada berlakunya kebinasaan menimpa mereka (sebagaimana yang telah menimpa) orang-orang kafir yang telah lalu. Kerana engkau tidak sekali-kali akan mendapati sebarang perubahan bagi \" Sunnatullah \" (undang-undang peraturan Allah), dan engkau tidak sekali-kali akan mendapati sebarang penukaran bagi perjalanan \" Sunnatullah \" itu.",
      "id": "karena kesombongan (mereka) di muka bumi dan karena rencana (mereka) yang jahat. Rencana yang jahat itu tidak akan menimpa selain orang yang merencanakannya sendiri. Tiadalah yang mereka nanti-nantikan melainkan (berlakunya) sunnah (Allah yang telah berlaku) kepada orang-orang yang terdahulu. Maka sekali-kali kamu tidak akan mendapat penggantian bagi sunnah Allah, dan sekali-kali tidak (pula) akan menemui penyimpangan bagi sunnah Allah itu.",
      "ar": "ٱسۡتِكۡبَارࣰا فِی ٱلۡأَرۡضِ وَمَكۡرَ ٱلسَّیِّىِٕۚ وَلَا یَحِیقُ ٱلۡمَكۡرُ ٱلسَّیِّئُ إِلَّا بِأَهۡلِهِۦۚ فَهَلۡ یَنظُرُونَ إِلَّا سُنَّتَ ٱلۡأَوَّلِینَۚ فَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَبۡدِیلࣰاۖ وَلَن تَجِدَ لِسُنَّتِ ٱللَّهِ تَحۡوِیلًا\n"
    }
  },
  {
    "id": 3704,
    "surahId": 35,
    "ayahNumber": 44,
    "arabicText": "أَوَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَیَنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلَّذِینَ مِن قَبۡلِهِمۡ وَكَانُوۤا۟ أَشَدَّ مِنۡهُمۡ قُوَّةࣰۚ وَمَا كَانَ ٱللَّهُ لِیُعۡجِزَهُۥ مِن شَیۡءࣲ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَلَا فِی ٱلۡأَرۡضِۚ إِنَّهُۥ كَانَ عَلِیمࣰا قَدِیرࣰا\n",
    "translations": {
      "en": "Have they never journeyed about the earth and beheld what happened in the end to those [deniers of the truth] who lived before their time and were [so much] greater than they in power? And [do they not see that the will of] God can never be foiled by anything whatever in the heavens or on earth, since, verily, He is all-knowing, infinite in His power?",
      "ms": "(Dan sebagai buktinya): tidakkah orang-orang (yang tidak mahu beriman) itu telah mengembara di muka bumi, lalu mereka menyaksikan bagaimana kesudahan orang-orang kafir yang terdahulu dari mereka, sedang orang-orang itu lebih kekuatannya dari mereka? Dan (sudah tetap) bahawa kekuasaan Allah tidak dapat dilemahkan atau dihalangi oleh sesuatupun sama ada di langit atau di bumi; sesungguhnya Ia adalah Maha Mengetahui, lagi Maha Kuasa.",
      "id": "Dan apakah mereka tidak berjalan di muka bumi, lalu melihat bagaimana kesudahan orang-orang yang sebelum mereka, sedangkan orang-orang itu adalah lebih besar kekuatannya dari mereka? Dan tiada sesuatupun yang dapat melemahkan Allah baik di langit maupun di bumi. Sesungguhnya Allah Maha Mengetahui lagi Maha Kuasa.",
      "ar": "أَوَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَیَنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلَّذِینَ مِن قَبۡلِهِمۡ وَكَانُوۤا۟ أَشَدَّ مِنۡهُمۡ قُوَّةࣰۚ وَمَا كَانَ ٱللَّهُ لِیُعۡجِزَهُۥ مِن شَیۡءࣲ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَلَا فِی ٱلۡأَرۡضِۚ إِنَّهُۥ كَانَ عَلِیمࣰا قَدِیرࣰا\n"
    }
  },
  {
    "id": 3705,
    "surahId": 35,
    "ayahNumber": 45,
    "arabicText": "وَلَوۡ یُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِمَا كَسَبُوا۟ مَا تَرَكَ عَلَىٰ ظَهۡرِهَا مِن دَاۤبَّةࣲ وَلَـٰكِن یُؤَخِّرُهُمۡ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّىۖ فَإِذَا جَاۤءَ أَجَلُهُمۡ فَإِنَّ ٱللَّهَ كَانَ بِعِبَادِهِۦ بَصِیرَۢا\n",
    "translations": {
      "en": "Now if God were to take men [at once] to task for whatever [wrong] they commit [on earth], He would not leave a single living creature upon its surface. However, He grants them respite for a term set [by Him]: but when their term comes to an end - then, verily, [they come to know that] God sees all that is in [the hearts of] His servants.",
      "ms": "Dan kalaulah Allah mengirakan kesalahan manusia serta terus menyeksa mereka disebabkan amal-amal jahat yang mereka telah kerjakan, tentulah la tidak membiarkan tinggal di muka bumi sesuatu makhluk yang bergerak; akan tetapi (dia tidak bertindak dengan serta merta, bahkan) Ia memberi tempoh kepada mereka hingga ke suatu masa yang tertentu; kemudian apabila sampai tempoh mereka (maka Allah akan membalas masing-masing dengan adilnya), kerana sesungguhnya Allah sentiasa Melihat keadaan hamba-hambaNya.",
      "id": "Dan kalau sekiranya Allah menyiksa manusia disebabkan usahanya, niscaya Dia tidak akan meninggalkan di atas permukaan bumi suatu mahluk yang melatapun akan tetapi Allah menangguhkan (penyiksaan) mereka, sampai waktu yang tertentu; maka apabila datang ajal mereka, maka sesungguhnya Allah adalah Maha Melihat (keadaan) hamba-hamba-Nya.",
      "ar": "وَلَوۡ یُؤَاخِذُ ٱللَّهُ ٱلنَّاسَ بِمَا كَسَبُوا۟ مَا تَرَكَ عَلَىٰ ظَهۡرِهَا مِن دَاۤبَّةࣲ وَلَـٰكِن یُؤَخِّرُهُمۡ إِلَىٰۤ أَجَلࣲ مُّسَمࣰّىۖ فَإِذَا جَاۤءَ أَجَلُهُمۡ فَإِنَّ ٱللَّهَ كَانَ بِعِبَادِهِۦ بَصِیرَۢا\n"
    }
  }
]