[
  {
    "id": 2141,
    "surahId": 18,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِیۤ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَـٰبَ وَلَمۡ یَجۡعَل لَّهُۥ عِوَجَاۜ\n",
    "translations": {
      "en": "ALL PRAISE is due to God, who has bestowed. this divine writ from on high upon His servant, and has not allowed any deviousness to obscure its meaning:",
      "ms": "Segala puji terentu bagi Allah yang telah menurunkan kepada hambaNya (Muhammad), Kitab suci Al-Quran, dan tidak menjadikan padanya sesuatu yang bengkok (terpesong):",
      "id": "Segala puji bagi Allah yang telah menurunkan kepada hamba-Nya Al Kitab (Al-Quran) dan Dia tidak mengadakan kebengkokan di dalamnya;",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِیۤ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَـٰبَ وَلَمۡ یَجۡعَل لَّهُۥ عِوَجَاۜ\n"
    }
  },
  {
    "id": 2142,
    "surahId": 18,
    "ayahNumber": 2,
    "arabicText": "قَیِّمࣰا لِّیُنذِرَ بَأۡسࣰا شَدِیدࣰا مِّن لَّدُنۡهُ وَیُبَشِّرَ ٱلۡمُؤۡمِنِینَ ٱلَّذِینَ یَعۡمَلُونَ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمۡ أَجۡرًا حَسَنࣰا\n",
    "translations": {
      "en": "[a divine writ] unerringly straight, meant to warn [the godless] of a severe punishment from Him, and to give unto the believers who do good works the glad tiding that theirs shall be a goodly reward-",
      "ms": "(Bahkan keadaannya) tetap benar lagi menjadi pengawas turunnya Al-Quran untuk memberi amaran (kepada orang-orang yang ingkar) dengan azab yang seberat-beratnya dari sisi Allah, dan memberi berita gembira kepada orang-orang yang beriman yang mengerjakan amal-amal soleh, bahawa mereka akan beroleh balasan yang baik.",
      "id": "sebagai bimbingan yang lurus, untuk memperingatkan siksaan yang sangat pedih dari sisi Allah dan memberi berita gembira kepada orang-orang yang beriman, yang mengerjakan amal saleh, bahwa mereka akan mendapat pembalasan yang baik,",
      "ar": "قَیِّمࣰا لِّیُنذِرَ بَأۡسࣰا شَدِیدࣰا مِّن لَّدُنۡهُ وَیُبَشِّرَ ٱلۡمُؤۡمِنِینَ ٱلَّذِینَ یَعۡمَلُونَ ٱلصَّـٰلِحَـٰتِ أَنَّ لَهُمۡ أَجۡرًا حَسَنࣰا\n"
    }
  },
  {
    "id": 2143,
    "surahId": 18,
    "ayahNumber": 3,
    "arabicText": "مَّـٰكِثِینَ فِیهِ أَبَدࣰا\n",
    "translations": {
      "en": "[a state of bliss] in which they. shall dwell beyond the count of time.",
      "ms": "Mereka tinggal tetap dalam (balasan yang baik) itu selama-lamanya.",
      "id": "mereka kekal di dalamnya untuk selama-lamanya.",
      "ar": "مَّـٰكِثِینَ فِیهِ أَبَدࣰا\n"
    }
  },
  {
    "id": 2144,
    "surahId": 18,
    "ayahNumber": 4,
    "arabicText": "وَیُنذِرَ ٱلَّذِینَ قَالُوا۟ ٱتَّخَذَ ٱللَّهُ وَلَدࣰا\n",
    "translations": {
      "en": "Furthermore, [this divine writ is meant] to warn all those who assert, \"God has taken unto Himself a son.\"",
      "ms": "Dan juga Al-Quran itu memberi amaran kepada orang-orang yang berkata:\" Allah mempunyai anak\".",
      "id": "Dan untuk memperingatkan kepada orang-orang yang berkata: \"Allah mengambil seorang anak\".",
      "ar": "وَیُنذِرَ ٱلَّذِینَ قَالُوا۟ ٱتَّخَذَ ٱللَّهُ وَلَدࣰا\n"
    }
  },
  {
    "id": 2145,
    "surahId": 18,
    "ayahNumber": 5,
    "arabicText": "مَّا لَهُم بِهِۦ مِنۡ عِلۡمࣲ وَلَا لِـَٔابَاۤىِٕهِمۡۚ كَبُرَتۡ كَلِمَةࣰ تَخۡرُجُ مِنۡ أَفۡوَ ٰ⁠هِهِمۡۚ إِن یَقُولُونَ إِلَّا كَذِبࣰا\n",
    "translations": {
      "en": "No knowledge whatever have they of Him, and neither had their forefathers: dreadful -is this saying that comes out of their mouths, [and] nothing but falsehood do they utter!",
      "ms": "(Sebenarnya) mereka tiada mempunyai sebarang pengetahuan mengenainya, dan tiada juga bagi datuk nenek mereka; besar sungguh perkataan syirik yang keluar dari mulut mereka; mereka hanya mengatakan perkara yang dusta.",
      "id": "Mereka sekali-kali tidak mempunyai pengetahuan tentang hal itu, begitu pula nenek moyang mereka. Alangkah buruknya kata-kata yang keluar dari mulut mereka; mereka tidak mengatakan (sesuatu) kecuali dusta.",
      "ar": "مَّا لَهُم بِهِۦ مِنۡ عِلۡمࣲ وَلَا لِـَٔابَاۤىِٕهِمۡۚ كَبُرَتۡ كَلِمَةࣰ تَخۡرُجُ مِنۡ أَفۡوَ ٰ⁠هِهِمۡۚ إِن یَقُولُونَ إِلَّا كَذِبࣰا\n"
    }
  },
  {
    "id": 2146,
    "surahId": 18,
    "ayahNumber": 6,
    "arabicText": "فَلَعَلَّكَ بَـٰخِعࣱ نَّفۡسَكَ عَلَىٰۤ ءَاثَـٰرِهِمۡ إِن لَّمۡ یُؤۡمِنُوا۟ بِهَـٰذَا ٱلۡحَدِیثِ أَسَفًا\n",
    "translations": {
      "en": "But wouldst thou, perhaps, torment thyself to death with grief over them if they are not willing to believe in this message?",
      "ms": "Maka jangan-jangan pula engkau (wahai Muhammad), membinasakan dirimu disebabkan menanggung dukacita terhadap kesan-kesan perbuatan buruk mereka, jika mereka enggan beriman kepada keterangan Al-Quran ini.",
      "id": "Maka (apakah) barangkali kamu akan membunuh dirimu karena bersedih hati setelah mereka berpaling, sekiranya mereka tidak beriman kepada keterangan ini (Al-Quran).",
      "ar": "فَلَعَلَّكَ بَـٰخِعࣱ نَّفۡسَكَ عَلَىٰۤ ءَاثَـٰرِهِمۡ إِن لَّمۡ یُؤۡمِنُوا۟ بِهَـٰذَا ٱلۡحَدِیثِ أَسَفًا\n"
    }
  },
  {
    "id": 2147,
    "surahId": 18,
    "ayahNumber": 7,
    "arabicText": "إِنَّا جَعَلۡنَا مَا عَلَى ٱلۡأَرۡضِ زِینَةࣰ لَّهَا لِنَبۡلُوَهُمۡ أَیُّهُمۡ أَحۡسَنُ عَمَلࣰا\n",
    "translations": {
      "en": "Behold, We have willed that all beauty on earth be a means by which We put men to a test, [showing] which of them are best in conduct;",
      "ms": "Sesungguhnya Kami telah jadikan apa yang ada di muka bumi sebagai perhiasan baginya, kerana kami hendak menguji mereka, siapakah di antaranya yang lebih baik amalnya.",
      "id": "Sesungguhnya Kami telah menjadikan apa yang di bumi sebagai perhiasan baginya, agar Kami menguji mereka siapakah di antara mereka yang terbaik perbuatannya.",
      "ar": "إِنَّا جَعَلۡنَا مَا عَلَى ٱلۡأَرۡضِ زِینَةࣰ لَّهَا لِنَبۡلُوَهُمۡ أَیُّهُمۡ أَحۡسَنُ عَمَلࣰا\n"
    }
  },
  {
    "id": 2148,
    "surahId": 18,
    "ayahNumber": 8,
    "arabicText": "وَإِنَّا لَجَـٰعِلُونَ مَا عَلَیۡهَا صَعِیدࣰا جُرُزًا\n",
    "translations": {
      "en": "and, verily, [in time] We shall reduce all that is on it to barren dust!",
      "ms": "Dan sesungguhnya Kami akan jadikan apa yang ada di bumi itu (punah-ranah) sebagai tanah yang tandus.",
      "id": "Dan sesungguhnya Kami benar-benar akan menjadikan (pula) apa yang di atasnya menjadi tanah rata lagi tandus.",
      "ar": "وَإِنَّا لَجَـٰعِلُونَ مَا عَلَیۡهَا صَعِیدࣰا جُرُزًا\n"
    }
  },
  {
    "id": 2149,
    "surahId": 18,
    "ayahNumber": 9,
    "arabicText": "أَمۡ حَسِبۡتَ أَنَّ أَصۡحَـٰبَ ٱلۡكَهۡفِ وَٱلرَّقِیمِ كَانُوا۟ مِنۡ ءَایَـٰتِنَا عَجَبًا\n",
    "translations": {
      "en": "[AND SINCE the life of this world is but a test, dost thou [really] think that [the parable of] the Men of the Cave and of [their devotion to] the scriptures could be deemed more wondrous than any [other] of Our messages?",
      "ms": "Adakah engkau menyangka (wahai Muhammad), bahawa kisah \"Ashaabul Kahfi\" dan \"Ar-Raqiim\" itu sahaja yang menakjubkan di antara tanda-tanda yang membuktikan kekuasaan Kami?",
      "id": "Atau kamu mengira bahwa orang-orang yang mendiami gua dan (yang mempunyai) raqim itu, mereka termasuk tanda-tanda kekuasaan Kami yang mengherankan?",
      "ar": "أَمۡ حَسِبۡتَ أَنَّ أَصۡحَـٰبَ ٱلۡكَهۡفِ وَٱلرَّقِیمِ كَانُوا۟ مِنۡ ءَایَـٰتِنَا عَجَبًا\n"
    }
  },
  {
    "id": 2150,
    "surahId": 18,
    "ayahNumber": 10,
    "arabicText": "إِذۡ أَوَى ٱلۡفِتۡیَةُ إِلَى ٱلۡكَهۡفِ فَقَالُوا۟ رَبَّنَاۤ ءَاتِنَا مِن لَّدُنكَ رَحۡمَةࣰ وَهَیِّئۡ لَنَا مِنۡ أَمۡرِنَا رَشَدࣰا\n",
    "translations": {
      "en": "When those youths took refuge in the cave, they prayed: \"O our Sustainer! Bestow on us grace from Thyself, and endow us, whatever our [outward] condition, with consciousness of what is right!\"",
      "ms": "(Ingatkanlah peristiwa) ketika serombongan orang-orang muda pergi ke gua, lalu mereka berdoa: \"Wahai Tuhan kami! Kurniakanlah kami rahmat dari sisiMu, dan berilah kemudahan-kemudahan serta pimpinan kepada kami untuk keselamatan ugama kami\".",
      "id": "(Ingatlah) tatkala para pemuda itu mencari tempat berlindung ke dalam gua, lalu mereka berdoa: \"Wahai Tuhan kami, berikanlah rahmat kepada kami dari sisi-Mu dan sempurnakanlah bagi kami petunjuk yang lurus dalam urusan kami (ini)\".",
      "ar": "إِذۡ أَوَى ٱلۡفِتۡیَةُ إِلَى ٱلۡكَهۡفِ فَقَالُوا۟ رَبَّنَاۤ ءَاتِنَا مِن لَّدُنكَ رَحۡمَةࣰ وَهَیِّئۡ لَنَا مِنۡ أَمۡرِنَا رَشَدࣰا\n"
    }
  },
  {
    "id": 2151,
    "surahId": 18,
    "ayahNumber": 11,
    "arabicText": "فَضَرَبۡنَا عَلَىٰۤ ءَاذَانِهِمۡ فِی ٱلۡكَهۡفِ سِنِینَ عَدَدࣰا\n",
    "translations": {
      "en": "And thereupon We veiled their ears in the cave for many a year,",
      "ms": "Lalu Kami tidurkan mereka dengan nyenyaknya dalam gua itu, bertahun-tahun, yang banyak bilangannya.",
      "id": "Maka Kami tutup telinga mereka beberapa tahun dalam gua itu,",
      "ar": "فَضَرَبۡنَا عَلَىٰۤ ءَاذَانِهِمۡ فِی ٱلۡكَهۡفِ سِنِینَ عَدَدࣰا\n"
    }
  },
  {
    "id": 2152,
    "surahId": 18,
    "ayahNumber": 12,
    "arabicText": "ثُمَّ بَعَثۡنَـٰهُمۡ لِنَعۡلَمَ أَیُّ ٱلۡحِزۡبَیۡنِ أَحۡصَىٰ لِمَا لَبِثُوۤا۟ أَمَدࣰا\n",
    "translations": {
      "en": "and then We awakened Christianity was no longer persecuted and had even become the official religion of the Roman Empire. The ancient coin (dating from the reign of Decius) with which the young man wanted to pay for his purchases immediately aroused curiosity; people began to question the stranger, and the story of the Men of the Cave and their miraculous sleep came to light. them: [and We did all this] so that We might mark out [to the world] which of the two points of view showed a better comprehension of the time-span during which they had remained in this state.",
      "ms": "Kemudian Kami bangkitkan mereka (dari tidurnya), untuk Kami menguji siapakah dari dua golongan di antara mereka yang lebih tepat kiraannya, tentang lamanya mereka hidup (dalam gua itu).",
      "id": "Kemudian Kami bangunkan mereka, agar Kami mengetahui manakah di antara kedua golongan itu] yang lebih tepat dalam menghitung berapa lama mereka tinggal (dalam gua itu).",
      "ar": "ثُمَّ بَعَثۡنَـٰهُمۡ لِنَعۡلَمَ أَیُّ ٱلۡحِزۡبَیۡنِ أَحۡصَىٰ لِمَا لَبِثُوۤا۟ أَمَدࣰا\n"
    }
  },
  {
    "id": 2153,
    "surahId": 18,
    "ayahNumber": 13,
    "arabicText": "نَّحۡنُ نَقُصُّ عَلَیۡكَ نَبَأَهُم بِٱلۡحَقِّۚ إِنَّهُمۡ فِتۡیَةٌ ءَامَنُوا۟ بِرَبِّهِمۡ وَزِدۡنَـٰهُمۡ هُدࣰى\n",
    "translations": {
      "en": "[And now] We shall truly relate to thee their story: Behold, they were young men who had attained to faith in their Sustainer: and [so] We deepened their consciousness of the right way",
      "ms": "Kami ceritakan kepadamu (wahai Muhammad) perihal mereka dengan benar; sesungguhnya mereka itu orang-orang muda yang beriman kepada Tuhan mereka, dan kami tambahi mereka dengan hidayah petunjuk.",
      "id": "Kami kisahkan kepadamu (Muhammad) cerita ini dengan benar. Sesungguhnya mereka adalah pemuda-pemuda yang beriman kepada Tuhan mereka, dan Kami tambah pula untuk mereka petunjuk.",
      "ar": "نَّحۡنُ نَقُصُّ عَلَیۡكَ نَبَأَهُم بِٱلۡحَقِّۚ إِنَّهُمۡ فِتۡیَةٌ ءَامَنُوا۟ بِرَبِّهِمۡ وَزِدۡنَـٰهُمۡ هُدࣰى\n"
    }
  },
  {
    "id": 2154,
    "surahId": 18,
    "ayahNumber": 14,
    "arabicText": "وَرَبَطۡنَا عَلَىٰ قُلُوبِهِمۡ إِذۡ قَامُوا۟ فَقَالُوا۟ رَبُّنَا رَبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ لَن نَّدۡعُوَا۟ مِن دُونِهِۦۤ إِلَـٰهࣰاۖ لَّقَدۡ قُلۡنَاۤ إِذࣰا شَطَطًا\n",
    "translations": {
      "en": "and endowed their hearts with strength, so that they stood up and said [to one another]: \"Our Sustainer is the Sustainer of the heavens and the earth. Never shall we invoke any deity other than Him: [if we did,] we should indeed have uttered an enormity!",
      "ms": "Dan Kami kuatkan hati mereka (dengan kesabaran dan keberanian), semasa mereka bangun (menegaskan tauhid) lalu berkata: \"Tuhan kami ialah Tuhan yang mencipta dan mentadbirkan langit dan bumi; kami tidak sekali-kali akan menyembah Tuhan yang lain dari padanya; jika kami menyembah yang lainnya bermakna kami memperkatakan dan mengakui sesuatu yang jauh dari kebenaran.\"",
      "id": "Dan Kami meneguhkan hati mereka diwaktu mereka berdiri, lalu mereka pun berkata, \"Tuhan kami adalah Tuhan seluruh langit dan bumi; kami sekali-kali tidak menyeru Tuhan selain Dia, sesungguhnya kami kalau demikian telah mengucapkan perkataan yang amat jauh dari kebenaran\".",
      "ar": "وَرَبَطۡنَا عَلَىٰ قُلُوبِهِمۡ إِذۡ قَامُوا۟ فَقَالُوا۟ رَبُّنَا رَبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ لَن نَّدۡعُوَا۟ مِن دُونِهِۦۤ إِلَـٰهࣰاۖ لَّقَدۡ قُلۡنَاۤ إِذࣰا شَطَطًا\n"
    }
  },
  {
    "id": 2155,
    "surahId": 18,
    "ayahNumber": 15,
    "arabicText": "هَـٰۤؤُلَاۤءِ قَوۡمُنَا ٱتَّخَذُوا۟ مِن دُونِهِۦۤ ءَالِهَةࣰۖ لَّوۡلَا یَأۡتُونَ عَلَیۡهِم بِسُلۡطَـٰنِۭ بَیِّنࣲۖ فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبࣰا\n",
    "translations": {
      "en": "These people of ours have taken to worshipping [other] deities instead of Him, without being able to adduce any reasonable evidence in support of their beliefs; and who could be more wicked than he who invents a lie about God?",
      "ms": "(Mereka berkata pula sesama sendiri): \"Kaum kita itu, menyembah beberapa tuhan yang lain dari Allah; sepatutnya mereka mengemukakan keterangan yang nyata yang membuktikan ketuhanan makhluk-makhluk yang mereka sembah itu? (Tetapi mereka tidak dapat berbuat demikian); Maka tidak ada yang lebih zalim dari orang-orang yang berdusta terhadap Allah.",
      "id": "Kaum kami ini telah menjadikan selain Dia sebagai tuhan-tuhan (untuk disembah). Mengapa mereka tidak mengemukakan alasan yang terang (tentang kepercayaan mereka)? Siapakah yang lebih zalim daripada orang-orang yang mengada-adakan kebohongan terhadap Allah?",
      "ar": "هَـٰۤؤُلَاۤءِ قَوۡمُنَا ٱتَّخَذُوا۟ مِن دُونِهِۦۤ ءَالِهَةࣰۖ لَّوۡلَا یَأۡتُونَ عَلَیۡهِم بِسُلۡطَـٰنِۭ بَیِّنࣲۖ فَمَنۡ أَظۡلَمُ مِمَّنِ ٱفۡتَرَىٰ عَلَى ٱللَّهِ كَذِبࣰا\n"
    }
  },
  {
    "id": 2156,
    "surahId": 18,
    "ayahNumber": 16,
    "arabicText": "وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا یَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥۤا۟ إِلَى ٱلۡكَهۡفِ یَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَیُهَیِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقࣰا\n",
    "translations": {
      "en": "Hence, now that you have withdrawn from them and from all that they worship instead of God, take refuge in that cave: God will spread His grace over you, and will endow you - whatever your [outward] condition - with all that your souls may need!",
      "ms": "Dan oleh kerana kamu telah mengasingkan diri dari mereka dan dari apa yang mereka sembah yang lain dari Allah, maka pergilah kamu berlindung di gua itu, supaya Tuhan kamu melimpahkan dari rahmatnya kepada kamu, dan menyediakan kemudahan-kemudahan untuk (menjayakan) urusan kamu dengan memberikan bantuan yang berguna\".",
      "id": "Dan apabila kamu meninggalkan mereka dan apa yang mereka sembah selain Allah, maka carilah tempat berlindung ke dalam gua itu, niscaya Tuhanmu akan melimpahkan sebagian rahmat-Nya kepadamu dan menyediakan sesuatu yang berguna bagimu dalam urusan kamu.",
      "ar": "وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا یَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥۤا۟ إِلَى ٱلۡكَهۡفِ یَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَیُهَیِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقࣰا\n"
    }
  },
  {
    "id": 2157,
    "surahId": 18,
    "ayahNumber": 17,
    "arabicText": "۞ وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَ ٰ⁠وَرُ عَن كَهۡفِهِمۡ ذَاتَ ٱلۡیَمِینِ وَإِذَا غَرَبَت تَّقۡرِضُهُمۡ ذَاتَ ٱلشِّمَالِ وَهُمۡ فِی فَجۡوَةࣲ مِّنۡهُۚ ذَ ٰ⁠لِكَ مِنۡ ءَایَـٰتِ ٱللَّهِۗ مَن یَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن یُضۡلِلۡ فَلَن تَجِدَ لَهُۥ وَلِیࣰّا مُّرۡشِدࣰا\n",
    "translations": {
      "en": "And [for many a year] thou might have seen the sun, on its rising, incline away from their cave on the right, and, on its setting, turn aside from them on the left, while they lived on in that spacious chamber, [bearing witness to] this of God's messages: He whom God guides, he alone has found the right way; whereas for him whom He lets go astray thou canst never find any protector who would point out the right way.",
      "ms": "Dan engkau akan melihat matahari ketika terbit, cenderung ke kanan dari gua mereka; dan apabila ia terbenam, meninggalkan mereka ke arah kiri, sedang mereka berada dalam satu lapangan gua itu. Yang demikian ialah dari tanda-tanda (yang membuktikan kekuasaan) Allah. Sesiapa yang diberi hidayah petunjuk oleh Allah, maka dia lah yang berjaya mencapai kebahagiaan; dan sesiapa yang disesatkanNya maka engkau tidak sekali-kali akan beroleh sebarang penolong yang dapat menunjukkan (jalan yang benar) kepadanya.",
      "id": "Dan kamu akan melihat matahari ketika terbit, condong dari gua mereka ke sebelah kanan, dan bila matahari terbenam menjauhi mereka ke sebelah kiri sedang mereka berada dalam tempat yang luas dalam gua itu. Itu adalah sebagian dari tanda-tanda (kebesaran) Allah. Barangsiapa yang diberi petunjuk oleh Allah, maka dialah yang mendapat petunjuk; dan barangsiapa yang disesatkan-Nya, maka kamu tidak akan mendapatkan seorang pemimpinpun yang dapat memberi petunjuk kepadanya.",
      "ar": "۞ وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَ ٰ⁠وَرُ عَن كَهۡفِهِمۡ ذَاتَ ٱلۡیَمِینِ وَإِذَا غَرَبَت تَّقۡرِضُهُمۡ ذَاتَ ٱلشِّمَالِ وَهُمۡ فِی فَجۡوَةࣲ مِّنۡهُۚ ذَ ٰ⁠لِكَ مِنۡ ءَایَـٰتِ ٱللَّهِۗ مَن یَهۡدِ ٱللَّهُ فَهُوَ ٱلۡمُهۡتَدِۖ وَمَن یُضۡلِلۡ فَلَن تَجِدَ لَهُۥ وَلِیࣰّا مُّرۡشِدࣰا\n"
    }
  },
  {
    "id": 2158,
    "surahId": 18,
    "ayahNumber": 18,
    "arabicText": "وَتَحۡسَبُهُمۡ أَیۡقَاظࣰا وَهُمۡ رُقُودࣱۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡیَمِینِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَـٰسِطࣱ ذِرَاعَیۡهِ بِٱلۡوَصِیدِۚ لَوِ ٱطَّلَعۡتَ عَلَیۡهِمۡ لَوَلَّیۡتَ مِنۡهُمۡ فِرَارࣰا وَلَمُلِئۡتَ مِنۡهُمۡ رُعۡبࣰا\n",
    "translations": {
      "en": "And thou wouldst have thought that they were awake, whereas they lay asleep. And We caused them to turn over repeatedly, now to the right, now to the left; and their dog [lay] on the threshold, its forepaws outstretched. Hadst thou come upon them [unprepared], thou wouldst surely have turned away from them in flight, and wouldst surely have been filled with awe of them.",
      "ms": "Dan engkau sangka mereka sedar, padahal mereka tidur; dan Kami balik-balikkan mereka dalam tidurnya ke sebelah kanan dan ke sebelah kiri; sedang anjing mereka menghulurkan dua kaki depannya dekat pintu gua; jika engkau melihat mereka, tentulah engkau akan berpaling melarikan diri dari mereka, dan tentulah engkau akan merasa sepenuh-penuh gerun takut kepada mereka.",
      "id": "Dan kamu mengira mereka itu bangun, padahal mereka tidur; Dan kami balik-balikkan mereka ke kanan dan ke kiri, sedang anjing mereka mengunjurkan kedua lengannya di muka pintu gua. Dan jika kamu menyaksikan mereka tentulah kamu akan berpaling dari mereka dengan melarikan diri dan tentulah (hati) kamu akan dipenuhi oleh ketakutan terhadap mereka.",
      "ar": "وَتَحۡسَبُهُمۡ أَیۡقَاظࣰا وَهُمۡ رُقُودࣱۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡیَمِینِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَـٰسِطࣱ ذِرَاعَیۡهِ بِٱلۡوَصِیدِۚ لَوِ ٱطَّلَعۡتَ عَلَیۡهِمۡ لَوَلَّیۡتَ مِنۡهُمۡ فِرَارࣰا وَلَمُلِئۡتَ مِنۡهُمۡ رُعۡبࣰا\n"
    }
  },
  {
    "id": 2159,
    "surahId": 18,
    "ayahNumber": 19,
    "arabicText": "وَكَذَ ٰ⁠لِكَ بَعَثۡنَـٰهُمۡ لِیَتَسَاۤءَلُوا۟ بَیۡنَهُمۡۚ قَالَ قَاۤىِٕلࣱ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡۖ قَالُوا۟ لَبِثۡنَا یَوۡمًا أَوۡ بَعۡضَ یَوۡمࣲۚ قَالُوا۟ رَبُّكُمۡ أَعۡلَمُ بِمَا لَبِثۡتُمۡ فَٱبۡعَثُوۤا۟ أَحَدَكُم بِوَرِقِكُمۡ هَـٰذِهِۦۤ إِلَى ٱلۡمَدِینَةِ فَلۡیَنظُرۡ أَیُّهَاۤ أَزۡكَىٰ طَعَامࣰا فَلۡیَأۡتِكُم بِرِزۡقࣲ مِّنۡهُ وَلۡیَتَلَطَّفۡ وَلَا یُشۡعِرَنَّ بِكُمۡ أَحَدًا\n",
    "translations": {
      "en": "And so, [in the course of time,] We awakened them; and they began to ask one another [as to what had happened to them]. One of them asked: \"How long have you remained thus?\" [The others] answered: \"We have remained thus a day, or part of a day.\" Said they [who were endowed with deeper insight]: \"Your Sustainer knows best how long you have thus remained. Let, then, one of you go with these silver coins to the town, and let him find out what food is purest there, and bring you thereof [some] provisions. But let him behave with great care and by no means make anyone aware of you:",
      "ms": "Dan demikianlah pula Kami bangkitkan mereka (dari tidurnya), supaya mereka bertanya-tanyaan sesama sendiri. Salah seorang di antaranya bertanya: \"Berapa lama kamu tidur?\" (sebahagian dari) mereka menjawab: \"Kita telah tidur selama sehari atau sebahagian dari sehari\". (Sebahagian lagi dari) mereka berkata: \"Tuhan kamu lebih menengetahui tentang lamanya kamu tidur; sekarang utuslah salah seorang dari kamu, membawa wang perak kamu ini ke bandar; kemudian biarlah dia mencari dan memilih mana-mana jenis makanan yang lebih baik lagi halal (yang dijual di situ); kemudian hendaklah ia membawa untuk kamu sedikit habuan daripadanya; dan hendaklah ia berlemah-lembut dengan bersungguh-sungguh (semasa di bandar); dan janganlah dia melakukan sesuatu yang menyebabkan sesiapapun menyedari akan hal kamu.",
      "id": "Dan demikianlah Kami bangunkan mereka agar mereka saling bertanya di antara mereka sendiri. Berkatalah salah seorang di antara mereka: Sudah berapa lamakah kamu berada (disini?)\". Mereka menjawab: \"Kita berada (disini) sehari atau setengah hari\". Berkata (yang lain lagi): \"Tuhan kamu lebih mengetahui berapa lamanya kamu berada (di sini). Maka suruhlah salah seorang di antara kamu untuk pergi ke kota dengan membawa uang perakmu ini, dan hendaklah dia lihat manakah makanan yang lebih baik, maka hendaklah ia membawa makanan itu untukmu, dan hendaklah ia berlaku lemah-lembut dan janganlah sekali-kali menceritakan halmu kepada seorangpun.",
      "ar": "وَكَذَ ٰ⁠لِكَ بَعَثۡنَـٰهُمۡ لِیَتَسَاۤءَلُوا۟ بَیۡنَهُمۡۚ قَالَ قَاۤىِٕلࣱ مِّنۡهُمۡ كَمۡ لَبِثۡتُمۡۖ قَالُوا۟ لَبِثۡنَا یَوۡمًا أَوۡ بَعۡضَ یَوۡمࣲۚ قَالُوا۟ رَبُّكُمۡ أَعۡلَمُ بِمَا لَبِثۡتُمۡ فَٱبۡعَثُوۤا۟ أَحَدَكُم بِوَرِقِكُمۡ هَـٰذِهِۦۤ إِلَى ٱلۡمَدِینَةِ فَلۡیَنظُرۡ أَیُّهَاۤ أَزۡكَىٰ طَعَامࣰا فَلۡیَأۡتِكُم بِرِزۡقࣲ مِّنۡهُ وَلۡیَتَلَطَّفۡ وَلَا یُشۡعِرَنَّ بِكُمۡ أَحَدًا\n"
    }
  },
  {
    "id": 2160,
    "surahId": 18,
    "ayahNumber": 20,
    "arabicText": "إِنَّهُمۡ إِن یَظۡهَرُوا۟ عَلَیۡكُمۡ یَرۡجُمُوكُمۡ أَوۡ یُعِیدُوكُمۡ فِی مِلَّتِهِمۡ وَلَن تُفۡلِحُوۤا۟ إِذًا أَبَدࣰا\n",
    "translations": {
      "en": "for, behold, if they should come to know of you, they might stone you to death or force you back to their faith-in which case you would never attain to any good!\"",
      "ms": "\"Sesungguhnya, kalaulah mereka mengetahui hal kamu, tentulah mereka akan merejam dengan membunuh kamu, atau mereka akan mengembalikan kamu kepada ugama mereka (secara paksa); dan jika berlaku demikian, kamu tidak sekali-kali akan berjaya selama-lamanya\".",
      "id": "Sesungguhnya jika mereka dapat mengetahui tempatmu, niscaya mereka akan melempar kamu dengan batu, atau memaksamu kembali kepada agama mereka, dan jika demikian niscaya kamu tidak akan beruntung selama lamanya\".",
      "ar": "إِنَّهُمۡ إِن یَظۡهَرُوا۟ عَلَیۡكُمۡ یَرۡجُمُوكُمۡ أَوۡ یُعِیدُوكُمۡ فِی مِلَّتِهِمۡ وَلَن تُفۡلِحُوۤا۟ إِذًا أَبَدࣰا\n"
    }
  },
  {
    "id": 2161,
    "surahId": 18,
    "ayahNumber": 21,
    "arabicText": "وَكَذَ ٰ⁠لِكَ أَعۡثَرۡنَا عَلَیۡهِمۡ لِیَعۡلَمُوۤا۟ أَنَّ وَعۡدَ ٱللَّهِ حَقࣱّ وَأَنَّ ٱلسَّاعَةَ لَا رَیۡبَ فِیهَاۤ إِذۡ یَتَنَـٰزَعُونَ بَیۡنَهُمۡ أَمۡرَهُمۡۖ فَقَالُوا۟ ٱبۡنُوا۟ عَلَیۡهِم بُنۡیَـٰنࣰاۖ رَّبُّهُمۡ أَعۡلَمُ بِهِمۡۚ قَالَ ٱلَّذِینَ غَلَبُوا۟ عَلَىٰۤ أَمۡرِهِمۡ لَنَتَّخِذَنَّ عَلَیۡهِم مَّسۡجِدࣰا\n",
    "translations": {
      "en": "AND IN THIS way have We drawn [people's] attention to their story, so that they might know - whenever they debate among themselves as to what happened to those [Men of the Cave] that God's promise [of resurrection] is true, and that there can be no doubt as to [the coming of] the Last Hour. And so, some [people] said: \"Erect a building in their memory; God knows best what happened to them.\" Said they whose opinion prevailed in the end: \"Indeed, we must surely raise a house of worship in their memory!\"",
      "ms": "Dan demikianlah Kami dedahkan hal mereka kepada orang ramai supaya orang-orang itu mengetahui bahawa janji Allah menghidupkan semula orang mati adalah benar, dan bahawa hari kiamat itu tidak ada sebarang syak padanya; pendedahan itu berlaku semasa orang-orang itu berbantahan sesama sendiri mengenai perkara hidupnya semula orang mati. Setelah itu maka (sebahagian dari) mereka berkata: \"Dirikanlah sebuah bangunan di sisi gua mereka, Allah jualah yang mengetahui akan hal ehwal mereka\". orang-orang yang berkuasa atas urusan mereka (pihak raja) pula berkata: \"Sebenarnya kami hendak membina sebuah masjid di sisi gua mereka\".",
      "id": "Dan demikian (pula) Kami mempertemukan (manusia) dengan mereka, agar manusia itu mengetahui, bahwa janji Allah itu benar, dan bahwa kedatangan hari kiamat tidak ada keraguan padanya. Ketika orang-orang itu berselisih tentang urusan mereka, orang-orang itu berkata: \"Dirikan sebuah bangunan di atas (gua) mereka, Tuhan mereka lebih mengetahui tentang mereka\". Orang-orang yang berkuasa atas urusan mereka berkata: \"Sesungguhnya kami akan mendirikan sebuah rumah peribadatan di atasnya\".",
      "ar": "وَكَذَ ٰ⁠لِكَ أَعۡثَرۡنَا عَلَیۡهِمۡ لِیَعۡلَمُوۤا۟ أَنَّ وَعۡدَ ٱللَّهِ حَقࣱّ وَأَنَّ ٱلسَّاعَةَ لَا رَیۡبَ فِیهَاۤ إِذۡ یَتَنَـٰزَعُونَ بَیۡنَهُمۡ أَمۡرَهُمۡۖ فَقَالُوا۟ ٱبۡنُوا۟ عَلَیۡهِم بُنۡیَـٰنࣰاۖ رَّبُّهُمۡ أَعۡلَمُ بِهِمۡۚ قَالَ ٱلَّذِینَ غَلَبُوا۟ عَلَىٰۤ أَمۡرِهِمۡ لَنَتَّخِذَنَّ عَلَیۡهِم مَّسۡجِدࣰا\n"
    }
  },
  {
    "id": 2162,
    "surahId": 18,
    "ayahNumber": 22,
    "arabicText": "سَیَقُولُونَ ثَلَـٰثَةࣱ رَّابِعُهُمۡ كَلۡبُهُمۡ وَیَقُولُونَ خَمۡسَةࣱ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَیۡبِۖ وَیَقُولُونَ سَبۡعَةࣱ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّیۤ أَعۡلَمُ بِعِدَّتِهِم مَّا یَعۡلَمُهُمۡ إِلَّا قَلِیلࣱۗ فَلَا تُمَارِ فِیهِمۡ إِلَّا مِرَاۤءࣰ ظَـٰهِرࣰا وَلَا تَسۡتَفۡتِ فِیهِم مِّنۡهُمۡ أَحَدࣰا\n",
    "translations": {
      "en": "[And in times to come] some will say, \"[They were] three, the fourth of them being their dog,\" while others will say, \"Five, with their dog as the sixth of them\" -idly guessing at something of which they can have no knowledge -and [so on, until] some will say, \"[They were] seven, the eighth of them being their dog.\" Say: \"My Sustainer knows best how many they were. None but a few have any [real] knowledge of them. Hence, do not argue about them otherwise than by way of an obvious argument, and do not ask any of those [story-tellers] to enlighten thee about them.\"",
      "ms": "(Sebahagian dari) mereka akan berkata: \"Bilangan Ashaabul Kahfi itu tiga orang, yang keempatnya ialah anjing mereka \"; dan setengahnya pula berkata:\"Bilangan mereka lima orang, yang keenamnya ialah anjing mereka\" - secara meraba-raba dalam gelap akan sesuatu yang tidak diketahui; dan setengahnya yang lain berkata: \"Bilangan mereka tujuh orang, dan yang kedelapannya ialah anjing mereka\". Katakanlah (wahai Muhammad): \"Tuhanku lebih mengetahui akan bilangan mereka, tiada yang mengetahui bilangannya melainkan sedikit\". Oleh itu, janganlah engkau berbahas dengan sesiapapun mengenai mereka melainkan dengan bahasan (secara sederhana) yang nyata (keterangannya di dalam Al-Quran), dan janganlah engkau meminta penjelasan mengenai hal mereka kepada seseorangpun dari golongan (yang membincangkannya).",
      "id": "Nanti (ada orang yang akan) mengatakan (jumlah mereka) adalah tiga orang yang keempat adalah anjingnya, dan (yang lain) mengatakan: \"(jumlah mereka) adalah lima orang yang keenam adalah anjing nya\", sebagai terkaan terhadap barang yang gaib; dan (yang lain lagi) mengatakan: \"(jumlah mereka) tujuh orang, yang ke delapan adalah anjingnya\". Katakanlah: \"Tuhanku lebih mengetahui jumlah mereka; tidak ada orang yang mengetahui (bilangan) mereka kecuali sedikit\". Karena itu janganlah kamu (Muhammad) bertengkar tentang hal mereka, kecuali pertengkaran lahir saja dan jangan kamu menanyakan tentang mereka (pemuda-pemuda itu) kepada seorangpun di antara mereka.",
      "ar": "سَیَقُولُونَ ثَلَـٰثَةࣱ رَّابِعُهُمۡ كَلۡبُهُمۡ وَیَقُولُونَ خَمۡسَةࣱ سَادِسُهُمۡ كَلۡبُهُمۡ رَجۡمَۢا بِٱلۡغَیۡبِۖ وَیَقُولُونَ سَبۡعَةࣱ وَثَامِنُهُمۡ كَلۡبُهُمۡۚ قُل رَّبِّیۤ أَعۡلَمُ بِعِدَّتِهِم مَّا یَعۡلَمُهُمۡ إِلَّا قَلِیلࣱۗ فَلَا تُمَارِ فِیهِمۡ إِلَّا مِرَاۤءࣰ ظَـٰهِرࣰا وَلَا تَسۡتَفۡتِ فِیهِم مِّنۡهُمۡ أَحَدࣰا\n"
    }
  },
  {
    "id": 2163,
    "surahId": 18,
    "ayahNumber": 23,
    "arabicText": "وَلَا تَقُولَنَّ لِشَا۟یۡءٍ إِنِّی فَاعِلࣱ ذَ ٰ⁠لِكَ غَدًا\n",
    "translations": {
      "en": "AND NEVER say about anything, \"Behold, I shall do this tomorrow,\"",
      "ms": "Dan janganlah engkau berkata mengenai sesuatu (yang hendak dikerjakan): \"Bahawa aku akan lakukan yang demikian itu, kemudian nanti\".",
      "id": "Dan jangan sekali-kali kamu mengatakan tentang sesuatu: \"Sesungguhnya aku akan mengerjakan ini besok pagi,",
      "ar": "وَلَا تَقُولَنَّ لِشَا۟یۡءٍ إِنِّی فَاعِلࣱ ذَ ٰ⁠لِكَ غَدًا\n"
    }
  },
  {
    "id": 2164,
    "surahId": 18,
    "ayahNumber": 24,
    "arabicText": "إِلَّاۤ أَن یَشَاۤءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِیتَ وَقُلۡ عَسَىٰۤ أَن یَهۡدِیَنِ رَبِّی لِأَقۡرَبَ مِنۡ هَـٰذَا رَشَدࣰا\n",
    "translations": {
      "en": "without (adding], \"if God so wills.\" And if thou shouldst forget [thyself at the time, and become aware of it later], call thy Sustainer to mind and say: \"I pray that my Sustainer guide me, even closer than this, to a consciousness of what is right!\"",
      "ms": "Melainkan (hendaklah disertakan dengan berkata): \"Insya Allah\". Dan ingatlah serta sebutlah akan Tuhanmu jika engkau lupa; dan katakanlah: \"Mudah-mudahan Tuhanku memimpinku ke jalan petunjuk yang lebih dekat dan lebih terang dari ini\".",
      "id": "kecuali (dengan menyebut): \"Insya Allah\". Dan ingatlah kepada Tuhanmu jika kamu lupa dan katakanlah: \"Mudah-mudahan Tuhanku akan memberiku petunjuk kepada yang lebih dekat kebenarannya dari pada ini\".",
      "ar": "إِلَّاۤ أَن یَشَاۤءَ ٱللَّهُۚ وَٱذۡكُر رَّبَّكَ إِذَا نَسِیتَ وَقُلۡ عَسَىٰۤ أَن یَهۡدِیَنِ رَبِّی لِأَقۡرَبَ مِنۡ هَـٰذَا رَشَدࣰا\n"
    }
  },
  {
    "id": 2165,
    "surahId": 18,
    "ayahNumber": 25,
    "arabicText": "وَلَبِثُوا۟ فِی كَهۡفِهِمۡ ثَلَـٰثَ مِا۟ئَةࣲ سِنِینَ وَٱزۡدَادُوا۟ تِسۡعࣰا\n",
    "translations": {
      "en": "AND [some people assert], \"They remained in their cave three hundred years\"; and some have added nine [to that number].",
      "ms": "Dan mereka telah tinggal tidur dalam gua mereka: Tiga ratus tahun dengan kiraan Ahli Kitab), dan sembilan lagi (dengan kiraan kamu).",
      "id": "Dan mereka tinggal dalam gua mereka tiga ratus tahun dan ditambah sembilan tahun (lagi).",
      "ar": "وَلَبِثُوا۟ فِی كَهۡفِهِمۡ ثَلَـٰثَ مِا۟ئَةࣲ سِنِینَ وَٱزۡدَادُوا۟ تِسۡعࣰا\n"
    }
  },
  {
    "id": 2166,
    "surahId": 18,
    "ayahNumber": 26,
    "arabicText": "قُلِ ٱللَّهُ أَعۡلَمُ بِمَا لَبِثُوا۟ۖ لَهُۥ غَیۡبُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ أَبۡصِرۡ بِهِۦ وَأَسۡمِعۡۚ مَا لَهُم مِّن دُونِهِۦ مِن وَلِیࣲّ وَلَا یُشۡرِكُ فِی حُكۡمِهِۦۤ أَحَدࣰا\n",
    "translations": {
      "en": "Say: \"God knows best how long they remained [there]. His [alone] is the knowledge of the hidden reality of the heavens and the earth: how well does He see and hear! No guardian have they apart from Him, since He allots to no one a share in His rule!\"",
      "ms": "Katakanlah (wahai Muhammad): \"Allah jua yang mengetahui tentang masa mereka tidur; bagiNya lah tertentu ilmu pengetahuan segala rahsia langit dan bumi; terang sungguh penglihatanNya (terhadap segala-galanya)! Tidak ada bagi penduduk langit dan bumi pengurus selain daripadaNya dan Ia tidak menjadikan sesiapapun masuk campur dalam hukumNya.",
      "id": "Katakanlah: \"Allah lebih mengetahui berapa lamanya mereka tinggal (di gua); kepunyaan-Nya-lah semua yang tersembunyi di langit dan di bumi. Alangkah terang penglihatan-Nya dan alangkah tajam pendengaran-Nya; tak ada seorang pelindungpun bagi mereka selain dari pada-Nya; dan Dia tidak mengambil seorangpun menjadi sekutu-Nya dalam menetapkan keputusan\".",
      "ar": "قُلِ ٱللَّهُ أَعۡلَمُ بِمَا لَبِثُوا۟ۖ لَهُۥ غَیۡبُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ أَبۡصِرۡ بِهِۦ وَأَسۡمِعۡۚ مَا لَهُم مِّن دُونِهِۦ مِن وَلِیࣲّ وَلَا یُشۡرِكُ فِی حُكۡمِهِۦۤ أَحَدࣰا\n"
    }
  },
  {
    "id": 2167,
    "surahId": 18,
    "ayahNumber": 27,
    "arabicText": "وَٱتۡلُ مَاۤ أُوحِیَ إِلَیۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَـٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدࣰا\n",
    "translations": {
      "en": "AND CONVEY [to the world] whatever has been revealed to thee of thy Sustainer's writ. There is nothing that could alter His words; and thou canst find no refuge other than with Him.",
      "ms": "Dan baca serta turutlah apa yang diwahyukan kepadamu dari kitab Tuhanmu; tiada sesiapa yang dapat mengubah kalimah-kalimahNya; dan engkau tidak sekali-kali akan mendapat tempat perlindungan selain daripadaNya.",
      "id": "Dan bacakanlah apa yang diwahyukan kepadamu, yaitu kitab Tuhanmu (Al Quran). Tidak ada (seorangpun) yang dapat merubah kalimat-kalimat-Nya. Dan kamu tidak akan dapat menemukan tempat berlindung selain dari pada-Nya.",
      "ar": "وَٱتۡلُ مَاۤ أُوحِیَ إِلَیۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَـٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ مُلۡتَحَدࣰا\n"
    }
  },
  {
    "id": 2168,
    "surahId": 18,
    "ayahNumber": 28,
    "arabicText": "وَٱصۡبِرۡ نَفۡسَكَ مَعَ ٱلَّذِینَ یَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِیِّ یُرِیدُونَ وَجۡهَهُۥۖ وَلَا تَعۡدُ عَیۡنَاكَ عَنۡهُمۡ تُرِیدُ زِینَةَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۖ وَلَا تُطِعۡ مَنۡ أَغۡفَلۡنَا قَلۡبَهُۥ عَن ذِكۡرِنَا وَٱتَّبَعَ هَوَىٰهُ وَكَانَ أَمۡرُهُۥ فُرُطࣰا\n",
    "translations": {
      "en": "And contain thyself in patience by the side of all who at morn and at evening invoke their Sustainer, seeking His countenance, and let not thine eyes pass beyond them in quest of the beauties of this world's life; and pay no heed to any whose heart We have rendered heedless of all remembrance of Us because he had always followed [only] his own desires, abandoning all that is good and true.",
      "ms": "Dan jadikanlah dirimu sentiasa berdamping rapat dengan orang-orang yang beribadat kepada Tuhan mereka pada waktu pagi dan petang, yang mengharapkan keredaan Allah semata-mata; dan janganlah engkau memalingkan pandanganmu daripada mereka hanya kerana engkau mahukan kesenangan hidup di dunia; dan janganlah engkau mematuhi orang yang Kami ketahui hatinya lalai daripada mengingati dan mematuhi pengajaran Kami di dalam Al-Quran, serta ia menurut hawa nafsunya, dan tingkah-lakunya pula adalah melampaui kebenaran.",
      "id": "Dan bersabarlah kamu bersama-sama dengan orang-orang yang menyeru Tuhannya di pagi dan senja hari dengan mengharap keridhaan-Nya; dan janganlah kedua matamu berpaling dari mereka (karena) mengharapkan perhiasan dunia ini; dan janganlah kamu mengikuti orang yang hatinya telah Kami lalaikan dari mengingati Kami, serta menuruti hawa nafsunya dan adalah keadaannya itu melewati batas.",
      "ar": "وَٱصۡبِرۡ نَفۡسَكَ مَعَ ٱلَّذِینَ یَدۡعُونَ رَبَّهُم بِٱلۡغَدَوٰةِ وَٱلۡعَشِیِّ یُرِیدُونَ وَجۡهَهُۥۖ وَلَا تَعۡدُ عَیۡنَاكَ عَنۡهُمۡ تُرِیدُ زِینَةَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۖ وَلَا تُطِعۡ مَنۡ أَغۡفَلۡنَا قَلۡبَهُۥ عَن ذِكۡرِنَا وَٱتَّبَعَ هَوَىٰهُ وَكَانَ أَمۡرُهُۥ فُرُطࣰا\n"
    }
  },
  {
    "id": 2169,
    "surahId": 18,
    "ayahNumber": 29,
    "arabicText": "وَقُلِ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَن شَاۤءَ فَلۡیُؤۡمِن وَمَن شَاۤءَ فَلۡیَكۡفُرۡۚ إِنَّاۤ أَعۡتَدۡنَا لِلظَّـٰلِمِینَ نَارًا أَحَاطَ بِهِمۡ سُرَادِقُهَاۚ وَإِن یَسۡتَغِیثُوا۟ یُغَاثُوا۟ بِمَاۤءࣲ كَٱلۡمُهۡلِ یَشۡوِی ٱلۡوُجُوهَۚ بِئۡسَ ٱلشَّرَابُ وَسَاۤءَتۡ مُرۡتَفَقًا\n",
    "translations": {
      "en": "And say: \"The truth [has now come] from your Sustainer: let, then, him who wills, believe in it, and let him who wills, reject it.\" Verily, for all who sin against themselves [by rejecting Our truth] We have readied a fire whose billowing folds will encompass them from all sides; and if they beg for water, they will be given water [hot] like molten lead, which will scald their faces: how dreadful a drink, and how evil a place to rest!",
      "ms": "Dan katakanlah (wahai Muhammad): \"Kebenaran itu ialah yang datang dari Tuhan kamu, maka sesiapa yang mahu beriman, hendaklah ia beriman; dan sesiapa yang mahu kufur ingkar, biarlah dia mengingkarinya\". Kerana Kami telah menyediakan bagi orang-orang yang berlaku zalim itu api neraka, yang meliputi mereka laksana khemah; dan jika mereka meminta pertolongan kerana dahaga, mereka diberi pertolongan dengan air yang seperti tembaga cair yang membakar muka; amatlah buruknya minuman itu, dan amatlah buruknya neraka sebagai tempat bersenang-senang.",
      "id": "Dan katakanlah: \"Kebenaran itu datangnya dari Tuhanmu; maka barangsiapa yang ingin (beriman) hendaklah ia beriman, dan barangsiapa yang ingin (kafir) biarlah ia kafir\". Sesungguhnya Kami telah sediakan bagi orang orang zalim itu neraka, yang gejolaknya mengepung mereka. Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek.",
      "ar": "وَقُلِ ٱلۡحَقُّ مِن رَّبِّكُمۡۖ فَمَن شَاۤءَ فَلۡیُؤۡمِن وَمَن شَاۤءَ فَلۡیَكۡفُرۡۚ إِنَّاۤ أَعۡتَدۡنَا لِلظَّـٰلِمِینَ نَارًا أَحَاطَ بِهِمۡ سُرَادِقُهَاۚ وَإِن یَسۡتَغِیثُوا۟ یُغَاثُوا۟ بِمَاۤءࣲ كَٱلۡمُهۡلِ یَشۡوِی ٱلۡوُجُوهَۚ بِئۡسَ ٱلشَّرَابُ وَسَاۤءَتۡ مُرۡتَفَقًا\n"
    }
  },
  {
    "id": 2170,
    "surahId": 18,
    "ayahNumber": 30,
    "arabicText": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ إِنَّا لَا نُضِیعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا\n",
    "translations": {
      "en": "[But,] behold, as for those who attain to faith and do righteous deeds-verily, We do not fail to requite any who persevere in doing good:",
      "ms": "Sebenarnya orang-orang yang beriman dan beramal soleh sudah tetap Kami tidak akan menghilangkan pahala orang-orang yang berusaha memperbaiki amalnya.",
      "id": "Sesunggunya mereka yang beriman dan beramal saleh, tentulah Kami tidak akan menyia-nyiakan pahala orang-orang yang mengerjakan amalan(nya) dengan yang baik.",
      "ar": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ إِنَّا لَا نُضِیعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا\n"
    }
  },
  {
    "id": 2171,
    "surahId": 18,
    "ayahNumber": 31,
    "arabicText": "أُو۟لَـٰۤىِٕكَ لَهُمۡ جَنَّـٰتُ عَدۡنࣲ تَجۡرِی مِن تَحۡتِهِمُ ٱلۡأَنۡهَـٰرُ یُحَلَّوۡنَ فِیهَا مِنۡ أَسَاوِرَ مِن ذَهَبࣲ وَیَلۡبَسُونَ ثِیَابًا خُضۡرࣰا مِّن سُندُسࣲ وَإِسۡتَبۡرَقࣲ مُّتَّكِـِٔینَ فِیهَا عَلَى ٱلۡأَرَاۤىِٕكِۚ نِعۡمَ ٱلثَّوَابُ وَحَسُنَتۡ مُرۡتَفَقࣰا\n",
    "translations": {
      "en": "theirs shall be gardens of perpetual bliss - [gardens] through which running waters flow - wherein they will be adorned with bracelets of gold and will wear green garments of silk and brocade, [and] wherein upon couches they will recline:\" how excellent a recompense, and how goodly a place to rest!",
      "ms": "Mereka itu, disediakan baginya syurga yang kekal, yang mengalir di bawahnya beberapa sungai; mereka dihiaskan di dalamnya dengan gelang-gelang tangan emas, dan memakai pakaian hijau dari sutera yang nipis dan sutera tebal yang bersulam; mereka berehat di dalamnya dengan berbaring di atas pelamin-pelamin (yang berhias). Demikian itulah balasan yang sebaik-baiknya dan demikian itulah Syurga tempat berehat yang semolek-moleknya.",
      "id": "Mereka itulah (orang-orang yang) bagi mereka surga 'Adn, mengalir sungai-sungai di bawahnya; dalam surga itu mereka dihiasi dengan gelang mas dan mereka memakai pakaian hijau dari sutera halus dan sutera tebal, sedang mereka duduk sambil bersandar di atas dipan-dipan yang indah. Itulah pahala yang sebaik-baiknya, dan tempat istirahat yang indah;",
      "ar": "أُو۟لَـٰۤىِٕكَ لَهُمۡ جَنَّـٰتُ عَدۡنࣲ تَجۡرِی مِن تَحۡتِهِمُ ٱلۡأَنۡهَـٰرُ یُحَلَّوۡنَ فِیهَا مِنۡ أَسَاوِرَ مِن ذَهَبࣲ وَیَلۡبَسُونَ ثِیَابًا خُضۡرࣰا مِّن سُندُسࣲ وَإِسۡتَبۡرَقࣲ مُّتَّكِـِٔینَ فِیهَا عَلَى ٱلۡأَرَاۤىِٕكِۚ نِعۡمَ ٱلثَّوَابُ وَحَسُنَتۡ مُرۡتَفَقࣰا\n"
    }
  },
  {
    "id": 2172,
    "surahId": 18,
    "ayahNumber": 32,
    "arabicText": "۞ وَٱضۡرِبۡ لَهُم مَّثَلࣰا رَّجُلَیۡنِ جَعَلۡنَا لِأَحَدِهِمَا جَنَّتَیۡنِ مِنۡ أَعۡنَـٰبࣲ وَحَفَفۡنَـٰهُمَا بِنَخۡلࣲ وَجَعَلۡنَا بَیۡنَهُمَا زَرۡعࣰا\n",
    "translations": {
      "en": "AND PROPOUND unto them the parable of two men, upon one of whom We had bestowed two vinyards, and surrounded them with date-palms, and placed a field of grain in-between.",
      "ms": "Dan berikanlah kepada mereka satu contoh: Dua orang lelaki, Kami adakan bagi salah seorang di antaranya, dua buah kebun anggur; dan Kami kelilingi kebun-kebun itu dengan pohon-pohon tamar, serta Kami jadikan di antara keduanya, jenis-jenis tanaman yang lain.",
      "id": "Dan berikanlah kepada mereka sebuah perumpamaan dua orang laki-laki, Kami jadikan bagi seorang di antara keduanya (yang kafir) dua buah kebun anggur dan kami kelilingi kedua kebun itu dengan pohon-pohon korma dan di antara kedua kebun itu Kami buatkan ladang.",
      "ar": "۞ وَٱضۡرِبۡ لَهُم مَّثَلࣰا رَّجُلَیۡنِ جَعَلۡنَا لِأَحَدِهِمَا جَنَّتَیۡنِ مِنۡ أَعۡنَـٰبࣲ وَحَفَفۡنَـٰهُمَا بِنَخۡلࣲ وَجَعَلۡنَا بَیۡنَهُمَا زَرۡعࣰا\n"
    }
  },
  {
    "id": 2173,
    "surahId": 18,
    "ayahNumber": 33,
    "arabicText": "كِلۡتَا ٱلۡجَنَّتَیۡنِ ءَاتَتۡ أُكُلَهَا وَلَمۡ تَظۡلِم مِّنۡهُ شَیۡـࣰٔاۚ وَفَجَّرۡنَا خِلَـٰلَهُمَا نَهَرࣰا\n",
    "translations": {
      "en": "Each of the two gardens yielded its produce and never failed therein in any way, for We had caused a stream to gush forth in the midst of each of them.",
      "ms": "Kedua-dua kebun itu mengeluarkan hasilnya, dan tiada mengurangi sedikitpun dari hasil itu; dan kami juga mengalirkan di antara keduanya sebatang sungai.",
      "id": "Kedua buah kebun itu menghasilkan buahnya, dan kebun itu tiada kurang buahnya sedikitpun, dan Kami alirkan sungai di celah-celah kedua kebun itu,",
      "ar": "كِلۡتَا ٱلۡجَنَّتَیۡنِ ءَاتَتۡ أُكُلَهَا وَلَمۡ تَظۡلِم مِّنۡهُ شَیۡـࣰٔاۚ وَفَجَّرۡنَا خِلَـٰلَهُمَا نَهَرࣰا\n"
    }
  },
  {
    "id": 2174,
    "surahId": 18,
    "ayahNumber": 34,
    "arabicText": "وَكَانَ لَهُۥ ثَمَرࣱ فَقَالَ لِصَـٰحِبِهِۦ وَهُوَ یُحَاوِرُهُۥۤ أَنَا۠ أَكۡثَرُ مِنكَ مَالࣰا وَأَعَزُّ نَفَرࣰا\n",
    "translations": {
      "en": "And so [the man] had fruit in abundance. And [one day] he said to his friend, bandying words with him, \"More wealth have I than thou, and mightier am I as regards [the number and power of my] followers!\"",
      "ms": "Tuan kebun itu pula ada mempunyai harta (yang lain); lalu berkatalah ia kepada rakannya, semasa ia berbincang dengannya: \"Aku lebih banyak harta daripadamu, dan lebih berpengaruh dengan pengikut-pengikutku yang ramai\".",
      "id": "dan dia mempunyai kekayaan besar, maka ia berkata kepada kawannya (yang mukmin) ketika bercakap-cakap dengan dia: \"Hartaku lebih banyak dari pada hartamu dan pengikut-pengikutku lebih kuat\"",
      "ar": "وَكَانَ لَهُۥ ثَمَرࣱ فَقَالَ لِصَـٰحِبِهِۦ وَهُوَ یُحَاوِرُهُۥۤ أَنَا۠ أَكۡثَرُ مِنكَ مَالࣰا وَأَعَزُّ نَفَرࣰا\n"
    }
  },
  {
    "id": 2175,
    "surahId": 18,
    "ayahNumber": 35,
    "arabicText": "وَدَخَلَ جَنَّتَهُۥ وَهُوَ ظَالِمࣱ لِّنَفۡسِهِۦ قَالَ مَاۤ أَظُنُّ أَن تَبِیدَ هَـٰذِهِۦۤ أَبَدࣰا\n",
    "translations": {
      "en": "And having [thus] sinned against himself, he entered his garden, saying, \"I do not think that this will ever perish!",
      "ms": "Dan ia pun masuk ke kebunnya (bersama-sama rakannya), sedang ia berlaku zalim kepada dirinya sendiri (dengan sebab kufurnya), sambil ia berkata: \"Aku tidak fikir, kebun ini akan binasa selama-lamanya.",
      "id": "Dan dia memasuki kebunnya sedang dia zalim terhadap dirinya sendiri; ia berkata: \"Aku kira kebun ini tidak akan binasa selama-lamanya,",
      "ar": "وَدَخَلَ جَنَّتَهُۥ وَهُوَ ظَالِمࣱ لِّنَفۡسِهِۦ قَالَ مَاۤ أَظُنُّ أَن تَبِیدَ هَـٰذِهِۦۤ أَبَدࣰا\n"
    }
  },
  {
    "id": 2176,
    "surahId": 18,
    "ayahNumber": 36,
    "arabicText": "وَمَاۤ أَظُنُّ ٱلسَّاعَةَ قَاۤىِٕمَةࣰ وَلَىِٕن رُّدِدتُّ إِلَىٰ رَبِّی لَأَجِدَنَّ خَیۡرࣰا مِّنۡهَا مُنقَلَبࣰا\n",
    "translations": {
      "en": "And neither do I think that the Last Hour will ever come. But even if [it should come, and] I am brought before my Sustainer, I will surely find something even better than this as [my last] resort!\"",
      "ms": "Dan aku tidak fikir, hari kiamat kan berlaku; dan kalaulah aku dikembalikan kepada Tuhanku (sebagaimana kepercayaanmu), tentulah aku akan mendapat tempat kembali yang lebih baik daripada ini.",
      "id": "dan aku tidak mengira hari kiamat itu akan datang, dan jika sekiranya aku kembalikan kepada Tuhanku, pasti aku akan mendapat tempat kembali yang lebih baik dari pada kebun-kebun itu\".",
      "ar": "وَمَاۤ أَظُنُّ ٱلسَّاعَةَ قَاۤىِٕمَةࣰ وَلَىِٕن رُّدِدتُّ إِلَىٰ رَبِّی لَأَجِدَنَّ خَیۡرࣰا مِّنۡهَا مُنقَلَبࣰا\n"
    }
  },
  {
    "id": 2177,
    "surahId": 18,
    "ayahNumber": 37,
    "arabicText": "قَالَ لَهُۥ صَاحِبُهُۥ وَهُوَ یُحَاوِرُهُۥۤ أَكَفَرۡتَ بِٱلَّذِی خَلَقَكَ مِن تُرَابࣲ ثُمَّ مِن نُّطۡفَةࣲ ثُمَّ سَوَّىٰكَ رَجُلࣰا\n",
    "translations": {
      "en": "And his friend answered him in the course of their argument: \"Wilt thou blaspheme against Him who has created thee out of dust, and then out of a drop of sperm, and in the end has fashioned thee into a [complete] man?",
      "ms": "berkatalah rakannya kepadanya, semasa ia berbincang dengannya: \"Patutkah engkau kufur ingkar kepada Allah yang menciptakan engkau dari tanah, kemudian dari air benih, kemudian Ia membentukmu dengan sempurna sebagai seorang lelaki?",
      "id": "Kawannya (yang mukmin) berkata kepadanya -- sedang dia bercakap-cakap dengannya: \"Apakah kamu kafir kepada (Tuhan) yang menciptakan kamu dari tanah, kemudian dari setetes air mani, lalu Dia menjadikan kamu seorang laki-laki yang sempurna?",
      "ar": "قَالَ لَهُۥ صَاحِبُهُۥ وَهُوَ یُحَاوِرُهُۥۤ أَكَفَرۡتَ بِٱلَّذِی خَلَقَكَ مِن تُرَابࣲ ثُمَّ مِن نُّطۡفَةࣲ ثُمَّ سَوَّىٰكَ رَجُلࣰا\n"
    }
  },
  {
    "id": 2178,
    "surahId": 18,
    "ayahNumber": 38,
    "arabicText": "لَّـٰكِنَّا۠ هُوَ ٱللَّهُ رَبِّی وَلَاۤ أُشۡرِكُ بِرَبِّیۤ أَحَدࣰا\n",
    "translations": {
      "en": "But as for myself, [I. know that] He is God, my Sustainer; and I cannot attribute divine powers to any but my Sustainer.\"",
      "ms": "Tetapi aku sendiri percaya dan yakin dengan sepenuhnya bahawa Dia lah Allah, Tuhanku, dan aku tidak sekutukan sesuatu pun dengan Tuhanku.",
      "id": "Tetapi aku (percaya bahwa): Dialah Allah, Tuhanku, dan aku tidak mempersekutukan seorangpun dengan Tuhanku.",
      "ar": "لَّـٰكِنَّا۠ هُوَ ٱللَّهُ رَبِّی وَلَاۤ أُشۡرِكُ بِرَبِّیۤ أَحَدࣰا\n"
    }
  },
  {
    "id": 2179,
    "surahId": 18,
    "ayahNumber": 39,
    "arabicText": "وَلَوۡلَاۤ إِذۡ دَخَلۡتَ جَنَّتَكَ قُلۡتَ مَا شَاۤءَ ٱللَّهُ لَا قُوَّةَ إِلَّا بِٱللَّهِۚ إِن تَرَنِ أَنَا۠ أَقَلَّ مِنكَ مَالࣰا وَوَلَدࣰا\n",
    "translations": {
      "en": "And [he continued:] \"Alas, if thou hadst but said, on entering thy garden, `Whatever God wills [shall come to pass, for] there is no power save with God!' Although, as thou seest, I have less wealth and offspring than thou,",
      "ms": "Dan sepatutnya semasa engkau masuk ke kebunmu, berkata: (Semuanya ialah barang yang dikehendaki Allah)! (tiada daya dan upaya melainkan dengan pertolongan Allah)? Kalau engkau memandangku sangat kurang tentang harta dan anak, berbanding denganmu,",
      "id": "Dan mengapa kamu tidak mengatakan waktu kamu memasuki kebunmu \"maasyaallaah, laa quwwata illaa billaah (sungguh atas kehendak Allah semua ini terwujud, tiada kekuatan kecuali dengan pertolongan Allah). Sekiranya kamu anggap aku lebih sedikit darimu dalam hal harta dan keturunan,",
      "ar": "وَلَوۡلَاۤ إِذۡ دَخَلۡتَ جَنَّتَكَ قُلۡتَ مَا شَاۤءَ ٱللَّهُ لَا قُوَّةَ إِلَّا بِٱللَّهِۚ إِن تَرَنِ أَنَا۠ أَقَلَّ مِنكَ مَالࣰا وَوَلَدࣰا\n"
    }
  },
  {
    "id": 2180,
    "surahId": 18,
    "ayahNumber": 40,
    "arabicText": "فَعَسَىٰ رَبِّیۤ أَن یُؤۡتِیَنِ خَیۡرࣰا مِّن جَنَّتِكَ وَیُرۡسِلَ عَلَیۡهَا حُسۡبَانࣰا مِّنَ ٱلسَّمَاۤءِ فَتُصۡبِحَ صَعِیدࣰا زَلَقًا\n",
    "translations": {
      "en": "yet it may well be that my Sustainer will give me something better than thy garden -just as He may let loose a calamity out of heaven upon this [thy garden], so that it becomes a heap of barren dust",
      "ms": "Maka mudah-mudahan Tuhanku akan mengurniakan daku lebih baik daripada kebunmu, dan (aku bimbang) dia akan menimpakannya dengan bala, bencana dari langit, sehinggalah menjadilah kebunmu itu tanah yang licin tandus.",
      "id": "maka mudah-mudahan Tuhanku, akan memberi kepadaku (kebun) yang lebih baik dari pada kebunmu (ini); dan mudah-mudahan Dia mengirimkan ketentuan (petir) dari langit kepada kebunmu; hingga (kebun itu) menjadi tanah yang licin;",
      "ar": "فَعَسَىٰ رَبِّیۤ أَن یُؤۡتِیَنِ خَیۡرࣰا مِّن جَنَّتِكَ وَیُرۡسِلَ عَلَیۡهَا حُسۡبَانࣰا مِّنَ ٱلسَّمَاۤءِ فَتُصۡبِحَ صَعِیدࣰا زَلَقًا\n"
    }
  },
  {
    "id": 2181,
    "surahId": 18,
    "ayahNumber": 41,
    "arabicText": "أَوۡ یُصۡبِحَ مَاۤؤُهَا غَوۡرࣰا فَلَن تَسۡتَطِیعَ لَهُۥ طَلَبࣰا\n",
    "translations": {
      "en": "or its water sinks deep into the ground, so that thou wilt never be able to find it again!\"",
      "ms": "Ataupun air kebun itu akan menjadi kering ditelan bumi, maka dengan yang demikian, engkau tidak akan dapat mencarinya lagi\".",
      "id": "atau airnya menjadi surut ke dalam tanah, maka sekali-kali kamu tidak dapat menemukannya lagi\".",
      "ar": "أَوۡ یُصۡبِحَ مَاۤؤُهَا غَوۡرࣰا فَلَن تَسۡتَطِیعَ لَهُۥ طَلَبࣰا\n"
    }
  },
  {
    "id": 2182,
    "surahId": 18,
    "ayahNumber": 42,
    "arabicText": "وَأُحِیطَ بِثَمَرِهِۦ فَأَصۡبَحَ یُقَلِّبُ كَفَّیۡهِ عَلَىٰ مَاۤ أَنفَقَ فِیهَا وَهِیَ خَاوِیَةٌ عَلَىٰ عُرُوشِهَا وَیَقُولُ یَـٰلَیۡتَنِی لَمۡ أُشۡرِكۡ بِرَبِّیۤ أَحَدࣰا\n",
    "translations": {
      "en": "And [thus it happened:] his fruitful gardens were encompassed [by ruin], and there he was, wringing his hands over all that he had spent on that which now lay waste, with its trellises caved in; and he could but say, \"Oh, would that I had not attributed divine powers to any but my Sustainer!\"",
      "ms": "Dan segala tanaman serta hartabendanya itupun dibinasakan, lalu jadilah ia membalik-balikkan kedua tapak tangannya (kerana menyesal) terhadap segala perbelanjaan yang telah dibelanjakannya pada kebun-kebunnya, sedang kebun-kebun itu runtuh junjung-junjung tanamannya; sambil dia berkata: \"Alangkah baiknya kalau aku tidak sekutukan sesuatupun dengan Tuhanku!\"",
      "id": "Dan harta kekayaannya dibinasakan; lalu ia membulak-balikkan kedua tangannya (tanda menyesal) terhadap apa yang ia telah belanjakan untuk itu, sedang pohon anggur itu roboh bersama para-paranya dan dia berkata: \"Aduhai kiranya dulu aku tidak mempersekutukan seorangpun dengan Tuhanku\".",
      "ar": "وَأُحِیطَ بِثَمَرِهِۦ فَأَصۡبَحَ یُقَلِّبُ كَفَّیۡهِ عَلَىٰ مَاۤ أَنفَقَ فِیهَا وَهِیَ خَاوِیَةٌ عَلَىٰ عُرُوشِهَا وَیَقُولُ یَـٰلَیۡتَنِی لَمۡ أُشۡرِكۡ بِرَبِّیۤ أَحَدࣰا\n"
    }
  },
  {
    "id": 2183,
    "surahId": 18,
    "ayahNumber": 43,
    "arabicText": "وَلَمۡ تَكُن لَّهُۥ فِئَةࣱ یَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مُنتَصِرًا\n",
    "translations": {
      "en": "-for now he had nought to succour him in God's stead, nor could he succour himself.",
      "ms": "Dan ia tidak mendapat sebarang golongan yang boleh menolongnya, selain dari Allah; dan ia pula tidak dapat membela dirinya sendiri.",
      "id": "Dan tidak ada bagi dia segolonganpun yang akan menolongnya selain Allah; dan sekali-kali ia tidak dapat membela dirinya.",
      "ar": "وَلَمۡ تَكُن لَّهُۥ فِئَةࣱ یَنصُرُونَهُۥ مِن دُونِ ٱللَّهِ وَمَا كَانَ مُنتَصِرًا\n"
    }
  },
  {
    "id": 2184,
    "surahId": 18,
    "ayahNumber": 44,
    "arabicText": "هُنَالِكَ ٱلۡوَلَـٰیَةُ لِلَّهِ ٱلۡحَقِّۚ هُوَ خَیۡرࣱ ثَوَابࣰا وَخَیۡرٌ عُقۡبࣰا\n",
    "translations": {
      "en": "For thus it is: all protective power belongs to God alone, the True One. He is the best to grant recompense, and the best to determine what is to be.",
      "ms": "Pada saat yang sedemikian itu kekuasaan memberi pertolongan hanya tertentu bagi Allah, Tuhan yang sebenar-benarnya; Dia lah sebaik-baik pemberi pahala, dan sebaik-baik pemberi kesudahan yang berbahagia (kepada hamba-hambaNya yang taat).",
      "id": "Di sana pertolongan itu hanya dari Allah Yang Hak. Dia adalah sebaik-baik Pemberi pahala dan sebaik-baik Pemberi balasan.",
      "ar": "هُنَالِكَ ٱلۡوَلَـٰیَةُ لِلَّهِ ٱلۡحَقِّۚ هُوَ خَیۡرࣱ ثَوَابࣰا وَخَیۡرٌ عُقۡبࣰا\n"
    }
  },
  {
    "id": 2185,
    "surahId": 18,
    "ayahNumber": 45,
    "arabicText": "وَٱضۡرِبۡ لَهُم مَّثَلَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا كَمَاۤءٍ أَنزَلۡنَـٰهُ مِنَ ٱلسَّمَاۤءِ فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ فَأَصۡبَحَ هَشِیمࣰا تَذۡرُوهُ ٱلرِّیَـٰحُۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ مُّقۡتَدِرًا\n",
    "translations": {
      "en": "AND PROPOUND unto them the parable of the life of this world: [it is] like the water which We send down from the skies, and which is absorbed by the plants of the earth: but [in time] they turn into dry. stubble which the winds blow freely about. And it is God [alone] who determines all things.",
      "ms": "Dan kemukakanlah kepada mereka misal perbandingan: Kehidupan dunia ini samalah seperti air yang Kami turunkan dari langit, lalu bercampur aduklah tanaman di bumi antara satu sama lain (dan kembang suburlah ia) disebabkan air itu; kemudian menjadilah ia kering hancur ditiup angin; dan (ingatlah) adalah Allah Maha Kuasa atas tiap-tiap sesuatu.",
      "id": "Dan berilah perumpamaan kepada mereka (manusia), kehidupan dunia sebagai air hujan yang Kami turunkan dari langit, maka menjadi subur karenanya tumbuh-tumbuhan di muka bumi, kemudian tumbuh-tumbuhan itu menjadi kering yang diterbangkan oleh angin. Dan adalah Allah, Maha Kuasa atas segala sesuatu.",
      "ar": "وَٱضۡرِبۡ لَهُم مَّثَلَ ٱلۡحَیَوٰةِ ٱلدُّنۡیَا كَمَاۤءٍ أَنزَلۡنَـٰهُ مِنَ ٱلسَّمَاۤءِ فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ فَأَصۡبَحَ هَشِیمࣰا تَذۡرُوهُ ٱلرِّیَـٰحُۗ وَكَانَ ٱللَّهُ عَلَىٰ كُلِّ شَیۡءࣲ مُّقۡتَدِرًا\n"
    }
  },
  {
    "id": 2186,
    "surahId": 18,
    "ayahNumber": 46,
    "arabicText": "ٱلۡمَالُ وَٱلۡبَنُونَ زِینَةُ ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۖ وَٱلۡبَـٰقِیَـٰتُ ٱلصَّـٰلِحَـٰتُ خَیۡرٌ عِندَ رَبِّكَ ثَوَابࣰا وَخَیۡرٌ أَمَلࣰا\n",
    "translations": {
      "en": "Wealth and children are an adornment of this, world's life: but good deeds, the fruit whereof endures forever, are of far greater merit in thy Sustainer's sight, and a far better source of hope.",
      "ms": "Harta benda dan anak pinak itu, ialah perhiasan hidup di dunia; dan amal-amal soleh yang kekal faedahnya itu lebih baik pada sisi Tuhanmu sebagai pahala balasan, dan lebih baik sebagai asas yang memberi harapan.",
      "id": "Harta dan anak-anak adalah perhiasan kehidupan dunia tetapi amalan-amalan yang kekal lagi saleh adalah lebih baik pahalanya di sisi Tuhanmu serta lebih baik untuk menjadi harapan.",
      "ar": "ٱلۡمَالُ وَٱلۡبَنُونَ زِینَةُ ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۖ وَٱلۡبَـٰقِیَـٰتُ ٱلصَّـٰلِحَـٰتُ خَیۡرٌ عِندَ رَبِّكَ ثَوَابࣰا وَخَیۡرٌ أَمَلࣰا\n"
    }
  },
  {
    "id": 2187,
    "surahId": 18,
    "ayahNumber": 47,
    "arabicText": "وَیَوۡمَ نُسَیِّرُ ٱلۡجِبَالَ وَتَرَى ٱلۡأَرۡضَ بَارِزَةࣰ وَحَشَرۡنَـٰهُمۡ فَلَمۡ نُغَادِرۡ مِنۡهُمۡ أَحَدࣰا\n",
    "translations": {
      "en": "Hence, [bear in mind] the Day, on which We shall cause the mountains to disappear and thou shalt behold the earth void and bare: for [on that Day] We will [resurrect the dead and] gather them all together, leaving out none of them.",
      "ms": "Dan (ingatkanlah) hari Kami bongkar dan terbangkan gunung-ganang dan engkau akan melihat (seluruh) muka bumi terdedah nyata; dan Kami himpunkan mereka (di padang Mahsyar) sehingga Kami tidak akan tinggalkan seorangpun dari mereka.",
      "id": "Dan (ingatlah) akan hari (yang ketika itu) Kami perjalankan gunung-gunung dan kamu akan dapat melihat bumi itu datar dan Kami kumpulkan seluruh manusia, dan tidak kami tinggalkan seorangpun dari mereka.",
      "ar": "وَیَوۡمَ نُسَیِّرُ ٱلۡجِبَالَ وَتَرَى ٱلۡأَرۡضَ بَارِزَةࣰ وَحَشَرۡنَـٰهُمۡ فَلَمۡ نُغَادِرۡ مِنۡهُمۡ أَحَدࣰا\n"
    }
  },
  {
    "id": 2188,
    "surahId": 18,
    "ayahNumber": 48,
    "arabicText": "وَعُرِضُوا۟ عَلَىٰ رَبِّكَ صَفࣰّا لَّقَدۡ جِئۡتُمُونَا كَمَا خَلَقۡنَـٰكُمۡ أَوَّلَ مَرَّةِۭۚ بَلۡ زَعَمۡتُمۡ أَلَّن نَّجۡعَلَ لَكُم مَّوۡعِدࣰا\n",
    "translations": {
      "en": "And they will be lined up before thy Sustainer, [and He will say:] \"Now, indeed, you have come unto Us [in a lonely state], even as We created you in the first instances - although you were wont to assert that We would never 'appoint for you a meeting [with Us]!\"",
      "ms": "Dan mereka tetap akan dibawa mengadap Tuhanmu dengan berbaris teratur, (sambil dikatakan kepada mereka): \"Kamu sekarang telah datang kepada Kami - (berseorangan) sebagaimana Kami telah jadikan kamu pada mulanya; bahkan kamu dahulu menyangka, bahawa kami tidak akan menjadikan bagi kamu masa yang tertentu (untuk melaksanakan apa yang Kami telah janjikan)\".",
      "id": "Dan mereka akan dibawa ke hadapan Tuhanmu dengan berbaris. Sesungguhnya kamu datang kepada Kami, sebagaimana Kami menciptakan kamu pada kali yang pertama; bahkan kamu mengatakan bahwa Kami sekali-kali tidak akan menetapkan bagi kamu waktu (memenuhi) perjanjian.",
      "ar": "وَعُرِضُوا۟ عَلَىٰ رَبِّكَ صَفࣰّا لَّقَدۡ جِئۡتُمُونَا كَمَا خَلَقۡنَـٰكُمۡ أَوَّلَ مَرَّةِۭۚ بَلۡ زَعَمۡتُمۡ أَلَّن نَّجۡعَلَ لَكُم مَّوۡعِدࣰا\n"
    }
  },
  {
    "id": 2189,
    "surahId": 18,
    "ayahNumber": 49,
    "arabicText": "وَوُضِعَ ٱلۡكِتَـٰبُ فَتَرَى ٱلۡمُجۡرِمِینَ مُشۡفِقِینَ مِمَّا فِیهِ وَیَقُولُونَ یَـٰوَیۡلَتَنَا مَالِ هَـٰذَا ٱلۡكِتَـٰبِ لَا یُغَادِرُ صَغِیرَةࣰ وَلَا كَبِیرَةً إِلَّاۤ أَحۡصَىٰهَاۚ وَوَجَدُوا۟ مَا عَمِلُوا۟ حَاضِرࣰاۗ وَلَا یَظۡلِمُ رَبُّكَ أَحَدࣰا\n",
    "translations": {
      "en": "And the record [of everyone's deeds] will be laid open; and thou wilt behold the guilty filled with dread at what [they see] therein; and they will exclaim: \"Oh, woe unto us! What a record is this! It leaves out nothing, be it small or great, but takes everything into account!\" For they will find all that they ever wrought [now] facing them, and [will know that] thy Sustainer does not wrong anyone.",
      "ms": "Dan \"Kitab-kitab Amal\" juga tetap akan dibentangkan, maka engkau akan melihat orang-orang yang berdosa itu, merasa takut akan apa yang tersurat di dalamnya; dan mereka akan berkata:\" Aduhai celakanya kami, mengapa kitab ini demikian keadaannya? Ia tidak meninggalkan yang kecil atau yang besar, melainkan semua dihitungnya!\" Dan mereka dapati segala yang mereka kerjakan itu sedia (tertulis di dalamnya); dan (ingatlah) Tuhanmu tidak berlaku zalim kepada seseorangpun.",
      "id": "Dan diletakkanlah kitab, lalu kamu akan melihat orang-orang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata: \"Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya; dan mereka dapati apa yang telah mereka kerjakan ada (tertulis). Dan Tuhanmu tidak menganiaya seorang juapun\".",
      "ar": "وَوُضِعَ ٱلۡكِتَـٰبُ فَتَرَى ٱلۡمُجۡرِمِینَ مُشۡفِقِینَ مِمَّا فِیهِ وَیَقُولُونَ یَـٰوَیۡلَتَنَا مَالِ هَـٰذَا ٱلۡكِتَـٰبِ لَا یُغَادِرُ صَغِیرَةࣰ وَلَا كَبِیرَةً إِلَّاۤ أَحۡصَىٰهَاۚ وَوَجَدُوا۟ مَا عَمِلُوا۟ حَاضِرࣰاۗ وَلَا یَظۡلِمُ رَبُّكَ أَحَدࣰا\n"
    }
  },
  {
    "id": 2190,
    "surahId": 18,
    "ayahNumber": 50,
    "arabicText": "وَإِذۡ قُلۡنَا لِلۡمَلَـٰۤىِٕكَةِ ٱسۡجُدُوا۟ لِـَٔادَمَ فَسَجَدُوۤا۟ إِلَّاۤ إِبۡلِیسَ كَانَ مِنَ ٱلۡجِنِّ فَفَسَقَ عَنۡ أَمۡرِ رَبِّهِۦۤۗ أَفَتَتَّخِذُونَهُۥ وَذُرِّیَّتَهُۥۤ أَوۡلِیَاۤءَ مِن دُونِی وَهُمۡ لَكُمۡ عَدُوُّۢۚ بِئۡسَ لِلظَّـٰلِمِینَ بَدَلࣰا\n",
    "translations": {
      "en": "AND [remember that] when We told the angels, \"Prostrate yourselves before Adam,\" they all prostrated themselves, save Iblis: he [too] was one of those invisible beings, but then he turned away from his Sustainer's command. Will you, then, take him and his cohorts for (your], masters instead of Me, although they are your foe? How vile an exchange on the evildoers' part!",
      "ms": "Dan (ingatkanlah peristiwa) ketika Kami berfirman kepada malaikat: \"Sujudlah kamu kepada Adam\"; lalu mereka sujud melainkan iblis; ia adalah berasal dari golongan jin, lalu ia menderhaka terhadap perintah Tuhannya. Oleh itu, patutkah kamu hendak menjadikan iblis dan keturunannya sebagai sahabat-sahabat karib yang menjadi pemimpin selain daripadaku? Sedang mereka itu ialah musuh bagi kamu. Amatlah buruknya bagi orang-orang yang zalim: pengganti yang mereka pilih itu.",
      "id": "Dan (ingatlah) ketika Kami berfirman kepada para malaikat: \"Sujudlah kamu kepada Adam, maka sujudlah mereka kecuali Iblis. Dia adalah dari golongan jin, maka ia mendurhakai perintah Tuhannya. Patutkah kamu mengambil dia dan turanan-turunannya sebagai pemimpin selain daripada-Ku, sedang mereka adalah musuhmu? Amat buruklah iblis itu sebagai pengganti (dari Allah) bagi orang-orang yang zalim.",
      "ar": "وَإِذۡ قُلۡنَا لِلۡمَلَـٰۤىِٕكَةِ ٱسۡجُدُوا۟ لِـَٔادَمَ فَسَجَدُوۤا۟ إِلَّاۤ إِبۡلِیسَ كَانَ مِنَ ٱلۡجِنِّ فَفَسَقَ عَنۡ أَمۡرِ رَبِّهِۦۤۗ أَفَتَتَّخِذُونَهُۥ وَذُرِّیَّتَهُۥۤ أَوۡلِیَاۤءَ مِن دُونِی وَهُمۡ لَكُمۡ عَدُوُّۢۚ بِئۡسَ لِلظَّـٰلِمِینَ بَدَلࣰا\n"
    }
  },
  {
    "id": 2191,
    "surahId": 18,
    "ayahNumber": 51,
    "arabicText": "۞ مَّاۤ أَشۡهَدتُّهُمۡ خَلۡقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَلَا خَلۡقَ أَنفُسِهِمۡ وَمَا كُنتُ مُتَّخِذَ ٱلۡمُضِلِّینَ عَضُدࣰا\n",
    "translations": {
      "en": "I did not make them witnesses of the creation of the heavens and the earth, nor of the creation of their own selves; and neither do I [have any need to] take as My helpers those [beings] that lead [men] astray.",
      "ms": "Aku tidak memanggil mereka menyaksi atau membantuKu menciptakan langit dan bumi, dan tidak juga meminta bantuan setengahnya untuk menciptakan setengahnya yang lain; dan tidak sepatutnya Aku mengambil makhluk-makhluk yang menyesatkan itu sebagai pembantu.",
      "id": "Aku tidak menghadirkan mereka (iblis dan anak cucunya) untuk menyaksikan penciptaan langit dan bumi dan tidak (pula) penciptaan diri mereka sendiri; dan tidaklah Aku mengambil orang-orang yang menyesatkan itu sebagai penolong.",
      "ar": "۞ مَّاۤ أَشۡهَدتُّهُمۡ خَلۡقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ وَلَا خَلۡقَ أَنفُسِهِمۡ وَمَا كُنتُ مُتَّخِذَ ٱلۡمُضِلِّینَ عَضُدࣰا\n"
    }
  },
  {
    "id": 2192,
    "surahId": 18,
    "ayahNumber": 52,
    "arabicText": "وَیَوۡمَ یَقُولُ نَادُوا۟ شُرَكَاۤءِیَ ٱلَّذِینَ زَعَمۡتُمۡ فَدَعَوۡهُمۡ فَلَمۡ یَسۡتَجِیبُوا۟ لَهُمۡ وَجَعَلۡنَا بَیۡنَهُم مَّوۡبِقࣰا\n",
    "translations": {
      "en": "Hence, [bear in mind] the Day on which He will say, \"Call [now] unto those beings whom you imagined to have a share in My divinity!\" - whereupon they will invoke them, but those [beings] will not respond to them: for We shall have placed between them an unbridgeable gulf.",
      "ms": "Dan (ingatkanlah) masa Allah berfirman: \"Panggilah sekutu-sekutuKu yang kamu katakan itu (untuk menolong kamu); lalu mereka memanggilnya, tetapi sia-sia sahaja, kerana makhluk-makhluk itu tidak menyahut seruan mereka: dan kami jadikan untuk mereka bersama sebuah tempat azab yang membinasakan.",
      "id": "Dan (ingatlah) akan hari (yang ketika itu) Dia berfirman: \"Serulah olehmu sekalian sekutu-sekutu-Ku yang kamu katakan itu\". Mereka lalu memanggilnya tetapi sekutu-sekutu itu tidak membalas seruan mereka dan Kami adakan untuk mereka tempat kebinasaan (neraka).",
      "ar": "وَیَوۡمَ یَقُولُ نَادُوا۟ شُرَكَاۤءِیَ ٱلَّذِینَ زَعَمۡتُمۡ فَدَعَوۡهُمۡ فَلَمۡ یَسۡتَجِیبُوا۟ لَهُمۡ وَجَعَلۡنَا بَیۡنَهُم مَّوۡبِقࣰا\n"
    }
  },
  {
    "id": 2193,
    "surahId": 18,
    "ayahNumber": 53,
    "arabicText": "وَرَءَا ٱلۡمُجۡرِمُونَ ٱلنَّارَ فَظَنُّوۤا۟ أَنَّهُم مُّوَاقِعُوهَا وَلَمۡ یَجِدُوا۟ عَنۡهَا مَصۡرِفࣰا\n",
    "translations": {
      "en": "And those who were lost in sin will behold the fire, and will know that they are bound to fall into it, and will find no way of escape therefrom.",
      "ms": "Dan orang-orang yang berdosa itu tetap akan melihat neraka, maka yakinlah mereka, bahawa mereka akan jatuh ke dalamnya dan mereka tidak akan mendapati sebarang jalan untuk mengelakkan diri daripadanya.",
      "id": "Dan orang-orang yang berdosa melihat neraka, maka mereka meyakini, bahwa mereka akan jatuh ke dalamnya dan mereka tidak menemukan tempat berpaling dari padanya.",
      "ar": "وَرَءَا ٱلۡمُجۡرِمُونَ ٱلنَّارَ فَظَنُّوۤا۟ أَنَّهُم مُّوَاقِعُوهَا وَلَمۡ یَجِدُوا۟ عَنۡهَا مَصۡرِفࣰا\n"
    }
  },
  {
    "id": 2194,
    "surahId": 18,
    "ayahNumber": 54,
    "arabicText": "وَلَقَدۡ صَرَّفۡنَا فِی هَـٰذَا ٱلۡقُرۡءَانِ لِلنَّاسِ مِن كُلِّ مَثَلࣲۚ وَكَانَ ٱلۡإِنسَـٰنُ أَكۡثَرَ شَیۡءࣲ جَدَلࣰا\n",
    "translations": {
      "en": "THUS, INDEED, have We given in this Qur'an many facets to every kind of lesson [designed] for [the benefit of] mankind. However, man is, above all else, always given to contention:",
      "ms": "Dan demi sesungguhnya Kami telah huraikan dengan berbagai-bagai cara di dalam Al-Quran ini untuk umat manusia, dari segala jenis contoh bandingan; dan sememangnya manusia itu, sejenis makhluk yang banyak sekali bantahannya.",
      "id": "Dan sesungguhnya Kami telah mengulang-ulangi bagi manusia dalam Al Quran ini bermacam-macam perumpamaan. Dan manusia adalah makhluk yang paling banyak membantah.",
      "ar": "وَلَقَدۡ صَرَّفۡنَا فِی هَـٰذَا ٱلۡقُرۡءَانِ لِلنَّاسِ مِن كُلِّ مَثَلࣲۚ وَكَانَ ٱلۡإِنسَـٰنُ أَكۡثَرَ شَیۡءࣲ جَدَلࣰا\n"
    }
  },
  {
    "id": 2195,
    "surahId": 18,
    "ayahNumber": 55,
    "arabicText": "وَمَا مَنَعَ ٱلنَّاسَ أَن یُؤۡمِنُوۤا۟ إِذۡ جَاۤءَهُمُ ٱلۡهُدَىٰ وَیَسۡتَغۡفِرُوا۟ رَبَّهُمۡ إِلَّاۤ أَن تَأۡتِیَهُمۡ سُنَّةُ ٱلۡأَوَّلِینَ أَوۡ یَأۡتِیَهُمُ ٱلۡعَذَابُ قُبُلࣰا\n",
    "translations": {
      "en": "for, what is there to keep people from attaining to faith now that guidance has come unto them, and from asking their Sustainer to forgive them their sins - unless it be [their wish] that the fate of the [sinful] people of ancient times should befall them [as well], or that the [ultimate] suffering should befall them in the hereafter?",
      "ms": "Dan tiada yang menghalang manusia daripada beriman, ketika datang petunjuk Al-Quran kepada mereka, dan daripada memohon ampun kepada Tuhan mereka, melainkan (kerana kedegilan mereka dan kerana mereka) menunggu didatangi azab yang memusnahkan yang telah menimpa orang-orang dahulu, atau di datangi azab yang dilihat dan dihadapi.",
      "id": "Dam tidak ada sesuatupun yang menghalangi manusia dari beriman, ketika petunjuk telah datang kepada mereka, dan dari memohon ampun kepada Tuhannya, kecuali (keinginan menanti) datangnya hukum (Allah yang telah berlalu pada) umat-umat yang dahulu atau datangnya azab atas mereka dengan nyata.",
      "ar": "وَمَا مَنَعَ ٱلنَّاسَ أَن یُؤۡمِنُوۤا۟ إِذۡ جَاۤءَهُمُ ٱلۡهُدَىٰ وَیَسۡتَغۡفِرُوا۟ رَبَّهُمۡ إِلَّاۤ أَن تَأۡتِیَهُمۡ سُنَّةُ ٱلۡأَوَّلِینَ أَوۡ یَأۡتِیَهُمُ ٱلۡعَذَابُ قُبُلࣰا\n"
    }
  },
  {
    "id": 2196,
    "surahId": 18,
    "ayahNumber": 56,
    "arabicText": "وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِینَ إِلَّا مُبَشِّرِینَ وَمُنذِرِینَۚ وَیُجَـٰدِلُ ٱلَّذِینَ كَفَرُوا۟ بِٱلۡبَـٰطِلِ لِیُدۡحِضُوا۟ بِهِ ٱلۡحَقَّۖ وَٱتَّخَذُوۤا۟ ءَایَـٰتِی وَمَاۤ أُنذِرُوا۟ هُزُوࣰا\n",
    "translations": {
      "en": "But We send [Our] message-bearers only as heralds of glad tidings and as warners - whereas those who are bent on denying the truth contend [against them] with fallacious arguments, so as to render void the truth thereby, and to make My messages and warnings a target of their mockery.",
      "ms": "Dan tidak Kami mengutus Rasul-rasul, melainkan sebagai pemberi berita gembira dan pemberi amaran; dan orang-orang yang kafir membantah dengan alasan yang salah untuk menghapuskan kebenaran dengan bantahan itu; dan mereka jadikan ayat-ayatku, dan amaran yang diberikan kepada mereka sebagai ejek-ejekan.",
      "id": "Dan tidaklah Kami mengutus rasul-rasul hanyalah sebagai pembawa berita gembira dan sebagai pemberi peringatan; tetapi orang-orang yang kafir membantah dengan yang batil agar dengan demikian mereka dapat melenyap kan yang hak, dan mereka menganggap ayat-ayat kami dan peringatan-peringatan terhadap mereka sebagai olok-olokan.",
      "ar": "وَمَا نُرۡسِلُ ٱلۡمُرۡسَلِینَ إِلَّا مُبَشِّرِینَ وَمُنذِرِینَۚ وَیُجَـٰدِلُ ٱلَّذِینَ كَفَرُوا۟ بِٱلۡبَـٰطِلِ لِیُدۡحِضُوا۟ بِهِ ٱلۡحَقَّۖ وَٱتَّخَذُوۤا۟ ءَایَـٰتِی وَمَاۤ أُنذِرُوا۟ هُزُوࣰا\n"
    }
  },
  {
    "id": 2197,
    "surahId": 18,
    "ayahNumber": 57,
    "arabicText": "وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِـَٔایَـٰتِ رَبِّهِۦ فَأَعۡرَضَ عَنۡهَا وَنَسِیَ مَا قَدَّمَتۡ یَدَاهُۚ إِنَّا جَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن یَفۡقَهُوهُ وَفِیۤ ءَاذَانِهِمۡ وَقۡرࣰاۖ وَإِن تَدۡعُهُمۡ إِلَى ٱلۡهُدَىٰ فَلَن یَهۡتَدُوۤا۟ إِذًا أَبَدࣰا\n",
    "translations": {
      "en": "And who could be more wicked than he to whom his Sustainer's messages are conveyed and who thereupon turns away from them, forgetting all [the evil] that his hands may have wrought? Behold, over their hearts have We laid veils which prevent them from grasping the truth, and into their ears, deafness; and though thou call them onto the right path, they will never allow themselves to be guided.",
      "ms": "Dan tidaklah ada yang lebih zalim daripada orang yang diberi ingat dengan ayat-ayat Tuhannya, lalu ia berpaling daripadanya dan lupa akan apa yang telah dilakukan oleh kedua tangannya; sesungguhnya (disebabkan bawaan mereka yang buruk itu) Kami jadikan tutupan berlapis-lapis atas hati mereka, menghalang mereka daripada memahaminya, dan (Kami jadikan) pada telinga mereka penyumbat (yang menyebabkan mereka pekak). Dan jika engkau menyeru mereka kepada petunjuk, maka dengan keadaan yang demikian, mereka tidak sekali-kali akan beroleh hidayah petunjuk selama-lamanya.",
      "id": "Dan siapakah yang lebih zalim dari pada orang yang telah diperingatkan dengan ayat-ayat Tuhannya lalu dia berpaling dari padanya dan melupakan apa yang telah dikerjakan oleh kedua tangannya? Sesungguhnya Kami telah meletakkan tutupan di atas hati mereka, (sehingga mereka tidak) memahaminya, dan (Kami letakkan pula) sumbatan di telinga mereka; dan kendatipun kamu menyeru mereka kepada petunjuk, niscaya mereka tidak akan mendapat petunjuk selama-lamanya.",
      "ar": "وَمَنۡ أَظۡلَمُ مِمَّن ذُكِّرَ بِـَٔایَـٰتِ رَبِّهِۦ فَأَعۡرَضَ عَنۡهَا وَنَسِیَ مَا قَدَّمَتۡ یَدَاهُۚ إِنَّا جَعَلۡنَا عَلَىٰ قُلُوبِهِمۡ أَكِنَّةً أَن یَفۡقَهُوهُ وَفِیۤ ءَاذَانِهِمۡ وَقۡرࣰاۖ وَإِن تَدۡعُهُمۡ إِلَى ٱلۡهُدَىٰ فَلَن یَهۡتَدُوۤا۟ إِذًا أَبَدࣰا\n"
    }
  },
  {
    "id": 2198,
    "surahId": 18,
    "ayahNumber": 58,
    "arabicText": "وَرَبُّكَ ٱلۡغَفُورُ ذُو ٱلرَّحۡمَةِۖ لَوۡ یُؤَاخِذُهُم بِمَا كَسَبُوا۟ لَعَجَّلَ لَهُمُ ٱلۡعَذَابَۚ بَل لَّهُم مَّوۡعِدࣱ لَّن یَجِدُوا۟ مِن دُونِهِۦ مَوۡىِٕلࣰا\n",
    "translations": {
      "en": "Yet, [withal,] thy Sustainer is the Truly-Forgiving One, limitless in His grace. Were He to take them [at once] to task for whatever [wrong] they commit, He would indeed bring about their speedy punishment [then and there]: but nay, they have a time-limit beyond which they shall find no redemption",
      "ms": "Dan Tuhanmu Maha Pengampun, lagi melimpah-limpah rahmatnya. Jika Ia mahu menyeksa mereka (di dunia) disebabkan apa yang mereka telah usahakan, tentulah Ia akan menyegerakan azab itu menimpa mereka; (tetapi Ia tidak berbuat demikian) bahkan ditentukan bagi mereka satu masa yang mereka tidak sekali-kali akan dapat sebarang tempat perlindungan, yang ialah daripadanya.",
      "id": "Dan Tuhanmulah yang Maha Pengampun, lagi mempunyai rahmat. Jika Dia mengazab mereka karena perbuatan mereka, tentu Dia akan menyegerakan azab bagi mereka. Tetapi bagi mereka ada waktu yang tertentu (untuk mendapat azab) yang mereka sekali-kali tidak akan menemukan tempat berlindung dari padanya.",
      "ar": "وَرَبُّكَ ٱلۡغَفُورُ ذُو ٱلرَّحۡمَةِۖ لَوۡ یُؤَاخِذُهُم بِمَا كَسَبُوا۟ لَعَجَّلَ لَهُمُ ٱلۡعَذَابَۚ بَل لَّهُم مَّوۡعِدࣱ لَّن یَجِدُوا۟ مِن دُونِهِۦ مَوۡىِٕلࣰا\n"
    }
  },
  {
    "id": 2199,
    "surahId": 18,
    "ayahNumber": 59,
    "arabicText": "وَتِلۡكَ ٱلۡقُرَىٰۤ أَهۡلَكۡنَـٰهُمۡ لَمَّا ظَلَمُوا۟ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدࣰا\n",
    "translations": {
      "en": "as [was the case with all] those communities that We destroyed when they went on and on doing wrong: for We had set a time-limit for their destruction.",
      "ms": "Dan penduduk negeri-negeri (yang derhaka) itu Kami telah binasakan ketika mereka melakukan kezaliman, dan Kami telah tetapkan satu masa yang tertentu bagi kebinasaan mereka.",
      "id": "Dan (penduduk) negeri telah Kami binasakan ketika mereka berbuat zalim, dan telah Kami tetapkan waktu tertentu bagi kebinasaan mereka.",
      "ar": "وَتِلۡكَ ٱلۡقُرَىٰۤ أَهۡلَكۡنَـٰهُمۡ لَمَّا ظَلَمُوا۟ وَجَعَلۡنَا لِمَهۡلِكِهِم مَّوۡعِدࣰا\n"
    }
  },
  {
    "id": 2200,
    "surahId": 18,
    "ayahNumber": 60,
    "arabicText": "وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَاۤ أَبۡرَحُ حَتَّىٰۤ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَیۡنِ أَوۡ أَمۡضِیَ حُقُبࣰا\n",
    "translations": {
      "en": "AND LO! [In the course of his wanderings,] Moses said to his servant: \"I shall not give up until I reach the junction of the two seas, even if I [have to] spend untold years [in my quest]!\"",
      "ms": "Dan (ingatkanlah peristiwa) ketika Nabi Musa berkata kepada temannya: \"Aku tidak akan berhenti berjalan sehingga aku sampai di tempat pertemuan dua laut itu atau aku berjalan terus bertahun-tahun\".",
      "id": "Dan (ingatlah) ketika Musa berkata kepada muridnya: \"Aku tidak akan berhenti (berjalan) sebelum sampai ke pertemuan dua buah lautan; atau aku akan berjalan sampai bertahun-tahun\".",
      "ar": "وَإِذۡ قَالَ مُوسَىٰ لِفَتَىٰهُ لَاۤ أَبۡرَحُ حَتَّىٰۤ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَیۡنِ أَوۡ أَمۡضِیَ حُقُبࣰا\n"
    }
  },
  {
    "id": 2201,
    "surahId": 18,
    "ayahNumber": 61,
    "arabicText": "فَلَمَّا بَلَغَا مَجۡمَعَ بَیۡنِهِمَا نَسِیَا حُوتَهُمَا فَٱتَّخَذَ سَبِیلَهُۥ فِی ٱلۡبَحۡرِ سَرَبࣰا\n",
    "translations": {
      "en": "But when they reached the junction between the two [seas], they forgot all about their fish, and it took its way into the sea and disappeared from sight.",
      "ms": "Maka apabila mereka berdua sampai ke tempat pertemuan dua laut itu, lupalah mereka akan hal ikan mereka, lalu ikan itu menggelunsur menempuh jalannya di laut, yang merupakan lorong di bawah tanah.",
      "id": "Maka tatkala mereka sampai ke pertemuan dua buah laut itu, mereka lalai akan ikannya, lalu ikan itu melompat mengambil jalannya ke laut itu.",
      "ar": "فَلَمَّا بَلَغَا مَجۡمَعَ بَیۡنِهِمَا نَسِیَا حُوتَهُمَا فَٱتَّخَذَ سَبِیلَهُۥ فِی ٱلۡبَحۡرِ سَرَبࣰا\n"
    }
  },
  {
    "id": 2202,
    "surahId": 18,
    "ayahNumber": 62,
    "arabicText": "فَلَمَّا جَاوَزَا قَالَ لِفَتَىٰهُ ءَاتِنَا غَدَاۤءَنَا لَقَدۡ لَقِینَا مِن سَفَرِنَا هَـٰذَا نَصَبࣰا\n",
    "translations": {
      "en": "And after the two had walked some distance, [Moses] said to his servant: \"Bring us our mid-day meal; we have indeed suffered hardship on this [day of] our journey!\"",
      "ms": "Setelah mereka melampaui (tempat itu), berkatalah Nabi Musa kepada temannya: \"Bawalah makan tengah hari kita sebenarnya kita telah mengalami penat lelah dalam perjalanan kita ini\".",
      "id": "Maka tatkala mereka berjalan lebih jauh, berkatalah Musa kepada muridnya: \"Bawalah kemari makanan kita; sesungguhnya kita telah merasa letih karena perjalanan kita ini\".",
      "ar": "فَلَمَّا جَاوَزَا قَالَ لِفَتَىٰهُ ءَاتِنَا غَدَاۤءَنَا لَقَدۡ لَقِینَا مِن سَفَرِنَا هَـٰذَا نَصَبࣰا\n"
    }
  },
  {
    "id": 2203,
    "surahId": 18,
    "ayahNumber": 63,
    "arabicText": "قَالَ أَرَءَیۡتَ إِذۡ أَوَیۡنَاۤ إِلَى ٱلصَّخۡرَةِ فَإِنِّی نَسِیتُ ٱلۡحُوتَ وَمَاۤ أَنسَىٰنِیهُ إِلَّا ٱلشَّیۡطَـٰنُ أَنۡ أَذۡكُرَهُۥۚ وَٱتَّخَذَ سَبِیلَهُۥ فِی ٱلۡبَحۡرِ عَجَبࣰا\n",
    "translations": {
      "en": "Said [the servant]: \"Wouldst thou believe it? When we betook ourselves to that rock for a rest, behold, I forgot about the fish-and none but Satan made me thus forget it - and it took its way into the sea! How strange!\"",
      "ms": "Temannya berkata: \"Tahukah apa yang telah terjadi ketika kita berehat di batu besar itu? Sebenarnya aku lupakan hal ikan itu; dan tiadalah yang menyebabkan aku lupa daripada menyebutkan halnya kepadamu melainkan Syaitan; dan ikan itu telah menggelunsur menempuh jalannya di laut, dengan cara yang menakjubkan\".",
      "id": "Muridnya menjawab: \"Tahukah kamu tatkala kita mencari tempat berlindung di batu tadi, maka sesungguhnya aku lupa (menceritakan tentang) ikan itu dan tidak adalah yang melupakan aku untuk menceritakannya kecuali syaitan dan ikan itu mengambil jalannya ke laut dengan cara yang aneh sekali\".",
      "ar": "قَالَ أَرَءَیۡتَ إِذۡ أَوَیۡنَاۤ إِلَى ٱلصَّخۡرَةِ فَإِنِّی نَسِیتُ ٱلۡحُوتَ وَمَاۤ أَنسَىٰنِیهُ إِلَّا ٱلشَّیۡطَـٰنُ أَنۡ أَذۡكُرَهُۥۚ وَٱتَّخَذَ سَبِیلَهُۥ فِی ٱلۡبَحۡرِ عَجَبࣰا\n"
    }
  },
  {
    "id": 2204,
    "surahId": 18,
    "ayahNumber": 64,
    "arabicText": "قَالَ ذَ ٰ⁠لِكَ مَا كُنَّا نَبۡغِۚ فَٱرۡتَدَّا عَلَىٰۤ ءَاثَارِهِمَا قَصَصࣰا\n",
    "translations": {
      "en": "[Moses] exclaimed: \"That [was the place] which we were seeking!, And the two turned back, retracing their footsetps,",
      "ms": "Nabi Musa berkata: \"Itulah yang kita kehendaki \"; merekapun balik semula ke situ, dengan menurut jejak mereka.",
      "id": "Musa berkata: \"Itulah (tempat) yang kita cari\". Lalu keduanya kembali, mengikuti jejak mereka semula.",
      "ar": "قَالَ ذَ ٰ⁠لِكَ مَا كُنَّا نَبۡغِۚ فَٱرۡتَدَّا عَلَىٰۤ ءَاثَارِهِمَا قَصَصࣰا\n"
    }
  },
  {
    "id": 2205,
    "surahId": 18,
    "ayahNumber": 65,
    "arabicText": "فَوَجَدَا عَبۡدࣰا مِّنۡ عِبَادِنَاۤ ءَاتَیۡنَـٰهُ رَحۡمَةࣰ مِّنۡ عِندِنَا وَعَلَّمۡنَـٰهُ مِن لَّدُنَّا عِلۡمࣰا\n",
    "translations": {
      "en": "and found one of Our servants, on whom We had bestowed grace from Ourselves and unto whom We had imparted knowledge [issuing] from Ourselves.",
      "ms": "Lalu mereka dapati seorang dari hamba-hamba Kami yang telah kami kurniakan kepadanya rahmat dari Kami, dan Kami telah mengajarnya sejenis ilmu; dari sisi Kami.",
      "id": "Lalu mereka bertemu dengan seorang hamba di antara hamba-hamba Kami, yang telah Kami berikan kepadanya rahmat dari sisi Kami, dan yang telah Kami ajarkan kepadanya ilmu dari sisi Kami.",
      "ar": "فَوَجَدَا عَبۡدࣰا مِّنۡ عِبَادِنَاۤ ءَاتَیۡنَـٰهُ رَحۡمَةࣰ مِّنۡ عِندِنَا وَعَلَّمۡنَـٰهُ مِن لَّدُنَّا عِلۡمࣰا\n"
    }
  },
  {
    "id": 2206,
    "surahId": 18,
    "ayahNumber": 66,
    "arabicText": "قَالَ لَهُۥ مُوسَىٰ هَلۡ أَتَّبِعُكَ عَلَىٰۤ أَن تُعَلِّمَنِ مِمَّا عُلِّمۡتَ رُشۡدࣰا\n",
    "translations": {
      "en": "Moses said unto him: \"May I follow thee on the understanding that thou wilt impart to me something of that consciousness of what is right which has been imparted to thee?\"",
      "ms": "Nabi Musa berkata kepadanya: Bolehkah aku mengikutmu, dengan syarat engkau mengajarku dari apa yang telah diajarkan oleh Allah kepadamu, ilmu yang menjadi petunjuk bagiku?\"",
      "id": "Musa berkata kepada Khidhr: \"Bolehkah aku mengikutimu supaya kamu mengajarkan kepadaku ilmu yang benar di antara ilmu-ilmu yang telah diajarkan kepadamu?\"",
      "ar": "قَالَ لَهُۥ مُوسَىٰ هَلۡ أَتَّبِعُكَ عَلَىٰۤ أَن تُعَلِّمَنِ مِمَّا عُلِّمۡتَ رُشۡدࣰا\n"
    }
  },
  {
    "id": 2207,
    "surahId": 18,
    "ayahNumber": 67,
    "arabicText": "قَالَ إِنَّكَ لَن تَسۡتَطِیعَ مَعِیَ صَبۡرࣰا\n",
    "translations": {
      "en": "[The other] answered: \"Behold, thou wilt never be able to have patience with me –",
      "ms": "Ia menjawab: \"Sesungguhnya engkau (wahai Musa), tidak sekali-kali akan dapat bersabar bersamaku.",
      "id": "Dia menjawab: \"Sesungguhnya kamu sekali-kali tidak akan sanggup sabar bersama aku.",
      "ar": "قَالَ إِنَّكَ لَن تَسۡتَطِیعَ مَعِیَ صَبۡرࣰا\n"
    }
  },
  {
    "id": 2208,
    "surahId": 18,
    "ayahNumber": 68,
    "arabicText": "وَكَیۡفَ تَصۡبِرُ عَلَىٰ مَا لَمۡ تُحِطۡ بِهِۦ خُبۡرࣰا\n",
    "translations": {
      "en": "for how couldst thou be patient about something that thou canst not comprehend within the compass of (thy] experience?\"",
      "ms": "Dan bagaimana engkau akan sabar terhadap perkara yang engkau tidak mengetahuinya secara meliputi?",
      "id": "Dan bagaimana kamu dapat sabar atas sesuatu, yang kamu belum mempunyai pengetahuan yang cukup tentang hal itu?\"",
      "ar": "وَكَیۡفَ تَصۡبِرُ عَلَىٰ مَا لَمۡ تُحِطۡ بِهِۦ خُبۡرࣰا\n"
    }
  },
  {
    "id": 2209,
    "surahId": 18,
    "ayahNumber": 69,
    "arabicText": "قَالَ سَتَجِدُنِیۤ إِن شَاۤءَ ٱللَّهُ صَابِرࣰا وَلَاۤ أَعۡصِی لَكَ أَمۡرࣰا\n",
    "translations": {
      "en": "Replied [Moses]: \"Thou wilt find me patient, if God so wills; and I shall not disobey thee in anything!\"",
      "ms": "Nabi Musa berkata: \"Engkau akan dapati aku, Insyaa Allah: orang yang sabar; dan aku tidak akan membantah sebarang perintahmu\".",
      "id": "Musa berkata: \"Insya Allah kamu akan mendapati aku sebagai orang yang sabar, dan aku tidak akan menentangmu dalam sesuatu urusanpun\".",
      "ar": "قَالَ سَتَجِدُنِیۤ إِن شَاۤءَ ٱللَّهُ صَابِرࣰا وَلَاۤ أَعۡصِی لَكَ أَمۡرࣰا\n"
    }
  },
  {
    "id": 2210,
    "surahId": 18,
    "ayahNumber": 70,
    "arabicText": "قَالَ فَإِنِ ٱتَّبَعۡتَنِی فَلَا تَسۡـَٔلۡنِی عَن شَیۡءٍ حَتَّىٰۤ أُحۡدِثَ لَكَ مِنۡهُ ذِكۡرࣰا\n",
    "translations": {
      "en": "Said [the sage]: \"Well, then, if thou art to follow me, do not question me about aught [that I may do] until I myself give thee an account thereof.\"",
      "ms": "Ia menjawab: \"Sekiranya engkau mengikutku, maka janganlah engkau bertanya kepadaku akan sesuatupun sehingga aku ceritakan halnya kepadamu\".",
      "id": "Dia berkata: \"Jika kamu mengikutiku, maka janganlah kamu menanyakan kepadaku tentang sesuatu apapun, sampai aku sendiri menerangkannya kepadamu\".",
      "ar": "قَالَ فَإِنِ ٱتَّبَعۡتَنِی فَلَا تَسۡـَٔلۡنِی عَن شَیۡءٍ حَتَّىٰۤ أُحۡدِثَ لَكَ مِنۡهُ ذِكۡرࣰا\n"
    }
  },
  {
    "id": 2211,
    "surahId": 18,
    "ayahNumber": 71,
    "arabicText": "فَٱنطَلَقَا حَتَّىٰۤ إِذَا رَكِبَا فِی ٱلسَّفِینَةِ خَرَقَهَاۖ قَالَ أَخَرَقۡتَهَا لِتُغۡرِقَ أَهۡلَهَا لَقَدۡ جِئۡتَ شَیۡـًٔا إِمۡرࣰا\n",
    "translations": {
      "en": "And so the two went on their way, till (they reached the seashore; and] when they disembarked from the boat [that had ferried them across], the sage made a hole in it-[whereupon Moses] exclaimed: \"Hast thou made a hole in it in order to drown the people who may be [travelling] in it? Indeed, thou hast done a grievous thing!\"",
      "ms": "Lalu berjalanlah keduanya sehingga apabila mereka naik ke sebuah perahu, ia membocorkannya. Nabi Musa berkata: \"Patutkah engkau membocorkannya sedang akibat perbuatan itu menenggelamkan penumpang-penumpangnya? Sesungguhnya engkau telah melakukan satu perkara yang besar\".",
      "id": "Maka berjalanlah keduanya, hingga tatkala keduanya menaiki perahu lalu Khidhr melobanginya. Musa berkata: \"Mengapa kamu melobangi perahu itu akibatnya kamu menenggelamkan penumpangnya?\" Sesungguhnya kamu telah berbuat sesuatu kesalahan yang besar.",
      "ar": "فَٱنطَلَقَا حَتَّىٰۤ إِذَا رَكِبَا فِی ٱلسَّفِینَةِ خَرَقَهَاۖ قَالَ أَخَرَقۡتَهَا لِتُغۡرِقَ أَهۡلَهَا لَقَدۡ جِئۡتَ شَیۡـًٔا إِمۡرࣰا\n"
    }
  },
  {
    "id": 2212,
    "surahId": 18,
    "ayahNumber": 72,
    "arabicText": "قَالَ أَلَمۡ أَقُلۡ إِنَّكَ لَن تَسۡتَطِیعَ مَعِیَ صَبۡرࣰا\n",
    "translations": {
      "en": "He replied: \"Did I not tell thee that thou wilt never be able to have patience with me?\"",
      "ms": "Ia menjawab: \"Bukankah aku telah katakan, bahawa engkau tidak sekali-kali akan dapat bersabar bersamaku?\"",
      "id": "Dia (Khidhr) berkata: \"Bukankah aku telah berkata: \"Sesungguhnya kamu sekali-kali tidak akan sabar bersama dengan aku\".",
      "ar": "قَالَ أَلَمۡ أَقُلۡ إِنَّكَ لَن تَسۡتَطِیعَ مَعِیَ صَبۡرࣰا\n"
    }
  },
  {
    "id": 2213,
    "surahId": 18,
    "ayahNumber": 73,
    "arabicText": "قَالَ لَا تُؤَاخِذۡنِی بِمَا نَسِیتُ وَلَا تُرۡهِقۡنِی مِنۡ أَمۡرِی عُسۡرࣰا\n",
    "translations": {
      "en": "Said [Moses]: \"Take-me not to task for my having forgotten [myself], and be not hard on me on account of what I have done!\"",
      "ms": "Nabi Musa berkata: \"Janganlah engkau marah akan daku disebabkan aku lupa (akan syaratmu); dan janganlah engkau memberati daku dengan sebarang kesukaran dalam urusanku (menuntut ilmu)\".",
      "id": "Musa berkata: \"Janganlah kamu menghukum aku karena kelupaanku dan janganlah kamu membebani aku dengan sesuatu kesulitan dalam urusanku\".",
      "ar": "قَالَ لَا تُؤَاخِذۡنِی بِمَا نَسِیتُ وَلَا تُرۡهِقۡنِی مِنۡ أَمۡرِی عُسۡرࣰا\n"
    }
  },
  {
    "id": 2214,
    "surahId": 18,
    "ayahNumber": 74,
    "arabicText": "فَٱنطَلَقَا حَتَّىٰۤ إِذَا لَقِیَا غُلَـٰمࣰا فَقَتَلَهُۥ قَالَ أَقَتَلۡتَ نَفۡسࣰا زَكِیَّةَۢ بِغَیۡرِ نَفۡسࣲ لَّقَدۡ جِئۡتَ شَیۡـࣰٔا نُّكۡرࣰا\n",
    "translations": {
      "en": "And so the two went on, till, when they met a young man, [the sage] slew him -(whereupon Moses] exclaimed: \"Hast thou slain an innocent human being without [his having taken] another man's life? Indeed, thou hast done a terrible thing!\"",
      "ms": "Kemudian keduanya berjalan lagi sehingga apabila mereka bertemu dengan seorang pemuda lalu ia membunuhnya. Nabi Musa berkata \"Patutkah engkau membunuh satu jiwa yang bersih, yang tidak berdosa membunuh orang? Sesungguhnya engkau telah melakukan satu perbuatan yang mungkar!\"",
      "id": "Maka berjalanlah keduanya; hingga tatkala keduanya berjumpa dengan seorang anak, maka Khidhr membunuhnya. Musa berkata: \"Mengapa kamu membunuh jiwa yang bersih, bukan karena dia membunuh orang lain? Sesungguhnya kamu telah melakukan suatu yang mungkar\".",
      "ar": "فَٱنطَلَقَا حَتَّىٰۤ إِذَا لَقِیَا غُلَـٰمࣰا فَقَتَلَهُۥ قَالَ أَقَتَلۡتَ نَفۡسࣰا زَكِیَّةَۢ بِغَیۡرِ نَفۡسࣲ لَّقَدۡ جِئۡتَ شَیۡـࣰٔا نُّكۡرࣰا\n"
    }
  },
  {
    "id": 2215,
    "surahId": 18,
    "ayahNumber": 75,
    "arabicText": "۞ قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِیعَ مَعِیَ صَبۡرࣰا\n",
    "translations": {
      "en": "He replied: \"Did I not tell thee that thou wilt never be able to have patience with me?\"",
      "ms": "Ia menjawab: \"Bukankah, aku telah katakan kepadamu, bahawa engkau tidak sekali-kali akan dapat bersabar bersamaku?\"",
      "id": "Khidhr berkata: \"Bukankah sudah kukatakan kepadamu, bahwa sesungguhnya kamu tidak akan dapat sabar bersamaku?\"",
      "ar": "۞ قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِیعَ مَعِیَ صَبۡرࣰا\n"
    }
  },
  {
    "id": 2216,
    "surahId": 18,
    "ayahNumber": 76,
    "arabicText": "قَالَ إِن سَأَلۡتُكَ عَن شَیۡءِۭ بَعۡدَهَا فَلَا تُصَـٰحِبۡنِیۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّی عُذۡرࣰا\n",
    "translations": {
      "en": "Said [Moses]: \"If, after this, I should ever question thee, keep me not in thy company: [for by] now thou hast heard enough excuses from me.\"",
      "ms": "Nabi Musa berkata: \"Jika aku bertanya kepadamu tentang sebarang perkara sesudah ini, maka janganlah engkau jadikan daku sahabatmu lagi; sesungguhnya engkau telah cukup mendapat alasan-alasan berbuat demikian disebabkan pertanyaan-pertanyaan dan bantahanku\".",
      "id": "Musa berkata: \"Jika aku bertanya kepadamu tentang sesuatu sesudah (kali) ini, maka janganlah kamu memperbolehkan aku menyertaimu, sesungguhnya kamu sudah cukup memberikan uzur padaku\".",
      "ar": "قَالَ إِن سَأَلۡتُكَ عَن شَیۡءِۭ بَعۡدَهَا فَلَا تُصَـٰحِبۡنِیۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّی عُذۡرࣰا\n"
    }
  },
  {
    "id": 2217,
    "surahId": 18,
    "ayahNumber": 77,
    "arabicText": "فَٱنطَلَقَا حَتَّىٰۤ إِذَاۤ أَتَیَاۤ أَهۡلَ قَرۡیَةٍ ٱسۡتَطۡعَمَاۤ أَهۡلَهَا فَأَبَوۡا۟ أَن یُضَیِّفُوهُمَا فَوَجَدَا فِیهَا جِدَارࣰا یُرِیدُ أَن یَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَیۡهِ أَجۡرࣰا\n",
    "translations": {
      "en": "And so the two went on, till, when they came upon some village people, they asked them for food; but those [people] refused them all hospitality. And they saw in that (village] a wall which was on the point of tumbling down, and [the sage] rebuilt it [whereupon Moses] said: \"Hadst thou so wished, surely thou couldst [at least] have obtained some payment for it?\"",
      "ms": "Kemudian keduanya berjalan lagi, sehingga apabila mereka sampai kepada penduduk sebuah bandar, mereka meminta makan kepada orang-orang di situ, lalu orang-orang itu enggan menjamu mereka. Kemudian mereka dapati di situ sebuah tembok yang hendak runtuh, lalu ia membinanya. Nabi Musa berkata: \"Jika engkau mahu, tentulah engkau berhak mengambil upah mengenainya!\"",
      "id": "Maka keduanya berjalan; hingga tatkala keduanya sampai kepada penduduk suatu negeri, mereka minta dijamu kepada penduduk negeri itu, tetapi penduduk negeri itu tidak mau menjamu mereka, kemudian keduanya mendapatkan dalam negeri itu dinding rumah yang hampir roboh, maka Khidhr menegakkan dinding itu. Musa berkata: \"Jikalau kamu mau, niscaya kamu mengambil upah untuk itu\".",
      "ar": "فَٱنطَلَقَا حَتَّىٰۤ إِذَاۤ أَتَیَاۤ أَهۡلَ قَرۡیَةٍ ٱسۡتَطۡعَمَاۤ أَهۡلَهَا فَأَبَوۡا۟ أَن یُضَیِّفُوهُمَا فَوَجَدَا فِیهَا جِدَارࣰا یُرِیدُ أَن یَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَیۡهِ أَجۡرࣰا\n"
    }
  },
  {
    "id": 2218,
    "surahId": 18,
    "ayahNumber": 78,
    "arabicText": "قَالَ هَـٰذَا فِرَاقُ بَیۡنِی وَبَیۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِیلِ مَا لَمۡ تَسۡتَطِع عَّلَیۡهِ صَبۡرًا\n",
    "translations": {
      "en": "[The sage] replied: \"This is the parting of ways between me and thee. [And now] I shall let thee know the real meaning of all [those events] that thou wert unable to bear with patience:,",
      "ms": "Ia menjawab: \"Inilah masanya perpisahan antaraku denganmu, aku akan terangkan kepadamu maksud (kejadian-kejadian yang dimusykilkan) yang engkau tidak dapat bersabar mengenainya.",
      "id": "Khidhr berkata: \"Inilah perpisahan antara aku dengan kamu; kelak akan kuberitahukan kepadamu tujuan perbuatan-perbuatan yang kamu tidak dapat sabar terhadapnya.",
      "ar": "قَالَ هَـٰذَا فِرَاقُ بَیۡنِی وَبَیۡنِكَۚ سَأُنَبِّئُكَ بِتَأۡوِیلِ مَا لَمۡ تَسۡتَطِع عَّلَیۡهِ صَبۡرًا\n"
    }
  },
  {
    "id": 2219,
    "surahId": 18,
    "ayahNumber": 79,
    "arabicText": "أَمَّا ٱلسَّفِینَةُ فَكَانَتۡ لِمَسَـٰكِینَ یَعۡمَلُونَ فِی ٱلۡبَحۡرِ فَأَرَدتُّ أَنۡ أَعِیبَهَا وَكَانَ وَرَاۤءَهُم مَّلِكࣱ یَأۡخُذُ كُلَّ سَفِینَةٍ غَصۡبࣰا\n",
    "translations": {
      "en": "\"As for that boat, it belonged to some needy people who toiled upon the sea -and I desired to damage it because (I knew that] behind them was a king who is wont to seize every boat by brute force.",
      "ms": "Adapun perahu itu adalah ia dipunyai oleh orang-orang miskin yang bekerja di laut; oleh itu, aku bocorkan dengan tujuan hendak mencacatkannya, kerana di belakang mereka nanti ada seorang raja yang merampas tiap-tiap sebuah perahu yang tidak cacat.",
      "id": "Adapun bahtera itu adalah kepunyaan orang-orang miskin yang bekerja di laut, dan aku bertujuan merusakkan bahtera itu, karena di hadapan mereka ada seorang raja yang merampas tiap-tiap bahtera.",
      "ar": "أَمَّا ٱلسَّفِینَةُ فَكَانَتۡ لِمَسَـٰكِینَ یَعۡمَلُونَ فِی ٱلۡبَحۡرِ فَأَرَدتُّ أَنۡ أَعِیبَهَا وَكَانَ وَرَاۤءَهُم مَّلِكࣱ یَأۡخُذُ كُلَّ سَفِینَةٍ غَصۡبࣰا\n"
    }
  },
  {
    "id": 2220,
    "surahId": 18,
    "ayahNumber": 80,
    "arabicText": "وَأَمَّا ٱلۡغُلَـٰمُ فَكَانَ أَبَوَاهُ مُؤۡمِنَیۡنِ فَخَشِینَاۤ أَن یُرۡهِقَهُمَا طُغۡیَـٰنࣰا وَكُفۡرࣰا\n",
    "translations": {
      "en": "\"And as for that young man, his parents were [true] believers - whereas we had every reason to fear that he would bring bitter grief upon them by [his] overweening wickedness and denial of all truth:",
      "ms": "Adapun pemuda itu, kedua ibu bapanya adalah orang-orang yang beriman, maka kami bimbang bahawa ia akan mendesak mereka melakukan perbuatan yang zalim dan kufur.",
      "id": "Dan adapun anak muda itu, maka keduanya adalah orang-orang mukmin, dan kami khawatir bahwa dia akan mendorong kedua orang tuanya itu kepada kesesatan dan kekafiran.",
      "ar": "وَأَمَّا ٱلۡغُلَـٰمُ فَكَانَ أَبَوَاهُ مُؤۡمِنَیۡنِ فَخَشِینَاۤ أَن یُرۡهِقَهُمَا طُغۡیَـٰنࣰا وَكُفۡرࣰا\n"
    }
  },
  {
    "id": 2221,
    "surahId": 18,
    "ayahNumber": 81,
    "arabicText": "فَأَرَدۡنَاۤ أَن یُبۡدِلَهُمَا رَبُّهُمَا خَیۡرࣰا مِّنۡهُ زَكَوٰةࣰ وَأَقۡرَبَ رُحۡمࣰا\n",
    "translations": {
      "en": "and so we desired that their Sustainer grant them in his stead [a child] of greater purity than him, and closer [to them] in loving tenderness.",
      "ms": "Oleh itu, kami ingin dan berharap, supaya Tuhan mereka gantikan bagi mereka anak yang lebih baik daripadanya tentang kebersihan jiwa, dan lebih mesra kasih sayangnya.",
      "id": "Dan kami menghendaki, supaya Tuhan mereka mengganti bagi mereka dengan anak lain yang lebih baik kesuciannya dari anaknya itu dan lebih dalam kasih sayangnya (kepada ibu bapaknya).",
      "ar": "فَأَرَدۡنَاۤ أَن یُبۡدِلَهُمَا رَبُّهُمَا خَیۡرࣰا مِّنۡهُ زَكَوٰةࣰ وَأَقۡرَبَ رُحۡمࣰا\n"
    }
  },
  {
    "id": 2222,
    "surahId": 18,
    "ayahNumber": 82,
    "arabicText": "وَأَمَّا ٱلۡجِدَارُ فَكَانَ لِغُلَـٰمَیۡنِ یَتِیمَیۡنِ فِی ٱلۡمَدِینَةِ وَكَانَ تَحۡتَهُۥ كَنزࣱ لَّهُمَا وَكَانَ أَبُوهُمَا صَـٰلِحࣰا فَأَرَادَ رَبُّكَ أَن یَبۡلُغَاۤ أَشُدَّهُمَا وَیَسۡتَخۡرِجَا كَنزَهُمَا رَحۡمَةࣰ مِّن رَّبِّكَۚ وَمَا فَعَلۡتُهُۥ عَنۡ أَمۡرِیۚ ذَ ٰ⁠لِكَ تَأۡوِیلُ مَا لَمۡ تَسۡطِع عَّلَیۡهِ صَبۡرࣰا\n",
    "translations": {
      "en": "\"And as for that wall, it belonged to two orphan boys [living] in the town, and beneath it was [buried] a treasure belonging to them [by right]. Now their father had been a righteous man, and so thy Sustainer willed it that when they come of age they should bring forth their treasure by thy Sustainer's grace. \"And I did not do (any of] this of my own accord: this is the real meaning of all [those events] that thou wert unable to bear with patience.\"",
      "ms": "Adapun tembok itu pula, adalah ia dipunyai oleh dua orang anak yatim di bandar itu; dan di bawahnya ada \"harta terpendam\" kepuyaan mereka; dan bapa mereka pula adalah orang yang soleh. Maka Tuhanmu menghendaki supaya mereka cukup umur dan dapat mengeluarkan harta mereka yang terpendam itu, sebagai satu rahmat dari Tuhanmu (kepada mereka). Dan (ingatlah) aku tidak melakukannya menurut fikiranku sendiri. Demikianlah penjelasan tentang maksud dan tujuan perkara-perkara yang engkau tidak dapat bersabar mengenainya\".",
      "id": "Adapun dinding rumah adalah kepunyaan dua orang anak yatim di kota itu, dan di bawahnya ada harta benda simpanan bagi mereka berdua, sedang ayahnya adalah seorang yang saleh, maka Tuhanmu menghendaki agar supaya mereka sampai kepada kedewasaannya dan mengeluarkan simpanannya itu, sebagai rahmat dari Tuhanmu; dan bukanlah aku melakukannya itu menurut kemauanku sendiri. Demikian itu adalah tujuan perbuatan-perbuatan yang kamu tidak dapat sabar terhadapnya\".",
      "ar": "وَأَمَّا ٱلۡجِدَارُ فَكَانَ لِغُلَـٰمَیۡنِ یَتِیمَیۡنِ فِی ٱلۡمَدِینَةِ وَكَانَ تَحۡتَهُۥ كَنزࣱ لَّهُمَا وَكَانَ أَبُوهُمَا صَـٰلِحࣰا فَأَرَادَ رَبُّكَ أَن یَبۡلُغَاۤ أَشُدَّهُمَا وَیَسۡتَخۡرِجَا كَنزَهُمَا رَحۡمَةࣰ مِّن رَّبِّكَۚ وَمَا فَعَلۡتُهُۥ عَنۡ أَمۡرِیۚ ذَ ٰ⁠لِكَ تَأۡوِیلُ مَا لَمۡ تَسۡطِع عَّلَیۡهِ صَبۡرࣰا\n"
    }
  },
  {
    "id": 2223,
    "surahId": 18,
    "ayahNumber": 83,
    "arabicText": "وَیَسۡـَٔلُونَكَ عَن ذِی ٱلۡقَرۡنَیۡنِۖ قُلۡ سَأَتۡلُوا۟ عَلَیۡكُم مِّنۡهُ ذِكۡرًا\n",
    "translations": {
      "en": "AND THEY will ask thee about the Two-Horned One. Say: \"I will convey unto you something by which he ought to be remembered.\"",
      "ms": "Dan mereka bertanya kepadamu (wahai Muhammad), mengenai Zulkarnain. Katakanlah: \"Aku akan bacakan kepada kamu (wahyu dari Allah yang menerangkan) sedikit tentang perihalnya\":",
      "id": "Mereka akan bertanya kepadamu (Muhammad) tentang Dzulkarnain. Katakanlah: \"Aku akan bacakan kepadamu cerita tantangnya\".",
      "ar": "وَیَسۡـَٔلُونَكَ عَن ذِی ٱلۡقَرۡنَیۡنِۖ قُلۡ سَأَتۡلُوا۟ عَلَیۡكُم مِّنۡهُ ذِكۡرًا\n"
    }
  },
  {
    "id": 2224,
    "surahId": 18,
    "ayahNumber": 84,
    "arabicText": "إِنَّا مَكَّنَّا لَهُۥ فِی ٱلۡأَرۡضِ وَءَاتَیۡنَـٰهُ مِن كُلِّ شَیۡءࣲ سَبَبࣰا\n",
    "translations": {
      "en": "Behold, We established him securely on earth, and endowed him with [the knowledge of] the right means to achieve anything [that he might set out to achieve];",
      "ms": "Sesungguhnya Kami telah memberikan kepadanya kekuasaan memerintah di bumi, dan Kami beri kepadanya jalan bagi menjayakan tiap-tiap sesuatu yang diperlukannya.",
      "id": "Sesungguhnya Kami telah memberi kekuasaan kepadanya di (muka) bumi, dan Kami telah memberikan kepadanya jalan (untuk mencapai) segala sesuatu,",
      "ar": "إِنَّا مَكَّنَّا لَهُۥ فِی ٱلۡأَرۡضِ وَءَاتَیۡنَـٰهُ مِن كُلِّ شَیۡءࣲ سَبَبࣰا\n"
    }
  },
  {
    "id": 2225,
    "surahId": 18,
    "ayahNumber": 85,
    "arabicText": "فَأَتۡبَعَ سَبَبًا\n",
    "translations": {
      "en": "and so he chose the right means [in whatever he did].",
      "ms": "Lalu ia menurut jalan (yang menyampaikan maksudnya).",
      "id": "maka diapun menempuh suatu jalan.",
      "ar": "فَأَتۡبَعَ سَبَبًا\n"
    }
  },
  {
    "id": 2226,
    "surahId": 18,
    "ayahNumber": 86,
    "arabicText": "حَتَّىٰۤ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِی عَیۡنٍ حَمِئَةࣲ وَوَجَدَ عِندَهَا قَوۡمࣰاۖ قُلۡنَا یَـٰذَا ٱلۡقَرۡنَیۡنِ إِمَّاۤ أَن تُعَذِّبَ وَإِمَّاۤ أَن تَتَّخِذَ فِیهِمۡ حُسۡنࣰا\n",
    "translations": {
      "en": "[And he marched westwards] till, when he came to the setting of the sun, it appeared to him that it was setting in a dark, turbid sea; and nearby he found a people [given to every kind of wrongdoing]. We said: \"O thou Two-Horned One! Thou mayest either cause [them] to suffer or treat them with kindness!\"",
      "ms": "Sehingga apabila ia sampai ke daerah matahari terbenam, ia mendapatinya terbenam di sebuah matair yang hitam berlumpur, dan ia dapati di sisinya satu kaum (yang kufur ingkar). Kami berfirman (dengan mengilhamkan kepadanya): \"Wahai Zulkarnain! Pilihlah sama ada engkau hendak menyeksa mereka atau engkau bertindak secara baik terhadap mereka\".",
      "id": "Hingga apabila dia telah sampai ketempat terbenam matahari, dia melihat matahari terbenam di dalam laut yang berlumpur hitam, dan dia mendapati di situ segolongan umat. Kami berkata: \"Hai Dzulkarnain, kamu boleh menyiksa atau boleh berbuat kebaikan terhadap mereka.",
      "ar": "حَتَّىٰۤ إِذَا بَلَغَ مَغۡرِبَ ٱلشَّمۡسِ وَجَدَهَا تَغۡرُبُ فِی عَیۡنٍ حَمِئَةࣲ وَوَجَدَ عِندَهَا قَوۡمࣰاۖ قُلۡنَا یَـٰذَا ٱلۡقَرۡنَیۡنِ إِمَّاۤ أَن تُعَذِّبَ وَإِمَّاۤ أَن تَتَّخِذَ فِیهِمۡ حُسۡنࣰا\n"
    }
  },
  {
    "id": 2227,
    "surahId": 18,
    "ayahNumber": 87,
    "arabicText": "قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ یُرَدُّ إِلَىٰ رَبِّهِۦ فَیُعَذِّبُهُۥ عَذَابࣰا نُّكۡرࣰا\n",
    "translations": {
      "en": "He answered: \"As for him who does wrong [unto others] - him shall we, in time, cause to suffer; and thereupon he shall be referred to his Sustainer, and He will cause him to suffer with unnameable suffering.",
      "ms": "Ia berkata: \"Adapun orang yang melakukan kezaliman (kufur derhaka), maka kami akan menyeksanya; kemudian ia akan dikembalikan kepada Tuhannya, lalu diazabkannya dengan azab seksa yang seburuk-buruknya.",
      "id": "Berkata Dzulkarnain: \"Adapun orang yang aniaya, maka kami kelak akan mengazabnya, kemudian dia kembalikan kepada Tuhannya, lalu Tuhan mengazabnya dengan azab yang tidak ada taranya.",
      "ar": "قَالَ أَمَّا مَن ظَلَمَ فَسَوۡفَ نُعَذِّبُهُۥ ثُمَّ یُرَدُّ إِلَىٰ رَبِّهِۦ فَیُعَذِّبُهُۥ عَذَابࣰا نُّكۡرࣰا\n"
    }
  },
  {
    "id": 2228,
    "surahId": 18,
    "ayahNumber": 88,
    "arabicText": "وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَـٰلِحࣰا فَلَهُۥ جَزَاۤءً ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا یُسۡرࣰا\n",
    "translations": {
      "en": "But as for him who believes and does righteous deeds - he will have the ultimate good [of the life to come] as his reward; and [as for us,] we shall make binding on him [only] that which is easy to fulfill.\"",
      "ms": "Adapun orang yang beriman serta beramal soleh, maka baginya balasan yang sebaik-baiknya; dan kami akan perintahkan kepadanya perintah-perintah kami yang tidak memberati\".",
      "id": "Adapun orang-orang yang beriman dan beramal saleh, maka baginya pahala yang terbaik sebagai balasan, dan akan kami titahkan kepadanya (perintah) yang mudah dari perintah-perintah kami\".",
      "ar": "وَأَمَّا مَنۡ ءَامَنَ وَعَمِلَ صَـٰلِحࣰا فَلَهُۥ جَزَاۤءً ٱلۡحُسۡنَىٰۖ وَسَنَقُولُ لَهُۥ مِنۡ أَمۡرِنَا یُسۡرࣰا\n"
    }
  },
  {
    "id": 2229,
    "surahId": 18,
    "ayahNumber": 89,
    "arabicText": "ثُمَّ أَتۡبَعَ سَبَبًا\n",
    "translations": {
      "en": "And once again he chose the right means [to achieve a right end].",
      "ms": "Kemudian ia berpatah balik menurut jalan yang lain.",
      "id": "Kemudian dia menempuh jalan (yang lain).",
      "ar": "ثُمَّ أَتۡبَعَ سَبَبًا\n"
    }
  },
  {
    "id": 2230,
    "surahId": 18,
    "ayahNumber": 90,
    "arabicText": "حَتَّىٰۤ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمࣲ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرࣰا\n",
    "translations": {
      "en": "[And then he marched eastwards] till, when he came to the rising of the sun he found that it was rising on a people for whom We had provided no coverings against it:",
      "ms": "Sehingga apabila ia sampai di daerah matahari terbit, ia mendapatinya terbit kepada suatu kaum yang kami tidak menjadikan bagi mereka sebarang perlindungan daripadanya.",
      "id": "Hingga apabila dia telah sampai ke tempat terbit matahari (sebelah Timur) dia mendapati matahari itu menyinari segolongan umat yang Kami tidak menjadikan bagi mereka sesuatu yang melindunginya dari (cahaya) matahari itu,",
      "ar": "حَتَّىٰۤ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمࣲ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرࣰا\n"
    }
  },
  {
    "id": 2231,
    "surahId": 18,
    "ayahNumber": 91,
    "arabicText": "كَذَ ٰ⁠لِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَیۡهِ خُبۡرࣰا\n",
    "translations": {
      "en": "thus [We had made them, and thus he left them; and We did encompass with Our knowledge all that he had in mind",
      "ms": "Demikianlah halnya; dan sesungguhnya Kami mengetahui secara meliputi akan segala yang ada padanya.",
      "id": "demikianlah. dan sesungguhnya ilmu Kami meliputi segala apa yang ada padanya.",
      "ar": "كَذَ ٰ⁠لِكَۖ وَقَدۡ أَحَطۡنَا بِمَا لَدَیۡهِ خُبۡرࣰا\n"
    }
  },
  {
    "id": 2232,
    "surahId": 18,
    "ayahNumber": 92,
    "arabicText": "ثُمَّ أَتۡبَعَ سَبَبًا\n",
    "translations": {
      "en": "And once again he chose the right means (to achieve a right end].",
      "ms": "kemudian ia berpatah balik menurut jalan yang lain.",
      "id": "Kemudian dia menempuh suatu jalan (yang lain lagi).",
      "ar": "ثُمَّ أَتۡبَعَ سَبَبًا\n"
    }
  },
  {
    "id": 2233,
    "surahId": 18,
    "ayahNumber": 93,
    "arabicText": "حَتَّىٰۤ إِذَا بَلَغَ بَیۡنَ ٱلسَّدَّیۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمࣰا لَّا یَكَادُونَ یَفۡقَهُونَ قَوۡلࣰا\n",
    "translations": {
      "en": "[And he marched on] till, when he reached [a place] between the two mountain-barriers, he found beneath them a people who could scarcely understand a word [of his language].",
      "ms": "Sehingga apabila ia sampai di antara dua gunung, ia dapati di sisinya satu kaum yang hampir-hampir mereka tidak dapat memahami perkataan.",
      "id": "Hingga apabila dia telah sampai di antara dua buah gunung, dia mendapati di hadapan kedua bukit itu suatu kaum yang hampir tidak mengerti pembicaraan.",
      "ar": "حَتَّىٰۤ إِذَا بَلَغَ بَیۡنَ ٱلسَّدَّیۡنِ وَجَدَ مِن دُونِهِمَا قَوۡمࣰا لَّا یَكَادُونَ یَفۡقَهُونَ قَوۡلࣰا\n"
    }
  },
  {
    "id": 2234,
    "surahId": 18,
    "ayahNumber": 94,
    "arabicText": "قَالُوا۟ یَـٰذَا ٱلۡقَرۡنَیۡنِ إِنَّ یَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِی ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰۤ أَن تَجۡعَلَ بَیۡنَنَا وَبَیۡنَهُمۡ سَدࣰّا\n",
    "translations": {
      "en": "They said: \"O thou Two-Horned One! Behold, Gog and Magog\" are spoiling this land. May we, then, pay unto thee a tribute on the understanding that thou wilt erect a barrier between us and them?\"",
      "ms": "Mereka berkata: \"wahai Zulkarnain, sesungguhnya kaum Yakjuj dan Makjuj sentiasa melakukan kerosakan di bumi; oleh itu, setujukah kiranya kami menentukan sejumlah bayaran kepadamu (dari hasil pendapatan kami) dengan syarat engkau membina sebuah tembok di antara kami dengan mereka?\"",
      "id": "Mereka berkata: \"Hai Dzulkarnain, sesungguhnya Ya'juj dan Ma'juj itu orang-orang yang membuat kerusakan di muka bumi, maka dapatkah kami memberikan sesuatu pembayaran kepadamu, supaya kamu membuat dinding antara kami dan mereka?\"",
      "ar": "قَالُوا۟ یَـٰذَا ٱلۡقَرۡنَیۡنِ إِنَّ یَأۡجُوجَ وَمَأۡجُوجَ مُفۡسِدُونَ فِی ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰۤ أَن تَجۡعَلَ بَیۡنَنَا وَبَیۡنَهُمۡ سَدࣰّا\n"
    }
  },
  {
    "id": 2235,
    "surahId": 18,
    "ayahNumber": 95,
    "arabicText": "قَالَ مَا مَكَّنِّی فِیهِ رَبِّی خَیۡرࣱ فَأَعِینُونِی بِقُوَّةٍ أَجۡعَلۡ بَیۡنَكُمۡ وَبَیۡنَهُمۡ رَدۡمًا\n",
    "translations": {
      "en": "He answered: \"That wherein my Sustainer has so securely established me is better [than anything that you could give me]; hence, do but help me with [your labour's] strength, [and] I shall erect a rampart between you and them!",
      "ms": "Dia menjawab: \"(kekuasaan dan kekayaan) yang Tuhanku jadikan daku menguasainya, lebih baik (dari bayaran kamu); oleh itu bantulah daku dengan tenaga (kamu beramai-ramai) aku akan bina antara kamu dengan mereka sebuah tembok penutup yang kukuh.",
      "id": "Dzulkarnain berkata: \"Apa yang telah dikuasakan oleh Tuhanku kepadaku terhadapnya adalah lebih baik, maka tolonglah aku dengan kekuatan (manusia dan alat-alat), agar aku membuatkan dinding antara kamu dan mereka,",
      "ar": "قَالَ مَا مَكَّنِّی فِیهِ رَبِّی خَیۡرࣱ فَأَعِینُونِی بِقُوَّةٍ أَجۡعَلۡ بَیۡنَكُمۡ وَبَیۡنَهُمۡ رَدۡمًا\n"
    }
  },
  {
    "id": 2236,
    "surahId": 18,
    "ayahNumber": 96,
    "arabicText": "ءَاتُونِی زُبَرَ ٱلۡحَدِیدِۖ حَتَّىٰۤ إِذَا سَاوَىٰ بَیۡنَ ٱلصَّدَفَیۡنِ قَالَ ٱنفُخُوا۟ۖ حَتَّىٰۤ إِذَا جَعَلَهُۥ نَارࣰا قَالَ ءَاتُونِیۤ أُفۡرِغۡ عَلَیۡهِ قِطۡرࣰا\n",
    "translations": {
      "en": "Bring me ingots of iron!\" Then, after he had [piled up the iron and] filled the gap between the two mountain-sides, he said: \"[Light a fire and] ply your bellows!\" At length, when he had made it [glow like] fire, he commanded: \"Bring me molten copper which I may pour upon it.\"",
      "ms": "Bawalah kepadaku ketul-ketul besi\"; sehingga apabila ia terkumpul separas tingginya menutup lapangan antara dua gunung itu, ddia pun perintahkan mereka membakarnya dengan berkata: \"Tiuplah dengan alat-alat kamu\" sehingga apabila ia menjadikannya merah menyala seperti api, berkatalah dia: \"Bawalah tembaga cair supaya aku tuangkan atasnya\".",
      "id": "berilah aku potongan-potongan besi\". Hingga apabila besi itu telah sama rata dengan kedua (puncak) gunung itu, berkatalah Dzulkarnain: \"Tiuplah (api itu)\". Hingga apabila besi itu sudah menjadi (merah seperti) api, diapun berkata: \"Berilah aku tembaga (yang mendidih) agar aku kutuangkan ke atas besi panas itu\".",
      "ar": "ءَاتُونِی زُبَرَ ٱلۡحَدِیدِۖ حَتَّىٰۤ إِذَا سَاوَىٰ بَیۡنَ ٱلصَّدَفَیۡنِ قَالَ ٱنفُخُوا۟ۖ حَتَّىٰۤ إِذَا جَعَلَهُۥ نَارࣰا قَالَ ءَاتُونِیۤ أُفۡرِغۡ عَلَیۡهِ قِطۡرࣰا\n"
    }
  },
  {
    "id": 2237,
    "surahId": 18,
    "ayahNumber": 97,
    "arabicText": "فَمَا ٱسۡطَـٰعُوۤا۟ أَن یَظۡهَرُوهُ وَمَا ٱسۡتَطَـٰعُوا۟ لَهُۥ نَقۡبࣰا\n",
    "translations": {
      "en": "And thus [the rampart was built, and] their enemies were unable to scale it, and neither were they able to pierce it.",
      "ms": "Maka mereka tidak dapat memanjat tembok itu, dan mereka juga tidak dapat menebuknya.",
      "id": "Maka mereka tidak bisa mendakinya dan mereka tidak bisa (pula) melobanginya.",
      "ar": "فَمَا ٱسۡطَـٰعُوۤا۟ أَن یَظۡهَرُوهُ وَمَا ٱسۡتَطَـٰعُوا۟ لَهُۥ نَقۡبࣰا\n"
    }
  },
  {
    "id": 2238,
    "surahId": 18,
    "ayahNumber": 98,
    "arabicText": "قَالَ هَـٰذَا رَحۡمَةࣱ مِّن رَّبِّیۖ فَإِذَا جَاۤءَ وَعۡدُ رَبِّی جَعَلَهُۥ دَكَّاۤءَۖ وَكَانَ وَعۡدُ رَبِّی حَقࣰّا\n",
    "translations": {
      "en": "Said [the King]: \"This is a mercy from my Sustainer! Yet when the time appointed by my Sustainer shall come, He will make this [rampart] level with the ground: and my Sustainer's promise always comes true!\"",
      "ms": "(Setelah itu) berkatalah Zulkarnain: \"Ini ialah suatu rahmat dari Tuhanku; dalam pada itu, apabila sampai janji Tuhanku, Dia akan menjadikan tembok itu hancur lebur, dan adalah janji Tuhanku itu benar\".",
      "id": "Dzulkarnain berkata: \"Ini (dinding) adalah rahmat dari Tuhanku, maka apabila sudah datang janji Tuhanku, Dia akan menjadikannya hancur luluh; dan janji Tuhanku itu adalah benar\".",
      "ar": "قَالَ هَـٰذَا رَحۡمَةࣱ مِّن رَّبِّیۖ فَإِذَا جَاۤءَ وَعۡدُ رَبِّی جَعَلَهُۥ دَكَّاۤءَۖ وَكَانَ وَعۡدُ رَبِّی حَقࣰّا\n"
    }
  },
  {
    "id": 2239,
    "surahId": 18,
    "ayahNumber": 99,
    "arabicText": "۞ وَتَرَكۡنَا بَعۡضَهُمۡ یَوۡمَىِٕذࣲ یَمُوجُ فِی بَعۡضࣲۖ وَنُفِخَ فِی ٱلصُّورِ فَجَمَعۡنَـٰهُمۡ جَمۡعࣰا\n",
    "translations": {
      "en": "AND ON that Day\" We shall [call forth all mankind and] leave them to surge like waves [that dash] against one another; and the trumpet [of judgment] will be blown, and We shall gather them all together.",
      "ms": "Dan Kami biarkan mereka pada hari itu (keluar beramai-ramai) bercampur-baur antara satu dengan yang lain; dan (kemudiannya) akan ditiup sangkakala, lalu Kami himpunkan makhluk-makhluk seluruhnya di Padang Mahsyar.",
      "id": "Kami biarkan mereka di hari itu bercampur aduk antara satu dengan yang lain, kemudian ditiup lagi sangkakala, lalu Kami kumpulkan mereka itu semuanya,",
      "ar": "۞ وَتَرَكۡنَا بَعۡضَهُمۡ یَوۡمَىِٕذࣲ یَمُوجُ فِی بَعۡضࣲۖ وَنُفِخَ فِی ٱلصُّورِ فَجَمَعۡنَـٰهُمۡ جَمۡعࣰا\n"
    }
  },
  {
    "id": 2240,
    "surahId": 18,
    "ayahNumber": 100,
    "arabicText": "وَعَرَضۡنَا جَهَنَّمَ یَوۡمَىِٕذࣲ لِّلۡكَـٰفِرِینَ عَرۡضًا\n",
    "translations": {
      "en": "And on that Day We shall place hell, for all to see, before those who denied the truth-",
      "ms": "Dan Kami perlihatkan neraka Jahannam, pada hari itu kepada orang-orang kafir, dengan pendedahan yang jelas nyata;",
      "id": "dan Kami nampakkan Jahannam pada hari itu kepada orang-orang kafir dengan jelas,",
      "ar": "وَعَرَضۡنَا جَهَنَّمَ یَوۡمَىِٕذࣲ لِّلۡكَـٰفِرِینَ عَرۡضًا\n"
    }
  },
  {
    "id": 2241,
    "surahId": 18,
    "ayahNumber": 101,
    "arabicText": "ٱلَّذِینَ كَانَتۡ أَعۡیُنُهُمۡ فِی غِطَاۤءٍ عَن ذِكۡرِی وَكَانُوا۟ لَا یَسۡتَطِیعُونَ سَمۡعًا\n",
    "translations": {
      "en": "those whose eyes had been veiled against any remembrance of Me because they could not bear to listen [to the voice of truth]!",
      "ms": "(Iaitu) orang-orang yang matanya telah tertutup daripada melihat tanda-tanda yang membawa kepada mengingatiKu, dan mereka pula tidak dapat mendengar sama sekali.",
      "id": "yaitu orang-orang yang matanya dalam keadaan tertutup dari memperhatikan tanda-tanda kebesaran-Ku, dan adalah mereka tidak sanggup mendengar.",
      "ar": "ٱلَّذِینَ كَانَتۡ أَعۡیُنُهُمۡ فِی غِطَاۤءٍ عَن ذِكۡرِی وَكَانُوا۟ لَا یَسۡتَطِیعُونَ سَمۡعًا\n"
    }
  },
  {
    "id": 2242,
    "surahId": 18,
    "ayahNumber": 102,
    "arabicText": "أَفَحَسِبَ ٱلَّذِینَ كَفَرُوۤا۟ أَن یَتَّخِذُوا۟ عِبَادِی مِن دُونِیۤ أَوۡلِیَاۤءَۚ إِنَّاۤ أَعۡتَدۡنَا جَهَنَّمَ لِلۡكَـٰفِرِینَ نُزُلࣰا\n",
    "translations": {
      "en": "Do they who are bent on denying the truth think, perchance, that they could take [any of] My creatures for protectors against Me? Verily, We have readied hell to welcome all who [thus] deny the truth!",
      "ms": "Maka adakah orang-orang kafir menyangka bahawa mereka mengambil hamba-hambaKu sebagai makhluk-makhluk yang disembah, selain daripadaKu, dapat menolong mereka? Sesungguhnya Kami telah sediakan neraka Jahannam bagi orang-orang kafir itu sebagai tempat tetamu.",
      "id": "maka apakah orang-orang kafir menyangka bahwa mereka (dapat) mengambil hamba-hamba-Ku menjadi penolong selain Aku? Sesungguhnya Kami telah menyediakan neraka Jahannam tempat tinggal bagi orang-orang kafir.",
      "ar": "أَفَحَسِبَ ٱلَّذِینَ كَفَرُوۤا۟ أَن یَتَّخِذُوا۟ عِبَادِی مِن دُونِیۤ أَوۡلِیَاۤءَۚ إِنَّاۤ أَعۡتَدۡنَا جَهَنَّمَ لِلۡكَـٰفِرِینَ نُزُلࣰا\n"
    }
  },
  {
    "id": 2243,
    "surahId": 18,
    "ayahNumber": 103,
    "arabicText": "قُلۡ هَلۡ نُنَبِّئُكُم بِٱلۡأَخۡسَرِینَ أَعۡمَـٰلًا\n",
    "translations": {
      "en": "Say: \"Shall we tell you who are the greatest losers in whatever they may do?",
      "ms": "Katakanlah (wahai Muhammad): \"Mahukah Kami khabarkan kepada kamu akan orang-orang yang paling rugi amal-amal perbuatannya?",
      "id": "Katakanlah: \"Apakah akan Kami beritahukan kepadamu tentang orang-orang yang paling merugi perbuatannya?\"",
      "ar": "قُلۡ هَلۡ نُنَبِّئُكُم بِٱلۡأَخۡسَرِینَ أَعۡمَـٰلًا\n"
    }
  },
  {
    "id": 2244,
    "surahId": 18,
    "ayahNumber": 104,
    "arabicText": "ٱلَّذِینَ ضَلَّ سَعۡیُهُمۡ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَهُمۡ یَحۡسَبُونَ أَنَّهُمۡ یُحۡسِنُونَ صُنۡعًا\n",
    "translations": {
      "en": "\"[It is] they whose labour has gone astray in [the pursuit of no more than] this world's life, and who none the less think that they are doing good works:",
      "ms": "(Iaitu) orang-orang yang telah sia-sia amal usahanya dalam kehidupan dunia ini, sedang mereka menyangka bahawa mereka sentiasa betul dan baik pada apa sahaja yang mereka lakukan\".",
      "id": "Yaitu orang-orang yang telah sia-sia perbuatannya dalam kehidupan dunia ini, sedangkan mereka menyangka bahwa mereka berbuat sebaik-baiknya.",
      "ar": "ٱلَّذِینَ ضَلَّ سَعۡیُهُمۡ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَهُمۡ یَحۡسَبُونَ أَنَّهُمۡ یُحۡسِنُونَ صُنۡعًا\n"
    }
  },
  {
    "id": 2245,
    "surahId": 18,
    "ayahNumber": 105,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ كَفَرُوا۟ بِـَٔایَـٰتِ رَبِّهِمۡ وَلِقَاۤىِٕهِۦ فَحَبِطَتۡ أَعۡمَـٰلُهُمۡ فَلَا نُقِیمُ لَهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ وَزۡنࣰا\n",
    "translations": {
      "en": "it is they who have chosen to deny their Sustainer's messages and the truth; that they are deseined to meet Him.\" Hence, all their [good] deeds come to nought, and no weight shall We assign to them on Resurrection Day.",
      "ms": "Merekalah orang-orang yang kufur ingkar akan ayat-ayat Tuhan mereka dan akan pertemuan denganNya; oleh itu gugurlah amal-amal mereka; maka akibatya Kami tidak akan memberi sebarang timbangan untuk menilai amal mereka, pada hari kiamat kelak.",
      "id": "Mereka itu orang-orang yang telah kufur terhadap ayat-ayat Tuhan mereka dan (kufur terhadap) perjumpaan dengan Dia, maka hapuslah amalan-amalan mereka, dan Kami tidak mengadakan suatu penilaian bagi (amalan) mereka pada hari kiamat.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ كَفَرُوا۟ بِـَٔایَـٰتِ رَبِّهِمۡ وَلِقَاۤىِٕهِۦ فَحَبِطَتۡ أَعۡمَـٰلُهُمۡ فَلَا نُقِیمُ لَهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ وَزۡنࣰا\n"
    }
  },
  {
    "id": 2246,
    "surahId": 18,
    "ayahNumber": 106,
    "arabicText": "ذَ ٰ⁠لِكَ جَزَاۤؤُهُمۡ جَهَنَّمُ بِمَا كَفَرُوا۟ وَٱتَّخَذُوۤا۟ ءَایَـٰتِی وَرُسُلِی هُزُوًا\n",
    "translations": {
      "en": "That will be their recompense - [their] hell -for having denied the truth and made My messages and My apostles a target of their mockery.",
      "ms": "(Mereka yang bersifat) demikian, balasannya neraka Jahannam, disebabkan mereka kufur ingkar, dan mereka pula menjadikan ayat-ayatKu dan Rasul-rasulKu sebagai ejek-ejekan.",
      "id": "Demikianlah balasan mereka itu neraka Jahannam, disebabkan kekafiran mereka dan disebabkan mereka menjadikan ayat-ayat-Ku dan rasul-rasul-Ku sebagai olok-olok.",
      "ar": "ذَ ٰ⁠لِكَ جَزَاۤؤُهُمۡ جَهَنَّمُ بِمَا كَفَرُوا۟ وَٱتَّخَذُوۤا۟ ءَایَـٰتِی وَرُسُلِی هُزُوًا\n"
    }
  },
  {
    "id": 2247,
    "surahId": 18,
    "ayahNumber": 107,
    "arabicText": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ كَانَتۡ لَهُمۡ جَنَّـٰتُ ٱلۡفِرۡدَوۡسِ نُزُلًا\n",
    "translations": {
      "en": "[But,] verily, as for those who attain to faith and do righteous deeds - the gardens of paradise will be there to welcome them;",
      "ms": "Sesungguhnya orang-orang yang beriman dan beramal soleh, disediakan bagi mereka Syurga-syurga Firdaus, sebagai tempat tetamu (yang serba mewah).",
      "id": "Sesungguhnya orang-orang yang beriman dan beramal saleh, bagi mereka adalah surga Firdaus menjadi tempat tinggal,",
      "ar": "إِنَّ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ كَانَتۡ لَهُمۡ جَنَّـٰتُ ٱلۡفِرۡدَوۡسِ نُزُلًا\n"
    }
  },
  {
    "id": 2248,
    "surahId": 18,
    "ayahNumber": 108,
    "arabicText": "خَـٰلِدِینَ فِیهَا لَا یَبۡغُونَ عَنۡهَا حِوَلࣰا\n",
    "translations": {
      "en": "therein will they abide, [and] never will they desire any change therefrom.",
      "ms": "Mereka kekal di dalamnya, (dan) tidak ingin berpindah daripadanya.",
      "id": "mereka kekal di dalamnya, mereka tidak ingin berpindah dari padanya.",
      "ar": "خَـٰلِدِینَ فِیهَا لَا یَبۡغُونَ عَنۡهَا حِوَلࣰا\n"
    }
  },
  {
    "id": 2249,
    "surahId": 18,
    "ayahNumber": 109,
    "arabicText": "قُل لَّوۡ كَانَ ٱلۡبَحۡرُ مِدَادࣰا لِّكَلِمَـٰتِ رَبِّی لَنَفِدَ ٱلۡبَحۡرُ قَبۡلَ أَن تَنفَدَ كَلِمَـٰتُ رَبِّی وَلَوۡ جِئۡنَا بِمِثۡلِهِۦ مَدَدࣰا\n",
    "translations": {
      "en": "SAY: \"If all the sea were ink for my Sustainer's words, the sea would indeed be exhausted ere my Sustainer's words are exhausted! And [thus it would be] if we were to add to it sea upon sea.\"",
      "ms": "Katakanlah (wahai Muhammad): \"Kalaulah semua jenis lautan menjadi tinta untuk menulis Kalimah-kalimah Tuhanku, sudah tentu akan habis kering lautan itu sebelum habis Kalimah-kalimah Tuhanku, walaupun Kami tambahi lagi dengan lautan yang sebanding dengannya, sebagai bantuan\".",
      "id": "Katakanlah: Sekiranya lautan menjadi tinta untuk (menulis) kalimat-kalimat Tuhanku, sungguh habislah lautan itu sebelum habis (ditulis) kalimat-kalimat Tuhanku, meskipun Kami datangkan tambahan sebanyak itu (pula)\".",
      "ar": "قُل لَّوۡ كَانَ ٱلۡبَحۡرُ مِدَادࣰا لِّكَلِمَـٰتِ رَبِّی لَنَفِدَ ٱلۡبَحۡرُ قَبۡلَ أَن تَنفَدَ كَلِمَـٰتُ رَبِّی وَلَوۡ جِئۡنَا بِمِثۡلِهِۦ مَدَدࣰا\n"
    }
  },
  {
    "id": 2250,
    "surahId": 18,
    "ayahNumber": 110,
    "arabicText": "قُلۡ إِنَّمَاۤ أَنَا۠ بَشَرࣱ مِّثۡلُكُمۡ یُوحَىٰۤ إِلَیَّ أَنَّمَاۤ إِلَـٰهُكُمۡ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۖ فَمَن كَانَ یَرۡجُوا۟ لِقَاۤءَ رَبِّهِۦ فَلۡیَعۡمَلۡ عَمَلࣰا صَـٰلِحࣰا وَلَا یُشۡرِكۡ بِعِبَادَةِ رَبِّهِۦۤ أَحَدَۢا\n",
    "translations": {
      "en": "Say [O Prophet]: \"I am but a mortal man like all of you. It has been revealed unto me that your God is the One and Only God. Hence, whoever looks forward [with hope and awe] to meeting his Sustainer [on Judgment Day], let him do righteous deeds, and let him not ascribe unto anyone or anything a share in the worship due to his Sustainer!\"",
      "ms": "Katakanlah (wahai Muhammad): \"Sesungguhnya aku hanyalah seorang manusia seperti kamu, diwahyukan kepadaku bahawa Tuhan kamu hanyalah Tuhan Yang Satu; Oleh itu, sesiapa yang percaya dan berharap akan pertemuan dengan Tuhannya, hendaklah ia mengerjakan amal yang soleh dan janganlah ia mempersekutukan sesiapapun dalam ibadatnya kepada Tuhannya\".",
      "id": "Katakanlah: Sesungguhnya aku ini manusia biasa seperti kamu, yang diwahyukan kepadaku: \"Bahwa sesungguhnya Tuhan kamu itu adalah Tuhan yang Esa\". Barangsiapa mengharap perjumpaan dengan Tuhannya, maka hendaklah ia mengerjakan amal yang saleh dan janganlah ia mempersekutukan seorangpun dalam beribadat kepada Tuhannya\".",
      "ar": "قُلۡ إِنَّمَاۤ أَنَا۠ بَشَرࣱ مِّثۡلُكُمۡ یُوحَىٰۤ إِلَیَّ أَنَّمَاۤ إِلَـٰهُكُمۡ إِلَـٰهࣱ وَ ٰ⁠حِدࣱۖ فَمَن كَانَ یَرۡجُوا۟ لِقَاۤءَ رَبِّهِۦ فَلۡیَعۡمَلۡ عَمَلࣰا صَـٰلِحࣰا وَلَا یُشۡرِكۡ بِعِبَادَةِ رَبِّهِۦۤ أَحَدَۢا\n"
    }
  }
]