[
  {
    "id": 4511,
    "surahId": 46,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ حمۤ\n",
    "translations": {
      "en": "Ha. Mim.",
      "ms": "Haa, Miim.",
      "id": "Haa Miim.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ حمۤ\n"
    }
  },
  {
    "id": 4512,
    "surahId": 46,
    "ayahNumber": 2,
    "arabicText": "تَنزِیلُ ٱلۡكِتَـٰبِ مِنَ ٱللَّهِ ٱلۡعَزِیزِ ٱلۡحَكِیمِ\n",
    "translations": {
      "en": "THE BESTOWAL from on high of this divine writ I issues from God, the Almighty, the Wise.",
      "ms": "Diturunkan Al-Quran ini, dari Allah Yang Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Diturunkan Kitab ini dari Allah Yang Maha Perkasa lagi Maha Bijaksana.",
      "ar": "تَنزِیلُ ٱلۡكِتَـٰبِ مِنَ ٱللَّهِ ٱلۡعَزِیزِ ٱلۡحَكِیمِ\n"
    }
  },
  {
    "id": 4513,
    "surahId": 46,
    "ayahNumber": 3,
    "arabicText": "مَا خَلَقۡنَا ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَمَا بَیۡنَهُمَاۤ إِلَّا بِٱلۡحَقِّ وَأَجَلࣲ مُّسَمࣰّىۚ وَٱلَّذِینَ كَفَرُوا۟ عَمَّاۤ أُنذِرُوا۟ مُعۡرِضُونَ\n",
    "translations": {
      "en": "We have not created the heavens and the earth and all that is between them otherwise than in accord­ance with [an inner] truth, and for a term set [by Us]: and yet, they who are bent on denying the truth turn aside from the warning which has been conveyed unto them.",
      "ms": "(Ingatlah), tidaklah Kami menciptakan langit dan bumi serta segala yang ada di antara keduanya melainkan dengan ada gunanya yang benar dan dengan ada masa penghujungnya yang tertentu (yang padanya dijalankan pembalasan); dan orang-orang yang kafir berpaling dari menerima peringatan yang diberikan kepada mereka mengenainya.",
      "id": "Kami tiada menciptakan langit dan bumi dan apa yang ada antara keduanya melainkan dengan (tujuan) yang benar dan dalam waktu yang ditentukan. Dan orang-orang yang kafir berpaling dari apa yang diperingatkan kepada mereka.",
      "ar": "مَا خَلَقۡنَا ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَمَا بَیۡنَهُمَاۤ إِلَّا بِٱلۡحَقِّ وَأَجَلࣲ مُّسَمࣰّىۚ وَٱلَّذِینَ كَفَرُوا۟ عَمَّاۤ أُنذِرُوا۟ مُعۡرِضُونَ\n"
    }
  },
  {
    "id": 4514,
    "surahId": 46,
    "ayahNumber": 4,
    "arabicText": "قُلۡ أَرَءَیۡتُم مَّا تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِی مَاذَا خَلَقُوا۟ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكࣱ فِی ٱلسَّمَـٰوَ ٰ⁠تِۖ ٱئۡتُونِی بِكِتَـٰبࣲ مِّن قَبۡلِ هَـٰذَاۤ أَوۡ أَثَـٰرَةࣲ مِّنۡ عِلۡمٍ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "Say: “Have you [really] given thought to what it is that you invoke instead of God? Show me what these [beings or forces] have created anywhere on earth! Or had they, perchance, a share in [creating] the heavens? [If so,] bring me any divine writ pre­ceding this one, or any [other] vestige of knowledge - if what you claim is true!”",
      "ms": "Katakanlah (wahai Muhammad kepada orang-orang musyrik yang menentangmu): \"Sudahkah kamu mengetahui kekuasaan dan kelayakan makhluk - makhluk yang kamu seru dan sembah yang lain dari Allah? Tunjukkanlah kepadaku apakah yang mereka ciptakan dari bahagian bumi ini? Atau adakah mereka mempunyai sebarang perkongsian (dengan Allah) dalam mencipta dan menguruskan langit? Bawalah kamu kepadaku sebuah Kitab (dari Allah) yang lain dari Al-Quran ini, atau sebarang keterangan yang berdasarkan ilmu (peninggalan orang-orang yang telah lalu) kalau betul kamu orang-orang yang benar (tentang dakwaan kamu itu)!\"",
      "id": "Katakanlah: \"Terangkanlah kepadaku tentang apa yang kamu sembah selain Allah; perlihatkan kepada-Ku apakah yang telah mereka ciptakan dari bumi ini atau adakah mereka berserikat (dengan Allah) dalam (penciptaan) langit? Bawalah kepada-Ku Kitab yang sebelum (Al Quran) ini atau peninggalan dari pengetahuan (orang-orang dahulu), jika kamu adalah orang-orang yang benar\"",
      "ar": "قُلۡ أَرَءَیۡتُم مَّا تَدۡعُونَ مِن دُونِ ٱللَّهِ أَرُونِی مَاذَا خَلَقُوا۟ مِنَ ٱلۡأَرۡضِ أَمۡ لَهُمۡ شِرۡكࣱ فِی ٱلسَّمَـٰوَ ٰ⁠تِۖ ٱئۡتُونِی بِكِتَـٰبࣲ مِّن قَبۡلِ هَـٰذَاۤ أَوۡ أَثَـٰرَةࣲ مِّنۡ عِلۡمٍ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 4515,
    "surahId": 46,
    "ayahNumber": 5,
    "arabicText": "وَمَنۡ أَضَلُّ مِمَّن یَدۡعُوا۟ مِن دُونِ ٱللَّهِ مَن لَّا یَسۡتَجِیبُ لَهُۥۤ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ وَهُمۡ عَن دُعَاۤىِٕهِمۡ غَـٰفِلُونَ\n",
    "translations": {
      "en": "And who could be more astray than one who invokes, instead of God, such as will not respond to him either now or on the Day of Resurrection, and are not even conscious of being invoked?",
      "ms": "Dan tidak ada yang lebih sesat daripada orang yang menyembah sesuatu yang lain dari Allah, yang tidak dapat menyahut atau memberikan sebarang pertolongan kepadanya (dari dunia) hinggalah ke hari kiamat, sedang makhluk-makhluk yang mereka sembah itu tidak dapat menyedari atau memberi layanan baik kepada permohonan mereka.",
      "id": "Dan siapakah yang lebih sesat daripada orang yang menyembah sembahan-sembahan selain Allah yang tiada dapat memperkenankan (doa)nya sampai hari kiamat dan mereka lalai dari (memperhatikan) doa mereka?",
      "ar": "وَمَنۡ أَضَلُّ مِمَّن یَدۡعُوا۟ مِن دُونِ ٱللَّهِ مَن لَّا یَسۡتَجِیبُ لَهُۥۤ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ وَهُمۡ عَن دُعَاۤىِٕهِمۡ غَـٰفِلُونَ\n"
    }
  },
  {
    "id": 4516,
    "surahId": 46,
    "ayahNumber": 6,
    "arabicText": "وَإِذَا حُشِرَ ٱلنَّاسُ كَانُوا۟ لَهُمۡ أَعۡدَاۤءࣰ وَكَانُوا۟ بِعِبَادَتِهِمۡ كَـٰفِرِینَ\n",
    "translations": {
      "en": "such as, when all mankind is gathered [for judgment], will be enemies unto those [who worshipped them], and will utterly reject their worship?",
      "ms": "Dan apabila manusia dihimpunkan (untuk dihitung amalnya pada hari akhirat), menjadilah segala yang disembah itu musuh kepada orang-orang yang menyembahnya, dan segala yang disembah itu juga tidak mengakui serta mendustakan penyembahan mereka kepadanya.",
      "id": "Dan apabila manusia dikumpulkan (pada hari kiamat) niscaya sembahan-sembahan itu menjadi musuh mereka dan mengingkari pemujaan-pemujaan mereka.",
      "ar": "وَإِذَا حُشِرَ ٱلنَّاسُ كَانُوا۟ لَهُمۡ أَعۡدَاۤءࣰ وَكَانُوا۟ بِعِبَادَتِهِمۡ كَـٰفِرِینَ\n"
    }
  },
  {
    "id": 4517,
    "surahId": 46,
    "ayahNumber": 7,
    "arabicText": "وَإِذَا تُتۡلَىٰ عَلَیۡهِمۡ ءَایَـٰتُنَا بَیِّنَـٰتࣲ قَالَ ٱلَّذِینَ كَفَرُوا۟ لِلۡحَقِّ لَمَّا جَاۤءَهُمۡ هَـٰذَا سِحۡرࣱ مُّبِینٌ\n",
    "translations": {
      "en": "But whenever Our messages are conveyed to them in all their clarity, they who are bent on denying the truth speak thus of the truth as soon as it is brought to them: “This is clearly nothing but spell­binding eloquence!”",
      "ms": "Dan apabila dibacakan kepada mereka (yang kafir) ayat-ayat Quran kami yang jelas nyata, berkatalah mereka terhadap kebenaran (Al-Quran) bila sahaja disampaikan kepada mereka: \"Ini ialah sihir yang nyata!\".",
      "id": "Dan apabila dibacakan kepada mereka ayat-ayat Kami yang menjelaskan, berkatalah orang-orang yang mengingkari kebenaran ketika kebenaran itu datang kepada mereka: \"Ini adalah sihir yang nyata\".",
      "ar": "وَإِذَا تُتۡلَىٰ عَلَیۡهِمۡ ءَایَـٰتُنَا بَیِّنَـٰتࣲ قَالَ ٱلَّذِینَ كَفَرُوا۟ لِلۡحَقِّ لَمَّا جَاۤءَهُمۡ هَـٰذَا سِحۡرࣱ مُّبِینٌ\n"
    }
  },
  {
    "id": 4518,
    "surahId": 46,
    "ayahNumber": 8,
    "arabicText": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَیۡتُهُۥ فَلَا تَمۡلِكُونَ لِی مِنَ ٱللَّهِ شَیۡـًٔاۖ هُوَ أَعۡلَمُ بِمَا تُفِیضُونَ فِیهِۚ كَفَىٰ بِهِۦ شَهِیدَۢا بَیۡنِی وَبَیۡنَكُمۡۖ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِیمُ\n",
    "translations": {
      "en": "Or do they say, “He has invented all this”? Say [O Muhammad]: “Had I invented it, you would not be of the least help to me against God. He is fully aware of that [slander] into which you so reck­lessly plunge: enough is He as a witness between me and you! And [withal,] He alone is truly-forgiving, a true dispenser of grace.”",
      "ms": "(Bukan setakat itu sahaja mereka katakan) bahkan mereka menuduh dengan berkata: \"Muhammad telah merekakan Al-Quran itu.\" Katakanlah (Wahai Muhammad): \"Kalau aku merekakan Al-Quran itu (maka tentulah aku tidak terlepas dari azab kesalahan itu) kerana kamu (dan juga yang lain dari kamu) tidak berkuasa memberikan daku sebarang perlindungan dari (azab) Allah. Allah lebih mengetahui akan (tuduhan-tuduhan yang tidak berasas) yang kamu perkatakan itu; cukuplah Allah menjadi saksi antaraku dengan kamu, dan Dia lah jua Yang Maha Pengampun, lagi Maha Mengasihani.\"",
      "id": "Bahkan mereka mengatakan: \"Dia (Muhammad) telah mengada-adakannya (Al Quran)\". Katakanlah: \"Jika aku mengada-adakannya, maka kamu tiada mempunyai kuasa sedikitpun mempertahankan aku dari (azab) Allah itu. Dia lebih mengetahui apa-apa yang kamu percakapkan tentang Al Quran itu. Cukuplah Dia menjadi saksi antaraku dan antaramu dan Dialah Yang Maha Pengampun lagi Maha Penyayang\".",
      "ar": "أَمۡ یَقُولُونَ ٱفۡتَرَىٰهُۖ قُلۡ إِنِ ٱفۡتَرَیۡتُهُۥ فَلَا تَمۡلِكُونَ لِی مِنَ ٱللَّهِ شَیۡـًٔاۖ هُوَ أَعۡلَمُ بِمَا تُفِیضُونَ فِیهِۚ كَفَىٰ بِهِۦ شَهِیدَۢا بَیۡنِی وَبَیۡنَكُمۡۖ وَهُوَ ٱلۡغَفُورُ ٱلرَّحِیمُ\n"
    }
  },
  {
    "id": 4519,
    "surahId": 46,
    "ayahNumber": 9,
    "arabicText": "قُلۡ مَا كُنتُ بِدۡعࣰا مِّنَ ٱلرُّسُلِ وَمَاۤ أَدۡرِی مَا یُفۡعَلُ بِی وَلَا بِكُمۡۖ إِنۡ أَتَّبِعُ إِلَّا مَا یُوحَىٰۤ إِلَیَّ وَمَاۤ أَنَا۠ إِلَّا نَذِیرࣱ مُّبِینࣱ\n",
    "translations": {
      "en": "Say: “I am not the first of [God’s] apostles; and [like all of them,] I do not know what will be done with me or with you: for I am nothing but a plain warner.”",
      "ms": "Katakanlah lagi: \"Bukanlah aku seorang Rasul pembawa ugama yang berlainan dari ugama yang dibawa oleh Rasul-rasul (yang telah lalu), dan aku tidak mengetahui apa yang akan dilakukan kepadaku dan kepada kamu. Aku tidak melakukan sesuatu melainkan menurut apa yang diwahyukan kepadaku, dan aku tidak lain hanyalah seorang Rasul pemberi amaran yang jelas nyata\"",
      "id": "Katakanlah: \"Aku bukanlah rasul yang pertama di antara rasul-rasul dan aku tidak mengetahui apa yang akan diperbuat terhadapku dan tidak (pula) terhadapmu. Aku tidak lain hanyalah mengikuti apa yang diwahyukan kepadaku dan aku tidak lain hanyalah seorang pemberi peringatan yang menjelaskan\".",
      "ar": "قُلۡ مَا كُنتُ بِدۡعࣰا مِّنَ ٱلرُّسُلِ وَمَاۤ أَدۡرِی مَا یُفۡعَلُ بِی وَلَا بِكُمۡۖ إِنۡ أَتَّبِعُ إِلَّا مَا یُوحَىٰۤ إِلَیَّ وَمَاۤ أَنَا۠ إِلَّا نَذِیرࣱ مُّبِینࣱ\n"
    }
  },
  {
    "id": 4520,
    "surahId": 46,
    "ayahNumber": 10,
    "arabicText": "قُلۡ أَرَءَیۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ وَكَفَرۡتُم بِهِۦ وَشَهِدَ شَاهِدࣱ مِّنۢ بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ عَلَىٰ مِثۡلِهِۦ فَـَٔامَنَ وَٱسۡتَكۡبَرۡتُمۡۚ إِنَّ ٱللَّهَ لَا یَهۡدِی ٱلۡقَوۡمَ ٱلظَّـٰلِمِینَ\n",
    "translations": {
      "en": "Say: “Have you given thought [to how you will fare] if this be truly [a revelation] from God and yet you deny its truth? - even though a witness from among the children of Israel has already borne wit­ness to [the advent of] one like himself, and has believed [in him], the while you glory in your arro­gance [and reject his message]? Verily, God does not grace [such] evildoing folk with His guidance!”",
      "ms": "Katakanlah lagi: \"Bagaimana fikiran kamu jika Al-Quran ini (yang datangnya) dari Allah dan kamu mengingkarinya, pada hal ada seorang saksi dari Bani Israil memberi keterangan mengakui (sahnya Kitab) yang sama seperti Al-Quran ini, lalu ia percayakan (Al-Quran ini dari Allah), sedang kamu dengan sombong angkuh mengingkarinya? (Tidakkah dengan yang demikian kamu bersifat zalim)? Sesungguhnya Allah tidak memberi hidayah petunjuk kepada orang-orang yang zalim (yang degil dalam kekufurannya)\".",
      "id": "Katakanlah: \"Terangkanlah kepadaku, bagaimanakah pendapatmu jika Al Quran itu datang dari sisi Allah, padahal kamu mengingkarinya dan seorang saksi dari Bani Israil mengakui (kebenaran) yang serupa dengan (yang tersebut dalam) Al Quran lalu dia beriman, sedang kamu menyombongkan diri. Sesungguhnya Allah tiada memberi petunjuk kepada orang-orang yang zalim\".",
      "ar": "قُلۡ أَرَءَیۡتُمۡ إِن كَانَ مِنۡ عِندِ ٱللَّهِ وَكَفَرۡتُم بِهِۦ وَشَهِدَ شَاهِدࣱ مِّنۢ بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ عَلَىٰ مِثۡلِهِۦ فَـَٔامَنَ وَٱسۡتَكۡبَرۡتُمۡۚ إِنَّ ٱللَّهَ لَا یَهۡدِی ٱلۡقَوۡمَ ٱلظَّـٰلِمِینَ\n"
    }
  },
  {
    "id": 4521,
    "surahId": 46,
    "ayahNumber": 11,
    "arabicText": "وَقَالَ ٱلَّذِینَ كَفَرُوا۟ لِلَّذِینَ ءَامَنُوا۟ لَوۡ كَانَ خَیۡرࣰا مَّا سَبَقُونَاۤ إِلَیۡهِۚ وَإِذۡ لَمۡ یَهۡتَدُوا۟ بِهِۦ فَسَیَقُولُونَ هَـٰذَاۤ إِفۡكࣱ قَدِیمࣱ\n",
    "translations": {
      "en": "But they who are bent on denying the truth speak thus of those who have attained to faith: “If this [message] were any good, these [people] would not have preceded us in accepting it!” And since they refuse to be guided by it, they will always say, “This is [but] an ancient falsehood!”",
      "ms": "Dan (kerana sombong angkuhnya orang-orang kafir itu) mereka berkata tentang kepercayaan orang-orang yang beriman: \"Kalaulah (apa yang dibawa oleh Muhammad) itu perkara yang baik tentulah mereka tidak mendahului kami mempercayainya (kerana kamilah yang sepatutnya menerima segala kebaikan)!\" Dan setelah mereka tidak dapat menerima petunjuk Al-Quran itu, (mereka memusuhinya) lalu mereka mencacinya dengan berkata: \"Al-Quran ini ialah rekaan dusta yang sudah lama\".",
      "id": "Dan orang-orang kafir berkata kepada orang-orang yang beriman: \"Kalau sekiranya di (Al Quran) adalah suatu yang baik, tentulah mereka tiada mendahului kami (beriman) kepadanya. Dan karena mereka tidak mendapat petunjuk dengannya maka mereka akan berkata: \"Ini adalah dusta yang lama\".",
      "ar": "وَقَالَ ٱلَّذِینَ كَفَرُوا۟ لِلَّذِینَ ءَامَنُوا۟ لَوۡ كَانَ خَیۡرࣰا مَّا سَبَقُونَاۤ إِلَیۡهِۚ وَإِذۡ لَمۡ یَهۡتَدُوا۟ بِهِۦ فَسَیَقُولُونَ هَـٰذَاۤ إِفۡكࣱ قَدِیمࣱ\n"
    }
  },
  {
    "id": 4522,
    "surahId": 46,
    "ayahNumber": 12,
    "arabicText": "وَمِن قَبۡلِهِۦ كِتَـٰبُ مُوسَىٰۤ إِمَامࣰا وَرَحۡمَةࣰۚ وَهَـٰذَا كِتَـٰبࣱ مُّصَدِّقࣱ لِّسَانًا عَرَبِیࣰّا لِّیُنذِرَ ٱلَّذِینَ ظَلَمُوا۟ وَبُشۡرَىٰ لِلۡمُحۡسِنِینَ\n",
    "translations": {
      "en": "And yet, before this there was the revelation of Moses, a guide and a [sign of God’s] grace; and this [Qur’an] is a divine writ confirming the truth [of the Torah] in the Arabic tongue, to warn those who are bent on evildoing, and [to bring] a glad tiding to the doers of good:",
      "ms": "(Bagaimana mereka tergamak mengatakan Al-Quran ini rekaan dusta yang telah lama?) Pada hal telah ada sebelumnya Kitab Nabi Musa yang menjadi ikutan dan rahmat (kepada umatnya); dan Al-Quran pula sebuah Kitab - yang mengesahkan kebenaran (kitab-kitab yang telah lalu), - diturunkan dalam bahasa Arab untuk memberi amaran kepada orang-orang yang zalim, dan berita gembira bagi orang-orang yang berbuat kebaikan.",
      "id": "Dan sebelum Al Quran itu telah ada kitab Musa sebagai petunjuk dan rahmat. Dan ini (Al Quran) adalah kitab yang membenarkannya dalam bahasa Arab untuk memberi peringatan kepada orang-orang yang zalim dan memberi kabar gembira kepada orang-orang yang berbuat baik.",
      "ar": "وَمِن قَبۡلِهِۦ كِتَـٰبُ مُوسَىٰۤ إِمَامࣰا وَرَحۡمَةࣰۚ وَهَـٰذَا كِتَـٰبࣱ مُّصَدِّقࣱ لِّسَانًا عَرَبِیࣰّا لِّیُنذِرَ ٱلَّذِینَ ظَلَمُوا۟ وَبُشۡرَىٰ لِلۡمُحۡسِنِینَ\n"
    }
  },
  {
    "id": 4523,
    "surahId": 46,
    "ayahNumber": 13,
    "arabicText": "إِنَّ ٱلَّذِینَ قَالُوا۟ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَـٰمُوا۟ فَلَا خَوۡفٌ عَلَیۡهِمۡ وَلَا هُمۡ یَحۡزَنُونَ\n",
    "translations": {
      "en": "for, behold, all who say, “Our Sustainer is God”, and thereafter stand firm [in their faith] - no fear need they have, and neither shall they grieve:",
      "ms": "Sesungguhnya orang-orang yang menegaskan keyakinannya dengan berkata: \"Tuhan kami ialah Allah\", kemudian mereka tetap teguh di atas jalan yang betul (dengan pengakuan iman dan tauhidnya itu), maka tidak ada kebimbangan (dari sesuatu yang tidak baik) terhadap mereka, dan mereka pula tidak akan berdukacita.",
      "id": "Sesungguhnya orang-orang yang mengatakan: \"Tuhan kami ialah Allah\", kemudian mereka tetap istiqamah maka tidak ada kekhawatiran terhadap mereka dan mereka tiada (pula) berduka cita.",
      "ar": "إِنَّ ٱلَّذِینَ قَالُوا۟ رَبُّنَا ٱللَّهُ ثُمَّ ٱسۡتَقَـٰمُوا۟ فَلَا خَوۡفٌ عَلَیۡهِمۡ وَلَا هُمۡ یَحۡزَنُونَ\n"
    }
  },
  {
    "id": 4524,
    "surahId": 46,
    "ayahNumber": 14,
    "arabicText": "أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلۡجَنَّةِ خَـٰلِدِینَ فِیهَا جَزَاۤءَۢ بِمَا كَانُوا۟ یَعۡمَلُونَ\n",
    "translations": {
      "en": "it is they who are destined for paradise, therein to abide as a reward for all that they have done.",
      "ms": "Merekalah ahli Syurga, tetap kekalah mereka di dalamnya, sebagai balasan bagi amal-amal soleh yang mereka telah kerjakan.",
      "id": "Mereka itulah penghuni-penghuni surga, mereka kekal di dalamnya; sebagai balasan atas apa yang telah mereka kerjakan.",
      "ar": "أُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلۡجَنَّةِ خَـٰلِدِینَ فِیهَا جَزَاۤءَۢ بِمَا كَانُوا۟ یَعۡمَلُونَ\n"
    }
  },
  {
    "id": 4525,
    "surahId": 46,
    "ayahNumber": 15,
    "arabicText": "وَوَصَّیۡنَا ٱلۡإِنسَـٰنَ بِوَ ٰ⁠لِدَیۡهِ إِحۡسَـٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ كُرۡهࣰا وَوَضَعَتۡهُ كُرۡهࣰاۖ وَحَمۡلُهُۥ وَفِصَـٰلُهُۥ ثَلَـٰثُونَ شَهۡرًاۚ حَتَّىٰۤ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرۡبَعِینَ سَنَةࣰ قَالَ رَبِّ أَوۡزِعۡنِیۤ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِیۤ أَنۡعَمۡتَ عَلَیَّ وَعَلَىٰ وَ ٰ⁠لِدَیَّ وَأَنۡ أَعۡمَلَ صَـٰلِحࣰا تَرۡضَىٰهُ وَأَصۡلِحۡ لِی فِی ذُرِّیَّتِیۤۖ إِنِّی تُبۡتُ إِلَیۡكَ وَإِنِّی مِنَ ٱلۡمُسۡلِمِینَ\n",
    "translations": {
      "en": "NOW [among the best of the deeds which] We have enjoined upon man is goodness towards his parents. In pain did his mother bear him, and in pain did she give him birth; and her bearing him and his utter dependence on her took thirty months. and so, when he attains to full maturity and reaches forty years, he [that is righteous] prays: “O my Sustainer! Inspire me so that I may forever be grateful for those blessings of Thine with which Thou hast graced me and my parents, and that I may do what is right [in a manner] that will meet with Thy goodly acceptance; and grant me righteousness in my offspring [as well]. Verily, unto Thee have I turned in repentance: for, verily, I am of those who have surrendered themselves unto Thee!”",
      "ms": "Dan Kami wajibkan manusia berbuat baik kepada kedua ibu bapanya; ibunya telah mengandungnya dengan menanggung susah payah dan telah melahirkannya dengan menanggung susah payah. Sedang tempoh mengandungnya beserta dengan tempoh menceraikan susunya ialah dalam masa tiga puluh bulan. Setelah ia besar sampai ke peringkat dewasa yang sempurna kekuatannya dan sampai ke peringkat umur empat puluh tahun, berdoalah ia dengan berkata: \"Wahai Tuhanku, ilhamkanlah daku supaya tetap bersyukur akan nikmatmu yang engkau kurniakan kepadaku dan kepada ibu bapaku, dan supaya aku tetap mengerjakan amal soleh yang Engkau redai; dan jadikanlah sifat-sifat kebaikan meresap masuk ke dalam jiwa zuriat keturunanku. Sesungguhnya aku bertaubat kepadamu, dan sesungguhnya aku dari orang-orang Islam (yang tunduk patuh kepadamu)\".",
      "id": "Kami perintahkan kepada manusia supaya berbuat baik kepada dua orang ibu bapaknya, ibunya mengandungnya dengan susah payah, dan melahirkannya dengan susah payah (pula). Mengandungnya sampai menyapihnya adalah tiga puluh bulan, sehingga apabila dia telah dewasa dan umurnya sampai empat puluh tahun ia berdoa: \"Ya Tuhanku, tunjukilah aku untuk mensyukuri nikmat Engkau yang telah Engkau berikan kepadaku dan kepada ibu bapakku dan supaya aku dapat berbuat amal yang saleh yang Engkau ridhai; berilah kebaikan kepadaku dengan (memberi kebaikan) kepada anak cucuku. Sesungguhnya aku bertaubat kepada Engkau dan sesungguhnya aku termasuk orang-orang yang berserah diri\".",
      "ar": "وَوَصَّیۡنَا ٱلۡإِنسَـٰنَ بِوَ ٰ⁠لِدَیۡهِ إِحۡسَـٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ كُرۡهࣰا وَوَضَعَتۡهُ كُرۡهࣰاۖ وَحَمۡلُهُۥ وَفِصَـٰلُهُۥ ثَلَـٰثُونَ شَهۡرًاۚ حَتَّىٰۤ إِذَا بَلَغَ أَشُدَّهُۥ وَبَلَغَ أَرۡبَعِینَ سَنَةࣰ قَالَ رَبِّ أَوۡزِعۡنِیۤ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِیۤ أَنۡعَمۡتَ عَلَیَّ وَعَلَىٰ وَ ٰ⁠لِدَیَّ وَأَنۡ أَعۡمَلَ صَـٰلِحࣰا تَرۡضَىٰهُ وَأَصۡلِحۡ لِی فِی ذُرِّیَّتِیۤۖ إِنِّی تُبۡتُ إِلَیۡكَ وَإِنِّی مِنَ ٱلۡمُسۡلِمِینَ\n"
    }
  },
  {
    "id": 4526,
    "surahId": 46,
    "ayahNumber": 16,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ نَتَقَبَّلُ عَنۡهُمۡ أَحۡسَنَ مَا عَمِلُوا۟ وَنَتَجَاوَزُ عَن سَیِّـَٔاتِهِمۡ فِیۤ أَصۡحَـٰبِ ٱلۡجَنَّةِۖ وَعۡدَ ٱلصِّدۡقِ ٱلَّذِی كَانُوا۟ یُوعَدُونَ\n",
    "translations": {
      "en": "It is [such as] these from whom We shall accept the best that they ever did, and whose bad deeds We shall overlook: [they will find themselves] among those who are destined for paradise, in fulfillment of the true promise which they were given [in this world].",
      "ms": "Mereka (yang bersifat dengan sifat-sifat yang terpuji seperti itu) ialah orang-orang yang Kami terima dari mereka amalnya yang baik yang mereka telah kerjakan, dan Kami ampunkan kesalahan-kesalahannya; (mereka akan dimasukkan) dalam kumpulan ahli Syurga, sebagai memenuhi janji yang benar, yang telah dijanjikan kepada mereka.",
      "id": "Mereka itulah orang-orang yang Kami terima dari mereka amal yang baik yang telah mereka kerjakan dan Kami ampuni kesalahan-kesalahan mereka, bersama penghuni-penghuni surga, sebagai janji yang benar yang telah dijanjikan kepada mereka.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ نَتَقَبَّلُ عَنۡهُمۡ أَحۡسَنَ مَا عَمِلُوا۟ وَنَتَجَاوَزُ عَن سَیِّـَٔاتِهِمۡ فِیۤ أَصۡحَـٰبِ ٱلۡجَنَّةِۖ وَعۡدَ ٱلصِّدۡقِ ٱلَّذِی كَانُوا۟ یُوعَدُونَ\n"
    }
  },
  {
    "id": 4527,
    "surahId": 46,
    "ayahNumber": 17,
    "arabicText": "وَٱلَّذِی قَالَ لِوَ ٰ⁠لِدَیۡهِ أُفࣲّ لَّكُمَاۤ أَتَعِدَانِنِیۤ أَنۡ أُخۡرَجَ وَقَدۡ خَلَتِ ٱلۡقُرُونُ مِن قَبۡلِی وَهُمَا یَسۡتَغِیثَانِ ٱللَّهَ وَیۡلَكَ ءَامِنۡ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّ فَیَقُولُ مَا هَـٰذَاۤ إِلَّاۤ أَسَـٰطِیرُ ٱلۡأَوَّلِینَ\n",
    "translations": {
      "en": "But [there is many a one] who says to his parents [whenever they try to imbue him with faith in God]: “Fie upon both of you! Do you promise me that I shall be brought forth [from the dead], although [so many] generations have passed away before me?” And [while] they both pray for God’s help [and say], “Alas for thee! For, behold, God’s promise always comes true!” - he but answers, “All this is nothing but fables of ancient times!”",
      "ms": "Dan (sebaliknya amatlah derhakanya) orang yang berkata kepada kedua ibu bapanya (ketika mereka mengajaknya beriman): \"Ah! Bosan perasaanku terhadap kamu berdua! Patutkah kamu menjanjikan kepadaku bahawa aku akan dibangkitkan keluar dari kubur, padahal berbagai umat sebelumku telah berlalu (masih lagi belum kembali)? \" Sambil mendengar kata-katanya itu - ibu bapanya merayu memohon pertolongan Allah (menyelamatkan anak mereka) serta berkata (kepada anaknya yang ingkar itu): \"Selamatkanlah dirimu! Berimanlah (tentang hidup semula menerima balasan amal)! Sesungguhnya janji Allah tetap benar\". Lalu ia menjawab (dengan angkuhnya): \"Semuanya itu hanyalah cerita-cerita dongeng orang-orang dahulu kala!\"",
      "id": "Dan orang yang berkata kepada dua orang ibu bapaknya: \"Cis bagi kamu keduanya, apakah kamu keduanya memperingatkan kepadaku bahwa aku akan dibangkitkan, padahal sungguh telah berlalu beberapa umat sebelumku? lalu kedua ibu bapaknya itu memohon pertolongan kepada Allah seraya mengatakan: \"Celaka kamu, berimanlah! Sesungguhnya janji Allah adalah benar\". Lalu dia berkata: \"Ini tidak lain hanyalah dongengan orang-orang dahulu belaka\".",
      "ar": "وَٱلَّذِی قَالَ لِوَ ٰ⁠لِدَیۡهِ أُفࣲّ لَّكُمَاۤ أَتَعِدَانِنِیۤ أَنۡ أُخۡرَجَ وَقَدۡ خَلَتِ ٱلۡقُرُونُ مِن قَبۡلِی وَهُمَا یَسۡتَغِیثَانِ ٱللَّهَ وَیۡلَكَ ءَامِنۡ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّ فَیَقُولُ مَا هَـٰذَاۤ إِلَّاۤ أَسَـٰطِیرُ ٱلۡأَوَّلِینَ\n"
    }
  },
  {
    "id": 4528,
    "surahId": 46,
    "ayahNumber": 18,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ حَقَّ عَلَیۡهِمُ ٱلۡقَوۡلُ فِیۤ أُمَمࣲ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُوا۟ خَـٰسِرِینَ\n",
    "translations": {
      "en": "It is [such as] these upon whom the sentence [of doom] will fall due, together with the [other sinful] communities of invisible beings and humans that have passed away before their time. Verily, they will be lost:",
      "ms": "Mereka (yang ingkar derhaka seperti itu) ialah orang-orang yang tetap menerima hukuman (azab) bersama-sama dengan umat-umat yang terdahulu daripada mereka - dari kalangan jin dan manusia; kerana sesungguhnya mereka telah menyebabkan diri mereka menjadi orang-orang yang rugi.",
      "id": "Mereka itulah orang-orang yang telah pasti ketetapan (azab) atas mereka bersama umat-umat yang telah berlalu sebelum mereka dari jin dan manusia. Sesungguhnya mereka adalah orang-orang yang merugi.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ حَقَّ عَلَیۡهِمُ ٱلۡقَوۡلُ فِیۤ أُمَمࣲ قَدۡ خَلَتۡ مِن قَبۡلِهِم مِّنَ ٱلۡجِنِّ وَٱلۡإِنسِۖ إِنَّهُمۡ كَانُوا۟ خَـٰسِرِینَ\n"
    }
  },
  {
    "id": 4529,
    "surahId": 46,
    "ayahNumber": 19,
    "arabicText": "وَلِكُلࣲّ دَرَجَـٰتࣱ مِّمَّا عَمِلُوا۟ۖ وَلِیُوَفِّیَهُمۡ أَعۡمَـٰلَهُمۡ وَهُمۡ لَا یُظۡلَمُونَ\n",
    "translations": {
      "en": "for, [in the life to come,] all shall have their degrees in accordance with whatever [good or evil] they did: and so, He will repay them in full for their doings, and none shall be wronged.",
      "ms": "Dan bagi mereka masing-masing (dari puak jin dan manusia - yang berbuat baik dan yang berbuat jahat) disediakan berbagai peringkat (balasan) yang sesuai dengan apa yang mereka telah kerjakan, dan (ketetapan yang demikian ialah) supaya Allah menyempurnakan bagi mereka balasan amal-amal mereka, sedang mereka tidak dirugikan (sedikitpun).",
      "id": "Dan bagi masing-masing mereka derajat menurut apa yang telah mereka kerjakan dan agar Allah mencukupkan bagi mereka (balasan) pekerjaan-pekerjaan mereka sedang mereka tiada dirugikan.",
      "ar": "وَلِكُلࣲّ دَرَجَـٰتࣱ مِّمَّا عَمِلُوا۟ۖ وَلِیُوَفِّیَهُمۡ أَعۡمَـٰلَهُمۡ وَهُمۡ لَا یُظۡلَمُونَ\n"
    }
  },
  {
    "id": 4530,
    "surahId": 46,
    "ayahNumber": 20,
    "arabicText": "وَیَوۡمَ یُعۡرَضُ ٱلَّذِینَ كَفَرُوا۟ عَلَى ٱلنَّارِ أَذۡهَبۡتُمۡ طَیِّبَـٰتِكُمۡ فِی حَیَاتِكُمُ ٱلدُّنۡیَا وَٱسۡتَمۡتَعۡتُم بِهَا فَٱلۡیَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَسۡتَكۡبِرُونَ فِی ٱلۡأَرۡضِ بِغَیۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَفۡسُقُونَ\n",
    "translations": {
      "en": "And on the Day when those who were bent on denying the truth will be brought within sight of the fire, [they will be told:] “You have exhausted your [share of] good things in your worldly life, having enjoyed them [without any thought of the hereafter]: and so today you shall be requited with the suffering of humiliation for having gloried on earth in your arrogance, offending against all that is right, and for all your iniquitous doings!”",
      "ms": "Dan (ingatlah), semasa orang-orang kafir didedahkan kepada neraka (serta dikatakan kepada mereka): \"Kamu telah habiskan nikmat-nikmat kesenangan kamu dalam kehidupan dunia kamu, dan kamu telah bersenang-senang menikmatinya; maka pada hari ini kamu dibalas dengan azab yang menghina kerana kamu berlaku sombong takbur di muka bumi dengan tidak berdasarkan alasan yang benar, dan kerana kamu sentiasa berlaku fasik\"",
      "id": "Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan ke neraka (kepada mereka dikatakan): \"Kamu telah menghabiskan rezekimu yang baik dalam kehidupan duniawimu (saja) dan kamu telah bersenang-senang dengannya; maka pada hari ini kamu dibalasi dengan azab yang menghinakan karena kamu telah menyombongkan diri di muka bumi tanpa hak dan karena kamu telah fasik\".",
      "ar": "وَیَوۡمَ یُعۡرَضُ ٱلَّذِینَ كَفَرُوا۟ عَلَى ٱلنَّارِ أَذۡهَبۡتُمۡ طَیِّبَـٰتِكُمۡ فِی حَیَاتِكُمُ ٱلدُّنۡیَا وَٱسۡتَمۡتَعۡتُم بِهَا فَٱلۡیَوۡمَ تُجۡزَوۡنَ عَذَابَ ٱلۡهُونِ بِمَا كُنتُمۡ تَسۡتَكۡبِرُونَ فِی ٱلۡأَرۡضِ بِغَیۡرِ ٱلۡحَقِّ وَبِمَا كُنتُمۡ تَفۡسُقُونَ\n"
    }
  },
  {
    "id": 4531,
    "surahId": 46,
    "ayahNumber": 21,
    "arabicText": "۞ وَٱذۡكُرۡ أَخَا عَادٍ إِذۡ أَنذَرَ قَوۡمَهُۥ بِٱلۡأَحۡقَافِ وَقَدۡ خَلَتِ ٱلنُّذُرُ مِنۢ بَیۡنِ یَدَیۡهِ وَمِنۡ خَلۡفِهِۦۤ أَلَّا تَعۡبُدُوۤا۟ إِلَّا ٱللَّهَ إِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمٍ عَظِیمࣲ\n",
    "translations": {
      "en": "AND REMEMBER that brother of [the tribe of] Ad, how - seeing that [other] warnings had already come and gone within his own knowledge as well as in times beyond his ken - he warned his people [who lived] among those sand-dunes: “Worship none but God! Verily, I fear lest suffering befall you on an awesome day!”",
      "ms": "Dan ingatlah peristiwa (Nabi Hud) saudara kaum Aad, ketika ia memberi amaran kepada kaumnya yang tinggal di lembah \"Al-Ahqaaf\", - sedang (amarannya itu samalah seperti) amaran-amaran yang telah diberikan oleh Rasul-rasul yang terdahulu daripadanya dan yang datang sesudahnya - (dengan berkata): \"Janganlah kamu menyembah melainkan Allah, sesungguhnya aku bimbang kamu akan beroleh azab hari yang besar (huru-haranya)\".",
      "id": "Dan ingatlah (Hud) saudara kaum 'Aad yaitu ketika dia memberi peringatan kepada kaumnya di Al Ahqaaf dan sesungguhnya telah terdahulu beberapa orang pemberi peringatan sebelumnya dan sesudahnya (dengan mengatakan): \"Janganlah kamu menyembah selain Allah, sesungguhnya aku khawatir kamu akan ditimpa azab hari yang besar\".",
      "ar": "۞ وَٱذۡكُرۡ أَخَا عَادٍ إِذۡ أَنذَرَ قَوۡمَهُۥ بِٱلۡأَحۡقَافِ وَقَدۡ خَلَتِ ٱلنُّذُرُ مِنۢ بَیۡنِ یَدَیۡهِ وَمِنۡ خَلۡفِهِۦۤ أَلَّا تَعۡبُدُوۤا۟ إِلَّا ٱللَّهَ إِنِّیۤ أَخَافُ عَلَیۡكُمۡ عَذَابَ یَوۡمٍ عَظِیمࣲ\n"
    }
  },
  {
    "id": 4532,
    "surahId": 46,
    "ayahNumber": 22,
    "arabicText": "قَالُوۤا۟ أَجِئۡتَنَا لِتَأۡفِكَنَا عَنۡ ءَالِهَتِنَا فَأۡتِنَا بِمَا تَعِدُنَاۤ إِن كُنتَ مِنَ ٱلصَّـٰدِقِینَ\n",
    "translations": {
      "en": "They answered: “Hast thou come to seduce us away from our gods? Bring, then, upon us that [doom] with which thou threaten us, if thou art a man of truth!”",
      "ms": "Mereka menjawab: \"Adakah engkau datang kepada kami untuk memesongkan kami dari menyembah tuhan-tuhan kami? Maka bawalah azab seksa yang engkau janjikan kepada kami itu jika betul engkau dari orang-orang yang benar!\"",
      "id": "Mereka menjawab: \"Apakah kamu datang kepada kami untuk memalingkan kami dari (menyembah) tuhan-tuhan kami? Maka datangkanlah kepada kami azab yang telah kamu ancamkan kepada kami jika kamu termasuk orang-orang yang benar\".",
      "ar": "قَالُوۤا۟ أَجِئۡتَنَا لِتَأۡفِكَنَا عَنۡ ءَالِهَتِنَا فَأۡتِنَا بِمَا تَعِدُنَاۤ إِن كُنتَ مِنَ ٱلصَّـٰدِقِینَ\n"
    }
  },
  {
    "id": 4533,
    "surahId": 46,
    "ayahNumber": 23,
    "arabicText": "قَالَ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَأُبَلِّغُكُم مَّاۤ أُرۡسِلۡتُ بِهِۦ وَلَـٰكِنِّیۤ أَرَىٰكُمۡ قَوۡمࣰا تَجۡهَلُونَ\n",
    "translations": {
      "en": "Said he: “Knowledge [of when it is to befall you] rests with God alone: I but convey unto you the message with which I have been entrusted; but I see that you are people ignorant [of right and wrong]!”",
      "ms": "Nabi Hud berkata: \"Sesungguhnya ilmu pengetahuan (tentang kedatangan azab itu) hanya ada di sisi Allah, dan (tugasku hanya) menyampaikan kepada kamu apa yang aku diutuskan membawanya, tetapi aku lihat kamu satu kaum yang jahil (akan tugas Rasul)!\"",
      "id": "Ia berkata: \"Sesungguhnya pengetahuan (tentang itu) hanya pada sisi Allah dan aku (hanya) menyampaikan kepadamu apa yang aku diutus dengan membawanya tetapi aku lihat kamu adalah kaum yang bodoh\".",
      "ar": "قَالَ إِنَّمَا ٱلۡعِلۡمُ عِندَ ٱللَّهِ وَأُبَلِّغُكُم مَّاۤ أُرۡسِلۡتُ بِهِۦ وَلَـٰكِنِّیۤ أَرَىٰكُمۡ قَوۡمࣰا تَجۡهَلُونَ\n"
    }
  },
  {
    "id": 4534,
    "surahId": 46,
    "ayahNumber": 24,
    "arabicText": "فَلَمَّا رَأَوۡهُ عَارِضࣰا مُّسۡتَقۡبِلَ أَوۡدِیَتِهِمۡ قَالُوا۟ هَـٰذَا عَارِضࣱ مُّمۡطِرُنَاۚ بَلۡ هُوَ مَا ٱسۡتَعۡجَلۡتُم بِهِۦۖ رِیحࣱ فِیهَا عَذَابٌ أَلِیمࣱ\n",
    "translations": {
      "en": "And so, when they beheld it in the shape of a dense cloud approaching their valleys, they exclaimed, “This is but a heavy cloud which will bring us [wel­come] rain!” [But Hud said:] “Nay, but it is the very thing which you [so contemptuously] sought to hasten - a wind bearing grievous suffering,",
      "ms": "Maka apabila mereka melihat azab itu sebagai awan yang menghala ke lembah-lembah mereka, mereka berkata: \"Ini ialah awan yang akan membawa hujan kepada kita!\" (Mendengarkan kata-kata yang demikian, Nabi Hud berkata): \"Tidak! Bahkan itulah (azab) yang kamu minta disegerakan kedatangannya, iaitu angin yang membawa azab seksa yang tidak terperi sakitnya;",
      "id": "Maka tatkala mereka melihat azab itu berupa awan yang menuju ke lembah-lembah mereka, berkatalah mereka: \"Inilah awan yang akan menurunkan hujan kepada kami\". (Bukan!) bahkan itulah azab yang kamu minta supaya datang dengan segera (yaitu) angin yang mengandung azab yang pedih,",
      "ar": "فَلَمَّا رَأَوۡهُ عَارِضࣰا مُّسۡتَقۡبِلَ أَوۡدِیَتِهِمۡ قَالُوا۟ هَـٰذَا عَارِضࣱ مُّمۡطِرُنَاۚ بَلۡ هُوَ مَا ٱسۡتَعۡجَلۡتُم بِهِۦۖ رِیحࣱ فِیهَا عَذَابٌ أَلِیمࣱ\n"
    }
  },
  {
    "id": 4535,
    "surahId": 46,
    "ayahNumber": 25,
    "arabicText": "تُدَمِّرُ كُلَّ شَیۡءِۭ بِأَمۡرِ رَبِّهَا فَأَصۡبَحُوا۟ لَا یُرَىٰۤ إِلَّا مَسَـٰكِنُهُمۡۚ كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡقَوۡمَ ٱلۡمُجۡرِمِینَ\n",
    "translations": {
      "en": "bound to destroy everything at its Sustainer’s behest!” And then they were so utterly wiped out that nothing could be seen save their [empty] dwellings: thus do We requite people lost in sin.",
      "ms": "\"Yang menghancur leburkan segala-galanya dengan izin Tuhannya\". (Setelah azab itu menimpa mereka) maka menjadilah mereka (punah ranah) - tidak ada yang kelihatan melainkan tempat-tempat tinggal mereka. Demikianlah Kami membalas kaum yang berdosa.",
      "id": "yang menghancurkan segala sesuatu dengan perintah Tuhannya, maka jadilah mereka tidak ada yang kelihatan lagi kecuali (bekas-bekas) tempat tinggal mereka. Demikianlah Kami memberi balasan kepada kaum yang berdosa.",
      "ar": "تُدَمِّرُ كُلَّ شَیۡءِۭ بِأَمۡرِ رَبِّهَا فَأَصۡبَحُوا۟ لَا یُرَىٰۤ إِلَّا مَسَـٰكِنُهُمۡۚ كَذَ ٰ⁠لِكَ نَجۡزِی ٱلۡقَوۡمَ ٱلۡمُجۡرِمِینَ\n"
    }
  },
  {
    "id": 4536,
    "surahId": 46,
    "ayahNumber": 26,
    "arabicText": "وَلَقَدۡ مَكَّنَّـٰهُمۡ فِیمَاۤ إِن مَّكَّنَّـٰكُمۡ فِیهِ وَجَعَلۡنَا لَهُمۡ سَمۡعࣰا وَأَبۡصَـٰرࣰا وَأَفۡـِٔدَةࣰ فَمَاۤ أَغۡنَىٰ عَنۡهُمۡ سَمۡعُهُمۡ وَلَاۤ أَبۡصَـٰرُهُمۡ وَلَاۤ أَفۡـِٔدَتُهُم مِّن شَیۡءٍ إِذۡ كَانُوا۟ یَجۡحَدُونَ بِـَٔایَـٰتِ ٱللَّهِ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n",
    "translations": {
      "en": "And yet, We had established them securely in a manner in which We have never established you, [O people of later times;] and We had endowed them with hearing, and sight, and [knowledgeable] hearts: but neither their hearing, nor their sight, nor their hearts were of the least avail to them, seeing that they went on rejecting God’s messages; and [in the end] they were overwhelmed by the very thing which they had been wont to deride.",
      "ms": "Dan demi sesungguhnya! Kami telah meneguhkan kedudukan mereka (dengan kekuasaan dan kemewahan) yang tidak Kami berikan kamu menguasainya (wahai kaum musyrik Makkah), dan Kami telah jadikan bagi mereka pendengaran dan penglihatan serta hati; dalam pada itu, pendengaran dan penglihatan serta hati mereka tidak memberikan faedah sedikitpun kepada mereka, kerana mereka sentiasa mengingkari ayat-ayat keterangan Allah; dan (dengan yang demikian) mereka diliputi oleh azab yang mereka telah ejek-ejek itu.",
      "id": "Dan sesungguhnya Kami telah meneguhkan kedudukan mereka dalam hal-hal yang Kami belum pernah meneguhkan kedudukanmu dalam hal itu dan Kami telah memberikan kepada mereka pendengaran, penglihatan dan hati; tetapi pendengaran, penglihatan dan hati mereka itu tidak berguna sedikit juapun bagi mereka, karena mereka selalu mengingkari ayat-ayat Allah dan mereka telah diliputi oleh siksa yang dahulu selalu mereka memperolok-olokkannya.",
      "ar": "وَلَقَدۡ مَكَّنَّـٰهُمۡ فِیمَاۤ إِن مَّكَّنَّـٰكُمۡ فِیهِ وَجَعَلۡنَا لَهُمۡ سَمۡعࣰا وَأَبۡصَـٰرࣰا وَأَفۡـِٔدَةࣰ فَمَاۤ أَغۡنَىٰ عَنۡهُمۡ سَمۡعُهُمۡ وَلَاۤ أَبۡصَـٰرُهُمۡ وَلَاۤ أَفۡـِٔدَتُهُم مِّن شَیۡءٍ إِذۡ كَانُوا۟ یَجۡحَدُونَ بِـَٔایَـٰتِ ٱللَّهِ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n"
    }
  },
  {
    "id": 4537,
    "surahId": 46,
    "ayahNumber": 27,
    "arabicText": "وَلَقَدۡ أَهۡلَكۡنَا مَا حَوۡلَكُم مِّنَ ٱلۡقُرَىٰ وَصَرَّفۡنَا ٱلۡـَٔایَـٰتِ لَعَلَّهُمۡ یَرۡجِعُونَ\n",
    "translations": {
      "en": "Thus have We destroyed many a [sinful] community living round about you; and yet, [before destroying them,] We had given many facets to [Our warning] messages, so that they might turn back [from their evil ways].",
      "ms": "Dan demi sesungguhnya! Kami telah binasakan negeri-negeri yang ada di sekeliling (negeri) kamu (wahai kaum musyrik Makkah), dan Kami telah menerangkan tanda-tanda (kekuasaan Kami) dengan berbagai cara, supaya mereka kembali (bertaubat).",
      "id": "Dan sesungguhnya Kami telah membinasakan negeri-negeri di sekitarmu dan Kami telah mendatangkan tanda-tanda kebesaran Kami berulang-ulang supaya mereka kembali (bertaubat).",
      "ar": "وَلَقَدۡ أَهۡلَكۡنَا مَا حَوۡلَكُم مِّنَ ٱلۡقُرَىٰ وَصَرَّفۡنَا ٱلۡـَٔایَـٰتِ لَعَلَّهُمۡ یَرۡجِعُونَ\n"
    }
  },
  {
    "id": 4538,
    "surahId": 46,
    "ayahNumber": 28,
    "arabicText": "فَلَوۡلَا نَصَرَهُمُ ٱلَّذِینَ ٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ قُرۡبَانًا ءَالِهَةَۢۖ بَلۡ ضَلُّوا۟ عَنۡهُمۡۚ وَذَ ٰ⁠لِكَ إِفۡكُهُمۡ وَمَا كَانُوا۟ یَفۡتَرُونَ\n",
    "translations": {
      "en": "But, then, did those [beings] whom they had chosen to worship as deities beside God, hoping that they would bring them nearer [to Him], help them [in the end]? Nay, they forsook them: for that [alleged divinity] was but an outcome of their self-delusion and all their false imagery.",
      "ms": "Maka sepatutnya mereka dibela oleh segala yang mereka sembah yang lain dari Allah sebagai penyembahan untuk mendekatkan diri (kepada Allah)? (Tetapi tidak), bahkan segala yang mereka sembah itu telah hilang lenyap dari mereka. Dan demikianlah akibat penyelewengan mereka dan kepercayaan yang mereka telah ada-adakan.",
      "id": "Maka mengapa yang mereka sembah selain Allah sebagai Tuhan untuk mendekatkan diri (kepada Allah) tidak dapat menolong mereka. Bahkan tuhan-tuhan itu telah lenyap dari mereka? Itulah akibat kebohongan mereka dan apa yang dahulu mereka ada-adakan.",
      "ar": "فَلَوۡلَا نَصَرَهُمُ ٱلَّذِینَ ٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ قُرۡبَانًا ءَالِهَةَۢۖ بَلۡ ضَلُّوا۟ عَنۡهُمۡۚ وَذَ ٰ⁠لِكَ إِفۡكُهُمۡ وَمَا كَانُوا۟ یَفۡتَرُونَ\n"
    }
  },
  {
    "id": 4539,
    "surahId": 46,
    "ayahNumber": 29,
    "arabicText": "وَإِذۡ صَرَفۡنَاۤ إِلَیۡكَ نَفَرࣰا مِّنَ ٱلۡجِنِّ یَسۡتَمِعُونَ ٱلۡقُرۡءَانَ فَلَمَّا حَضَرُوهُ قَالُوۤا۟ أَنصِتُوا۟ۖ فَلَمَّا قُضِیَ وَلَّوۡا۟ إِلَىٰ قَوۡمِهِم مُّنذِرِینَ\n",
    "translations": {
      "en": "AND LO! We caused a group of unseen beings to incline towards thee, [O Muhammad,] so that they might give ear to the Qur’an; and so, as soon as they became aware of it, they said [unto one another], “Listen in silence!” And when [the recitation] was ended, they returned to their people as warners.",
      "ms": "Dan (ingatkanlah peristiwa) semasa Kami menghalakan satu rombongan jin datang kepadamu (wahai Muhammad) untuk mendengar Al-Quran; setelah mereka menghadiri bacaannya, berkatalah (setengahnya kepada yang lain): \"Diamlah kamu dengan sebulat-bulat ingatan untuk mendengarnya!\" Kemudian setelah selesai bacaan itu, kembalilah mereka kepada kaumnya (menyiarkan ajaran Al-Quran itu dengan) memberi peringatan dan amaran.",
      "id": "Dan (ingatlah) ketika Kami hadapkan serombongan jin kepadamu yang mendengarkan Al Quran, maka tatkala mereka menghadiri pembacaan(nya) lalu mereka berkata: \"Diamlah kamu (untuk mendengarkannya)\". Ketika pembacaan telah selesai mereka kembali kepada kaumnya (untuk) memberi peringatan.",
      "ar": "وَإِذۡ صَرَفۡنَاۤ إِلَیۡكَ نَفَرࣰا مِّنَ ٱلۡجِنِّ یَسۡتَمِعُونَ ٱلۡقُرۡءَانَ فَلَمَّا حَضَرُوهُ قَالُوۤا۟ أَنصِتُوا۟ۖ فَلَمَّا قُضِیَ وَلَّوۡا۟ إِلَىٰ قَوۡمِهِم مُّنذِرِینَ\n"
    }
  },
  {
    "id": 4540,
    "surahId": 46,
    "ayahNumber": 30,
    "arabicText": "قَالُوا۟ یَـٰقَوۡمَنَاۤ إِنَّا سَمِعۡنَا كِتَـٰبًا أُنزِلَ مِنۢ بَعۡدِ مُوسَىٰ مُصَدِّقࣰا لِّمَا بَیۡنَ یَدَیۡهِ یَهۡدِیۤ إِلَى ٱلۡحَقِّ وَإِلَىٰ طَرِیقࣲ مُّسۡتَقِیمࣲ\n",
    "translations": {
      "en": "They said: “O our people! Behold, we have been listening to a revelation bestowed from on high after [that of] Moses, confirming the truth of what­ever there still remains [of the Torah]: it guides towards the truth, and onto a straight way.",
      "ms": "Mereka berkata: \"Wahai kaum kami! Sesungguhnya kami telah mendengar Kitab (Al-Quran) yang diturunkan (oleh Allah) sesudah Nabi Musa, yang menegaskan kebenaran Kitab-kitab Suci yang terdahulu daripadanya, lagi, memandu kepada kebenaran (tauhid) dan ke jalan yang lurus (ugama Islam)",
      "id": "Mereka berkata: \"Hai kaum kami, sesungguhnya kami telah mendengarkan kitab (Al Quran) yang telah diturunkan sesudah Musa yang membenarkan kitab-kitab yang sebelumnya lagi memimpin kepada kebenaran dan kepada jalan yang lurus.",
      "ar": "قَالُوا۟ یَـٰقَوۡمَنَاۤ إِنَّا سَمِعۡنَا كِتَـٰبًا أُنزِلَ مِنۢ بَعۡدِ مُوسَىٰ مُصَدِّقࣰا لِّمَا بَیۡنَ یَدَیۡهِ یَهۡدِیۤ إِلَى ٱلۡحَقِّ وَإِلَىٰ طَرِیقࣲ مُّسۡتَقِیمࣲ\n"
    }
  },
  {
    "id": 4541,
    "surahId": 46,
    "ayahNumber": 31,
    "arabicText": "یَـٰقَوۡمَنَاۤ أَجِیبُوا۟ دَاعِیَ ٱللَّهِ وَءَامِنُوا۟ بِهِۦ یَغۡفِرۡ لَكُم مِّن ذُنُوبِكُمۡ وَیُجِرۡكُم مِّنۡ عَذَابٍ أَلِیمࣲ\n",
    "translations": {
      "en": "“O our people! Respond to God’s call, and have faith in Him: He will forgive you [whatever is past] of your sins, and deliver you from grievous suffering [in the life to come].",
      "ms": "\"Wahai kaum kami! Sahutlah (seruan) Rasul (Nabi Muhammad) yang mengajak ke jalan Allah, serta berimanlah kamu kepadanya, supaya Allah mengampunkan sebahagian dari dosa-dosa kamu, dan menyelamatkan kamu dari azab seksa yang tidak terperi sakitnya.",
      "id": "Hai kaum kami, terimalah (seruan) orang yang menyeru kepada Allah dan berimanlah kepada-Nya, niscaya Allah akan mengampuni dosa-dosa kamu dan melepaskan kamu dari azab yang pedih.",
      "ar": "یَـٰقَوۡمَنَاۤ أَجِیبُوا۟ دَاعِیَ ٱللَّهِ وَءَامِنُوا۟ بِهِۦ یَغۡفِرۡ لَكُم مِّن ذُنُوبِكُمۡ وَیُجِرۡكُم مِّنۡ عَذَابٍ أَلِیمࣲ\n"
    }
  },
  {
    "id": 4542,
    "surahId": 46,
    "ayahNumber": 32,
    "arabicText": "وَمَن لَّا یُجِبۡ دَاعِیَ ٱللَّهِ فَلَیۡسَ بِمُعۡجِزࣲ فِی ٱلۡأَرۡضِ وَلَیۡسَ لَهُۥ مِن دُونِهِۦۤ أَوۡلِیَاۤءُۚ أُو۟لَـٰۤىِٕكَ فِی ضَلَـٰلࣲ مُّبِینٍ\n",
    "translations": {
      "en": "But he who does not respond to God’s call can never elude [Him] on earth, nor can he has any protector against Him [in the life to come]: all such are most obviously lost in error.”",
      "ms": "\"Dan sesiapa tidak menyahut (seruan) Rasul yang mengajaknya ke jalan Allah, maka ia tidak akan dapat melepaskan diri (dari balasan azab walau ke mana sahaja ia melarikan diri) di bumi, dan ia tidak akan beroleh sesiapapun - yang lain dari Allah - sebagai pelindung-pelindung yang membelanya; mereka (yang demikian sifatnya) adalah dalam kesesatan yang nyata\".",
      "id": "Dan orang yang tidak menerima (seruan) orang yang menyeru kepada Allah maka dia tidak akan melepaskan diri dari azab Allah di muka bumi dan tidak ada baginya pelindung selain Allah. Mereka itu dalam kesesatan yang nyata\".",
      "ar": "وَمَن لَّا یُجِبۡ دَاعِیَ ٱللَّهِ فَلَیۡسَ بِمُعۡجِزࣲ فِی ٱلۡأَرۡضِ وَلَیۡسَ لَهُۥ مِن دُونِهِۦۤ أَوۡلِیَاۤءُۚ أُو۟لَـٰۤىِٕكَ فِی ضَلَـٰلࣲ مُّبِینٍ\n"
    }
  },
  {
    "id": 4543,
    "surahId": 46,
    "ayahNumber": 33,
    "arabicText": "أَوَلَمۡ یَرَوۡا۟ أَنَّ ٱللَّهَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَلَمۡ یَعۡیَ بِخَلۡقِهِنَّ بِقَـٰدِرٍ عَلَىٰۤ أَن یُحۡـِۧیَ ٱلۡمَوۡتَىٰۚ بَلَىٰۤۚ إِنَّهُۥ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n",
    "translations": {
      "en": "ARE, THEN, they [who deny the life to come] not aware that God, who has created the heavens and the earth and never been wearied by their creation, has [also] the power to bring the dead back to life? Yea, verily, He has the power to will anything!",
      "ms": "Masihkah mereka ingkar dan tidak mahu memikir serta mengetahui bahawa sesungguhnya Allah yang telah menciptakan langit dan bumi dengan tidak mengalami kesukaran dalam menciptakannya - berkuasa menghidupkan makhluk-makhluk yang telah mati? Sudah tentu berkuasa! Sesungguhnya Ia Maha Kuasa atas tiap-tiap sesuatu.",
      "id": "Dan apakah mereka tidak memperhatikan bahwa sesungguhnya Allah yang menciptakan langit dan bumi dan Dia tidak merasa payah karena menciptakannya, kuasa menghidupkan orang-orang mati? Ya (bahkan) sesungguhnya Dia Maha Kuasa atas segala sesuatu.",
      "ar": "أَوَلَمۡ یَرَوۡا۟ أَنَّ ٱللَّهَ ٱلَّذِی خَلَقَ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ وَلَمۡ یَعۡیَ بِخَلۡقِهِنَّ بِقَـٰدِرٍ عَلَىٰۤ أَن یُحۡـِۧیَ ٱلۡمَوۡتَىٰۚ بَلَىٰۤۚ إِنَّهُۥ عَلَىٰ كُلِّ شَیۡءࣲ قَدِیرࣱ\n"
    }
  },
  {
    "id": 4544,
    "surahId": 46,
    "ayahNumber": 34,
    "arabicText": "وَیَوۡمَ یُعۡرَضُ ٱلَّذِینَ كَفَرُوا۟ عَلَى ٱلنَّارِ أَلَیۡسَ هَـٰذَا بِٱلۡحَقِّۖ قَالُوا۟ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُوا۟ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ\n",
    "translations": {
      "en": "And so, on the Day when those who were bent on denying the truth will be brought within sight of the fire [and will be asked], “Is not this the truth?” - they will answer, “Yea, by Our Sustainer!” [And] He will say: “Taste, then, this suffering as an outcome of your denial of the truth!”",
      "ms": "Dan (ingatlah) hari orang-orang yang kafir didedahkan kepada neraka, (lalu dikatakan kepada mereka): \"Bukankah (azab) neraka ini benar?\" Mereka menjawab: \"Ya, benar, demi Tuhan kami!\" (Setelah itu) dikatakan lagi (kepada mereka): \"Maka sekarang rasalah azab seksa dengan sebab kamu kufur ingkar di dunia dahulu. \"",
      "id": "Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan kepada neraka, (dikatakan kepada mereka): \"Bukankah (azab) ini benar?\" Mereka menjawab: \"Ya benar, demi Tuhan kami\". Allah berfirman \"Maka rasakanlah azab ini disebabkan kamu selalu ingkar\".",
      "ar": "وَیَوۡمَ یُعۡرَضُ ٱلَّذِینَ كَفَرُوا۟ عَلَى ٱلنَّارِ أَلَیۡسَ هَـٰذَا بِٱلۡحَقِّۖ قَالُوا۟ بَلَىٰ وَرَبِّنَاۚ قَالَ فَذُوقُوا۟ ٱلۡعَذَابَ بِمَا كُنتُمۡ تَكۡفُرُونَ\n"
    }
  },
  {
    "id": 4545,
    "surahId": 46,
    "ayahNumber": 35,
    "arabicText": "فَٱصۡبِرۡ كَمَا صَبَرَ أُو۟لُوا۟ ٱلۡعَزۡمِ مِنَ ٱلرُّسُلِ وَلَا تَسۡتَعۡجِل لَّهُمۡۚ كَأَنَّهُمۡ یَوۡمَ یَرَوۡنَ مَا یُوعَدُونَ لَمۡ یَلۡبَثُوۤا۟ إِلَّا سَاعَةࣰ مِّن نَّهَارِۭۚ بَلَـٰغࣱۚ فَهَلۡ یُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلۡفَـٰسِقُونَ\n",
    "translations": {
      "en": "REMAIN, then, [O believer,] patient in adversity, just as all of the apostles, endowed with firmness of heart, bore themselves with patience. And do not ask for a speedy doom of those [who still deny the truth]: on the Day when they see [the fulfillment of] what they were promised, [it will seem to them] as though they had dwelt [on earth] no longer than one hour of [an earthly] day! [This is Our] message. Will, then, any be [really] destroyed save iniquitous folk?”",
      "ms": "(Jika demikian akibat orang-orang kafir yang menentangmu wahai Muhammad) maka bersabarlah engkau sebagaimana sabarnya Rasul-rasul \"Ulil-Azmi\" (yang mempunyai keazaman dan ketabahan hati) dari kalangan Rasul-rasul (yang terdahulu daripadamu); dan janganlah engkau meminta disegerakan azab untuk mereka (yang menentangmu itu). Sesungguhnya keadaan mereka semasa melihat azab yang dijanjikan kepada mereka, merasai seolah-olah mereka tidak tinggal (di dunia) melainkan sekadar satu saat sahaja dari siang hari. (Penerangan yang demikian) cukuplah menjadi pelajaran (bagi orang-orang yang mahu insaf). Maka (ingatlah) tidak dibinasakan melainkan kaum yang fasik - derhaka.",
      "id": "Maka bersabarlah kamu seperti orang-orang yang mempunyai keteguhan hati dari rasul-rasul telah bersabar dan janganlah kamu meminta disegerakan (azab) bagi mereka. Pada hari mereka melihat azab yang diancamkan kepada mereka (merasa) seolah-olah tidak tinggal (di dunia) melainkan sesaat pada siang hari. (Inilah) suatu pelajaran yang cukup, maka tidak dibinasakan melainkan kaum yang fasik.",
      "ar": "فَٱصۡبِرۡ كَمَا صَبَرَ أُو۟لُوا۟ ٱلۡعَزۡمِ مِنَ ٱلرُّسُلِ وَلَا تَسۡتَعۡجِل لَّهُمۡۚ كَأَنَّهُمۡ یَوۡمَ یَرَوۡنَ مَا یُوعَدُونَ لَمۡ یَلۡبَثُوۤا۟ إِلَّا سَاعَةࣰ مِّن نَّهَارِۭۚ بَلَـٰغࣱۚ فَهَلۡ یُهۡلَكُ إِلَّا ٱلۡقَوۡمُ ٱلۡفَـٰسِقُونَ\n"
    }
  }
]