[
  {
    "id": 4474,
    "surahId": 45,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ حمۤ\n",
    "translations": {
      "en": "Ha. Mim.",
      "ms": "Haa, Miim.",
      "id": "Haa Miim",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ حمۤ\n"
    }
  },
  {
    "id": 4475,
    "surahId": 45,
    "ayahNumber": 2,
    "arabicText": "تَنزِیلُ ٱلۡكِتَـٰبِ مِنَ ٱللَّهِ ٱلۡعَزِیزِ ٱلۡحَكِیمِ\n",
    "translations": {
      "en": "THE BESTOWAL from on high of this divine writ issues from God, the Almighty, the Wise.",
      "ms": "Turunnya Al-Quran ini, dari Allah Yang Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Kitab (ini) diturunkan dari Allah Yang Maha Perkasa lagi Maha Bijaksana.",
      "ar": "تَنزِیلُ ٱلۡكِتَـٰبِ مِنَ ٱللَّهِ ٱلۡعَزِیزِ ٱلۡحَكِیمِ\n"
    }
  },
  {
    "id": 4476,
    "surahId": 45,
    "ayahNumber": 3,
    "arabicText": "إِنَّ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ لَـَٔایَـٰتࣲ لِّلۡمُؤۡمِنِینَ\n",
    "translations": {
      "en": "Behold, in the heavens as well as on earth there are indeed messages for all who [are willing to] believe.",
      "ms": "Sesungguhnya pada langit dan bumi terdapat tanda-tanda (yang membuktikan kekuasaan Allah) bagi orang-orang yang beriman.",
      "id": "Sesungguhnya pada langit dan bumi benar-benar terdapat tanda-tanda (kekuasaan Allah) untuk orang-orang yang beriman.",
      "ar": "إِنَّ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ لَـَٔایَـٰتࣲ لِّلۡمُؤۡمِنِینَ\n"
    }
  },
  {
    "id": 4477,
    "surahId": 45,
    "ayahNumber": 4,
    "arabicText": "وَفِی خَلۡقِكُمۡ وَمَا یَبُثُّ مِن دَاۤبَّةٍ ءَایَـٰتࣱ لِّقَوۡمࣲ یُوقِنُونَ\n",
    "translations": {
      "en": "And in your own nature, and in [that of] all the animals which He scatters [over the earth] there are messages for people who are endowed with inner certainty.",
      "ms": "Dan pada kejadian diri kamu sendiri, serta (pada kejadian) segala binatang yang dibiakkanNya, terdapat juga tanda-tanda (yang membuktikan kekuasaan Allah) bagi orang-orang yang meyakininya.",
      "id": "Dan pada penciptakan kamu dan pada binatang-binatang yang melata yang bertebaran (di muka bumi) terdapat tanda-tanda (kekuasaan Allah) untuk kaum yang meyakini,",
      "ar": "وَفِی خَلۡقِكُمۡ وَمَا یَبُثُّ مِن دَاۤبَّةٍ ءَایَـٰتࣱ لِّقَوۡمࣲ یُوقِنُونَ\n"
    }
  },
  {
    "id": 4478,
    "surahId": 45,
    "ayahNumber": 5,
    "arabicText": "وَٱخۡتِلَـٰفِ ٱلَّیۡلِ وَٱلنَّهَارِ وَمَاۤ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَاۤءِ مِن رِّزۡقࣲ فَأَحۡیَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَتَصۡرِیفِ ٱلرِّیَـٰحِ ءَایَـٰتࣱ لِّقَوۡمࣲ یَعۡقِلُونَ\n",
    "translations": {
      "en": "And in the succession of night and day, and in the means of subsistence which God sends down from the skies, giving life thereby to the earth after it had been lifeless, and in the change of the winds: [in all this] there are messages for people who use their reason.",
      "ms": "Dan (pada) pertukaran malam dan siang silih berganti, dan juga (pada) rezeki yang diturunkan oleh Allah dari langit, lalu Ia hidupkan dengannya tumbuh-tumbuhan di bumi sesudah matinya, serta (pada) peredaran angin, (semuanya itu mengandungi) tanda-tanda (yang membuktikan keesaan Allah, kekuasaanNya, kebijaksanaanNya, serta keluasan rahmatNya) bagi kaum yang mahu menggunakan akal fikiran.",
      "id": "dan pada pergantian malam dan siang dan hujan yang diturunkan Allah dari langit lalu dihidupkan-Nya dengan air hujan itu bumi sesudah matinya; dan pada perkisaran angin terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang berakal.",
      "ar": "وَٱخۡتِلَـٰفِ ٱلَّیۡلِ وَٱلنَّهَارِ وَمَاۤ أَنزَلَ ٱللَّهُ مِنَ ٱلسَّمَاۤءِ مِن رِّزۡقࣲ فَأَحۡیَا بِهِ ٱلۡأَرۡضَ بَعۡدَ مَوۡتِهَا وَتَصۡرِیفِ ٱلرِّیَـٰحِ ءَایَـٰتࣱ لِّقَوۡمࣲ یَعۡقِلُونَ\n"
    }
  },
  {
    "id": 4479,
    "surahId": 45,
    "ayahNumber": 6,
    "arabicText": "تِلۡكَ ءَایَـٰتُ ٱللَّهِ نَتۡلُوهَا عَلَیۡكَ بِٱلۡحَقِّۖ فَبِأَیِّ حَدِیثِۭ بَعۡدَ ٱللَّهِ وَءَایَـٰتِهِۦ یُؤۡمِنُونَ\n",
    "translations": {
      "en": "These messages of God do We convey unto thee, setting forth the truth. In what other tiding, if not in God’s messages, will they, then, believe?",
      "ms": "Itulah ayat-ayat penerangan Allah yang kami bacakan kepadamu (wahai Muhammad) kerana menegakkan kebenaran; maka dengan perkataan yang manakah lagi mereka hendak beriman, sesudah penerangan Allah dan tanda-tanda kekuasaanNya (mereka tidak mahu memahami dan menelitinya)?",
      "id": "Itulah ayat-ayat Allah yang Kami membacakannya kepadamu dengan sebenarnya; maka dengan perkataan manakah lagi mereka akan beriman sesudah (kalam) Allah dan keterangan-keterangan-Nya.",
      "ar": "تِلۡكَ ءَایَـٰتُ ٱللَّهِ نَتۡلُوهَا عَلَیۡكَ بِٱلۡحَقِّۖ فَبِأَیِّ حَدِیثِۭ بَعۡدَ ٱللَّهِ وَءَایَـٰتِهِۦ یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 4480,
    "surahId": 45,
    "ayahNumber": 7,
    "arabicText": "وَیۡلࣱ لِّكُلِّ أَفَّاكٍ أَثِیمࣲ\n",
    "translations": {
      "en": "Woe unto every sinful self-deceiver",
      "ms": "Kecelakaanlah bagi tiap-tiap pendusta yang berdosa, -",
      "id": "Kecelakaan besarlah bagi tiap-tiap orang yang banyak berdusta lagi banyak berdosa,",
      "ar": "وَیۡلࣱ لِّكُلِّ أَفَّاكٍ أَثِیمࣲ\n"
    }
  },
  {
    "id": 4481,
    "surahId": 45,
    "ayahNumber": 8,
    "arabicText": "یَسۡمَعُ ءَایَـٰتِ ٱللَّهِ تُتۡلَىٰ عَلَیۡهِ ثُمَّ یُصِرُّ مُسۡتَكۡبِرࣰا كَأَن لَّمۡ یَسۡمَعۡهَاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِیمࣲ\n",
    "translations": {
      "en": "who hears God’s messages when they are conveyed to him, and yet, as though he had not heard them, persists in his haughty disdain! Hence, announce unto him grievous suffering –",
      "ms": "Yang mendengar ayat-ayat penerangan Allah sentiasa dibacakan kepadanya, kemudian dia terus berlagak sombong (enggan menerimanya), seolah-olah ia tidak mendengarnya; oleh itu gembirakanlah dia dengan azab seksa yang tidak terperi sakitnya.",
      "id": "dia mendengar ayat-ayat Allah dibacakan kepadanya kemudian dia tetap menyombongkan diri seakan-akan dia tidak mendengarnya. Maka beri khabar gembiralah dia dengan azab yang pedih.",
      "ar": "یَسۡمَعُ ءَایَـٰتِ ٱللَّهِ تُتۡلَىٰ عَلَیۡهِ ثُمَّ یُصِرُّ مُسۡتَكۡبِرࣰا كَأَن لَّمۡ یَسۡمَعۡهَاۖ فَبَشِّرۡهُ بِعَذَابٍ أَلِیمࣲ\n"
    }
  },
  {
    "id": 4482,
    "surahId": 45,
    "ayahNumber": 9,
    "arabicText": "وَإِذَا عَلِمَ مِنۡ ءَایَـٰتِنَا شَیۡـًٔا ٱتَّخَذَهَا هُزُوًاۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ عَذَابࣱ مُّهِینࣱ\n",
    "translations": {
      "en": "for when he does become aware of any of Our messages, he makes them a target of his mockery! For all such there is shameful suffering in store.",
      "ms": "Dan apabila sampai ke pengetahuannya sesuatu dari ayat-ayat penerangan Kami, ia menjadikannya ejek-ejekan; mereka yang demikian keadaannya, akan beroleh azab yang menghina.",
      "id": "Dan apabila dia mengetahui barang sedikit tentang ayat-ayat Kami, maka ayat-ayat itu dijadikan olok-olok. Merekalah yang memperoleh azab yang menghinakan.",
      "ar": "وَإِذَا عَلِمَ مِنۡ ءَایَـٰتِنَا شَیۡـًٔا ٱتَّخَذَهَا هُزُوًاۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ عَذَابࣱ مُّهِینࣱ\n"
    }
  },
  {
    "id": 4483,
    "surahId": 45,
    "ayahNumber": 10,
    "arabicText": "مِّن وَرَاۤىِٕهِمۡ جَهَنَّمُۖ وَلَا یُغۡنِی عَنۡهُم مَّا كَسَبُوا۟ شَیۡـࣰٔا وَلَا مَا ٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ أَوۡلِیَاۤءَۖ وَلَهُمۡ عَذَابٌ عَظِیمٌ\n",
    "translations": {
      "en": "Hell is ahead of them; and all that they may have gained [in this world] shall be of no avail whatever to them, and neither shall any of those things which, instead of God, they have come to regard as their protectors: for, awesome suffering awaits them.",
      "ms": "Di hadapan mereka (di akhirat kelak) ada neraka Jahannam (yang disediakan untuk mereka), dan apa jua yang mereka usahakan, tidak dapat menyelematkan mereka sedikit pun; demikian juga yang mereka sembah atau puja selain Allah, tidak dapat memberikan sebarang perlindungan; dan (kesudahannya) mereka akan beroleh azab seksa yang besar.",
      "id": "Di hadapan mereka neraka Jahannam dan tidak akan berguna bagi mereka sedikitpun apa yang telah mereka kerjakan, dan tidak pula berguna apa yang mereka jadikan sebagai sembahan-sembahan (mereka) dari selain Allah. Dan bagi mereka azab yang besar.",
      "ar": "مِّن وَرَاۤىِٕهِمۡ جَهَنَّمُۖ وَلَا یُغۡنِی عَنۡهُم مَّا كَسَبُوا۟ شَیۡـࣰٔا وَلَا مَا ٱتَّخَذُوا۟ مِن دُونِ ٱللَّهِ أَوۡلِیَاۤءَۖ وَلَهُمۡ عَذَابٌ عَظِیمٌ\n"
    }
  },
  {
    "id": 4484,
    "surahId": 45,
    "ayahNumber": 11,
    "arabicText": "هَـٰذَا هُدࣰىۖ وَٱلَّذِینَ كَفَرُوا۟ بِـَٔایَـٰتِ رَبِّهِمۡ لَهُمۡ عَذَابࣱ مِّن رِّجۡزٍ أَلِیمٌ\n",
    "translations": {
      "en": "[To pay heed to God’s signs and messages:] this is [the meaning of] guidance; on the other hand, for those who are bent on denying the truth of their Sustainer’s messages there is grievous suffering in store as an outcome of [their] vileness.",
      "ms": "Al-Quran ini ialah hidayah petunjuk yang cukup lengkap; dan orang-orang yang kufur ingkar akan ayat-ayat penerangan Tuhannya, mereka akan beroleh azab dari jenis azab seksa yang tidak terperi sakitnya.",
      "id": "Ini (Al Quran) adalah petunjuk. Dan orang-orang yang kafir kepada ayat-ayat Tuhannya bagi mereka azab yaitu siksaan yang sangat pedih.",
      "ar": "هَـٰذَا هُدࣰىۖ وَٱلَّذِینَ كَفَرُوا۟ بِـَٔایَـٰتِ رَبِّهِمۡ لَهُمۡ عَذَابࣱ مِّن رِّجۡزٍ أَلِیمٌ\n"
    }
  },
  {
    "id": 4485,
    "surahId": 45,
    "ayahNumber": 12,
    "arabicText": "۞ ٱللَّهُ ٱلَّذِی سَخَّرَ لَكُمُ ٱلۡبَحۡرَ لِتَجۡرِیَ ٱلۡفُلۡكُ فِیهِ بِأَمۡرِهِۦ وَلِتَبۡتَغُوا۟ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ\n",
    "translations": {
      "en": "IT IS GOD who has made the sea subservient [to His laws, so that it be of use] to you so that ships might sail through it at His behest, and that you might seek to obtain [what you need] of His bounty, and that you might have cause to be grateful.",
      "ms": "Allah yang memudahkan laut bagi kegunaan kamu, supaya kapal-kapal belayar padanya dengan perintahNya, dan supaya kamu mencari rezeki dari limpah kurniaNya, dan juga supaya kamu bersyukur.",
      "id": "Allah-lah yang menundukkan lautan untukmu supaya kapal-kapal dapat berlayar padanya dengan seizin-Nya dan supaya kamu dapat mencari karunia -Nya dan mudah-mudahan kamu bersyukur.",
      "ar": "۞ ٱللَّهُ ٱلَّذِی سَخَّرَ لَكُمُ ٱلۡبَحۡرَ لِتَجۡرِیَ ٱلۡفُلۡكُ فِیهِ بِأَمۡرِهِۦ وَلِتَبۡتَغُوا۟ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ\n"
    }
  },
  {
    "id": 4486,
    "surahId": 45,
    "ayahNumber": 13,
    "arabicText": "وَسَخَّرَ لَكُم مَّا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِ جَمِیعࣰا مِّنۡهُۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَتَفَكَّرُونَ\n",
    "translations": {
      "en": "And He has made subservient to you, [as a gift] from Himself, all that is in the heavens and on earth: in this, behold, there are messages indeed for people who think!",
      "ms": "Dan Ia memudahkan untuk (faedah dan kegunaan) kamu, segala yang ada di langit dan yang ada di bumi, (sebagai rahmat pemberian) daripadaNya; sesungguhnya semuanya itu mengandungi tanda-tanda (yang membuktikan kemurahan dan kekuasaanNya) bagi kaum yang memikirkannya dengan teliti.",
      "id": "Dan Dia telah menundukkan untukmu apa yang di langit dan apa yang di bumi semuanya, (sebagai rahmat) daripada-Nya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi kaum yang berfikir.",
      "ar": "وَسَخَّرَ لَكُم مَّا فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَمَا فِی ٱلۡأَرۡضِ جَمِیعࣰا مِّنۡهُۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَتَفَكَّرُونَ\n"
    }
  },
  {
    "id": 4487,
    "surahId": 45,
    "ayahNumber": 14,
    "arabicText": "قُل لِّلَّذِینَ ءَامَنُوا۟ یَغۡفِرُوا۟ لِلَّذِینَ لَا یَرۡجُونَ أَیَّامَ ٱللَّهِ لِیَجۡزِیَ قَوۡمَۢا بِمَا كَانُوا۟ یَكۡسِبُونَ\n",
    "translations": {
      "en": "Tell all who have attained to faith that they should forgive those who do not believe in the com­ing of the Days of God, [since it is] for Him [alone] to requite people for whatever they may have earned.",
      "ms": "Katakanlah (wahai Muhammad) kepada orang-orang yang beriman: hendaklah mereka memaafkan (kejahatan dan gangguan) orang-orang yang tidak menaruh ingatan kepada hari-hari (pembalasan yang telah ditentukan) Allah; (disuruh berbuat demikian), kerana Allah akan memberi kepada satu-satu puak: balasan yang patut dengan apa yang mereka telah usahakan.",
      "id": "Katakanlah kepada orang-orang yang beriman hendaklah mereka memaafkan orang-orang yang tiada takut hari-hari Allah karena Dia akan membalas sesuatu kaum terhadap apa yang telah mereka kerjakan.",
      "ar": "قُل لِّلَّذِینَ ءَامَنُوا۟ یَغۡفِرُوا۟ لِلَّذِینَ لَا یَرۡجُونَ أَیَّامَ ٱللَّهِ لِیَجۡزِیَ قَوۡمَۢا بِمَا كَانُوا۟ یَكۡسِبُونَ\n"
    }
  },
  {
    "id": 4488,
    "surahId": 45,
    "ayahNumber": 15,
    "arabicText": "مَنۡ عَمِلَ صَـٰلِحࣰا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَاۤءَ فَعَلَیۡهَاۖ ثُمَّ إِلَىٰ رَبِّكُمۡ تُرۡجَعُونَ\n",
    "translations": {
      "en": "Whoever does what is just and right, does so for his own good; and whoever does evil, does so to his own hurt; and in the end unto your Sustainer you all will be brought back.",
      "ms": "(Tiap-tiap balasan berdasarkan kaedah): Sesiapa yang mengerjakan amal soleh, maka faedahnya akan terpulang kepada dirinya sendiri; dan sesiapa yang berbuat kejahatan, maka bahayanya akan menimpa dirinya sendiri; kemudian kamu akan dikembalikan kepada Tuhan kamu.",
      "id": "Barangsiapa yang mengerjakan amal saleh, maka itu adalah untuk dirinya sendiri, dan barangsiapa yang mengerjakan kejahatan, maka itu akan menimpa dirinya sendiri, kemudian kepada Tuhanmulah kamu dikembalikan.",
      "ar": "مَنۡ عَمِلَ صَـٰلِحࣰا فَلِنَفۡسِهِۦۖ وَمَنۡ أَسَاۤءَ فَعَلَیۡهَاۖ ثُمَّ إِلَىٰ رَبِّكُمۡ تُرۡجَعُونَ\n"
    }
  },
  {
    "id": 4489,
    "surahId": 45,
    "ayahNumber": 16,
    "arabicText": "وَلَقَدۡ ءَاتَیۡنَا بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ ٱلۡكِتَـٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَ وَرَزَقۡنَـٰهُم مِّنَ ٱلطَّیِّبَـٰتِ وَفَضَّلۡنَـٰهُمۡ عَلَى ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "AND, INDEED, [already] unto the children of Israel did We vouchsafe revelation, and wisdom, and prophethood; and We provided for them sustenance out of the good things of life, and favoured them above all other people [of their time].",
      "ms": "Dan demi sesungguhnya, Kami telah memberi kepada Bani Israil Kitab Taurat, dan pangkat kehakiman serta pangkat kenabian; dan Kami telah kurniakan mereka benda-benda yang baik-baik, serta Kami lebihkan (nenek moyang) mereka di atas orang-orang yang ada pada zamannya.",
      "id": "Dan sesungguhnya telah Kami berikan kepada Bani Israil Al Kitab (Taurat), kekuasaan dan kenabian dan Kami berikan kepada mereka rezeki-rezeki yang baik dan Kami lebihkan mereka atas bangsa-bangsa (pada masanya).",
      "ar": "وَلَقَدۡ ءَاتَیۡنَا بَنِیۤ إِسۡرَ ٰ⁠ۤءِیلَ ٱلۡكِتَـٰبَ وَٱلۡحُكۡمَ وَٱلنُّبُوَّةَ وَرَزَقۡنَـٰهُم مِّنَ ٱلطَّیِّبَـٰتِ وَفَضَّلۡنَـٰهُمۡ عَلَى ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 4490,
    "surahId": 45,
    "ayahNumber": 17,
    "arabicText": "وَءَاتَیۡنَـٰهُم بَیِّنَـٰتࣲ مِّنَ ٱلۡأَمۡرِۖ فَمَا ٱخۡتَلَفُوۤا۟ إِلَّا مِنۢ بَعۡدِ مَا جَاۤءَهُمُ ٱلۡعِلۡمُ بَغۡیَۢا بَیۡنَهُمۡۚ إِنَّ رَبَّكَ یَقۡضِی بَیۡنَهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ فِیمَا كَانُوا۟ فِیهِ یَخۡتَلِفُونَ\n",
    "translations": {
      "en": "And We gave them clear indications of the purpose [of faith]; and it was only after all this knowledge had been vouchsafed to them that they began, out of mutual jealousy, to hold divergent views: [but,] verily, thy Sustainer will judge be­tween them on Resurrection Day regarding all whereon they were wont to differ.",
      "ms": "Dan lagi Kami telah berikan mereka keterangan-keterangan yang jelas nyata mengenai perkara ugama; maka mereka tidak berselisihan (dalam perkara ugama itu) melainkan setelah sampai kepada mereka ajaran-ajaran yang memberi mereka mengetahui (apa yang baik dan yang sebaliknya; berlakunya yang demikian) kerana hasad dengki yang ada dalam kalangan mereka. Sesungguhnya Tuhanmu akan menghukum di antara mereka pada hari kiamat tentang apa yang mereka perselisihkan itu.",
      "id": "Dan Kami berikan kepada mereka keterangan-keterangan yang nyata tentang urusan (agama); maka mereka tidak berselisih melainkan sesudah datang kepada mereka pengetahuan karena kedengkian yang ada di antara mereka. Sesungguhnya Tuhanmu akan memutuskan antara mereka pada hari kiamat terhadap apa yang mereka selalu berselisih padanya.",
      "ar": "وَءَاتَیۡنَـٰهُم بَیِّنَـٰتࣲ مِّنَ ٱلۡأَمۡرِۖ فَمَا ٱخۡتَلَفُوۤا۟ إِلَّا مِنۢ بَعۡدِ مَا جَاۤءَهُمُ ٱلۡعِلۡمُ بَغۡیَۢا بَیۡنَهُمۡۚ إِنَّ رَبَّكَ یَقۡضِی بَیۡنَهُمۡ یَوۡمَ ٱلۡقِیَـٰمَةِ فِیمَا كَانُوا۟ فِیهِ یَخۡتَلِفُونَ\n"
    }
  },
  {
    "id": 4491,
    "surahId": 45,
    "ayahNumber": 18,
    "arabicText": "ثُمَّ جَعَلۡنَـٰكَ عَلَىٰ شَرِیعَةࣲ مِّنَ ٱلۡأَمۡرِ فَٱتَّبِعۡهَا وَلَا تَتَّبِعۡ أَهۡوَاۤءَ ٱلَّذِینَ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "And, finally, [O Muhammad,] We have set thee on a way by which the purpose [of faith] may be fulfilled: so follow thou this [way], and follow not the likes and dislikes of those who do not know [the truth].",
      "ms": "Kesudahannya Kami jadikan engkau (wahai Muhammad dan utuskan engkau) menjalankan satu Syariat (yang cukup lengkap) dari hukum-hukum ugama; maka turutlah Syariat itu, dan janganlah engkau menurut hawa nafsu orang-orang yang tidak mengetahui (perkara yang benar).",
      "id": "Kemudian Kami jadikan kamu berada di atas suatu syariat (peraturan) dari urusan (agama itu), maka ikutilah syariat itu dan janganlah kamu ikuti hawa nafsu orang-orang yang tidak mengetahui.",
      "ar": "ثُمَّ جَعَلۡنَـٰكَ عَلَىٰ شَرِیعَةࣲ مِّنَ ٱلۡأَمۡرِ فَٱتَّبِعۡهَا وَلَا تَتَّبِعۡ أَهۡوَاۤءَ ٱلَّذِینَ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 4492,
    "surahId": 45,
    "ayahNumber": 19,
    "arabicText": "إِنَّهُمۡ لَن یُغۡنُوا۟ عَنكَ مِنَ ٱللَّهِ شَیۡـࣰٔاۚ وَإِنَّ ٱلظَّـٰلِمِینَ بَعۡضُهُمۡ أَوۡلِیَاۤءُ بَعۡضࣲۖ وَٱللَّهُ وَلِیُّ ٱلۡمُتَّقِینَ\n",
    "translations": {
      "en": "Behold, they could never be of any avail to thee if thou wert to defy the will of God for, verily, such evildoers are but friends and protectors of one another, whereas God is the Protector of all who are conscious of Him.",
      "ms": "Sesungguhnya mereka tidak sekali-kali akan dapat menyelamatkanmu sedikitpun dari (azab) Allah (kalau engkau menurut mereka); dan sesungguhnya orang-orang yang zalim itu setengahnya menjadi penolong dan penyokong bagi setengahnya yang lain (dalam perkara yang salah); dan (sebaliknya) Allah menjadi penolong dan pelindung bagi orang-orang yang bertaqwa (yang engkaulah pemimpinnya).",
      "id": "Sesungguhnya mereka sekali-kali tidak akan dapat menolak dari kamu sedikitpun dari siksaan Allah. Dan Sesungguhnya orang-orang yang zalim itu sebagian mereka menjadi penolong bagi sebagian yang lain, dan Allah adalah pelindung orang-orang yang bertakwa.",
      "ar": "إِنَّهُمۡ لَن یُغۡنُوا۟ عَنكَ مِنَ ٱللَّهِ شَیۡـࣰٔاۚ وَإِنَّ ٱلظَّـٰلِمِینَ بَعۡضُهُمۡ أَوۡلِیَاۤءُ بَعۡضࣲۖ وَٱللَّهُ وَلِیُّ ٱلۡمُتَّقِینَ\n"
    }
  },
  {
    "id": 4493,
    "surahId": 45,
    "ayahNumber": 20,
    "arabicText": "هَـٰذَا بَصَـٰۤىِٕرُ لِلنَّاسِ وَهُدࣰى وَرَحۡمَةࣱ لِّقَوۡمࣲ یُوقِنُونَ\n",
    "translations": {
      "en": "This [revelation, then,] is a means of insight for mankind, and a guidance and grace unto people who are endowed with inner certainty.",
      "ms": "Al-Quran ini menjadi panduan-panduan yang membuka matahati manusia, dan menjadi hidayah petunjuk serta membawa rahmat bagi kaum yang meyakini (kebenarannya).",
      "id": "Al Quran ini adalah pedoman bagi manusia, petunjuk dan rahmat bagi kaum yang meyakini.",
      "ar": "هَـٰذَا بَصَـٰۤىِٕرُ لِلنَّاسِ وَهُدࣰى وَرَحۡمَةࣱ لِّقَوۡمࣲ یُوقِنُونَ\n"
    }
  },
  {
    "id": 4494,
    "surahId": 45,
    "ayahNumber": 21,
    "arabicText": "أَمۡ حَسِبَ ٱلَّذِینَ ٱجۡتَرَحُوا۟ ٱلسَّیِّـَٔاتِ أَن نَّجۡعَلَهُمۡ كَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَوَاۤءࣰ مَّحۡیَاهُمۡ وَمَمَاتُهُمۡۚ سَاۤءَ مَا یَحۡكُمُونَ\n",
    "translations": {
      "en": "Now as for those who indulge in sinful doings - do they think that We place them, both in their life and their death, on an equal footing with those who have attained to faith and do righteous deeds? Bad, indeed, is their judgment:",
      "ms": "Patutkah orang-orang yang melakukan kejahatan menyangka bahawa Kami akan menjadikan mereka seperti orang-orang yang beriman dan beramal soleh, dengan menyamakan keadaan (mereka semua) semasa mereka hidup dan semasa mereka mati? Buruk sungguh apa yang mereka hukumkan itu.",
      "id": "Apakah orang-orang yang membuat kejahatan itu menyangka bahwa Kami akan menjadikan mereka seperti orang-orang yang beriman dan mengerjakan amal saleh, yaitu sama antara kehidupan dan kematian mereka? Amat buruklah apa yang mereka sangka itu.",
      "ar": "أَمۡ حَسِبَ ٱلَّذِینَ ٱجۡتَرَحُوا۟ ٱلسَّیِّـَٔاتِ أَن نَّجۡعَلَهُمۡ كَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ سَوَاۤءࣰ مَّحۡیَاهُمۡ وَمَمَاتُهُمۡۚ سَاۤءَ مَا یَحۡكُمُونَ\n"
    }
  },
  {
    "id": 4495,
    "surahId": 45,
    "ayahNumber": 22,
    "arabicText": "وَخَلَقَ ٱللَّهُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ بِٱلۡحَقِّ وَلِتُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡ وَهُمۡ لَا یُظۡلَمُونَ\n",
    "translations": {
      "en": "for, God has created the heavens and the earth in accordance with [an inner] truth, and [has therefore willed] that every human being shall be recompensed for what he has earned and none shall be wronged.",
      "ms": "Dan (ingatlah), Allah menciptakan langit dan bumi dengan cara yang sungguh layak dan berhikmat (untuk membuktikan keesaanNya dan keadilanNya), dan supaya tiap-tiap diri diberi balasan dengan apa yang mereka telah kerjakan (baik atau jahat), sedang mereka tidak dikurangkan balasannya sedikitpun.",
      "id": "Dan Allah menciptakan langit dan bumi dengan tujuan yang benar dan agar dibalasi tiap-tiap diri terhadap apa yang dikerjakannya, dan mereka tidak akan dirugikan.",
      "ar": "وَخَلَقَ ٱللَّهُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضَ بِٱلۡحَقِّ وَلِتُجۡزَىٰ كُلُّ نَفۡسِۭ بِمَا كَسَبَتۡ وَهُمۡ لَا یُظۡلَمُونَ\n"
    }
  },
  {
    "id": 4496,
    "surahId": 45,
    "ayahNumber": 23,
    "arabicText": "أَفَرَءَیۡتَ مَنِ ٱتَّخَذَ إِلَـٰهَهُۥ هَوَىٰهُ وَأَضَلَّهُ ٱللَّهُ عَلَىٰ عِلۡمࣲ وَخَتَمَ عَلَىٰ سَمۡعِهِۦ وَقَلۡبِهِۦ وَجَعَلَ عَلَىٰ بَصَرِهِۦ غِشَـٰوَةࣰ فَمَن یَهۡدِیهِ مِنۢ بَعۡدِ ٱللَّهِۚ أَفَلَا تَذَكَّرُونَ\n",
    "translations": {
      "en": "HAST THOU ever considered [the kind of man] who makes his own desires his deity, and whom God has [thereupon] let go astray, knowing [that his mind is closed to all guidance], and whose hearing and heart He has sealed, and upon whose sight He has placed a veil? Who, then, could guide him after God [has abandoned him]? Will you not, then, bethink your­selves?",
      "ms": "Dengan yang demikian, bagaimana fikiranmu (wahai Muhammad) terhadap orang yang menjadikan hawa nafsunya: tuhan yang dipatuhinya, dan ia pula disesatkan oleh Allah kerana diketahuiNya (bahawa ia tetap kufur ingkar), dan dimeteraikan pula atas pendengarannya dan hatinya, serta diadakan lapisan penutup atas penglihatannya? Maka siapakah lagi yang dapat memberi hidayah petunjuk kepadanya sesudah Allah (menjadikan dia berkeadaan demikian)? Oleh itu, mengapa kamu (wahai orang-orang yang ingkar) tidak ingat dan insaf?",
      "id": "Maka pernahkah kamu melihat orang yang menjadikan hawa nafsunya sebagai tuhannya dan Allah membiarkannya berdasarkan ilmu-Nya dan Allah telah mengunci mati pendengaran dan hatinya dan meletakkan tutupan atas penglihatannya? Maka siapakah yang akan memberinya petunjuk sesudah Allah (membiarkannya sesat). Maka mengapa kamu tidak mengambil pelajaran?",
      "ar": "أَفَرَءَیۡتَ مَنِ ٱتَّخَذَ إِلَـٰهَهُۥ هَوَىٰهُ وَأَضَلَّهُ ٱللَّهُ عَلَىٰ عِلۡمࣲ وَخَتَمَ عَلَىٰ سَمۡعِهِۦ وَقَلۡبِهِۦ وَجَعَلَ عَلَىٰ بَصَرِهِۦ غِشَـٰوَةࣰ فَمَن یَهۡدِیهِ مِنۢ بَعۡدِ ٱللَّهِۚ أَفَلَا تَذَكَّرُونَ\n"
    }
  },
  {
    "id": 4497,
    "surahId": 45,
    "ayahNumber": 24,
    "arabicText": "وَقَالُوا۟ مَا هِیَ إِلَّا حَیَاتُنَا ٱلدُّنۡیَا نَمُوتُ وَنَحۡیَا وَمَا یُهۡلِكُنَاۤ إِلَّا ٱلدَّهۡرُۚ وَمَا لَهُم بِذَ ٰ⁠لِكَ مِنۡ عِلۡمٍۖ إِنۡ هُمۡ إِلَّا یَظُنُّونَ\n",
    "translations": {
      "en": "And yet they say: “There is nothing beyond our life in this world. We die as we come to life, and nothing but time destroys us.” But of this they have no knowledge whatever: they do nothing but guess.",
      "ms": "Dan mereka berkata: \"Tiadalah hidup yang lain selain daripada hidup kita di dunia ini. Kita mati dan kita hidup (silih berganti); dan tiadalah yang membinasakan kita melainkan edaran zaman\". Pada hal mereka tidak mempunyai sebarang pengetahuan tentang hal itu; mereka hanyalah menurut sangkaan semata-mata.",
      "id": "Dan mereka berkata: \"Kehidupan ini tidak lain hanyalah kehidupan di dunia saja, kita mati dan kita hidup dan tidak ada yang akan membinasakan kita selain masa\", dan mereka sekali-kali tidak mempunyai pengetahuan tentang itu, mereka tidak lain hanyalah menduga-duga saja.",
      "ar": "وَقَالُوا۟ مَا هِیَ إِلَّا حَیَاتُنَا ٱلدُّنۡیَا نَمُوتُ وَنَحۡیَا وَمَا یُهۡلِكُنَاۤ إِلَّا ٱلدَّهۡرُۚ وَمَا لَهُم بِذَ ٰ⁠لِكَ مِنۡ عِلۡمٍۖ إِنۡ هُمۡ إِلَّا یَظُنُّونَ\n"
    }
  },
  {
    "id": 4498,
    "surahId": 45,
    "ayahNumber": 25,
    "arabicText": "وَإِذَا تُتۡلَىٰ عَلَیۡهِمۡ ءَایَـٰتُنَا بَیِّنَـٰتࣲ مَّا كَانَ حُجَّتَهُمۡ إِلَّاۤ أَن قَالُوا۟ ٱئۡتُوا۟ بِـَٔابَاۤىِٕنَاۤ إِن كُنتُمۡ صَـٰدِقِینَ\n",
    "translations": {
      "en": "And [so,] whenever Our messages are conveyed to them in all their clarity, their only argument is this: “Bring forth our fore­fathers [as witnesses], if what you claim is true!”",
      "ms": "Dan apabila dibacakan kepada mereka ayat-ayat keterangan Kami yang jelas nyata (mengenai soal hidup semula sesudah mati), tidaklah ada hujah mereka (untuk menolak kebenarannya) selain daripada berkata: \"Bawakanlah datuk nenek kami (hidup semula) kalau betul kami orang-orang yang benar!\"",
      "id": "Dan apabila dibacakan kepada mereka ayat-ayat Kami yang jelas, tidak ada bantahan mereka selain dari mengatakan: \"Datangkanlah nenek moyang kami jika kamu adalah orang-orang yang benar\".",
      "ar": "وَإِذَا تُتۡلَىٰ عَلَیۡهِمۡ ءَایَـٰتُنَا بَیِّنَـٰتࣲ مَّا كَانَ حُجَّتَهُمۡ إِلَّاۤ أَن قَالُوا۟ ٱئۡتُوا۟ بِـَٔابَاۤىِٕنَاۤ إِن كُنتُمۡ صَـٰدِقِینَ\n"
    }
  },
  {
    "id": 4499,
    "surahId": 45,
    "ayahNumber": 26,
    "arabicText": "قُلِ ٱللَّهُ یُحۡیِیكُمۡ ثُمَّ یُمِیتُكُمۡ ثُمَّ یَجۡمَعُكُمۡ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ لَا رَیۡبَ فِیهِ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n",
    "translations": {
      "en": "Say: “It is God who gives you life, and then causes you to die; and in the end He will gather you together on Resurrection Day, [the coming of] which is beyond all doubt - but most human beings under­stand it not.”",
      "ms": "Katakanlah (wahai Muhammad): \"Allah yang menghidupkan kamu, kemudian Ia akan mematikan kamu, setelah itu Ia akan menghimpunkan kamu (dalam keadaan hidup semula) pada hari kiamat - (hari) yang tidak ada sebarang syak tentang kedatangannya; akan tetapi kebanyakan manusia tidak mengetahui (ketetapan itu)\".",
      "id": "Katakanlah: \"Allah-lah yang menghidupkan kamu kemudian mematikan kamu, setelah itu mengumpulkan kamu pada hari kiamat yang tidak ada keraguan padanya; akan tetapi kebanyakan manusia tidak mengetahui.",
      "ar": "قُلِ ٱللَّهُ یُحۡیِیكُمۡ ثُمَّ یُمِیتُكُمۡ ثُمَّ یَجۡمَعُكُمۡ إِلَىٰ یَوۡمِ ٱلۡقِیَـٰمَةِ لَا رَیۡبَ فِیهِ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یَعۡلَمُونَ\n"
    }
  },
  {
    "id": 4500,
    "surahId": 45,
    "ayahNumber": 27,
    "arabicText": "وَلِلَّهِ مُلۡكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَیَوۡمَ تَقُومُ ٱلسَّاعَةُ یَوۡمَىِٕذࣲ یَخۡسَرُ ٱلۡمُبۡطِلُونَ\n",
    "translations": {
      "en": "For, God’s is the dominion over the heavens and the earth; and on the Day when the Last Hour dawns - on that Day will be lost all who [in their lifetime] tried to reduce to nothing [whatever they could not understand].",
      "ms": "Dan bagi Allah jualah kuasa pemerintahan langit dan bumi; dan ketika berlakunya hari kiamat, pada saat itulah ruginya orang-orang yang berpegang kepada perkara yang salah.",
      "id": "Dan hanya kepunyaan Allah kerajaan langit dan bumi. Dan pada hari terjadinya kebangkitan, akan rugilah pada hari itu orang-orang yang mengerjakan kebathilan.",
      "ar": "وَلِلَّهِ مُلۡكُ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۚ وَیَوۡمَ تَقُومُ ٱلسَّاعَةُ یَوۡمَىِٕذࣲ یَخۡسَرُ ٱلۡمُبۡطِلُونَ\n"
    }
  },
  {
    "id": 4501,
    "surahId": 45,
    "ayahNumber": 28,
    "arabicText": "وَتَرَىٰ كُلَّ أُمَّةࣲ جَاثِیَةࣰۚ كُلُّ أُمَّةࣲ تُدۡعَىٰۤ إِلَىٰ كِتَـٰبِهَا ٱلۡیَوۡمَ تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ\n",
    "translations": {
      "en": "And [on that Day] thou wilt see all people kneeling down [in humility]: all people will be called upon to [face] their record: “Today you shall be requited for all that you ever did!",
      "ms": "Dan (pada hari kiamat) engkau akan melihat tiap-tiap umat berlutut (dalam keadaan cemas dan menunggu panggilan); tiap-tiap umat diseru untuk menerima kitab suratan amalnya (serta dikatakan kepada mereka): \"Pada hari ini kamu akan dibalas menurut apa yang kamu telah kerjakan!",
      "id": "Dan (pada hari itu) kamu lihat tiap-tiap umat berlutut. Tiap-tiap umat dipanggil untuk (melihat) buku catatan amalnya. Pada hari itu kamu diberi balasan terhadap apa yang telah kamu kerjakan.",
      "ar": "وَتَرَىٰ كُلَّ أُمَّةࣲ جَاثِیَةࣰۚ كُلُّ أُمَّةࣲ تُدۡعَىٰۤ إِلَىٰ كِتَـٰبِهَا ٱلۡیَوۡمَ تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 4502,
    "surahId": 45,
    "ayahNumber": 29,
    "arabicText": "هَـٰذَا كِتَـٰبُنَا یَنطِقُ عَلَیۡكُم بِٱلۡحَقِّۚ إِنَّا كُنَّا نَسۡتَنسِخُ مَا كُنتُمۡ تَعۡمَلُونَ\n",
    "translations": {
      "en": "This Our record speaks of you in all truth: for, verily, We have caused to be recorded all that you ever did!”",
      "ms": "\"Inilah surat (tulisan malaikat) Kami, ia memberi keterangan terhadap kamu dengan yang benar, kerana sesungguhnya Kami telah (perintahkan malaikat) menulis segala yang kamu telah lakukan (di dunia dahulu)!\"",
      "id": "(Allah berfirman): \"Inilah kitab (catatan) Kami yang menuturkan terhadapmu dengan benar. Sesungguhnya Kami telah menyuruh mencatat apa yang telah kamu kerjakan\".",
      "ar": "هَـٰذَا كِتَـٰبُنَا یَنطِقُ عَلَیۡكُم بِٱلۡحَقِّۚ إِنَّا كُنَّا نَسۡتَنسِخُ مَا كُنتُمۡ تَعۡمَلُونَ\n"
    }
  },
  {
    "id": 4503,
    "surahId": 45,
    "ayahNumber": 30,
    "arabicText": "فَأَمَّا ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فَیُدۡخِلُهُمۡ رَبُّهُمۡ فِی رَحۡمَتِهِۦۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡفَوۡزُ ٱلۡمُبِینُ\n",
    "translations": {
      "en": "Now as for those who have attained to faith and done righteous deeds, their Sustainer will admit them to His grace: that will be [their] manifest triumph!",
      "ms": "Adapun orang-orang yang beriman dan beramal soleh, maka mereka akan dimasukkan oleh Tuhan mereka ke dalam rahmatNya; yang demikian itu ialah kemenangan yang besar.",
      "id": "Adapun orang-orang yang beriman dan mengerjakan amal saleh maka Tuhan mereka memasukkan mereka ke dalam rahmat-Nya (surga). Itulah keberuntungan yang nyata.",
      "ar": "فَأَمَّا ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ فَیُدۡخِلُهُمۡ رَبُّهُمۡ فِی رَحۡمَتِهِۦۚ ذَ ٰ⁠لِكَ هُوَ ٱلۡفَوۡزُ ٱلۡمُبِینُ\n"
    }
  },
  {
    "id": 4504,
    "surahId": 45,
    "ayahNumber": 31,
    "arabicText": "وَأَمَّا ٱلَّذِینَ كَفَرُوۤا۟ أَفَلَمۡ تَكُنۡ ءَایَـٰتِی تُتۡلَىٰ عَلَیۡكُمۡ فَٱسۡتَكۡبَرۡتُمۡ وَكُنتُمۡ قَوۡمࣰا مُّجۡرِمِینَ\n",
    "translations": {
      "en": "But as for those who were bent on denying the truth, [they will be told:] “Were not My messages conveyed to you? And withal, you gloried in your arrogance, and so you became people lost in sin:",
      "ms": "Adapun orang-orang yang kafir, (maka mereka akan ditempelak dengan dikatakan kepada mereka): \"Bukankah ayat-ayatku telah disampaikan dan dibacakan kepada kamu, lalu kamu berlaku sombong takbur (mengingkarinya), serta menjadi kaum yang sentiasa melakukan kesalahan?",
      "id": "Dan adapun orang-orang yang kafir (kepada mereka dikatakan): \"Maka apakah belum ada ayat-ayat-Ku yang dibacakan kepadamu lalu kamu menyombongkan diri dan kamu jadi kaum yang berbuat dosa?\"",
      "ar": "وَأَمَّا ٱلَّذِینَ كَفَرُوۤا۟ أَفَلَمۡ تَكُنۡ ءَایَـٰتِی تُتۡلَىٰ عَلَیۡكُمۡ فَٱسۡتَكۡبَرۡتُمۡ وَكُنتُمۡ قَوۡمࣰا مُّجۡرِمِینَ\n"
    }
  },
  {
    "id": 4505,
    "surahId": 45,
    "ayahNumber": 32,
    "arabicText": "وَإِذَا قِیلَ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّ وَٱلسَّاعَةُ لَا رَیۡبَ فِیهَا قُلۡتُم مَّا نَدۡرِی مَا ٱلسَّاعَةُ إِن نَّظُنُّ إِلَّا ظَنࣰّا وَمَا نَحۡنُ بِمُسۡتَیۡقِنِینَ\n",
    "translations": {
      "en": "for when it was said, ‘Behold, God’s promise always comes true, and there can be no doubt about [the coming of] the Last Hour’ - you would answer, ‘We do not know what that Last Hour may be: we think it is no more than an empty guess, and [so] we are by no means convinced!’”",
      "ms": "\"Dan apabila dikatakan (kepada kamu): ` Sesungguhnya janji Allah (membalas amal kamu) adalah benar, dan hari kiamat tidak ada sebarang syak tentang kedatangannya ', kamu berkata: ` Kami tidak mengetahui apa dia hari kiamat itu; kami hanya mengira (kemungkinannya) sebagai sangkaan jua, dan kami tidak sekali-kali meyakininya '.\"",
      "id": "Dan apabila dikatakan (kepadamu): \"Sesungguhnya janji Allah itu adalah benar dan hari berbangkit itu tidak ada keraguan padanya\", niscaya kamu menjawab: \"Kami tidak tahu apakah hari kiamat itu, kami sekali-kali tidak lain hanyalah menduga-duga saja dan kami sekali-kali tidak meyakini(nya)\".",
      "ar": "وَإِذَا قِیلَ إِنَّ وَعۡدَ ٱللَّهِ حَقࣱّ وَٱلسَّاعَةُ لَا رَیۡبَ فِیهَا قُلۡتُم مَّا نَدۡرِی مَا ٱلسَّاعَةُ إِن نَّظُنُّ إِلَّا ظَنࣰّا وَمَا نَحۡنُ بِمُسۡتَیۡقِنِینَ\n"
    }
  },
  {
    "id": 4506,
    "surahId": 45,
    "ayahNumber": 33,
    "arabicText": "وَبَدَا لَهُمۡ سَیِّـَٔاتُ مَا عَمِلُوا۟ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n",
    "translations": {
      "en": "And [on that Day,] the evil of their doings will become obvious to them, and they will be over­whelmed by the very thing which they were wont to deride.",
      "ms": "Dan (pada ketika itu) ternyatalah kepada mereka balasan kejahatan-kejahatan yang mereka telah lakukan, serta mereka diliputi oleh azab yang mereka ejek-ejek itu!",
      "id": "Dan nyatalah bagi mereka keburukan-keburukan dari apa yang mereka kerjakan dan mereka diliputi oleh (azab) yang mereka selalu memperolok-olokkannya.",
      "ar": "وَبَدَا لَهُمۡ سَیِّـَٔاتُ مَا عَمِلُوا۟ وَحَاقَ بِهِم مَّا كَانُوا۟ بِهِۦ یَسۡتَهۡزِءُونَ\n"
    }
  },
  {
    "id": 4507,
    "surahId": 45,
    "ayahNumber": 34,
    "arabicText": "وَقِیلَ ٱلۡیَوۡمَ نَنسَىٰكُمۡ كَمَا نَسِیتُمۡ لِقَاۤءَ یَوۡمِكُمۡ هَـٰذَا وَمَأۡوَىٰكُمُ ٱلنَّارُ وَمَا لَكُم مِّن نَّـٰصِرِینَ\n",
    "translations": {
      "en": "And [the word] will be spoken: “Today We shall be oblivious of you as you were oblivious of the coming of this your Day [of Judgment]; and so your goal is the fire, and you shall have none to succour you:",
      "ms": "Dan dikatakan (kepada mereka): \"Pada hari ini Kami tidak hiraukan kamu (menderita di dalam azab seksa) sebagaimana kamu tidak hiraukan persediaan untuk menemui hari kamu ini; dan tempat kamu ialah neraka, dan kamu tidak akan beroleh sesiapapun yang dapat memberikan pertolongan.",
      "id": "Dan dikatakan (kepada mereka): \"Pada hari ini Kami melupakan kamu sebagaimana kamu telah melupakan pertemuan (dengan) harimu ini dan tempat kembalimu ialah neraka dan kamu sekali-kali tidak memperoleh penolong\".",
      "ar": "وَقِیلَ ٱلۡیَوۡمَ نَنسَىٰكُمۡ كَمَا نَسِیتُمۡ لِقَاۤءَ یَوۡمِكُمۡ هَـٰذَا وَمَأۡوَىٰكُمُ ٱلنَّارُ وَمَا لَكُم مِّن نَّـٰصِرِینَ\n"
    }
  },
  {
    "id": 4508,
    "surahId": 45,
    "ayahNumber": 35,
    "arabicText": "ذَ ٰ⁠لِكُم بِأَنَّكُمُ ٱتَّخَذۡتُمۡ ءَایَـٰتِ ٱللَّهِ هُزُوࣰا وَغَرَّتۡكُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَاۚ فَٱلۡیَوۡمَ لَا یُخۡرَجُونَ مِنۡهَا وَلَا هُمۡ یُسۡتَعۡتَبُونَ\n",
    "translations": {
      "en": "this, because you made God’s messages the target of your mockery, having allowed the life of this world to beguile you!” On that Day, therefore, they will not be brought out of the fire, nor will they be allowed to make amends.",
      "ms": "\"(Balasan buruk) yang demikian ini ialah kerana kamu telah menjadikan ayat-ayat keterangan Allah sebagai ejek-ejekan, dan kerana kamu telah membiarkan diri kamu diperdayakan oleh kehidupan dunia\". Maka pada hari itu mereka tidak akan dikeluarkan dari neraka, dan mereka tidak diberi peluang untuk bertaubat (memperbaiki kesalahannya).",
      "id": "Yang demikian itu, karena sesungguhnya kamu menjadikan ayat-ayat Allah sebagai olok-olokan dan kamu telah ditipu oleh kehidupan dunia, maka pada hari ini mereka tidak dikeluarkan dari neraka dan tidak pula mereka diberi kesempatan untuk bertaubat.",
      "ar": "ذَ ٰ⁠لِكُم بِأَنَّكُمُ ٱتَّخَذۡتُمۡ ءَایَـٰتِ ٱللَّهِ هُزُوࣰا وَغَرَّتۡكُمُ ٱلۡحَیَوٰةُ ٱلدُّنۡیَاۚ فَٱلۡیَوۡمَ لَا یُخۡرَجُونَ مِنۡهَا وَلَا هُمۡ یُسۡتَعۡتَبُونَ\n"
    }
  },
  {
    "id": 4509,
    "surahId": 45,
    "ayahNumber": 36,
    "arabicText": "فَلِلَّهِ ٱلۡحَمۡدُ رَبِّ ٱلسَّمَـٰوَ ٰ⁠تِ وَرَبِّ ٱلۡأَرۡضِ رَبِّ ٱلۡعَـٰلَمِینَ\n",
    "translations": {
      "en": "AND THUS, all praise is due to God, Sustainer of the heavens and Sustainer of the earth: the Sustainer of all the worlds!",
      "ms": "(Demikianlah ajaran dan peringatan Allah Yang Maha Adil) maka bagi Allah jualah tertentu segala pujian, Tuhan yang mentadbirkan langit, dan Tuhan yang mentadbirkan bumi, - Tuhan sekalian alam.",
      "id": "Maka bagi Allah-lah segala puji, Tuhan langit dan Tuhan bumi, Tuhan semesta alam.",
      "ar": "فَلِلَّهِ ٱلۡحَمۡدُ رَبِّ ٱلسَّمَـٰوَ ٰ⁠تِ وَرَبِّ ٱلۡأَرۡضِ رَبِّ ٱلۡعَـٰلَمِینَ\n"
    }
  },
  {
    "id": 4510,
    "surahId": 45,
    "ayahNumber": 37,
    "arabicText": "وَلَهُ ٱلۡكِبۡرِیَاۤءُ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n",
    "translations": {
      "en": "And His alone is all majesty in the heavens and on earth; and He alone is almighty, truly wise!",
      "ms": "Dan bagiNyalah keagungan dan kekuasaan di langit dan di bumi; dan dia lah Yang Maha Kuasa, lagi Maha Bijaksana.",
      "id": "Dan bagi-Nya-lah keagungan di langit dan bumi, Dialah Yang Maha Perkasa lagi Maha Bijaksana.",
      "ar": "وَلَهُ ٱلۡكِبۡرِیَاۤءُ فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِیزُ ٱلۡحَكِیمُ\n"
    }
  }
]