[
  {
    "id": 4546,
    "surahId": 47,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ أَضَلَّ أَعۡمَـٰلَهُمۡ\n",
    "translations": {
      "en": "AS FOR THOSE who are bent on denying the truth and on barring [others] from the path of God - all their [good] deeds will He let go to waste;",
      "ms": "Orang-orang yang kafir serta menghalangi (dirinya dan orang lain) dari jalan Allah, Allah sia-siakan segala amal mereka.",
      "id": "Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah, Allah menyesatkan perbuatan-perbuatan mereka.",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ أَضَلَّ أَعۡمَـٰلَهُمۡ\n"
    }
  },
  {
    "id": 4547,
    "surahId": 47,
    "ayahNumber": 2,
    "arabicText": "وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَءَامَنُوا۟ بِمَا نُزِّلَ عَلَىٰ مُحَمَّدࣲ وَهُوَ ٱلۡحَقُّ مِن رَّبِّهِمۡ كَفَّرَ عَنۡهُمۡ سَیِّـَٔاتِهِمۡ وَأَصۡلَحَ بَالَهُمۡ\n",
    "translations": {
      "en": "whereas those who have attained to faith and do righteous deeds, and have come to believe in what has been bestowed from on high on Muhammad - for it is the truth from their Sustainer - [shall attain to God’s grace:] He will efface their [past] bad deeds, and will set their hearts at rest.",
      "ms": "Dan (sebaliknya) orang-orang yang beriman dan mengerjakan amal yang soleh serta beriman kepada Al-Quran yang diturunkan kepada Nabi Muhammad (s.a.w) - yang ialah kebenaran dari Tuhan mereka, - Allah mengampunkan dosa-dosa mereka, dan menjayakan keadaan mereka (di dunia dan di akhirat).",
      "id": "Dan orang-orang mukmin dan beramal soleh serta beriman kepada apa yang diturunkan kepada Muhammad dan itulah yang haq dari Tuhan mereka, Allah menghapuskan kesalahan-kesalahan mereka dan memperbaiki keadaan mereka.",
      "ar": "وَٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ وَءَامَنُوا۟ بِمَا نُزِّلَ عَلَىٰ مُحَمَّدࣲ وَهُوَ ٱلۡحَقُّ مِن رَّبِّهِمۡ كَفَّرَ عَنۡهُمۡ سَیِّـَٔاتِهِمۡ وَأَصۡلَحَ بَالَهُمۡ\n"
    }
  },
  {
    "id": 4548,
    "surahId": 47,
    "ayahNumber": 3,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّ ٱلَّذِینَ كَفَرُوا۟ ٱتَّبَعُوا۟ ٱلۡبَـٰطِلَ وَأَنَّ ٱلَّذِینَ ءَامَنُوا۟ ٱتَّبَعُوا۟ ٱلۡحَقَّ مِن رَّبِّهِمۡۚ كَذَ ٰ⁠لِكَ یَضۡرِبُ ٱللَّهُ لِلنَّاسِ أَمۡثَـٰلَهُمۡ\n",
    "translations": {
      "en": "This, because they who are bent on denying the truth pursue falsehood, whereas they who have attained to faith pursue [but] the truth [that flows] from their Sustainer. In this way does God set forth unto man the parables of their true state.",
      "ms": "Berlakunya yang demikian, kerana sesungguhnya orang-orang yang kafir menurut perkara yang salah, dan sesungguhnya orang-orang yang beriman menurut perkara yang benar dari Tuhan mereka. Demikianlah Allah menerangkan kepada umat manusia akan sifat dan akibat bawaan mereka masing-masing.",
      "id": "Yang demikian adalah karena sesungguhnya orang-orang kafir mengikuti yang bathil dan sesungguhnya orang-orang mukmin mengikuti yang haq dari Tuhan mereka. Demikianlah Allah membuat untuk manusia perbandingan-perbandingan bagi mereka.",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّ ٱلَّذِینَ كَفَرُوا۟ ٱتَّبَعُوا۟ ٱلۡبَـٰطِلَ وَأَنَّ ٱلَّذِینَ ءَامَنُوا۟ ٱتَّبَعُوا۟ ٱلۡحَقَّ مِن رَّبِّهِمۡۚ كَذَ ٰ⁠لِكَ یَضۡرِبُ ٱللَّهُ لِلنَّاسِ أَمۡثَـٰلَهُمۡ\n"
    }
  },
  {
    "id": 4549,
    "surahId": 47,
    "ayahNumber": 4,
    "arabicText": "فَإِذَا لَقِیتُمُ ٱلَّذِینَ كَفَرُوا۟ فَضَرۡبَ ٱلرِّقَابِ حَتَّىٰۤ إِذَاۤ أَثۡخَنتُمُوهُمۡ فَشُدُّوا۟ ٱلۡوَثَاقَ فَإِمَّا مَنَّۢا بَعۡدُ وَإِمَّا فِدَاۤءً حَتَّىٰ تَضَعَ ٱلۡحَرۡبُ أَوۡزَارَهَاۚ ذَ ٰ⁠لِكَۖ وَلَوۡ یَشَاۤءُ ٱللَّهُ لَٱنتَصَرَ مِنۡهُمۡ وَلَـٰكِن لِّیَبۡلُوَا۟ بَعۡضَكُم بِبَعۡضࣲۗ وَٱلَّذِینَ قُتِلُوا۟ فِی سَبِیلِ ٱللَّهِ فَلَن یُضِلَّ أَعۡمَـٰلَهُمۡ\n",
    "translations": {
      "en": "NOW WHEN you meet [in war] those who are bent on denying the truth, smite their necks until you overcome them fully, and then tighten their bonds; but thereafter [set them free,] either by an act of grace or against ransom, so that the burden of war may be lifted: thus [shall it be]. And [know that] had God so willed, He could indeed punish them [Himself]; but [He wills you to struggle] so as to test you [all] by means of one another. And as for those who are slain in God’s cause, never will He let their deeds go to waste:",
      "ms": "Dengan yang demikian, apabila kamu berjuang menentang orang-orang kafir (dalam peperangan jihad) maka pancunglah lehernya, sehingga apabila kamu dapat membunuh mereka dengan banyaknya (serta mengalahkannya) maka tawanlah (mana-mana yang hidup) dan ikatlah mereka dengan kukuhnya. Setelah selesai pertempuran itu maka (terserahlah kepada kamu) sama ada hendak memberi kebebasan (kepada orang-orang tawanan itu dengan tiada sebarang penebusnya) atau membebaskan mereka dengan mengambil penebusnya. (Bertindaklah demikian terhadap golongan kafir yang menceroboh) sehinggalah berakhir peperangan jihad itu (dan lenyaplah sebab-sebab yang memimbulkannya). Demikianlah (diperintahkan kamu melakukannya). Dan sekiranya Allah menghendaki, tentulah Ia membinasakan mereka (dengan tidak payah kamu memeranginya); tetapi Ia (perintahkan kamu berbuat demikian) kerana hendak menguji kesabaran kamu menentang golongan yang kufur ingkar (yang mencerobohi kamu). Dan orang-orang yang telah berjuang serta gugur syahid pada jalan Allah (mempertahankan ugamanya), maka Allah tidak sekali kali akan mensia-siakan amal-amal mereka.",
      "id": "Apabila kamu bertemu dengan orang-orang kafir (di medan perang) maka pancunglah batang leher mereka. Sehingga apabila kamu telah mengalahkan mereka maka tawanlah mereka dan sesudah itu kamu boleh membebaskan mereka atau menerima tebusan sampai perang berakhir. Demikianlah apabila Allah menghendaki niscaya Allah akan membinasakan mereka tetapi Allah hendak menguji sebahagian kamu dengan sebahagian yang lain. Dan orang-orang yang syahid pada jalan Allah, Allah tidak akan menyia-nyiakan amal mereka.",
      "ar": "فَإِذَا لَقِیتُمُ ٱلَّذِینَ كَفَرُوا۟ فَضَرۡبَ ٱلرِّقَابِ حَتَّىٰۤ إِذَاۤ أَثۡخَنتُمُوهُمۡ فَشُدُّوا۟ ٱلۡوَثَاقَ فَإِمَّا مَنَّۢا بَعۡدُ وَإِمَّا فِدَاۤءً حَتَّىٰ تَضَعَ ٱلۡحَرۡبُ أَوۡزَارَهَاۚ ذَ ٰ⁠لِكَۖ وَلَوۡ یَشَاۤءُ ٱللَّهُ لَٱنتَصَرَ مِنۡهُمۡ وَلَـٰكِن لِّیَبۡلُوَا۟ بَعۡضَكُم بِبَعۡضࣲۗ وَٱلَّذِینَ قُتِلُوا۟ فِی سَبِیلِ ٱللَّهِ فَلَن یُضِلَّ أَعۡمَـٰلَهُمۡ\n"
    }
  },
  {
    "id": 4550,
    "surahId": 47,
    "ayahNumber": 5,
    "arabicText": "سَیَهۡدِیهِمۡ وَیُصۡلِحُ بَالَهُمۡ\n",
    "translations": {
      "en": "He will guide them [in the hereafter as well], and will set their hearts at rest,",
      "ms": "Allah akan memimpin mereka yang berjuang (ke jalan mendapat sebaik-baik balasan) dan menjadikan keadaan mereka baik dan berguna (di dunia dan di akhirat)",
      "id": "Allah akan memberi pimpinan kepada mereka dan memperbaiki keadaan mereka,",
      "ar": "سَیَهۡدِیهِمۡ وَیُصۡلِحُ بَالَهُمۡ\n"
    }
  },
  {
    "id": 4551,
    "surahId": 47,
    "ayahNumber": 6,
    "arabicText": "وَیُدۡخِلُهُمُ ٱلۡجَنَّةَ عَرَّفَهَا لَهُمۡ\n",
    "translations": {
      "en": "and will admit them to the paradise which He has promised them.",
      "ms": "Serta memasukkan mereka ke dalam Syurga yang telah dijanjikan dan diterangkan sifat-sifatnya kepada mereka.",
      "id": "dan memasukkan mereka ke dalam jannah yang telah diperkenankan-Nya kepada mereka.",
      "ar": "وَیُدۡخِلُهُمُ ٱلۡجَنَّةَ عَرَّفَهَا لَهُمۡ\n"
    }
  },
  {
    "id": 4552,
    "surahId": 47,
    "ayahNumber": 7,
    "arabicText": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِن تَنصُرُوا۟ ٱللَّهَ یَنصُرۡكُمۡ وَیُثَبِّتۡ أَقۡدَامَكُمۡ\n",
    "translations": {
      "en": "O you who have attained to faith! If you help [the cause of] God, He will help you, and will make firm your steps;",
      "ms": "Wahai orang-orang yang beriman, kalau kamu membela (ugama) Allah nescaya Allah membela kamu (untuk mencapai kemenangan) dan meneguhkan tapak pendirian kamu.",
      "id": "Hai orang-orang mukmin, jika kamu menolong (agama) Allah, niscaya Dia akan menolongmu dan meneguhkan kedudukanmu.",
      "ar": "یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ إِن تَنصُرُوا۟ ٱللَّهَ یَنصُرۡكُمۡ وَیُثَبِّتۡ أَقۡدَامَكُمۡ\n"
    }
  },
  {
    "id": 4553,
    "surahId": 47,
    "ayahNumber": 8,
    "arabicText": "وَٱلَّذِینَ كَفَرُوا۟ فَتَعۡسࣰا لَّهُمۡ وَأَضَلَّ أَعۡمَـٰلَهُمۡ\n",
    "translations": {
      "en": "but as for those who are bent on denying the truth, ill fortune awaits them, since He will let all their [good] deeds go to waste:",
      "ms": "Dan (sebaliknya) orang-orang yang kafir, maka kecelakaanlah bagi mereka, dan (Allah) mensia-siakan amal-amal mereka.",
      "id": "Dan orang-orang yang kafir, maka kecelakaanlah bagi mereka dan Allah menyesatkan amal-amal mereka.",
      "ar": "وَٱلَّذِینَ كَفَرُوا۟ فَتَعۡسࣰا لَّهُمۡ وَأَضَلَّ أَعۡمَـٰلَهُمۡ\n"
    }
  },
  {
    "id": 4554,
    "surahId": 47,
    "ayahNumber": 9,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّهُمۡ كَرِهُوا۟ مَاۤ أَنزَلَ ٱللَّهُ فَأَحۡبَطَ أَعۡمَـٰلَهُمۡ\n",
    "translations": {
      "en": "this, because they hate [the very thought of] what God has bestowed from on high and thus He causes all their deeds to come to nought!",
      "ms": "Berlakunya yang demikian, kerana sesungguhnya mereka tidak menyukai apa yang diturunkan oleh Allah (mengenai ajaran tauhid dan hukum-hukum syarak yang diterangkan di dalam Al-Quran), lalu Allah menggugurkan amal-amal mereka.",
      "id": "Yang demikian itu adalah karena Sesungguhnya mereka benci kepada apa yang diturunkan Allah (Al Quran) lalu Allah menghapuskan (pahala-pahala) amal-amal mereka.",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّهُمۡ كَرِهُوا۟ مَاۤ أَنزَلَ ٱللَّهُ فَأَحۡبَطَ أَعۡمَـٰلَهُمۡ\n"
    }
  },
  {
    "id": 4555,
    "surahId": 47,
    "ayahNumber": 10,
    "arabicText": "۞ أَفَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَیَنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلَّذِینَ مِن قَبۡلِهِمۡۖ دَمَّرَ ٱللَّهُ عَلَیۡهِمۡۖ وَلِلۡكَـٰفِرِینَ أَمۡثَـٰلُهَا\n",
    "translations": {
      "en": "Have they, then, never journeyed about the earth and beheld what happened in the end to those [willful sinners] who lived before their time? God destroyed them utterly: and the like thereof awaits all who deny the truth.",
      "ms": "Maka tidakkah mereka telah mengembara di muka bumi, serta mereka memerhatikan bagaimana akibat orang-orang kafir yang terdahulu dari mereka? Allah telah menghancurkan orang-orang itu; dan orang-orang kafir (yang menurut jejak mereka) akan beroleh akibat-akibat buruk yang seperti itu.",
      "id": "Maka apakah mereka tidak mengadakan perjalanan di muka bumi sehingga mereka dapat memperhatikan bagaimana kesudahan orang-orang sebelum mereka; Allah telah menimpakan kebinasaan atas mereka dan orang-orang kafir akan menerima (akibat-akibat) seperti itu.",
      "ar": "۞ أَفَلَمۡ یَسِیرُوا۟ فِی ٱلۡأَرۡضِ فَیَنظُرُوا۟ كَیۡفَ كَانَ عَـٰقِبَةُ ٱلَّذِینَ مِن قَبۡلِهِمۡۖ دَمَّرَ ٱللَّهُ عَلَیۡهِمۡۖ وَلِلۡكَـٰفِرِینَ أَمۡثَـٰلُهَا\n"
    }
  },
  {
    "id": 4556,
    "surahId": 47,
    "ayahNumber": 11,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّ ٱللَّهَ مَوۡلَى ٱلَّذِینَ ءَامَنُوا۟ وَأَنَّ ٱلۡكَـٰفِرِینَ لَا مَوۡلَىٰ لَهُمۡ\n",
    "translations": {
      "en": "This, because God is the Protector of all who have attained to faith, whereas they who deny the truth have no protector.",
      "ms": "Balasan yang demikian, kerana sesungguhnya Allah menjadi Pelindung orang-orang yang beriman, dan sesungguhnya orang-orang yang kafir: tiada sesiapapun yang dapat memberikan perlindungan kepada mereka.",
      "id": "Yang demikian itu karena sesungguhnya Allah adalah pelindung orang-orang yang beriman dan karena sesungguhnya orang-orang kafir itu tidak mempunyai pelindung.",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّ ٱللَّهَ مَوۡلَى ٱلَّذِینَ ءَامَنُوا۟ وَأَنَّ ٱلۡكَـٰفِرِینَ لَا مَوۡلَىٰ لَهُمۡ\n"
    }
  },
  {
    "id": 4557,
    "surahId": 47,
    "ayahNumber": 12,
    "arabicText": "إِنَّ ٱللَّهَ یُدۡخِلُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ وَٱلَّذِینَ كَفَرُوا۟ یَتَمَتَّعُونَ وَیَأۡكُلُونَ كَمَا تَأۡكُلُ ٱلۡأَنۡعَـٰمُ وَٱلنَّارُ مَثۡوࣰى لَّهُمۡ\n",
    "translations": {
      "en": "Verily, God will admit all who attain to faith and do righteous deeds into gardens through which running waters flow, whereas they who are bent on denying the truth shall have - even though they may enjoy their life [in this world] and eat as cattle eat - the fire [of the hereafter] for their abode.",
      "ms": "Sesungguhnya Allah akan memasukkan orang-orang yang beriman serta mengerjakan amal-amal yang soleh - ke dalam Syurga yang mengalir di bawahnya beberapa sungai; dan (sebaliknya) orang-orang yang kafir menikmati kesenangan di dunia serta mereka makan minum sebagaimana binatang-binatang ternak makan minum, sedang nerakalah menjadi tempat tinggal mereka.",
      "id": "Sesungguhnya Allah memasukkan orang-orang mukmin dan beramal saleh ke dalam jannah yang mengalir di bawahnya sungai-sungai. Dan orang-orang kafir bersenang-senang (di dunia) dan mereka makan seperti makannya binatang. Dan jahannam adalah tempat tinggal mereka.",
      "ar": "إِنَّ ٱللَّهَ یُدۡخِلُ ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ جَنَّـٰتࣲ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ وَٱلَّذِینَ كَفَرُوا۟ یَتَمَتَّعُونَ وَیَأۡكُلُونَ كَمَا تَأۡكُلُ ٱلۡأَنۡعَـٰمُ وَٱلنَّارُ مَثۡوࣰى لَّهُمۡ\n"
    }
  },
  {
    "id": 4558,
    "surahId": 47,
    "ayahNumber": 13,
    "arabicText": "وَكَأَیِّن مِّن قَرۡیَةٍ هِیَ أَشَدُّ قُوَّةࣰ مِّن قَرۡیَتِكَ ٱلَّتِیۤ أَخۡرَجَتۡكَ أَهۡلَكۡنَـٰهُمۡ فَلَا نَاصِرَ لَهُمۡ\n",
    "translations": {
      "en": "And how many a community of greater power than this thy community which has driven thee out, [O Muhammad,] have We destroyed, with none to succour them!",
      "ms": "Dan bukan sedikit (penduduk) negeri-negeri yang lebih kuat dari (penduduk) negerimu (wahai Muhammad) yang telah memaksamu keluar (berhijrah) - Kami binasakan mereka, maka tiadalah sesiapa pun yang dapat membela mereka.",
      "id": "Dan betapa banyaknya negeri yang (penduduknya) lebih kuat dari pada (penduduk) negerimu (Muhammad) yang telah mengusirmu itu. Kami telah membinasakan mereka, maka tidak ada seorang penolongpun bagi mereka.",
      "ar": "وَكَأَیِّن مِّن قَرۡیَةٍ هِیَ أَشَدُّ قُوَّةࣰ مِّن قَرۡیَتِكَ ٱلَّتِیۤ أَخۡرَجَتۡكَ أَهۡلَكۡنَـٰهُمۡ فَلَا نَاصِرَ لَهُمۡ\n"
    }
  },
  {
    "id": 4559,
    "surahId": 47,
    "ayahNumber": 14,
    "arabicText": "أَفَمَن كَانَ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّهِۦ كَمَن زُیِّنَ لَهُۥ سُوۤءُ عَمَلِهِۦ وَٱتَّبَعُوۤا۟ أَهۡوَاۤءَهُم\n",
    "translations": {
      "en": "CAN, THEN, he who takes his stand on a clear evidence from his Sustainer be likened Unto one to whom the evil of his own doings [always] seems goodly, and unto such as would follow but their own lusts?",
      "ms": "Dengan yang demikian, adakah orang orang (yang beriman dan taat) yang keadaannya sentiasa berdasarkan bukti yang nyata dari Tuhannya: sama seperti orang-orang (yang ingkar - derhaka) yang telah diperhiaskan kepadanya (oleh Syaitan) akan kejahatan amalnya (sehingga dipandangnya baik), dan yang telah menurut hawa nafsunya? (Sudah tentu tidak sama)!",
      "id": "Maka apakah orang yang berpegang pada keterangan yang datang dari Rabbnya sama dengan orang yang (shaitan) menjadikan dia memandang baik perbuatannya yang buruk itu dan mengikuti hawa nafsunya?",
      "ar": "أَفَمَن كَانَ عَلَىٰ بَیِّنَةࣲ مِّن رَّبِّهِۦ كَمَن زُیِّنَ لَهُۥ سُوۤءُ عَمَلِهِۦ وَٱتَّبَعُوۤا۟ أَهۡوَاۤءَهُم\n"
    }
  },
  {
    "id": 4560,
    "surahId": 47,
    "ayahNumber": 15,
    "arabicText": "مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِی وُعِدَ ٱلۡمُتَّقُونَۖ فِیهَاۤ أَنۡهَـٰرࣱ مِّن مَّاۤءٍ غَیۡرِ ءَاسِنࣲ وَأَنۡهَـٰرࣱ مِّن لَّبَنࣲ لَّمۡ یَتَغَیَّرۡ طَعۡمُهُۥ وَأَنۡهَـٰرࣱ مِّنۡ خَمۡرࣲ لَّذَّةࣲ لِّلشَّـٰرِبِینَ وَأَنۡهَـٰرࣱ مِّنۡ عَسَلࣲ مُّصَفࣰّىۖ وَلَهُمۡ فِیهَا مِن كُلِّ ٱلثَّمَرَ ٰ⁠تِ وَمَغۡفِرَةࣱ مِّن رَّبِّهِمۡۖ كَمَنۡ هُوَ خَـٰلِدࣱ فِی ٱلنَّارِ وَسُقُوا۟ مَاۤءً حَمِیمࣰا فَقَطَّعَ أَمۡعَاۤءَهُمۡ\n",
    "translations": {
      "en": "[And can] the parable of the paradise which the God-conscious are promised [a paradise] wherein there are rivers of water which time does not corrupt, and rivers of milk the taste whereof never alters, and rivers of wine delightful to those who drink it, and rivers of honey of all impurity cleansed, and the enjoyment of all the fruits [of their good deeds] and of forgiveness from their Sustainer -: can this [parable of paradise] be likened unto [the parable of the recompense of] such as are to abide in the fire and be given waters of burning despair to drink, so that it will tear their bowels asunder?",
      "ms": "Sifat Syurga yang telah dijanjikan kepada orang-orang yang bertaqwa (ialah seperti berikut): ada padanya beberapa sungai dari air yang tidak berubah (rasa dan baunya), dan beberapa sungai dari susu yang tidak berubah rasanya, serta beberapa sungai dari arak yang lazat bagi orang-orang yang meminumnya, dan juga beberapa sungai dari madu yang suci bersih. Dan ada pula untuk mereka di sana segala jenis buah-buahan, serta keredaan dari Tuhan mereka. (Adakah orang-orang yang tinggal kekal di dalam Syurga yang sedemikian itu keadaannya) sama seperti orang-orang yang tinggal kekal di dalam neraka dan diberi minum dari air yang menggelegak sehingga menjadikan isi perut mereka hancur? (Sudah tentu tidak sama)!",
      "id": "(Apakah) perumpamaan (penghuni) jannah yang dijanjikan kepada orang-orang yang bertakwa yang di dalamnya ada sungai-sungai dari air yang tiada berubah rasa dan baunya, sungai-sungai dari air susu yang tidak berubah rasanya, sungai-sungai dari khamar yang lezat rasanya bagi peminumnya dan sungai-sungai dari madu yang disaring; dan mereka memperoleh di dalamnya segala macam buah-buahan dan ampunan dari Rabb mereka, sama dengan orang yang kekal dalam jahannam dan diberi minuman dengan air yang mendidih sehingga memotong ususnya?",
      "ar": "مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِی وُعِدَ ٱلۡمُتَّقُونَۖ فِیهَاۤ أَنۡهَـٰرࣱ مِّن مَّاۤءٍ غَیۡرِ ءَاسِنࣲ وَأَنۡهَـٰرࣱ مِّن لَّبَنࣲ لَّمۡ یَتَغَیَّرۡ طَعۡمُهُۥ وَأَنۡهَـٰرࣱ مِّنۡ خَمۡرࣲ لَّذَّةࣲ لِّلشَّـٰرِبِینَ وَأَنۡهَـٰرࣱ مِّنۡ عَسَلࣲ مُّصَفࣰّىۖ وَلَهُمۡ فِیهَا مِن كُلِّ ٱلثَّمَرَ ٰ⁠تِ وَمَغۡفِرَةࣱ مِّن رَّبِّهِمۡۖ كَمَنۡ هُوَ خَـٰلِدࣱ فِی ٱلنَّارِ وَسُقُوا۟ مَاۤءً حَمِیمࣰا فَقَطَّعَ أَمۡعَاۤءَهُمۡ\n"
    }
  },
  {
    "id": 4561,
    "surahId": 47,
    "ayahNumber": 16,
    "arabicText": "وَمِنۡهُم مَّن یَسۡتَمِعُ إِلَیۡكَ حَتَّىٰۤ إِذَا خَرَجُوا۟ مِنۡ عِندِكَ قَالُوا۟ لِلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ مَاذَا قَالَ ءَانِفًاۚ أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ طَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَٱتَّبَعُوۤا۟ أَهۡوَاۤءَهُمۡ\n",
    "translations": {
      "en": "Now among those [hapless sinners] are such as [pretend to] listen to thee, [O Muhammad,] and then, as soon as they leave thy presence, speak [with scorn] unto those who have understood [thy mes­sage]: “What is it that he has said just now?” It is such as these whose hearts God has sealed because they [always] followed but their own lusts",
      "ms": "Dan di antara mereka (yang hadir di majlismu wahai Muhammad, ialah orang-orang munafik) yang mendengar ajaranmu (dengan sambil lewa), sehingga apabila mereka keluar dari sisimu berkatalah mereka (secara mengejek-ejek) kepada orang-orang yang diberi ilmu (dari kalangan sahabat-sahabatmu yang setia): \"Apa yang dikatakan oleh Muhammad tadi?\" Mereka (yang munafik) itu ialah orang-orang yang telah dimeteraikan Allah atas hati mereka, dan ialah orang-orang yang menurut hawa nafsunya.",
      "id": "Dan di antara mereka ada orang yang mendengarkan perkataanmu sehingga apabila mereka keluar dari sisimu orang-orang berkata kepada orang yang telah diberi ilmu pengetahuan (sahabat-sahabat Nabi): \"Apakah yang dikatakannya tadi?\" Mereka itulah orang-orang yang dikunci mati hati mereka oleh Allah dan mengikuti hawa nafsu mereka.",
      "ar": "وَمِنۡهُم مَّن یَسۡتَمِعُ إِلَیۡكَ حَتَّىٰۤ إِذَا خَرَجُوا۟ مِنۡ عِندِكَ قَالُوا۟ لِلَّذِینَ أُوتُوا۟ ٱلۡعِلۡمَ مَاذَا قَالَ ءَانِفًاۚ أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ طَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَٱتَّبَعُوۤا۟ أَهۡوَاۤءَهُمۡ\n"
    }
  },
  {
    "id": 4562,
    "surahId": 47,
    "ayahNumber": 17,
    "arabicText": "وَٱلَّذِینَ ٱهۡتَدَوۡا۟ زَادَهُمۡ هُدࣰى وَءَاتَىٰهُمۡ تَقۡوَىٰهُمۡ\n",
    "translations": {
      "en": "just as for those who are [willing to be] guided, He increases their [ability to follow His] guidance and causes them to grow in God-consciousness.",
      "ms": "Dan (sebaliknya) orang-orang yang menerima petunjuk (ke jalan yang benar), Allah menambahi mereka dengan hidayah petunjuk, serta memberi kepada mereka (dorongan) untuk mereka bertaqwa.",
      "id": "Dan orang-orang yang mau menerima petunjuk, Allah menambah petunjuk kepada mereka dan memberikan balasan ketakwaannya.",
      "ar": "وَٱلَّذِینَ ٱهۡتَدَوۡا۟ زَادَهُمۡ هُدࣰى وَءَاتَىٰهُمۡ تَقۡوَىٰهُمۡ\n"
    }
  },
  {
    "id": 4563,
    "surahId": 47,
    "ayahNumber": 18,
    "arabicText": "فَهَلۡ یَنظُرُونَ إِلَّا ٱلسَّاعَةَ أَن تَأۡتِیَهُم بَغۡتَةࣰۖ فَقَدۡ جَاۤءَ أَشۡرَاطُهَاۚ فَأَنَّىٰ لَهُمۡ إِذَا جَاۤءَتۡهُمۡ ذِكۡرَىٰهُمۡ\n",
    "translations": {
      "en": "Are, then, they [whose hearts are sealed] wait­ing for the Last Hour - [waiting] that it come upon them of a sudden? But it has already been foretold! And what will their remembrance [of their past sins] avail them, once it has come upon them?",
      "ms": "(Kiranya golongan yang ingkar masih tidak mahu menerima peringatan yang diberi kepadanya) maka tidak ada lagi yang mereka tunggu melainkan saat kiamat yang akan datang kepada mereka secara mengejut, kerana sesungguhnya telah lahirlah tanda-tanda kedatangannya. Kalaulah demikian, maka bagaimanakah mereka dapat menerima peringatan yang diberi kepada mereka - apabila saat kiamat itu datang kepada mereka?",
      "id": "Maka tidaklah yang mereka tunggu-tunggu melainkan hari kiamat (yaitu) kedatangannya kepada mereka dengan tiba-tiba, karena sesungguhnya telah datang tanda-tandanya. Maka apakah faedahnya bagi mereka kesadaran mereka itu apabila Kiamat sudah datang?",
      "ar": "فَهَلۡ یَنظُرُونَ إِلَّا ٱلسَّاعَةَ أَن تَأۡتِیَهُم بَغۡتَةࣰۖ فَقَدۡ جَاۤءَ أَشۡرَاطُهَاۚ فَأَنَّىٰ لَهُمۡ إِذَا جَاۤءَتۡهُمۡ ذِكۡرَىٰهُمۡ\n"
    }
  },
  {
    "id": 4564,
    "surahId": 47,
    "ayahNumber": 19,
    "arabicText": "فَٱعۡلَمۡ أَنَّهُۥ لَاۤ إِلَـٰهَ إِلَّا ٱللَّهُ وَٱسۡتَغۡفِرۡ لِذَنۢبِكَ وَلِلۡمُؤۡمِنِینَ وَٱلۡمُؤۡمِنَـٰتِۗ وَٱللَّهُ یَعۡلَمُ مُتَقَلَّبَكُمۡ وَمَثۡوَىٰكُمۡ\n",
    "translations": {
      "en": "Know, then, [O man,] that there is no deity save God, and [while there is yet time,] ask forgive­ness for thy sins and for [the sins of] all other believing men and women: for God knows all your comings and goings as well as your abiding [at rest].",
      "ms": "Oleh itu, maka tetapkanlah pengetahuanmu dan keyakinanmu (wahai Muhammad) bahawa sesungguhnya tiada Tuhan yang berhak disembah melainkan Allah, dan mintalah ampun kepadaNya bagi salah silap yang engkau lakukan, dan bagi dosa-dosa orang-orang yang beriman - lelaki dan perempuan; dan (ingatlah), Allah mengetahui akan keadaan gerak-geri kamu (di dunia) dan keadaan penetapan kamu (di akhirat).",
      "id": "Maka ketahuilah, bahwa sesungguhnya tidak ada Ilah (sesembahan, tuhan) selain Allah dan mohonlah ampunan bagi dosamu dan bagi (dosa) orang-orang mukmin, laki-laki dan perempuan. Dan Allah mengetahui tempat kamu berusaha dan tempat kamu tinggal.",
      "ar": "فَٱعۡلَمۡ أَنَّهُۥ لَاۤ إِلَـٰهَ إِلَّا ٱللَّهُ وَٱسۡتَغۡفِرۡ لِذَنۢبِكَ وَلِلۡمُؤۡمِنِینَ وَٱلۡمُؤۡمِنَـٰتِۗ وَٱللَّهُ یَعۡلَمُ مُتَقَلَّبَكُمۡ وَمَثۡوَىٰكُمۡ\n"
    }
  },
  {
    "id": 4565,
    "surahId": 47,
    "ayahNumber": 20,
    "arabicText": "وَیَقُولُ ٱلَّذِینَ ءَامَنُوا۟ لَوۡلَا نُزِّلَتۡ سُورَةࣱۖ فَإِذَاۤ أُنزِلَتۡ سُورَةࣱ مُّحۡكَمَةࣱ وَذُكِرَ فِیهَا ٱلۡقِتَالُ رَأَیۡتَ ٱلَّذِینَ فِی قُلُوبِهِم مَّرَضࣱ یَنظُرُونَ إِلَیۡكَ نَظَرَ ٱلۡمَغۡشِیِّ عَلَیۡهِ مِنَ ٱلۡمَوۡتِۖ فَأَوۡلَىٰ لَهُمۡ\n",
    "translations": {
      "en": "NOW THOSE who have attained to faith say, “Would that a revelation [allowing us to fight] was bestowed from on high!” But now that a revelation clear in and by itself, mentioning war, has been bestowed from on high, thou canst see those in whose hearts is disease look­ing at thee, [O Muhammad,] with the look of one who is about to faint for fear of death! And yet, far better for them would be",
      "ms": "Dan (kerana gemarkan pahala berjuang menegakkan Islam) orang-orang yang beriman berkata: \"Alangkah baiknya sekiranya diturunkan satu surah (dari Al-Quran, yang memerintahkan kami berjuang)?\" Maka apabila diturunkan satu surah (dari Al-Quran) yang tegas keterangannya dan tersebut padanya hukum-hukum yang mewajibkan perang Jihad (menentang pencerobohan musuh), sudah tentu engkau akan melihat orang-orang yang ada penyakit (kufur) dalam hatinya memandang kepadamu dengan terbeliak matanya kerana gerun takut menghadapi mati; dengan yang demikian, maka kebinasaanlah lebih hampir kepada mereka.",
      "id": "Dan orang-orang yang beriman berkata: \"Mengapa tiada diturunkan suatu surat?\" Maka apabila diturunkan suatu surat yang jelas maksudnya dan disebutkan di dalamnya (perintah) perang, kamu lihat orang-orang yang ada penyakit di dalam hatinya memandang kepadamu seperti pandangan orang yang pingsan karena takut mati, dan kecelakaanlah bagi mereka.",
      "ar": "وَیَقُولُ ٱلَّذِینَ ءَامَنُوا۟ لَوۡلَا نُزِّلَتۡ سُورَةࣱۖ فَإِذَاۤ أُنزِلَتۡ سُورَةࣱ مُّحۡكَمَةࣱ وَذُكِرَ فِیهَا ٱلۡقِتَالُ رَأَیۡتَ ٱلَّذِینَ فِی قُلُوبِهِم مَّرَضࣱ یَنظُرُونَ إِلَیۡكَ نَظَرَ ٱلۡمَغۡشِیِّ عَلَیۡهِ مِنَ ٱلۡمَوۡتِۖ فَأَوۡلَىٰ لَهُمۡ\n"
    }
  },
  {
    "id": 4566,
    "surahId": 47,
    "ayahNumber": 21,
    "arabicText": "طَاعَةࣱ وَقَوۡلࣱ مَّعۡرُوفࣱۚ فَإِذَا عَزَمَ ٱلۡأَمۡرُ فَلَوۡ صَدَقُوا۟ ٱللَّهَ لَكَانَ خَیۡرࣰا لَّهُمۡ\n",
    "translations": {
      "en": "obedience [to God’s call] and a word that could win [His] approval: for, since the matter has been resolved [by His revelation], it would be but for their own good to remain true to God.",
      "ms": "(Mereka selalu berkata: \"Pendirian kami) mematuhi perintah dan memperkatakan perkataan yang baik (yang diredhai Allah)\". Dalam pada itu, apabila perkara (peperangan Jihad) itu ditetapkan wajibnya, (mereka tidak menyukainya); maka kalaulah mereka bersifat jujur kepada Allah (dengan mematuhi perintahNya), tentulah yang demikian itu amat baik bagi mereka.",
      "id": "Taat dan mengucapkan perkataan yang baik (adalah lebih baik bagi mereka). Apabila telah tetap perintah perang (mereka tidak menyukainya). Tetapi jikalau mereka benar (imannya) terhadap Allah, niscaya yang demikian itu lebih baik bagi mereka.",
      "ar": "طَاعَةࣱ وَقَوۡلࣱ مَّعۡرُوفࣱۚ فَإِذَا عَزَمَ ٱلۡأَمۡرُ فَلَوۡ صَدَقُوا۟ ٱللَّهَ لَكَانَ خَیۡرࣰا لَّهُمۡ\n"
    }
  },
  {
    "id": 4567,
    "surahId": 47,
    "ayahNumber": 22,
    "arabicText": "فَهَلۡ عَسَیۡتُمۡ إِن تَوَلَّیۡتُمۡ أَن تُفۡسِدُوا۟ فِی ٱلۡأَرۡضِ وَتُقَطِّعُوۤا۟ أَرۡحَامَكُمۡ\n",
    "translations": {
      "en": "[Ask them:] “Would you, perchance, after having turned away [from God’s commandment, pre­fer to revert to your old ways, and] spread corruption on earth, and [once again] cut asunder your ties of kinship?”",
      "ms": "(Kalau kamu tidak mematuhi perintah) maka tidakkah kamu harus dibimbang dan dikhuatirkan - jika kamu dapat memegang kuasa - kamu akan melakukan kerosakan di muka bumi, dan memutuskan hubungan silaturrahim dengan kaum kerabat?",
      "id": "Maka apakah kiranya jika kamu berkuasa kamu akan membuat kerusakan di muka bumi dan memutuskan hubungan kekeluargaan?",
      "ar": "فَهَلۡ عَسَیۡتُمۡ إِن تَوَلَّیۡتُمۡ أَن تُفۡسِدُوا۟ فِی ٱلۡأَرۡضِ وَتُقَطِّعُوۤا۟ أَرۡحَامَكُمۡ\n"
    }
  },
  {
    "id": 4568,
    "surahId": 47,
    "ayahNumber": 23,
    "arabicText": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ لَعَنَهُمُ ٱللَّهُ فَأَصَمَّهُمۡ وَأَعۡمَىٰۤ أَبۡصَـٰرَهُمۡ\n",
    "translations": {
      "en": "It is such as these whom God rejects, and whom He makes deaf [to the voice of truth], and whose eyes He blinds [to its sight]!",
      "ms": "(Orang-orang yang melakukan perkara yang tersebut) merekalah yang dilaknat oleh Allah serta ditulikan pendengaran mereka, dan dibutakan penglihatannya",
      "id": "Mereka itulah orang-orang yang dilaknati Allah dan ditulikan-Nya telinga mereka dan dibutakan-Nya penglihatan mereka.",
      "ar": "أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ لَعَنَهُمُ ٱللَّهُ فَأَصَمَّهُمۡ وَأَعۡمَىٰۤ أَبۡصَـٰرَهُمۡ\n"
    }
  },
  {
    "id": 4569,
    "surahId": 47,
    "ayahNumber": 24,
    "arabicText": "أَفَلَا یَتَدَبَّرُونَ ٱلۡقُرۡءَانَ أَمۡ عَلَىٰ قُلُوبٍ أَقۡفَالُهَاۤ\n",
    "translations": {
      "en": "Will they not, then, ponder over this Qur’an? - or are there locks upon their hearts?",
      "ms": "(Setelah diterangkan yang demikian) maka adakah mereka sengaja tidak berusaha memahami serta memikirkan isi Al-Quran? Atau telah ada di atas hati mereka kunci penutup (yang menghalangnya daripada menerima ajaran Al-Quran)?",
      "id": "Maka apakah mereka tidak memperhatikan Al Quran ataukah hati mereka terkunci?",
      "ar": "أَفَلَا یَتَدَبَّرُونَ ٱلۡقُرۡءَانَ أَمۡ عَلَىٰ قُلُوبٍ أَقۡفَالُهَاۤ\n"
    }
  },
  {
    "id": 4570,
    "surahId": 47,
    "ayahNumber": 25,
    "arabicText": "إِنَّ ٱلَّذِینَ ٱرۡتَدُّوا۟ عَلَىٰۤ أَدۡبَـٰرِهِم مِّنۢ بَعۡدِ مَا تَبَیَّنَ لَهُمُ ٱلۡهُدَى ٱلشَّیۡطَـٰنُ سَوَّلَ لَهُمۡ وَأَمۡلَىٰ لَهُمۡ\n",
    "translations": {
      "en": "VERILY, those who turn their backs [on this mes­sage] after guidance has been vouchsafed to them, [do it because] Satan has embellished their fancies and filled them with false hopes:",
      "ms": "Sesungguhnya orang-orang yang telah berbalik kepada keingkaran mereka sesudah terang nyata kepada mereka kebenaran petunjuk (yang dikemukakan kepadanya), Syaitanlah yang memperdayakan mereka (berlaku demikian), serta memanjangkan angan-angan mereka.",
      "id": "Sesungguhnya orang-orang yang kembali ke belakang (kepada kekafiran) sesudah petunjuk itu jelas bagi mereka, syaitan telah menjadikan mereka mudah (berbuat dosa) dan memanjangkan angan-angan mereka.",
      "ar": "إِنَّ ٱلَّذِینَ ٱرۡتَدُّوا۟ عَلَىٰۤ أَدۡبَـٰرِهِم مِّنۢ بَعۡدِ مَا تَبَیَّنَ لَهُمُ ٱلۡهُدَى ٱلشَّیۡطَـٰنُ سَوَّلَ لَهُمۡ وَأَمۡلَىٰ لَهُمۡ\n"
    }
  },
  {
    "id": 4571,
    "surahId": 47,
    "ayahNumber": 26,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّهُمۡ قَالُوا۟ لِلَّذِینَ كَرِهُوا۟ مَا نَزَّلَ ٱللَّهُ سَنُطِیعُكُمۡ فِی بَعۡضِ ٱلۡأَمۡرِۖ وَٱللَّهُ یَعۡلَمُ إِسۡرَارَهُمۡ\n",
    "translations": {
      "en": "[they do turn their backs on it] inasmuch as they are wont to say unto those who abhor all that God has revealed, “We will comply with your views on some points.” But God knows their secret thoughts:",
      "ms": "Berlakunya yang demikian ialah: kerana mereka berkata kepada orang-orang yang tidak menyukai perkara yang diturunkan oleh Allah: \"Kami akan patuh kepada kamu pada setengah perkara (yang berhubung dengan menentang Muhammad dan pengikutnya) itu\"; sedang Allah mengetahui segala (perkataan dan perbuatan) yang mereka sembunyikan.",
      "id": "Yang demikian itu karena sesungguhnya mereka (orang-orang munafik) itu berkata kepada orang-orang yang benci kepada apa yang diturunkan Allah (orang-orang Yahudi): \"Kami akan mematuhi kamu dalam beberapa urusan\", sedang Allah mengetahui rahasia mereka.",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّهُمۡ قَالُوا۟ لِلَّذِینَ كَرِهُوا۟ مَا نَزَّلَ ٱللَّهُ سَنُطِیعُكُمۡ فِی بَعۡضِ ٱلۡأَمۡرِۖ وَٱللَّهُ یَعۡلَمُ إِسۡرَارَهُمۡ\n"
    }
  },
  {
    "id": 4572,
    "surahId": 47,
    "ayahNumber": 27,
    "arabicText": "فَكَیۡفَ إِذَا تَوَفَّتۡهُمُ ٱلۡمَلَـٰۤىِٕكَةُ یَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَـٰرَهُمۡ\n",
    "translations": {
      "en": "hence, how [will they fare] when the angels gather them in death, striking their faces and their backs?",
      "ms": "(Kalaulah mereka terlepas sekarang dari bencana kejahatan mereka) maka bagaimanakah (mereka dapat menolak azab seksa) apabila malaikat mengambil nyawa mereka sambil memukul muka dan punggung mereka?",
      "id": "Bagaimanakah (keadaan mereka) apabila malaikat mencabut nyawa mereka seraya memukul-mukul muka mereka dan punggung mereka?",
      "ar": "فَكَیۡفَ إِذَا تَوَفَّتۡهُمُ ٱلۡمَلَـٰۤىِٕكَةُ یَضۡرِبُونَ وُجُوهَهُمۡ وَأَدۡبَـٰرَهُمۡ\n"
    }
  },
  {
    "id": 4573,
    "surahId": 47,
    "ayahNumber": 28,
    "arabicText": "ذَ ٰ⁠لِكَ بِأَنَّهُمُ ٱتَّبَعُوا۟ مَاۤ أَسۡخَطَ ٱللَّهَ وَكَرِهُوا۟ رِضۡوَ ٰ⁠نَهُۥ فَأَحۡبَطَ أَعۡمَـٰلَهُمۡ\n",
    "translations": {
      "en": "This, because they were wont to pursue what God con­demns and to hate [whatever would meet with] His goodly acceptance: and so He has caused all their [good] deeds to come to nought.",
      "ms": "(Kematian mereka dalam keadaan yang buruk) itu, kerana mereka menurut (serta melakukan) perkara-perkara yang menyebabkan kemurkaan Allah, dan mereka pula membenci perkara-perkara yang diredhaiNya; oleh itu, Allah gugurkan amal-amal mereka (yang baik, yang pernah mereka lakukan).",
      "id": "Yang demikian itu adalah karena sesungguhnya mereka mengikuti apa yang menimbulkan kemurkaan Allah dan karena mereka membenci keridhaan-Nya, sebab itu Allah menghapus (pahala) amal-amal mereka.",
      "ar": "ذَ ٰ⁠لِكَ بِأَنَّهُمُ ٱتَّبَعُوا۟ مَاۤ أَسۡخَطَ ٱللَّهَ وَكَرِهُوا۟ رِضۡوَ ٰ⁠نَهُۥ فَأَحۡبَطَ أَعۡمَـٰلَهُمۡ\n"
    }
  },
  {
    "id": 4574,
    "surahId": 47,
    "ayahNumber": 29,
    "arabicText": "أَمۡ حَسِبَ ٱلَّذِینَ فِی قُلُوبِهِم مَّرَضٌ أَن لَّن یُخۡرِجَ ٱللَّهُ أَضۡغَـٰنَهُمۡ\n",
    "translations": {
      "en": "Or do they in whose hearts is disease think, perchance, that God would never bring their moral failings to light?",
      "ms": "Patutkah orang-orang (munafik) yang ada penyakit (syak, ragu-ragu) dalam hatinya: menyangka bahawa Allah tidak sekali-kali akan mendedahkan perasaan dendam dan hasad dengki mereka (terhadap Nabi Muhammad s.a.w dan umatnya)?",
      "id": "Atau apakah orang-orang yang ada penyakit dalam hatinya mengira bahwa Allah tidak akan menampakkan kedengkian mereka?",
      "ar": "أَمۡ حَسِبَ ٱلَّذِینَ فِی قُلُوبِهِم مَّرَضٌ أَن لَّن یُخۡرِجَ ٱللَّهُ أَضۡغَـٰنَهُمۡ\n"
    }
  },
  {
    "id": 4575,
    "surahId": 47,
    "ayahNumber": 30,
    "arabicText": "وَلَوۡ نَشَاۤءُ لَأَرَیۡنَـٰكَهُمۡ فَلَعَرَفۡتَهُم بِسِیمَـٰهُمۡۚ وَلَتَعۡرِفَنَّهُمۡ فِی لَحۡنِ ٱلۡقَوۡلِۚ وَٱللَّهُ یَعۡلَمُ أَعۡمَـٰلَكُمۡ\n",
    "translations": {
      "en": "Now had We so willed, We could have shown them clearly to thee, so that thou wouldst know them for sure as by a visible mark: but [even so,] thou wilt most certainly recognize them by the tone of their voice. And God knows all that you do, [O men;]",
      "ms": "Dan sekiranya Kami kehendaki, tentulah Kami akan memperkenalkan mereka kepadamu (wahai Muhammad), lalu engkau tetap mengenalinya dengan tanda-tanda (yang menjadi sifat) mereka; dan demi sesungguhnya, engkau akan mengenali mereka dari gaya dan tutur katanya. Dan (ingatlah kamu masing-masing), Allah mengetahui segala yang kamu lakukan.",
      "id": "Dan kalau Kami kehendaki, niscaya Kami tunjukkan mereka kepadamu sehingga kamu benar-benar dapat mengenal mereka dengan tanda-tandanya. Dan kamu benar-benar akan mengenal mereka dari kiasan-kiasan perkataan mereka dan Allah mengetahui perbuatan-perbuatan kamu.",
      "ar": "وَلَوۡ نَشَاۤءُ لَأَرَیۡنَـٰكَهُمۡ فَلَعَرَفۡتَهُم بِسِیمَـٰهُمۡۚ وَلَتَعۡرِفَنَّهُمۡ فِی لَحۡنِ ٱلۡقَوۡلِۚ وَٱللَّهُ یَعۡلَمُ أَعۡمَـٰلَكُمۡ\n"
    }
  },
  {
    "id": 4576,
    "surahId": 47,
    "ayahNumber": 31,
    "arabicText": "وَلَنَبۡلُوَنَّكُمۡ حَتَّىٰ نَعۡلَمَ ٱلۡمُجَـٰهِدِینَ مِنكُمۡ وَٱلصَّـٰبِرِینَ وَنَبۡلُوَا۟ أَخۡبَارَكُمۡ\n",
    "translations": {
      "en": "and most certainly We shall try you all, so that We might mark out those of you who strive hard [in Our cause] and are patient in adversity: for We shall put to a test [the truth of] all your assertions.",
      "ms": "Dan demi sesungguhnya! Kami tetap menguji kamu (wahai orang-orang yang mengaku beriman) sehingga ternyata pengetahuan Kami tentang adanya orang-orang yang berjuang dari kalangan kamu dan orang-orang yang sabar (dalam menjalankan perintah Kami); dan (sehingga) Kami dapat mengesahkan (benar atau tidaknya) berita-berita tentang keadaan kamu.",
      "id": "Dan sesungguhnya Kami benar-benar akan menguji kamu agar Kami mengetahui orang-orang yang berjihad dan bersabar di antara kamu, dan agar Kami menyatakan (baik buruknya) hal ihwalmu.",
      "ar": "وَلَنَبۡلُوَنَّكُمۡ حَتَّىٰ نَعۡلَمَ ٱلۡمُجَـٰهِدِینَ مِنكُمۡ وَٱلصَّـٰبِرِینَ وَنَبۡلُوَا۟ أَخۡبَارَكُمۡ\n"
    }
  },
  {
    "id": 4577,
    "surahId": 47,
    "ayahNumber": 32,
    "arabicText": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ وَشَاۤقُّوا۟ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَیَّنَ لَهُمُ ٱلۡهُدَىٰ لَن یَضُرُّوا۟ ٱللَّهَ شَیۡـࣰٔا وَسَیُحۡبِطُ أَعۡمَـٰلَهُمۡ\n",
    "translations": {
      "en": "Verily, they who are bent on denying the truth and on barring [others] from the path of God, and [who thus] cut themselves off from the Apostle after guidance has been vouchsafed to them, can in no wise harm God; but He will cause all their deeds to come to nought.",
      "ms": "Sesungguhnya orang-orang yang kafir dan menghalangi (dirinya dan orang lain) dari jalan Allah, serta mereka memusuhi Rasul Allah setelah ternyata kepada mereka kebenaran petunjuk (yang dibawanya), mereka tidak sekali-kali akan dapat mendatangkan mudarat kepada Allah sedikitpun, dan (sebaliknya) Allah akan menghampakan perbuatan dan amal-amal mereka.",
      "id": "Sesungguhnya orang-orang kafir dan (yang) menghalangi manusia dari jalan Allah serta memusuhi Rasul setelah petunjuk itu jelas bagi mereka, mereka tidak dapat memberi mudharat kepada Allah sedikitpun. Dan Allah akan menghapuskan (pahala) amal-amal mereka.",
      "ar": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ وَشَاۤقُّوا۟ ٱلرَّسُولَ مِنۢ بَعۡدِ مَا تَبَیَّنَ لَهُمُ ٱلۡهُدَىٰ لَن یَضُرُّوا۟ ٱللَّهَ شَیۡـࣰٔا وَسَیُحۡبِطُ أَعۡمَـٰلَهُمۡ\n"
    }
  },
  {
    "id": 4578,
    "surahId": 47,
    "ayahNumber": 33,
    "arabicText": "۞ یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَطِیعُوا۟ ٱللَّهَ وَأَطِیعُوا۟ ٱلرَّسُولَ وَلَا تُبۡطِلُوۤا۟ أَعۡمَـٰلَكُمۡ\n",
    "translations": {
      "en": "O you who have attained to faith! Pay heed unto God, and pay heed unto the Apostle, and let not your [good] deeds come to nought!",
      "ms": "Wahai orang-orang yang beriman! Taatlah kamu kepada Allah dan taatlah kepada Rasul Allah, dan janganlah kamu batalkan amal-amal kamu!",
      "id": "Hai orang-orang yang beriman, taatilah Allah dan taatilah Rasul dan janganlah kamu merusakkan (pahala) amal-amalmu.",
      "ar": "۞ یَـٰۤأَیُّهَا ٱلَّذِینَ ءَامَنُوۤا۟ أَطِیعُوا۟ ٱللَّهَ وَأَطِیعُوا۟ ٱلرَّسُولَ وَلَا تُبۡطِلُوۤا۟ أَعۡمَـٰلَكُمۡ\n"
    }
  },
  {
    "id": 4579,
    "surahId": 47,
    "ayahNumber": 34,
    "arabicText": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ ثُمَّ مَاتُوا۟ وَهُمۡ كُفَّارࣱ فَلَن یَغۡفِرَ ٱللَّهُ لَهُمۡ\n",
    "translations": {
      "en": "Verily, as for those who are bent on denying the truth and on barring [others] from the path of God, and then die as deniers of the truth - indeed, God will not grant them forgiveness!",
      "ms": "Sesungguhnya orang-orang yang kafir dan menghalangi (dirinya dan orang lain) dari jalan Allah, kemudian mereka mati dengan keadaan kafirnya, maka Allah tidak sekali-kali akan mengampunkan mereka.",
      "id": "Sesungguhnya orang-orang kafir dan (yang) menghalangi manusia dari jalan Allah kemudian mereka mati dalam keadaan kafir, maka sekali-kali Allah tidak akan memberi ampun kepada mereka.",
      "ar": "إِنَّ ٱلَّذِینَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِیلِ ٱللَّهِ ثُمَّ مَاتُوا۟ وَهُمۡ كُفَّارࣱ فَلَن یَغۡفِرَ ٱللَّهُ لَهُمۡ\n"
    }
  },
  {
    "id": 4580,
    "surahId": 47,
    "ayahNumber": 35,
    "arabicText": "فَلَا تَهِنُوا۟ وَتَدۡعُوۤا۟ إِلَى ٱلسَّلۡمِ وَأَنتُمُ ٱلۡأَعۡلَوۡنَ وَٱللَّهُ مَعَكُمۡ وَلَن یَتِرَكُمۡ أَعۡمَـٰلَكُمۡ\n",
    "translations": {
      "en": "AND SO, [when you fight in a just cause,] do not lose heart and [never] beg for peace: for, seeing that God is with you, you are bound to rise high [in the end]; and never will He let your [good] deeds go to waste.",
      "ms": "(Apabila kamu telah mengetahui bahawa orang-orang kafir itu dihampakan amalnya dan diseksa oleh Allah) maka janganlah kamu (wahai orang-orang yang beriman) merasa lemah dan mengajak (musuh yang menceroboh) untuk berdamai, padahal kamulah orang-orang yang tertinggi keadaannya, lagi pula Allah bersama-sama kamu (untuk membela kamu mencapai kemenangan), dan Ia tidak sekali-kali akan mengurangi (pahala) amal-amal kamu.",
      "id": "Janganlah kamu lemah dan minta damai padahal kamulah yang di atas dan Allah pun bersamamu dan Dia sekali-kali tidak akan mengurangi pahala amal-amalmu.",
      "ar": "فَلَا تَهِنُوا۟ وَتَدۡعُوۤا۟ إِلَى ٱلسَّلۡمِ وَأَنتُمُ ٱلۡأَعۡلَوۡنَ وَٱللَّهُ مَعَكُمۡ وَلَن یَتِرَكُمۡ أَعۡمَـٰلَكُمۡ\n"
    }
  },
  {
    "id": 4581,
    "surahId": 47,
    "ayahNumber": 36,
    "arabicText": "إِنَّمَا ٱلۡحَیَوٰةُ ٱلدُّنۡیَا لَعِبࣱ وَلَهۡوࣱۚ وَإِن تُؤۡمِنُوا۟ وَتَتَّقُوا۟ یُؤۡتِكُمۡ أُجُورَكُمۡ وَلَا یَسۡـَٔلۡكُمۡ أَمۡوَ ٰ⁠لَكُمۡ\n",
    "translations": {
      "en": "The life of this world is but a play and a passing delight: but if you believe [in God] and are conscious of Him, He will grant you your deserts. And withal, He does not demand of you [to sacrifice in His cause all of] your possessions:",
      "ms": "(Ingatlah) bahawa kehidupan dunia (yang tidak berdasarkan iman dan taqwa) hanyalah ibarat permainan dan hiburan; dan jika kamu beriman serta bertaqwa, Allah akan memberikan kamu pahala amal kamu, dan Ia tidak meminta kepada kamu harta benda kamu (melainkan untuk memberikan kamu barang yang lebih baik daripadanya).",
      "id": "Sesungguhnya kehidupan dunia hanyalah permainan dan senda gurau. Dan jika kamu beriman dan bertakwa, Allah akan memberikan pahala kepadamu dan Dia tidak akan meminta harta-hartamu.",
      "ar": "إِنَّمَا ٱلۡحَیَوٰةُ ٱلدُّنۡیَا لَعِبࣱ وَلَهۡوࣱۚ وَإِن تُؤۡمِنُوا۟ وَتَتَّقُوا۟ یُؤۡتِكُمۡ أُجُورَكُمۡ وَلَا یَسۡـَٔلۡكُمۡ أَمۡوَ ٰ⁠لَكُمۡ\n"
    }
  },
  {
    "id": 4582,
    "surahId": 47,
    "ayahNumber": 37,
    "arabicText": "إِن یَسۡـَٔلۡكُمُوهَا فَیُحۡفِكُمۡ تَبۡخَلُوا۟ وَیُخۡرِجۡ أَضۡغَـٰنَكُمۡ\n",
    "translations": {
      "en": "[for,] if He were to demand of you all of them, and urge you, you would niggardly cling [to them], and so He would [but] bring out your moral failings.",
      "ms": "(Tabiat kamu wahai manusia) jika Tuhan meminta kepada kamu harta benda kamu serta mendesak kamu memberikanNya, nescaya kamu akan berlaku bakhil kedekut, dan kebakhilan itu akan melahirkan kemarahan dan kebencian kamu.",
      "id": "Jika Dia meminta harta kepadamu lalu mendesak kamu (supaya memberikan semuanya) niscaya kamu akan kikir dan Dia akan menampakkan kedengkianmu.",
      "ar": "إِن یَسۡـَٔلۡكُمُوهَا فَیُحۡفِكُمۡ تَبۡخَلُوا۟ وَیُخۡرِجۡ أَضۡغَـٰنَكُمۡ\n"
    }
  },
  {
    "id": 4583,
    "surahId": 47,
    "ayahNumber": 38,
    "arabicText": "هَـٰۤأَنتُمۡ هَـٰۤؤُلَاۤءِ تُدۡعَوۡنَ لِتُنفِقُوا۟ فِی سَبِیلِ ٱللَّهِ فَمِنكُم مَّن یَبۡخَلُۖ وَمَن یَبۡخَلۡ فَإِنَّمَا یَبۡخَلُ عَن نَّفۡسِهِۦۚ وَٱللَّهُ ٱلۡغَنِیُّ وَأَنتُمُ ٱلۡفُقَرَاۤءُۚ وَإِن تَتَوَلَّوۡا۟ یَسۡتَبۡدِلۡ قَوۡمًا غَیۡرَكُمۡ ثُمَّ لَا یَكُونُوۤا۟ أَمۡثَـٰلَكُم\n",
    "translations": {
      "en": "Behold, [O believers,] it is you who are called upon to spend freely in God’s cause: but [even] among you are such as turn out to be niggardly! And yet, he who acts niggardly [in God’s cause] is but niggardly towards his own self: for God is indeed self-sufficient, whereas you stand in need [of Him]; and if you turn away [from Him], He will cause other people to take your place, and they will not be the likes of you!",
      "ms": "(Ingatlah), kamu ini adalah orang-orang yang bertabiat demikian - kamu diseru supaya menderma dan membelanjakan sedikit dari harta benda kamu pada jalan Allah, maka ada di antara kamu yang berlaku bakhil, padahal sesiapa yang berlaku bakhil maka sesungguhnya ia hanyalah berlaku bakhil kepada dirinya sendiri. Dan (ingatlah) Allah Maha kaya (tidak berhajat kepada sesuatupun), sedang kamu semua orang-orang miskin (yang sentiasa berhajat kepadaNya dalam segala hal). Dan jika kamu berpaling (daripada beriman, bertaqwa dan berderma) Ia akan menggantikan kamu dengan kaum yang lain; setelah itu mereka tidak akan berkeadaan seperti kamu.",
      "id": "Ingatlah, kamu ini orang-orang yang diajak untuk menafkahkan (hartamu) pada jalan Allah. Maka di antara kamu ada yang kikir, dan siapa yang kikir sesungguhnya dia hanyalah kikir terhadap dirinya sendiri. Dan Allah-lah yang Maha Kaya sedangkan kamulah orang-orang yang berkehendak (kepada-Nya); dan jika kamu berpaling niscaya Dia akan mengganti (kamu) dengan kaum yang lain; dan mereka tidak akan seperti kamu ini.",
      "ar": "هَـٰۤأَنتُمۡ هَـٰۤؤُلَاۤءِ تُدۡعَوۡنَ لِتُنفِقُوا۟ فِی سَبِیلِ ٱللَّهِ فَمِنكُم مَّن یَبۡخَلُۖ وَمَن یَبۡخَلۡ فَإِنَّمَا یَبۡخَلُ عَن نَّفۡسِهِۦۚ وَٱللَّهُ ٱلۡغَنِیُّ وَأَنتُمُ ٱلۡفُقَرَاۤءُۚ وَإِن تَتَوَلَّوۡا۟ یَسۡتَبۡدِلۡ قَوۡمًا غَیۡرَكُمۡ ثُمَّ لَا یَكُونُوۤا۟ أَمۡثَـٰلَكُم\n"
    }
  }
]