[
  {
    "id": 1708,
    "surahId": 13,
    "ayahNumber": 1,
    "arabicText": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤمۤرۚ تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِۗ وَٱلَّذِیۤ أُنزِلَ إِلَیۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یُؤۡمِنُونَ\n",
    "translations": {
      "en": "Alif. Lam. Mim. Ra. THESE ARE MESSAGES of revelation: and what has been bestowed upon thee from on high by thy Sustainer is the truth-yet most people will not believe [in it]?",
      "ms": "Alif, Laam, Miim, Raa'. Ini ialah ayat-ayat Kitab (Al-Quran); dan apa yang diturunkan kepadamu (wahai Muhammad) dari Tuhanmu adalah benar; tetapi kebanyakan manusia tidak (mahu) beriman.",
      "id": "Alif laam miim raa. Ini adalah ayat-ayat Al Kitab (Al Quran). Dan Kitab yang diturunkan kepadamu daripada Tuhanmu itu adalah benar: akan tetapi kebanyakan manusia tidak beriman (kepadanya).",
      "ar": "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَـٰنِ ٱلرَّحِیمِ الۤمۤرۚ تِلۡكَ ءَایَـٰتُ ٱلۡكِتَـٰبِۗ وَٱلَّذِیۤ أُنزِلَ إِلَیۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَـٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا یُؤۡمِنُونَ\n"
    }
  },
  {
    "id": 1709,
    "surahId": 13,
    "ayahNumber": 2,
    "arabicText": "ٱللَّهُ ٱلَّذِی رَفَعَ ٱلسَّمَـٰوَ ٰ⁠تِ بِغَیۡرِ عَمَدࣲ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلࣱّ یَجۡرِی لِأَجَلࣲ مُّسَمࣰّىۚ یُدَبِّرُ ٱلۡأَمۡرَ یُفَصِّلُ ٱلۡـَٔایَـٰتِ لَعَلَّكُم بِلِقَاۤءِ رَبِّكُمۡ تُوقِنُونَ\n",
    "translations": {
      "en": "It is God who has raised the heavens without any supports that you could see, and is established on the throne of His almightiness; and He [it is who] has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him]. He governs all that exists. Clearly does He spell out these messages, so that you might be certain in your innermost that you are destined to meet your Sustainer [on Judgment Day].",
      "ms": "Allah jualah yang menjadikan langit terangkat tinggi dengan tiada bertiang sebagaimana yang kamu melihatnya, kemudian Ia bersemayam di atas Arasy; dan Ia memudahkan matahari dan bulan (untuk faedah makhluk-makhlukNya) tiap-tiap satu dari keduanya beredar untuk suatu masa yang telah ditetapkan. Allah jualah yang mentadbirkan segala urusan; Ia menerangkan tanda-tanda kekuasaanNya satu-persatu, supaya kamu yakin kepada pertemuan Tuhan kamu (untuk menerima balasan).",
      "id": "Allah-lah Yang meninggikan langit tanpa tiang (sebagaimana) yang kamu lihat, kemudian Dia bersemayam di atas 'Arasy, dan menundukkan matahari dan bulan. Masing-masing beredar hingga waktu yang ditentukan. Allah mengatur urusan (makhluk-Nya), menjelaskan tanda-tanda (kebesaran-Nya), supaya kamu meyakini pertemuan(mu) dengan Tuhanmu.",
      "ar": "ٱللَّهُ ٱلَّذِی رَفَعَ ٱلسَّمَـٰوَ ٰ⁠تِ بِغَیۡرِ عَمَدࣲ تَرَوۡنَهَاۖ ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ وَسَخَّرَ ٱلشَّمۡسَ وَٱلۡقَمَرَۖ كُلࣱّ یَجۡرِی لِأَجَلࣲ مُّسَمࣰّىۚ یُدَبِّرُ ٱلۡأَمۡرَ یُفَصِّلُ ٱلۡـَٔایَـٰتِ لَعَلَّكُم بِلِقَاۤءِ رَبِّكُمۡ تُوقِنُونَ\n"
    }
  },
  {
    "id": 1710,
    "surahId": 13,
    "ayahNumber": 3,
    "arabicText": "وَهُوَ ٱلَّذِی مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِیهَا رَوَ ٰ⁠سِیَ وَأَنۡهَـٰرࣰاۖ وَمِن كُلِّ ٱلثَّمَرَ ٰ⁠تِ جَعَلَ فِیهَا زَوۡجَیۡنِ ٱثۡنَیۡنِۖ یُغۡشِی ٱلَّیۡلَ ٱلنَّهَارَۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَتَفَكَّرُونَ\n",
    "translations": {
      "en": "And it is He who has spread the earth wide and placed on it firm mountains and running waters, and created thereon two sexes of every [kind of] plant; [and it is He who] causes the night to cover the day. Verily, in all this there are messages indeed for people who think!",
      "ms": "Dan Dia lah yang menjadikan bumi terbentang luas, dan menjadikan padanya gunung-ganang (terdiri kukuh) serta sungai-sungai (yang mengalir). Dan dari tiap-tiap jenis buah-buahan, Ia jadikan padanya pasangan: dua-dua. Ia juga melindungi siang dengan malam silih berganti. Sesungguhnya semuanya itu mengandungi tanda-tanda kekuasaan Allah bagi kaum yang (mahu) berfikir.",
      "id": "Dan Dialah Tuhan yang membentangkan bumi dan menjadikan gunung-gunung dan sungai-sungai padanya. Dan menjadikan padanya semua buah-buahan berpasang-pasangan, Allah menutupkan malam kepada siang. Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi kaum yang memikirkan.",
      "ar": "وَهُوَ ٱلَّذِی مَدَّ ٱلۡأَرۡضَ وَجَعَلَ فِیهَا رَوَ ٰ⁠سِیَ وَأَنۡهَـٰرࣰاۖ وَمِن كُلِّ ٱلثَّمَرَ ٰ⁠تِ جَعَلَ فِیهَا زَوۡجَیۡنِ ٱثۡنَیۡنِۖ یُغۡشِی ٱلَّیۡلَ ٱلنَّهَارَۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَتَفَكَّرُونَ\n"
    }
  },
  {
    "id": 1711,
    "surahId": 13,
    "ayahNumber": 4,
    "arabicText": "وَفِی ٱلۡأَرۡضِ قِطَعࣱ مُّتَجَـٰوِرَ ٰ⁠تࣱ وَجَنَّـٰتࣱ مِّنۡ أَعۡنَـٰبࣲ وَزَرۡعࣱ وَنَخِیلࣱ صِنۡوَانࣱ وَغَیۡرُ صِنۡوَانࣲ یُسۡقَىٰ بِمَاۤءࣲ وَ ٰ⁠حِدࣲ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضࣲ فِی ٱلۡأُكُلِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَعۡقِلُونَ\n",
    "translations": {
      "en": "And there are on earth [many] tracts of land close by one another [and yet widely differing from one another]; and [there are on it] vinyards, and fields of grain, and date-palms growing in clusters from one root or standing alone, [all] watered with the same water: and yet, some of them have We favoured above others by way of the food [which they provide for man and beast]. Verily, in all this there are messages indeed for people who use their reason!",
      "ms": "Dan di bumi ada beberapa potong tanah yang berdekatan (tetapi berlainan keadaannya); dan padanya ada kebun-kebun anggur, dan jenis-jenis tanaman serta pohon-pohon tamar (kurma) yang berumpun dan yang tidak berumpun; semuanya disiram dengan air yang sama; dan Kami lebihkan buah setengahnya dari setengahnya yang lain (pada bentuk, rasa, dan baunya) Sesungguhnya yang demikian itu mengandungi tanda-tanda kekuasaan Allah bagi orang-orang yang (mahu) berfikir serta memahaminya.",
      "id": "Dan di bumi ini terdapat bagian-bagian yang berdampingan, dan kebun-kebun anggur, tanaman-tanaman dan pohon korma yang bercabang dan yang tidak bercabang, disirami dengan air yang sama. Kami melebihkan sebahagian tanam-tanaman itu atas sebahagian yang lain tentang rasanya. Sesungguhnya pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi kaum yang berfikir.",
      "ar": "وَفِی ٱلۡأَرۡضِ قِطَعࣱ مُّتَجَـٰوِرَ ٰ⁠تࣱ وَجَنَّـٰتࣱ مِّنۡ أَعۡنَـٰبࣲ وَزَرۡعࣱ وَنَخِیلࣱ صِنۡوَانࣱ وَغَیۡرُ صِنۡوَانࣲ یُسۡقَىٰ بِمَاۤءࣲ وَ ٰ⁠حِدࣲ وَنُفَضِّلُ بَعۡضَهَا عَلَىٰ بَعۡضࣲ فِی ٱلۡأُكُلِۚ إِنَّ فِی ذَ ٰ⁠لِكَ لَـَٔایَـٰتࣲ لِّقَوۡمࣲ یَعۡقِلُونَ\n"
    }
  },
  {
    "id": 1712,
    "surahId": 13,
    "ayahNumber": 5,
    "arabicText": "۞ وَإِن تَعۡجَبۡ فَعَجَبࣱ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَ ٰ⁠بًا أَءِنَّا لَفِی خَلۡقࣲ جَدِیدٍۗ أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ كَفَرُوا۟ بِرَبِّهِمۡۖ وَأُو۟لَـٰۤىِٕكَ ٱلۡأَغۡلَـٰلُ فِیۤ أَعۡنَاقِهِمۡۖ وَأُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلنَّارِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n",
    "translations": {
      "en": "BUT IF thou art amazed [at the marvels of God's creation], amazing, too, is their saying, \"What! After we have become dust, shall we indeed be [restored to life] in a new act of creation?\" It is they who [thus show that they] are bent on denying their Sustainer; and it is they who carry the shackles [of their own making] around their necks; and it is they who are destined for the fire, therein to abide.",
      "ms": "Dan jika engkau merasa hairan (wahai Muhammad), maka sungguh menghairankan perkataan mereka yang kafir itu (yang mengatakan): \"Adalah apabila kami telah menjadi tanah betulkah kami pula akan hidup semula dalam bentuk kejadian yang baharu?\" Mereka itulah orang-orang yang kufur ingkar kepada Tuhan mereka, dan merekalah yang dibelenggu dengan belenggu-belenggu pada leher mereka; dan merekalah juga ahli neraka, mereka kekal di dalamnya.",
      "id": "Dan jika (ada sesuatu) yang kamu herankan, maka yang patut mengherankan adalah ucapan mereka: \"Apabila kami telah menjadi tanah, apakah kami sesungguhnya akan (dikembalikan) menjadi makhluk yang baru?\" Orang-orang itulah yang kafir kepada Tuhannya; dan orang-orang itulah (yang dilekatkan) belenggu di lehernya; mereka itulah penghuni neraka, mereka kekal di dalamnya.",
      "ar": "۞ وَإِن تَعۡجَبۡ فَعَجَبࣱ قَوۡلُهُمۡ أَءِذَا كُنَّا تُرَ ٰ⁠بًا أَءِنَّا لَفِی خَلۡقࣲ جَدِیدٍۗ أُو۟لَـٰۤىِٕكَ ٱلَّذِینَ كَفَرُوا۟ بِرَبِّهِمۡۖ وَأُو۟لَـٰۤىِٕكَ ٱلۡأَغۡلَـٰلُ فِیۤ أَعۡنَاقِهِمۡۖ وَأُو۟لَـٰۤىِٕكَ أَصۡحَـٰبُ ٱلنَّارِۖ هُمۡ فِیهَا خَـٰلِدُونَ\n"
    }
  },
  {
    "id": 1713,
    "surahId": 13,
    "ayahNumber": 6,
    "arabicText": "وَیَسۡتَعۡجِلُونَكَ بِٱلسَّیِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَـٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةࣲ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِیدُ ٱلۡعِقَابِ\n",
    "translations": {
      "en": "And [since, O Prophet, they are bent on denying the truth,] they challenge thee to hasten the coming upon them of evil instead of [hoping for] good although [they ought to know that] the exemplary punishments [which they now deride] have indeed come to pass before their time. Now, behold, thy Sustainer is full of forgiveness unto men despite all their evildoing: but, behold, thy Sustainer is [also] truly severe in retribution!",
      "ms": "Dan mereka meminta kepadamu menyegerakan kedatangan perkara buruk (azab yang dijanjikan) sebelum mereka memohon kebaikan; padahal sesungguhnya telah berlaku sebelum mereka peristiwa-peristiwa azab yang telah menimpa orang-orang yang kafir seperti mereka. dan (ingatlah) sesungguhnya Tuhanmu Amat melimpah keampunanNya bagi manusia (yang bertaubat) terhadap kezaliman mereka, dan sesungguhnya Tuhanmu juga amatlah keras balasan azabNya (terhadap golongan yang tetap ingkar).",
      "id": "Mereka meminta kepadamu supaya disegerakan (datangnya) siksa, sebelum (mereka meminta) kebaikan, padahal telah terjadi bermacam-macam contoh siksa sebelum mereka. Sesungguhnya Tuhanmu benar-benar mempunyai ampunan (yang luas) bagi manusia sekalipun mereka zalim, dan sesungguhnya Tuhanmu benar-benar sangat keras siksanya.",
      "ar": "وَیَسۡتَعۡجِلُونَكَ بِٱلسَّیِّئَةِ قَبۡلَ ٱلۡحَسَنَةِ وَقَدۡ خَلَتۡ مِن قَبۡلِهِمُ ٱلۡمَثُلَـٰتُۗ وَإِنَّ رَبَّكَ لَذُو مَغۡفِرَةࣲ لِّلنَّاسِ عَلَىٰ ظُلۡمِهِمۡۖ وَإِنَّ رَبَّكَ لَشَدِیدُ ٱلۡعِقَابِ\n"
    }
  },
  {
    "id": 1714,
    "surahId": 13,
    "ayahNumber": 7,
    "arabicText": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۤۗ إِنَّمَاۤ أَنتَ مُنذِرࣱۖ وَلِكُلِّ قَوۡمٍ هَادٍ\n",
    "translations": {
      "en": "However, they who are bent on denying the truth [refuse to believe and] say, \"Why has no miraculous sign ever been bestowed on him from on high by his Sustainer?\" [But] thou art only a warmer; and [in God] all people have a guide.",
      "ms": "Dan berkatalah orang-orang yang kafir: \"Mengapa tidak diturunkan kepada (Muhammad) sesuatu mukjizat dari Tuhannya?\" Sesungguhnya engkau (wahai Muhammad) hanyalah seorang Rasul pemberi amaran (kepada orang-orang yang ingkar), dan tiap-tiap umat (yang telah lalu) ada Nabinya yang memimpin ke jalan yang benar.",
      "id": "Orang-orang yang kafir berkata: \"Mengapa tidak diturunkan kepadanya (Muhammad) suatu tanda (kebesaran) dari Tuhannya?\" Sesungguhnya kamu hanyalah seorang pemberi peringatan; dan bagi tiap-tiap kaum ada orang yang memberi petunjuk.",
      "ar": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۤۗ إِنَّمَاۤ أَنتَ مُنذِرࣱۖ وَلِكُلِّ قَوۡمٍ هَادٍ\n"
    }
  },
  {
    "id": 1715,
    "surahId": 13,
    "ayahNumber": 8,
    "arabicText": "ٱللَّهُ یَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِیضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَیۡءٍ عِندَهُۥ بِمِقۡدَارٍ\n",
    "translations": {
      "en": "God knows what any female bears [in her womb], and by how much the wombs may fall short [in gestation], and by how much they may increase [the average period]: for with Him everything is [created] in accordance with its scope and purpose.",
      "ms": "Allah mengetahui akan apa yang dikandung oleh tiap-tiap ibu, dan mengetahui apa yang kurang dari yang dikandung dalam rahim itu atau yang lebih. Dan tiap-tiap sesuatu adalah ditetapkan di sisiNya dengan kadar yang tertentu.",
      "id": "Allah mengetahui apa yang dikandung oleh setiap perempuan, dan kandungan rahim yang kurang sempurna dan yang bertambah. Dan segala sesuatu pada sisi-Nya ada ukurannya.",
      "ar": "ٱللَّهُ یَعۡلَمُ مَا تَحۡمِلُ كُلُّ أُنثَىٰ وَمَا تَغِیضُ ٱلۡأَرۡحَامُ وَمَا تَزۡدَادُۚ وَكُلُّ شَیۡءٍ عِندَهُۥ بِمِقۡدَارٍ\n"
    }
  },
  {
    "id": 1716,
    "surahId": 13,
    "ayahNumber": 9,
    "arabicText": "عَـٰلِمُ ٱلۡغَیۡبِ وَٱلشَّهَـٰدَةِ ٱلۡكَبِیرُ ٱلۡمُتَعَالِ\n",
    "translations": {
      "en": "He knows all that is beyond the reach of a created being's perception as well as all that can be witnessed by a creature's senses or mind -the Great One, the One far above anything that is or could ever be!",
      "ms": "Dia lah yang mengetahui perkara-perkara yang ghaib dan yang nyata; Dia lah jua Yang Maha Besar, lagi maha Tinggi (Yang mengatasi segala-galanya).",
      "id": "Yang mengetahui semua yang ghaib dan yang nampak; Yang Maha Besar lagi Maha Tinggi.",
      "ar": "عَـٰلِمُ ٱلۡغَیۡبِ وَٱلشَّهَـٰدَةِ ٱلۡكَبِیرُ ٱلۡمُتَعَالِ\n"
    }
  },
  {
    "id": 1717,
    "surahId": 13,
    "ayahNumber": 10,
    "arabicText": "سَوَاۤءࣱ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۭ بِٱلَّیۡلِ وَسَارِبُۢ بِٱلنَّهَارِ\n",
    "translations": {
      "en": "It is all alike [to Him] whether any of you conceals his thought or brings it into the open, and whether he seeks to hide [his evil deeds] under the cover of night or walks [boldly] in the light of day,",
      "ms": "Sama sahaja kepadaNya: sesiapa di antara kamu yang merahsiakan kata-katanya dalam hati dan yang menyatakannya; juga yang bersembunyi pada waktu malam dan yang keluar berjalan pada waktu siang.",
      "id": "Sama saja (bagi Tuhan), siapa diantaramu yang merahasiakan ucapannya, dan siapa yang berterus-terang dengan ucapan itu, dan siapa yang bersembunyi di malam hari dan yang berjalan (menampakkan diri) di siang hari.",
      "ar": "سَوَاۤءࣱ مِّنكُم مَّنۡ أَسَرَّ ٱلۡقَوۡلَ وَمَن جَهَرَ بِهِۦ وَمَنۡ هُوَ مُسۡتَخۡفِۭ بِٱلَّیۡلِ وَسَارِبُۢ بِٱلنَّهَارِ\n"
    }
  },
  {
    "id": 1718,
    "surahId": 13,
    "ayahNumber": 11,
    "arabicText": "لَهُۥ مُعَقِّبَـٰتࣱ مِّنۢ بَیۡنِ یَدَیۡهِ وَمِنۡ خَلۡفِهِۦ یَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا یُغَیِّرُ مَا بِقَوۡمٍ حَتَّىٰ یُغَیِّرُوا۟ مَا بِأَنفُسِهِمۡۗ وَإِذَاۤ أَرَادَ ٱللَّهُ بِقَوۡمࣲ سُوۤءࣰا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ\n",
    "translations": {
      "en": "[thinking that] he has hosts of helpers-both such as can be perceived by him and such as are hidden from him -that could preserve him from whatever God may have willed. Verily, God does not change men's condition unless they change their inner selves; and when God wills people to suffer evil [in consequence of their own evil deeds], there is none who could avert it: for they have none who could protect them from Him.",
      "ms": "Bagi tiap-tiap seorang ada malaikat penjaganya silih berganti dari hadapannya dan dari belakangnya, yang mengawas dan menjaganya (dari sesuatu bahaya) dengan perintah Allah. Sesungguhnya Allah tidak mengubah apa yang ada pada sesuatu kaum sehingga mereka mengubah apa yang ada pada diri mereka sendiri. Dan apabila Allah menghendaki untuk menimpakan kepada sesuatu kaum bala bencana (disebabkan kesalahan mereka sendiri), maka tiada sesiapapun yang dapat menolak atau menahan apa yang ditetapkanNya itu, dan tidak ada sesiapapun yang dapat menolong dan melindungi mereka selain daripadaNya.",
      "id": "Bagi manusia ada malaikat-malaikat yang selalu mengikutinya bergiliran, di muka dan di belakangnya, mereka menjaganya atas perintah Allah. Sesungguhnya Allah tidak merubah keadaan sesuatu kaum sehingga mereka merubah keadaan yang ada pada diri mereka sendiri. Dan apabila Allah menghendaki keburukan terhadap sesuatu kaum, maka tak ada yang dapat menolaknya; dan sekali-kali tak ada pelindung bagi mereka selain Dia.",
      "ar": "لَهُۥ مُعَقِّبَـٰتࣱ مِّنۢ بَیۡنِ یَدَیۡهِ وَمِنۡ خَلۡفِهِۦ یَحۡفَظُونَهُۥ مِنۡ أَمۡرِ ٱللَّهِۗ إِنَّ ٱللَّهَ لَا یُغَیِّرُ مَا بِقَوۡمٍ حَتَّىٰ یُغَیِّرُوا۟ مَا بِأَنفُسِهِمۡۗ وَإِذَاۤ أَرَادَ ٱللَّهُ بِقَوۡمࣲ سُوۤءࣰا فَلَا مَرَدَّ لَهُۥۚ وَمَا لَهُم مِّن دُونِهِۦ مِن وَالٍ\n"
    }
  },
  {
    "id": 1719,
    "surahId": 13,
    "ayahNumber": 12,
    "arabicText": "هُوَ ٱلَّذِی یُرِیكُمُ ٱلۡبَرۡقَ خَوۡفࣰا وَطَمَعࣰا وَیُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ\n",
    "translations": {
      "en": "HE IT IS who displays before you the lightning, to give rise to [both] fear and hope, and calls heavy clouds into being;",
      "ms": "Dia lah yang memperlihatkan kilat kepada kamu, untuk menakutkan (dari panahan petir), dan memberi harapan (dengan turunnya hujan); dan Ia yang menjadikan awan tebal yang berat (dengan air).",
      "id": "Dialah Tuhan yang memperlihatkan kilat kepadamu untuk menimbulkan ketakutan dan harapan, dan Dia mengadakan awan mendung.",
      "ar": "هُوَ ٱلَّذِی یُرِیكُمُ ٱلۡبَرۡقَ خَوۡفࣰا وَطَمَعࣰا وَیُنشِئُ ٱلسَّحَابَ ٱلثِّقَالَ\n"
    }
  },
  {
    "id": 1720,
    "surahId": 13,
    "ayahNumber": 13,
    "arabicText": "وَیُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَـٰۤىِٕكَةُ مِنۡ خِیفَتِهِۦ وَیُرۡسِلُ ٱلصَّوَ ٰ⁠عِقَ فَیُصِیبُ بِهَا مَن یَشَاۤءُ وَهُمۡ یُجَـٰدِلُونَ فِی ٱللَّهِ وَهُوَ شَدِیدُ ٱلۡمِحَالِ\n",
    "translations": {
      "en": "and the thunder extols His limitless glory and praises Him, and [so do] the angels, in awe of Him; and He [it is who] lets loose the thunderbolts and strikes with them whom He wills. And yet, they stubbornly argue about God, notwithstanding [all evidence] that He alone has the power to contrive whatever His unfathomable wisdom wills!",
      "ms": "Dan Dia lah juga yang guruh dan malaikat bertasbih memujiNya, kerana takut kepadaNya. Dan Dia lah juga yang menghantarkan petir, lalu Ia mengenakan dengan panahannya kepada sesiapa yang dikehendakinya Dan mereka yang ingkar itu membantah (serta mendustakan Rasul) mengenai perkara yang berhubung dengan Allah (dan kuat kuasaNya) Padahal Ia Amat keras azab seksanya.",
      "id": "Dan guruh itu bertasbih dengan memuji Allah, (demikian pula) para malaikat karena takut kepada-Nya, dan Allah melepaskan halilintar, lalu menimpakannya kepada siapa yang Dia kehendaki, dan mereka berbantah-bantahan tentang Allah, dan Dialah Tuhan Yang Maha keras siksa-Nya.",
      "ar": "وَیُسَبِّحُ ٱلرَّعۡدُ بِحَمۡدِهِۦ وَٱلۡمَلَـٰۤىِٕكَةُ مِنۡ خِیفَتِهِۦ وَیُرۡسِلُ ٱلصَّوَ ٰ⁠عِقَ فَیُصِیبُ بِهَا مَن یَشَاۤءُ وَهُمۡ یُجَـٰدِلُونَ فِی ٱللَّهِ وَهُوَ شَدِیدُ ٱلۡمِحَالِ\n"
    }
  },
  {
    "id": 1721,
    "surahId": 13,
    "ayahNumber": 14,
    "arabicText": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِینَ یَدۡعُونَ مِن دُونِهِۦ لَا یَسۡتَجِیبُونَ لَهُم بِشَیۡءٍ إِلَّا كَبَـٰسِطِ كَفَّیۡهِ إِلَى ٱلۡمَاۤءِ لِیَبۡلُغَ فَاهُ وَمَا هُوَ بِبَـٰلِغِهِۦۚ وَمَا دُعَاۤءُ ٱلۡكَـٰفِرِینَ إِلَّا فِی ضَلَـٰلࣲ\n",
    "translations": {
      "en": "Unto Him [alone] is due all prayer aiming at the Ultimate Truth, since those [other beings or powers] whom men invoke instead of God cannot respond to them in any way - [so that he who invokes them is] but like one who stretches his open hands towards water, [hoping] that it will reach his mouth, the while it never reaches him. Hence, the prayer of those who deny the truth amounts to no more than losing oneself in grievous error.",
      "ms": "Kuasa menerima ibadat yang benar adalah tertentu bagi Allah; dan benda-benda yang mereka sembah yang lain dari Allah, tidak akan dapat menyahut atau memberikan sesuatupun kepada mereka, hanyalah seperti orang yang membentangkan kedua tapak tangannya kepada air supaya sampai ke mulutnya, padahal air itu sudah tentu tidak akan sampai kepadanya. Dan tiadalah ibadat dan doa permohonan orang-orang kafir itu melainkan dalam kesesatan.",
      "id": "Hanya bagi Allah-lah (hak mengabulkan) doa yang benar. Dan berhala-berhala yang mereka sembah selain Allah tidak dapat memperkenankan sesuatupun bagi mereka, melainkan seperti orang yang membukakan kedua telapak tangannya ke dalam air supaya sampai air ke mulutnya, padahal air itu tidak dapat sampai ke mulutnya. Dan doa (ibadat) orang-orang kafir itu, hanyalah sia-sia belaka.",
      "ar": "لَهُۥ دَعۡوَةُ ٱلۡحَقِّۚ وَٱلَّذِینَ یَدۡعُونَ مِن دُونِهِۦ لَا یَسۡتَجِیبُونَ لَهُم بِشَیۡءٍ إِلَّا كَبَـٰسِطِ كَفَّیۡهِ إِلَى ٱلۡمَاۤءِ لِیَبۡلُغَ فَاهُ وَمَا هُوَ بِبَـٰلِغِهِۦۚ وَمَا دُعَاۤءُ ٱلۡكَـٰفِرِینَ إِلَّا فِی ضَلَـٰلࣲ\n"
    }
  },
  {
    "id": 1722,
    "surahId": 13,
    "ayahNumber": 15,
    "arabicText": "وَلِلَّهِ یَسۡجُدُ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ طَوۡعࣰا وَكَرۡهࣰا وَظِلَـٰلُهُم بِٱلۡغُدُوِّ وَٱلۡـَٔاصَالِ ۩\n",
    "translations": {
      "en": "And before God prostrate themselves, willingly or unwillingly, all [things and beings] that are in the heavens and on earth, as do their shadows in the mornings and the evenings.",
      "ms": "Dan kepada Allah jualah sekalian makhluk yang ada di langit dan di bumi tunduk menurut, sama ada dengan sukarela atau dengan terpaksa; dan (demikian juga) bayang-bayang mereka; pada waktu pagi dan petang.",
      "id": "Hanya kepada Allah-lah sujud (patuh) segala apa yang di langit dan di bumi, baik dengan kemauan sendiri ataupun terpaksa (dan sujud pula) bayang-bayangnya di waktu pagi dan petang hari.",
      "ar": "وَلِلَّهِ یَسۡجُدُ مَن فِی ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ طَوۡعࣰا وَكَرۡهࣰا وَظِلَـٰلُهُم بِٱلۡغُدُوِّ وَٱلۡـَٔاصَالِ ۩\n"
    }
  },
  {
    "id": 1723,
    "surahId": 13,
    "ayahNumber": 16,
    "arabicText": "قُلۡ مَن رَّبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦۤ أَوۡلِیَاۤءَ لَا یَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعࣰا وَلَا ضَرࣰّاۚ قُلۡ هَلۡ یَسۡتَوِی ٱلۡأَعۡمَىٰ وَٱلۡبَصِیرُ أَمۡ هَلۡ تَسۡتَوِی ٱلظُّلُمَـٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُوا۟ لِلَّهِ شُرَكَاۤءَ خَلَقُوا۟ كَخَلۡقِهِۦ فَتَشَـٰبَهَ ٱلۡخَلۡقُ عَلَیۡهِمۡۚ قُلِ ٱللَّهُ خَـٰلِقُ كُلِّ شَیۡءࣲ وَهُوَ ٱلۡوَ ٰ⁠حِدُ ٱلۡقَهَّـٰرُ\n",
    "translations": {
      "en": "Say: \"Who is the Sustainer of the heavens and the earth?\" Say: \"[It is] God.\" Say: \"[Why,] then, do you take for your protectors, instead of Him, such as have it not within their power to bring benefit to, or avert harm from, themselves?\" Say: \"Can the blind and the seeing be deemed equal? -or can the depths of darkness and the light be deemed equal?\" Or do they [really] believe that there are, side by side with God, other divine powers that have created the like of what He creates, so that this act of creation appears to them to be similar [to His]? Say: \"God is the Creator of all things; and He is the One who holds absolute sway over all that exists.\"",
      "ms": "Bertanyalah (wahai Muhammad): \"Siapakah Tuhan yang memelihara dan mentadbirkan langit dan bumi?\" Jawablah: \"Allah\". Bertanyalah lagi: \"Kalau demikian, patutkah kamu menjadikan benda-benda yang lain dari Allah sebagai Pelindung dan Penolong, yang tidak dapat mendatangkan sebarang manfaat bagi dirinya sendiri, dan tidak dapat menolak sesuatu bahaya?\" Bertanyalah lagi: \"Adakah sama, orang yang buta dengan orang yang celik? Atau adakah sama, gelap-gelita dengan terang? Atau adakah makhluk-makhluk yang mereka jadikan sekutu bagi Allah itu telah mencipta sesuatu seperti ciptaanNya, sehingga ciptaan-ciptaan itu menjadi kesamaran kepada mereka?\" Katakanlah: \"Allah jualah yang menciptakan tiap-tiap sesuatu, dan Dia lah Yang Maha Esa, lagi Maha Kuasa\".",
      "id": "Katakanlah: \"Siapakah Tuhan langit dan bumi?\" Jawabnya: \"Allah\". Katakanlah: \"Maka patutkah kamu mengambil pelindung-pelindungmu dari selain Allah, padahal mereka tidak menguasai kemanfaatan dan tidak (pula) kemudharatan bagi diri mereka sendiri?\". Katakanlah: \"Adakah sama orang buta dan yang dapat melihat, atau samakah gelap gulita dan terang benderang; apakah mereka menjadikan beberapa sekutu bagi Allah yang dapat menciptakan seperti ciptaan-Nya sehingga kedua ciptaan itu serupa menurut pandangan mereka?\" Katakanlah: \"Allah adalah Pencipta segala sesuatu dan Dialah Tuhan Yang Maha Esa lagi Maha Perkasa\".",
      "ar": "قُلۡ مَن رَّبُّ ٱلسَّمَـٰوَ ٰ⁠تِ وَٱلۡأَرۡضِ قُلِ ٱللَّهُۚ قُلۡ أَفَٱتَّخَذۡتُم مِّن دُونِهِۦۤ أَوۡلِیَاۤءَ لَا یَمۡلِكُونَ لِأَنفُسِهِمۡ نَفۡعࣰا وَلَا ضَرࣰّاۚ قُلۡ هَلۡ یَسۡتَوِی ٱلۡأَعۡمَىٰ وَٱلۡبَصِیرُ أَمۡ هَلۡ تَسۡتَوِی ٱلظُّلُمَـٰتُ وَٱلنُّورُۗ أَمۡ جَعَلُوا۟ لِلَّهِ شُرَكَاۤءَ خَلَقُوا۟ كَخَلۡقِهِۦ فَتَشَـٰبَهَ ٱلۡخَلۡقُ عَلَیۡهِمۡۚ قُلِ ٱللَّهُ خَـٰلِقُ كُلِّ شَیۡءࣲ وَهُوَ ٱلۡوَ ٰ⁠حِدُ ٱلۡقَهَّـٰرُ\n"
    }
  },
  {
    "id": 1724,
    "surahId": 13,
    "ayahNumber": 17,
    "arabicText": "أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَسَالَتۡ أَوۡدِیَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّیۡلُ زَبَدࣰا رَّابِیࣰاۖ وَمِمَّا یُوقِدُونَ عَلَیۡهِ فِی ٱلنَّارِ ٱبۡتِغَاۤءَ حِلۡیَةٍ أَوۡ مَتَـٰعࣲ زَبَدࣱ مِّثۡلُهُۥۚ كَذَ ٰ⁠لِكَ یَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَـٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَیَذۡهَبُ جُفَاۤءࣰۖ وَأَمَّا مَا یَنفَعُ ٱلنَّاسَ فَیَمۡكُثُ فِی ٱلۡأَرۡضِۚ كَذَ ٰ⁠لِكَ یَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ\n",
    "translations": {
      "en": "[Whenever] He sends down water from the sky, and [once-dry] river-beds are running high according to their measure, the stream carries scum on its surface; and, likewise, from that [metal] which they smelt in the fire in order to make ornaments or utensils, [there rises] scum. In this way does God set forth the parable of truth and falsehood: for, as far as the scum is concerned, it passes away as [does all] dross; but that which is of benefit to man abides on earth. In this way does God set forth the parables",
      "ms": "Ia menurunkan air (hujan) dari langit, lalu membanjiri tanah-tanah lembah (dengan airnya) menurut kadarnya yang ditetapkan Tuhan untuk faedah makhlukNya, kemudian banjir itu membawa buih yang terapung-apung. Dan dari benda-benda yang dibakar di dalam api untuk dijadikan barang perhiasan atau perkakas yang diperlukan, juga timbul buih seperti itu. Demikianlah Allah memberi misal perbandingan tentang perkara yang benar dan yang salah. Adapun buih itu maka akan hilang lenyaplah ia hanyut terbuang, manakala benda-benda yang berfaedah kepada manusia maka ia tetap tinggal di bumi. Demikianlah Allah menerangkan misal-misal perbandingan.",
      "id": "Allah telah menurunkan air (hujan) dari langit, maka mengalirlah air di lembah-lembah menurut ukurannya, maka arus itu membawa buih yang mengambang. Dan dari apa (logam) yang mereka lebur dalam api untuk membuat perhiasan atau alat-alat, ada (pula) buihnya seperti buih arus itu. Demikianlah Allah membuat perumpamaan (bagi) yang benar dan yang bathil. Adapun buih itu, akan hilang sebagai sesuatu yang tak ada harganya; adapun yang memberi manfaat kepada manusia, maka ia tetap di bumi. Demikianlah Allah membuat perumpamaan-perumpamaan.",
      "ar": "أَنزَلَ مِنَ ٱلسَّمَاۤءِ مَاۤءࣰ فَسَالَتۡ أَوۡدِیَةُۢ بِقَدَرِهَا فَٱحۡتَمَلَ ٱلسَّیۡلُ زَبَدࣰا رَّابِیࣰاۖ وَمِمَّا یُوقِدُونَ عَلَیۡهِ فِی ٱلنَّارِ ٱبۡتِغَاۤءَ حِلۡیَةٍ أَوۡ مَتَـٰعࣲ زَبَدࣱ مِّثۡلُهُۥۚ كَذَ ٰ⁠لِكَ یَضۡرِبُ ٱللَّهُ ٱلۡحَقَّ وَٱلۡبَـٰطِلَۚ فَأَمَّا ٱلزَّبَدُ فَیَذۡهَبُ جُفَاۤءࣰۖ وَأَمَّا مَا یَنفَعُ ٱلنَّاسَ فَیَمۡكُثُ فِی ٱلۡأَرۡضِۚ كَذَ ٰ⁠لِكَ یَضۡرِبُ ٱللَّهُ ٱلۡأَمۡثَالَ\n"
    }
  },
  {
    "id": 1725,
    "surahId": 13,
    "ayahNumber": 18,
    "arabicText": "لِلَّذِینَ ٱسۡتَجَابُوا۟ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِینَ لَمۡ یَسۡتَجِیبُوا۟ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِی ٱلۡأَرۡضِ جَمِیعࣰا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡا۟ بِهِۦۤۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ سُوۤءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ\n",
    "translations": {
      "en": "of those who have responded to their Sustainer with a goodly response, and of those who did not respond to Him. [As for the latter,] if they possessed all that is on earth, and twice as much, they would surely offer it as ransom [on the Day of Judgment]: a most evil reckoning awaits them, and their goal is hell: and how evil a resting-place!",
      "ms": "Bagi orang-orang yang menyahut seruan Tuhan mereka sahajalah balasan yang sebaik-baiknya; dan orang-orang yang ingkar yang tidak menyahut seruanNya, kalaulah mereka mempunyai segala apa jua yang ada di bumi disertai dengan sebanyak itu lagi, tentulah mereka rela menebus diri dengannya. mereka itu disediakan baginya hitungan hisab yang seburuk-buruknya, serta tempat kembali mereka ialah neraka jahanam; dan amatlah buruknya tempat tinggal itu.",
      "id": "Bagi orang-orang yang memenuhi seruan Tuhannya, (disediakan) pembalasan yang baik. Dan orang-orang yang tidak memenuhi seruan Tuhan, sekiranya mereka mempunyai semua (kekayaan) yang ada di bumi dan (ditambah) sebanyak isi bumi itu lagi besertanya, niscaya mereka akan menebus dirinya dengan kekayaan itu. Orang-orang itu disediakan baginya hisab yang buruk dan tempat kediaman mereka ialah Jahanam dan itulah seburuk-buruk tempat kediaman.",
      "ar": "لِلَّذِینَ ٱسۡتَجَابُوا۟ لِرَبِّهِمُ ٱلۡحُسۡنَىٰۚ وَٱلَّذِینَ لَمۡ یَسۡتَجِیبُوا۟ لَهُۥ لَوۡ أَنَّ لَهُم مَّا فِی ٱلۡأَرۡضِ جَمِیعࣰا وَمِثۡلَهُۥ مَعَهُۥ لَٱفۡتَدَوۡا۟ بِهِۦۤۚ أُو۟لَـٰۤىِٕكَ لَهُمۡ سُوۤءُ ٱلۡحِسَابِ وَمَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ\n"
    }
  },
  {
    "id": 1726,
    "surahId": 13,
    "ayahNumber": 19,
    "arabicText": "۞ أَفَمَن یَعۡلَمُ أَنَّمَاۤ أُنزِلَ إِلَیۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰۤۚ إِنَّمَا یَتَذَكَّرُ أُو۟لُوا۟ ٱلۡأَلۡبَـٰبِ\n",
    "translations": {
      "en": "CAN, THEN, he who knows that whatever has been bestowed from on high upon thee by thy Sustainer is the truth be deemed equal to one who is blind? Only they who are endowed with insight keep this in mind:",
      "ms": "Maka adakah orang yang mengetahui bahawa Al-Quran yang diturunkan kepadamu dari Tuhanmu itu (wahai Muhammad) perkara yang benar, sama dengan orang yang buta matahatinya? Sesungguhnya orang-orang yang mahu memikirkan hal itu hanyalah orang-orang yang berakal sempurna.",
      "id": "Adakah orang yang mengetahui bahwasanya apa yang diturunkan kepadamu dari Tuhanmu itu benar sama dengan orang yang buta? Hanyalah orang-orang yang berakal saja yang dapat mengambil pelajaran,",
      "ar": "۞ أَفَمَن یَعۡلَمُ أَنَّمَاۤ أُنزِلَ إِلَیۡكَ مِن رَّبِّكَ ٱلۡحَقُّ كَمَنۡ هُوَ أَعۡمَىٰۤۚ إِنَّمَا یَتَذَكَّرُ أُو۟لُوا۟ ٱلۡأَلۡبَـٰبِ\n"
    }
  },
  {
    "id": 1727,
    "surahId": 13,
    "ayahNumber": 20,
    "arabicText": "ٱلَّذِینَ یُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا یَنقُضُونَ ٱلۡمِیثَـٰقَ\n",
    "translations": {
      "en": "they who are true to their bond with God and never break their covenant;",
      "ms": "Orang-orang yang menyempurnakan perjanjian Allah dan tidak merombak (mencabuli) perjanjian yang telah diperteguhkan itu; -",
      "id": "(yaitu) orang-orang yang memenuhi janji Allah dan tidak merusak perjanjian,",
      "ar": "ٱلَّذِینَ یُوفُونَ بِعَهۡدِ ٱللَّهِ وَلَا یَنقُضُونَ ٱلۡمِیثَـٰقَ\n"
    }
  },
  {
    "id": 1728,
    "surahId": 13,
    "ayahNumber": 21,
    "arabicText": "وَٱلَّذِینَ یَصِلُونَ مَاۤ أَمَرَ ٱللَّهُ بِهِۦۤ أَن یُوصَلَ وَیَخۡشَوۡنَ رَبَّهُمۡ وَیَخَافُونَ سُوۤءَ ٱلۡحِسَابِ\n",
    "translations": {
      "en": "and who keep together what God has bidden to be joined, and stand in awe of their Sustainer and fear the most evil reckoning [which awaits such as do not respond to Him];",
      "ms": "Dan orang-orang yang menghubungkan perkara-perkara yang disuruh oleh Allah supaya dihubungkan, dan yang menaruh bimbang akan kemurkaan Tuhan mereka, serta takut kepada kesukaran yang akan dihadapi semasa soaljawab dan hitungan amal (pada hari kiamat); -",
      "id": "dan orang-orang yang menghubungkan apa-apa yang Allah perintahkan supaya dihubungkan, dan mereka takut kepada Tuhannya dan takut kepada hisab yang buruk.",
      "ar": "وَٱلَّذِینَ یَصِلُونَ مَاۤ أَمَرَ ٱللَّهُ بِهِۦۤ أَن یُوصَلَ وَیَخۡشَوۡنَ رَبَّهُمۡ وَیَخَافُونَ سُوۤءَ ٱلۡحِسَابِ\n"
    }
  },
  {
    "id": 1729,
    "surahId": 13,
    "ayahNumber": 22,
    "arabicText": "وَٱلَّذِینَ صَبَرُوا۟ ٱبۡتِغَاۤءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقۡنَـٰهُمۡ سِرࣰّا وَعَلَانِیَةࣰ وَیَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّیِّئَةَ أُو۟لَـٰۤىِٕكَ لَهُمۡ عُقۡبَى ٱلدَّارِ\n",
    "translations": {
      "en": "and who are patient in adversity out of a longing for their Sustainer's countenance, and are constant in prayer, and spend on others, secretly and openly, out of what We provide for them as sustenance, and [who] repel evil with good. It is these that shall find their fulfilment in the hereafter:",
      "ms": "Dan orang-orang yang sabar kerana mengharapkan keredaan Tuhan mereka semata-mata, dan mendirikan sembahyang, serta mendermakan dari apa yang Kami kurniakan kepada mereka, secara bersembunyi atau secara terbuka; dan mereka pula menolak kejahatan dengan cara yang baik; mereka itu semuanya adalah disediakan baginya balasan yang sebaik-baiknya pada hari akhirat; -",
      "id": "Dan orang-orang yang sabar karena mencari keridhaan Tuhannya, mendirikan shalat, dan menafkahkan sebagian rezeki yang Kami berikan kepada mereka, secara sembunyi atau terang-terangan serta menolak kejahatan dengan kebaikan; orang-orang itulah yang mendapat tempat kesudahan (yang baik),",
      "ar": "وَٱلَّذِینَ صَبَرُوا۟ ٱبۡتِغَاۤءَ وَجۡهِ رَبِّهِمۡ وَأَقَامُوا۟ ٱلصَّلَوٰةَ وَأَنفَقُوا۟ مِمَّا رَزَقۡنَـٰهُمۡ سِرࣰّا وَعَلَانِیَةࣰ وَیَدۡرَءُونَ بِٱلۡحَسَنَةِ ٱلسَّیِّئَةَ أُو۟لَـٰۤىِٕكَ لَهُمۡ عُقۡبَى ٱلدَّارِ\n"
    }
  },
  {
    "id": 1730,
    "surahId": 13,
    "ayahNumber": 23,
    "arabicText": "جَنَّـٰتُ عَدۡنࣲ یَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَاۤىِٕهِمۡ وَأَزۡوَ ٰ⁠جِهِمۡ وَذُرِّیَّـٰتِهِمۡۖ وَٱلۡمَلَـٰۤىِٕكَةُ یَدۡخُلُونَ عَلَیۡهِم مِّن كُلِّ بَابࣲ\n",
    "translations": {
      "en": "gardens of perpetual bliss, which they shall enter together with the righteous from among their parents, their spouses, and their offspring; and the angels will come unto them from every gate [and will say]:",
      "ms": "Iaitu Syurga yang kekal yang mereka akan memasukinya bersama-sama orang-orang yang mengerjakan amal soleh dari ibu bapa mereka dan isteri-isteri mereka serta anak-anak mereka; sedang malaikat-malaikat pula akan masuk kepada mereka dari tiap-tiap pintu; -",
      "id": "(yaitu) surga 'Adn yang mereka masuk ke dalamnya bersama-sama dengan orang-orang yang saleh dari bapak-bapaknya, isteri-isterinya dan anak cucunya, sedang malaikat-malaikat masuk ke tempat-tempat mereka dari semua pintu;",
      "ar": "جَنَّـٰتُ عَدۡنࣲ یَدۡخُلُونَهَا وَمَن صَلَحَ مِنۡ ءَابَاۤىِٕهِمۡ وَأَزۡوَ ٰ⁠جِهِمۡ وَذُرِّیَّـٰتِهِمۡۖ وَٱلۡمَلَـٰۤىِٕكَةُ یَدۡخُلُونَ عَلَیۡهِم مِّن كُلِّ بَابࣲ\n"
    }
  },
  {
    "id": 1731,
    "surahId": 13,
    "ayahNumber": 24,
    "arabicText": "سَلَـٰمٌ عَلَیۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ\n",
    "translations": {
      "en": "\"Peace be upon you, because you have persevered!\" How excellent, then, this fulfilment in the hereafter!",
      "ms": "(Memberi hormat dengan berkata): \"Selamat sejahteralah kamu berpanjangan, disebabkan kesabaran kamu. Maka amatlah baiknya balasan amal kamu di dunia dahulu.",
      "id": "(sambil mengucapkan): \"Salamun 'alaikum bima shabartum\". Maka alangkah baiknya tempat kesudahan itu.",
      "ar": "سَلَـٰمٌ عَلَیۡكُم بِمَا صَبَرۡتُمۡۚ فَنِعۡمَ عُقۡبَى ٱلدَّارِ\n"
    }
  },
  {
    "id": 1732,
    "surahId": 13,
    "ayahNumber": 25,
    "arabicText": "وَٱلَّذِینَ یَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِیثَـٰقِهِۦ وَیَقۡطَعُونَ مَاۤ أَمَرَ ٱللَّهُ بِهِۦۤ أَن یُوصَلَ وَیُفۡسِدُونَ فِی ٱلۡأَرۡضِ أُو۟لَـٰۤىِٕكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوۤءُ ٱلدَّارِ\n",
    "translations": {
      "en": "But as for those who break their bond with God after it has been established [in their nature], and cut asunder what God has bidden to be joined, and spread corruption on earth -their due is rejection [by God], and theirs is a most evil fate [in the life to come].",
      "ms": "Dan (sebaliknya) orang-orang yang merombak (mencabuli) perjanjian Allah sesudah diperteguhkannya dan memutuskan perkara-perkara yang disuruh oleh Allah supaya dihubungkan, serta mereka pula membuat kerosakan dan bencana di muka bumi, - mereka itu beroleh laknat, dan mereka pula beroleh balasan hari akhirat yang seburuk-buruknya.",
      "id": "Orang-orang yang merusak janji Allah setelah diikrarkan dengan teguh dan memutuskan apa-apa yang Allah perintahkan supaya dihubungkan dan mengadakan kerusakan di bumi, orang-orang itulah yang memperoleh kutukan dan bagi mereka tempat kediaman yang buruk (Jahannam).",
      "ar": "وَٱلَّذِینَ یَنقُضُونَ عَهۡدَ ٱللَّهِ مِنۢ بَعۡدِ مِیثَـٰقِهِۦ وَیَقۡطَعُونَ مَاۤ أَمَرَ ٱللَّهُ بِهِۦۤ أَن یُوصَلَ وَیُفۡسِدُونَ فِی ٱلۡأَرۡضِ أُو۟لَـٰۤىِٕكَ لَهُمُ ٱللَّعۡنَةُ وَلَهُمۡ سُوۤءُ ٱلدَّارِ\n"
    }
  },
  {
    "id": 1733,
    "surahId": 13,
    "ayahNumber": 26,
    "arabicText": "ٱللَّهُ یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ وَیَقۡدِرُۚ وَفَرِحُوا۟ بِٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَمَا ٱلۡحَیَوٰةُ ٱلدُّنۡیَا فِی ٱلۡـَٔاخِرَةِ إِلَّا مَتَـٰعࣱ\n",
    "translations": {
      "en": "GOD GRANTS abundant sustenance, or gives it in scant measure, unto whomever He wills; and they [who are given abundance] rejoice in the life of this world - even though, as compared with the life to come, the life of this world is nought but -a fleeting pleasure.",
      "ms": "Allah memewahkan rezeki bagi sesiapa yang dikehendakiNya, dan Ia juga yang menyempitkannya. Dan mereka (yang ingkar): bergembira dengan kehidupan dunia, sedang kehidupan dunia itu tidak lain, hanyalah kesenangan yang kecil dan tidak, kekal berbanding dengan kesenangan hari akhirat.",
      "id": "Allah meluaskan rezeki dan menyempitkannya bagi siapa yang Dia kehendaki. Mereka bergembira dengan kehidupan di dunia, padahal kehidupan dunia itu (dibanding dengan) kehidupan akhirat, hanyalah kesenangan (yang sedikit).",
      "ar": "ٱللَّهُ یَبۡسُطُ ٱلرِّزۡقَ لِمَن یَشَاۤءُ وَیَقۡدِرُۚ وَفَرِحُوا۟ بِٱلۡحَیَوٰةِ ٱلدُّنۡیَا وَمَا ٱلۡحَیَوٰةُ ٱلدُّنۡیَا فِی ٱلۡـَٔاخِرَةِ إِلَّا مَتَـٰعࣱ\n"
    }
  },
  {
    "id": 1734,
    "surahId": 13,
    "ayahNumber": 27,
    "arabicText": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ یُضِلُّ مَن یَشَاۤءُ وَیَهۡدِیۤ إِلَیۡهِ مَنۡ أَنَابَ\n",
    "translations": {
      "en": "NOW THOSE who are bent on denying the truth [of the Prophet's message] say, \"Why has no miraculous sign ever been bestowed upon him from on high by his Sustainer?\" Say: \"Behold, God lets go astray him who wills [to go astray], just as He guides unto Himself all who turn unto Him-",
      "ms": "Dan orang-orang yang kafir berkata: \"Mengapa tidak diturunkan kepada (Muhammad) satu mukjizat dari Tuhannya? \"Katakanlah (wahai Muhammad): \"Sesungguhnya Allah menyesatkan sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya), dan memberi petunjuk ke jalan ugamanya, sesiapa yang rujuk kepadaNya, -",
      "id": "Orang-orang kafir berkata: \"Mengapa tidak diturunkan kepadanya (Muhammad) tanda (mukjizat) dari Tuhannya?\" Katakanlah: \"Sesungguhnya Allah menyesatkan siapa yang Dia kehendaki dan menunjuki orang-orang yang bertaubat kepada-Nya\",",
      "ar": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَوۡلَاۤ أُنزِلَ عَلَیۡهِ ءَایَةࣱ مِّن رَّبِّهِۦۚ قُلۡ إِنَّ ٱللَّهَ یُضِلُّ مَن یَشَاۤءُ وَیَهۡدِیۤ إِلَیۡهِ مَنۡ أَنَابَ\n"
    }
  },
  {
    "id": 1735,
    "surahId": 13,
    "ayahNumber": 28,
    "arabicText": "ٱلَّذِینَ ءَامَنُوا۟ وَتَطۡمَىِٕنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَىِٕنُّ ٱلۡقُلُوبُ\n",
    "translations": {
      "en": "those who believe, and whose hearts find their rest in the remembrance of God - for, verily, in the remembrance of God [men's] hearts do find their rest-:",
      "ms": "\"(Iaitu) orang-orang yang beriman dan tenang tenteram hati mereka dengan zikrullah\". Ketahuilah dengan \"zikrullah\" itu, tenang tenteramlah hati manusia.",
      "id": "(yaitu) orang-orang yang beriman dan hati mereka manjadi tenteram dengan mengingat Allah. Ingatlah, hanya dengan mengingati Allah-lah hati menjadi tenteram.",
      "ar": "ٱلَّذِینَ ءَامَنُوا۟ وَتَطۡمَىِٕنُّ قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَىِٕنُّ ٱلۡقُلُوبُ\n"
    }
  },
  {
    "id": 1736,
    "surahId": 13,
    "ayahNumber": 29,
    "arabicText": "ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَـَٔابࣲ\n",
    "translations": {
      "en": "[and so it is that] they who attain to faith and do righteous deeds are destined for happiness [in this world] and the most beauteous of all goals [in the life to come]!\"",
      "ms": "Orang-orang yang beriman dan beramal soleh, beroleh kebahagiaan yang amat mengembirakan dan tempat kembali yang sebaik-baiknya.",
      "id": "Orang-orang yang beriman dan beramal saleh, bagi mereka kebahagiaan dan tempat kembali yang baik.",
      "ar": "ٱلَّذِینَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ طُوبَىٰ لَهُمۡ وَحُسۡنُ مَـَٔابࣲ\n"
    }
  },
  {
    "id": 1737,
    "surahId": 13,
    "ayahNumber": 30,
    "arabicText": "كَذَ ٰ⁠لِكَ أَرۡسَلۡنَـٰكَ فِیۤ أُمَّةࣲ قَدۡ خَلَتۡ مِن قَبۡلِهَاۤ أُمَمࣱ لِّتَتۡلُوَا۟ عَلَیۡهِمُ ٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ وَهُمۡ یَكۡفُرُونَ بِٱلرَّحۡمَـٰنِۚ قُلۡ هُوَ رَبِّی لَاۤ إِلَـٰهَ إِلَّا هُوَ عَلَیۡهِ تَوَكَّلۡتُ وَإِلَیۡهِ مَتَابِ\n",
    "translations": {
      "en": "Thus have We raised thee [O Muhammad] as Our Apostle amidst a community [of unbelievers] before whose time [similar] communities have come and gone, so that thou might propound to them what We have revealed unto thee: for [in their ignorance] they deny the Most Gracious! Say: \"He is my Sustainer. There is no deity save Him. In Him have I placed my trust, and unto Him is my recourse!\"",
      "ms": "Demikianlah, Kami utuskan engkau (wahai Muhammad) kepada satu umat yang telah lalu sebelumnya beberapa umat yang lain, supaya engkau membacakan kepada mereka Al-Quran yang Kami wahyukan kepadamu, sedang mereka kufur kepada (Allah) Ar-Rahman Katakanlah: \"Dia lah Tuhanku, tiada Tuhan (yang berhak disembah) melainkan Dia. KepadaNyalah aku berserah diri, dan kepadaNyalah tempat kembaliku (dan kamu semuanya)\".",
      "id": "Demikianlah, Kami telah mengutus kamu pada suatu umat yang sungguh telah berlalu beberapa umat sebelumnya, supaya kamu membacakan kepada mereka (Al Quran) yang Kami wahyukan kepadamu, padahal mereka kafir kepada Tuhan Yang Maha Pemurah. Katakanlah: \"Dialah Tuhanku tidak ada Tuhan selain Dia; hanya kepada-Nya aku bertawakkal dan hanya kepada-Nya aku bertaubat\".",
      "ar": "كَذَ ٰ⁠لِكَ أَرۡسَلۡنَـٰكَ فِیۤ أُمَّةࣲ قَدۡ خَلَتۡ مِن قَبۡلِهَاۤ أُمَمࣱ لِّتَتۡلُوَا۟ عَلَیۡهِمُ ٱلَّذِیۤ أَوۡحَیۡنَاۤ إِلَیۡكَ وَهُمۡ یَكۡفُرُونَ بِٱلرَّحۡمَـٰنِۚ قُلۡ هُوَ رَبِّی لَاۤ إِلَـٰهَ إِلَّا هُوَ عَلَیۡهِ تَوَكَّلۡتُ وَإِلَیۡهِ مَتَابِ\n"
    }
  },
  {
    "id": 1738,
    "surahId": 13,
    "ayahNumber": 31,
    "arabicText": "وَلَوۡ أَنَّ قُرۡءَانࣰا سُیِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِیعًاۗ أَفَلَمۡ یَا۟یۡـَٔسِ ٱلَّذِینَ ءَامَنُوۤا۟ أَن لَّوۡ یَشَاۤءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِیعࣰاۗ وَلَا یَزَالُ ٱلَّذِینَ كَفَرُوا۟ تُصِیبُهُم بِمَا صَنَعُوا۟ قَارِعَةٌ أَوۡ تَحُلُّ قَرِیبࣰا مِّن دَارِهِمۡ حَتَّىٰ یَأۡتِیَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا یُخۡلِفُ ٱلۡمِیعَادَ\n",
    "translations": {
      "en": "Yet even if [they should listen to] a [divine] discourse by which mountains could be moved, or the earth cleft asunder, or the dead made to speak - [they who are bent on denying the truth would still refuse to believe in it]! Nay, but God alone has the power to decide what shall be. Have, then, they who have attained to faith not yet come to know that, had God so willed; He would indeed have guided all mankind aright? But as for those who are bent on denying the truth-in result of their [evil] deeds, sudden calamities will always befall them or will alight close to their homes; [and this will continue] until God's promise [of resurrection] is fulfilled: verily, God never fails to fulfil His promise!",
      "ms": "Dan kalaulah ada mana-mana Kitab Suci yang dengan sebabnya gunung-ganang terbongkar bergerak dari tempatnya, atau dengan sebabnya bumi dipecah-belah mengeluarkan isi kandungannya, atau dengan sebabnya orang-orang yang telah mati dapat menjawab kata-kata yang dihadapkan kepadanya, maka Al-Quran ialah Kitab Suci yang mengandungi mukjizat. (Tetapi lahirnya sesuatu mukjizat itu adalah menurut kehendak Allah), bahkan segala urusan tertentu bagi Allah. Maka tidakkah orang-orang yang beriman mengetahui bahawa kalaulah Allah menghendaki tentulah Ia memberi petunjuk kepada umat manusia seluruhnya, (lalu menjadikan mereka semuanya beriman). Dan orang-orang yang kafir itu (dengan sebab kekufuran mereka) sentiasa ditimpa bala bencana (ke atas diri atau harta benda mereka); atau pun bala bencana itu turun menimpa tempat-tempat yang berhampiran dengan tempat tinggal mereka (lalu menjadikan mereka gempar kecemasan), sehinggalah datang janji Allah (hari kiamat dan azabnya); Sesungguhnya Allah tidak memungkiri janjiNya.",
      "id": "Dan sekiranya ada suatu bacaan (kitab suci) yang dengan bacaan itu gunung-gunung dapat digoncangkan atau bumi jadi terbelah atau oleh karenanya orang-orang yang sudah mati dapat berbicara, (tentulah Al Quran itulah dia). Sebenarnya segala urusan itu adalah kepunyaan Allah. Maka tidakkah orang-orang yang beriman itu mengetahui bahwa seandainya Allah menghendaki (semua manusia beriman), tentu Allah memberi petunjuk kepada manusia semuanya. Dan orang-orang yang kafir senantiasa ditimpa bencana disebabkan perbuatan mereka sendiri atau bencana itu terjadi dekat tempat kediaman mereka, sehingga datanglah janji Allah. Sesungguhnya Allah tidak menyalahi janji.",
      "ar": "وَلَوۡ أَنَّ قُرۡءَانࣰا سُیِّرَتۡ بِهِ ٱلۡجِبَالُ أَوۡ قُطِّعَتۡ بِهِ ٱلۡأَرۡضُ أَوۡ كُلِّمَ بِهِ ٱلۡمَوۡتَىٰۗ بَل لِّلَّهِ ٱلۡأَمۡرُ جَمِیعًاۗ أَفَلَمۡ یَا۟یۡـَٔسِ ٱلَّذِینَ ءَامَنُوۤا۟ أَن لَّوۡ یَشَاۤءُ ٱللَّهُ لَهَدَى ٱلنَّاسَ جَمِیعࣰاۗ وَلَا یَزَالُ ٱلَّذِینَ كَفَرُوا۟ تُصِیبُهُم بِمَا صَنَعُوا۟ قَارِعَةٌ أَوۡ تَحُلُّ قَرِیبࣰا مِّن دَارِهِمۡ حَتَّىٰ یَأۡتِیَ وَعۡدُ ٱللَّهِۚ إِنَّ ٱللَّهَ لَا یُخۡلِفُ ٱلۡمِیعَادَ\n"
    }
  },
  {
    "id": 1739,
    "surahId": 13,
    "ayahNumber": 32,
    "arabicText": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلࣲ مِّن قَبۡلِكَ فَأَمۡلَیۡتُ لِلَّذِینَ كَفَرُوا۟ ثُمَّ أَخَذۡتُهُمۡۖ فَكَیۡفَ كَانَ عِقَابِ\n",
    "translations": {
      "en": "And, indeed, [even] before thy time have [God's] apostles been derided, and for a while I gave rein to those who were [thus] bent on denying the truth: but then I took them to task - and how awesome was My retribution!",
      "ms": "Dan sesungguhnya telahpun diejek-ejekkan Rasul-rasul yang diutus sebelummu (wahai Muhammad), lalu aku biarkan orang-orang yang tidak percayakan Rasul-rasul itu ke suatu masa yang tertentu, kemudian Aku menimpakan mereka dengan azab; maka tidaklah terperi seksanya azabKu itu.",
      "id": "Dan sesungguhnya telah diperolok-olokkan beberapa rasul sebelum kamu, maka Aku beri tangguh kepada orang-orang kafir itu kemudian Aku binasakan mereka. Alangkah hebatnya siksaan-Ku itu!",
      "ar": "وَلَقَدِ ٱسۡتُهۡزِئَ بِرُسُلࣲ مِّن قَبۡلِكَ فَأَمۡلَیۡتُ لِلَّذِینَ كَفَرُوا۟ ثُمَّ أَخَذۡتُهُمۡۖ فَكَیۡفَ كَانَ عِقَابِ\n"
    }
  },
  {
    "id": 1740,
    "surahId": 13,
    "ayahNumber": 33,
    "arabicText": "أَفَمَنۡ هُوَ قَاۤىِٕمٌ عَلَىٰ كُلِّ نَفۡسِۭ بِمَا كَسَبَتۡۗ وَجَعَلُوا۟ لِلَّهِ شُرَكَاۤءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّـُٔونَهُۥ بِمَا لَا یَعۡلَمُ فِی ٱلۡأَرۡضِ أَم بِظَـٰهِرࣲ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُیِّنَ لِلَّذِینَ كَفَرُوا۟ مَكۡرُهُمۡ وَصُدُّوا۟ عَنِ ٱلسَّبِیلِۗ وَمَن یُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادࣲ\n",
    "translations": {
      "en": "IS, THEN, HE who has every living being in His almighty care, [dealing with each] according to what it deserves -[is, then, He like anything else that exists]? And yet, they ascribe to other beings a share in God's divinity! Say: \"Give them any name [you please]: but do you [really think that you could] inform Him of anything on earth that He does not know-or [do you] but play with words?, Nay, goodly seems their false imagery to those who are bent on denying the truth, and so they are turned away from the [right] path: and he whom God lets go astray can never find any guide.",
      "ms": "Setelah diketahui demikian maka tidaklah patut disamakan Allah Tuhan yang berkuasa mengawas, tiap-tiap diri dan mengetahui akan apa yang telah diusahakan oleh diri-diri itu, (dengan makhluk yang tidak bersifat demikian). Dalam pada itu, mereka yang kafir telah menjadikan beberapa makhluk sebagai sekutu bagi Allah. Katakanlah (wahai Muhammad): \"Namakanlah kamu akan mereka (yang kamu sembah itu). Atau adakah kamu hendak memberi tahu kepada Allah akan apa yang tidak diketahuiNya di bumi? Atau adakah kamu menamakannya dengan kata-kata yang lahir (sedang pada hakikatnya tidak demikian)?\" Bahkan sebenarnya telah diperhiaskan oleh Iblis bagi orang-orang yang kafir itu akan kekufuran dan tipu daya mereka (terhadap Islam), dan mereka pula disekat oleh hawa nafsu mereka daripada menurut jalan yang benar. Dan (ingatlah) sesiapa yang disesatkan oleh Allah (dengan pilihannya yang salah) maka tidak ada sesiapapun yang dapat memberi hidayah petunjuk kepadanya.",
      "id": "Maka apakah Tuhan yang menjaga setiap diri terhadap apa yang diperbuatnya (sama dengan yang tidak demikian sifatnya)? Mereka menjadikan beberapa sekutu bagi Allah. Katakanlah: \"Sebutkanlah sifat-sifat mereka itu\". Atau apakah kamu hendak memberitakan kepada Allah apa yang tidak diketahui-Nya di bumi, atau kamu mengatakan (tentang hal itu) sekadar perkataan pada lahirnya saja. Sebenarnya orang-orang kafir itu dijadikan (oleh syaitan) memandang baik tipu daya mereka dan dihalanginya dari jalan (yang benar). Dan barangsiapa yang disesatkan Allah, maka baginya tak ada seorangpun yang akan memberi petunjuk.",
      "ar": "أَفَمَنۡ هُوَ قَاۤىِٕمٌ عَلَىٰ كُلِّ نَفۡسِۭ بِمَا كَسَبَتۡۗ وَجَعَلُوا۟ لِلَّهِ شُرَكَاۤءَ قُلۡ سَمُّوهُمۡۚ أَمۡ تُنَبِّـُٔونَهُۥ بِمَا لَا یَعۡلَمُ فِی ٱلۡأَرۡضِ أَم بِظَـٰهِرࣲ مِّنَ ٱلۡقَوۡلِۗ بَلۡ زُیِّنَ لِلَّذِینَ كَفَرُوا۟ مَكۡرُهُمۡ وَصُدُّوا۟ عَنِ ٱلسَّبِیلِۗ وَمَن یُضۡلِلِ ٱللَّهُ فَمَا لَهُۥ مِنۡ هَادࣲ\n"
    }
  },
  {
    "id": 1741,
    "surahId": 13,
    "ayahNumber": 34,
    "arabicText": "لَّهُمۡ عَذَابࣱ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۖ وَلَعَذَابُ ٱلۡـَٔاخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقࣲ\n",
    "translations": {
      "en": "For such, there is suffering in the life of this world; but, truly, [their] suffering in the life to come will be harder still, and they will have none to shield them from God.",
      "ms": "Mereka beroleh azab dalam kehidupan dunia, dan sesungguhnya azab hari akhirat lebih menyeksakan lagi; dan tiadalah bagi mereka, sesiapapun yang dapat melindungi mereka dari azab Allah itu.",
      "id": "Bagi mereka azab dalam kehidupan dunia dan sesungguhnya azab akhirat adalah lebih keras dan tak ada bagi mereka seorang pelindungpun dari (azab) Allah.",
      "ar": "لَّهُمۡ عَذَابࣱ فِی ٱلۡحَیَوٰةِ ٱلدُّنۡیَاۖ وَلَعَذَابُ ٱلۡـَٔاخِرَةِ أَشَقُّۖ وَمَا لَهُم مِّنَ ٱللَّهِ مِن وَاقࣲ\n"
    }
  },
  {
    "id": 1742,
    "surahId": 13,
    "ayahNumber": 35,
    "arabicText": "۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِی وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ أُكُلُهَا دَاۤىِٕمࣱ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِینَ ٱتَّقَوا۟ۚ وَّعُقۡبَى ٱلۡكَـٰفِرِینَ ٱلنَّارُ\n",
    "translations": {
      "en": "THE PARABLE of the paradise promised to those who are conscious of God [is that of a garden] through which running waters flow: [but, unlike an earthly garden,] its fruits will be everlasting, and [so will be] its shade. Such will be the destiny of those who remain conscious of God-just as the destiny of those who deny the truth will be the fire.",
      "ms": "Sifat Syurga yang dijanjikan kepada orang-orang yang bertaqwa itu ialah air sungai-sungainya sentiasa mengalir di sekitar tamannya; makanannya kekal tidak putus-putus dan naungannya sentiasa teduh. Itulah kesudahan usaha orang-orang yang bertaqwa, sedang kesudahan usaha orang-orang yang kafir pula ialah neraka.",
      "id": "Perumpamaan surga yang dijanjikan kepada orang-orang yang takwa ialah (seperti taman); mengalir sungai-sungai di dalamnya; buahnya tak henti-henti sedang naungannya (demikian pula). Itulah tempat kesudahan bagi orang-orang yang bertakwa, sedang tempat kesudahan bagi orang-orang kafir ialah neraka.",
      "ar": "۞ مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِی وُعِدَ ٱلۡمُتَّقُونَۖ تَجۡرِی مِن تَحۡتِهَا ٱلۡأَنۡهَـٰرُۖ أُكُلُهَا دَاۤىِٕمࣱ وَظِلُّهَاۚ تِلۡكَ عُقۡبَى ٱلَّذِینَ ٱتَّقَوا۟ۚ وَّعُقۡبَى ٱلۡكَـٰفِرِینَ ٱلنَّارُ\n"
    }
  },
  {
    "id": 1743,
    "surahId": 13,
    "ayahNumber": 36,
    "arabicText": "وَٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ یَفۡرَحُونَ بِمَاۤ أُنزِلَ إِلَیۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن یُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَاۤ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَاۤ أُشۡرِكَ بِهِۦۤۚ إِلَیۡهِ أَدۡعُوا۟ وَإِلَیۡهِ مَـَٔابِ\n",
    "translations": {
      "en": "Hence, they unto whom We have vouchsafed this revelation rejoice at all that has been bestowed upon thee [O Prophet] from on high; but among the followers of other creeds there are such as deny the validity of some of it. Say [unto them, O Prophet]: \"I have only been bidden to worship God, and not to ascribe divine. powers to aught beside Him: unto Him do I call [all mankind], and He is my goal!\"",
      "ms": "Dan orang-orang yang Kami berikan Kitab, mereka bersukacita dengan apa yang Kami turunkan kepadamu (wahai Muhammad) dan di antara beberapa kumpulan dari orang-orang itu ada yang mengingkari sebahagiannya. Katakanlah: \"Sesungguhnya aku hanya diperintahkan supaya menyembah Allah, dan supaya aku tidak mempersekutukanNya dengan sesuatu yang lain: kepadaNyalah aku menyeru (manusia semuanya untuk menyembahNya), dan kepadaNyalah tempat kembaliku (dan kamu semuanya untuk menerima balasan)\".",
      "id": "Orang-orang yang telah Kami berikan kitab kepada mereka bergembira dengan kitab yang diturunkan kepadamu, dan di antara golongan-golongan (Yahudi dan Nasrani) yang bersekutu, ada yang mengingkari sebahagiannya. Katakanlah \"Sesungguhnya aku hanya diperintah untuk menyembah Allah dan tidak mempersekutukan sesuatupun dengan Dia. Hanya kepada-Nya aku seru (manusia) dan hanya kepada-Nya aku kembali\".",
      "ar": "وَٱلَّذِینَ ءَاتَیۡنَـٰهُمُ ٱلۡكِتَـٰبَ یَفۡرَحُونَ بِمَاۤ أُنزِلَ إِلَیۡكَۖ وَمِنَ ٱلۡأَحۡزَابِ مَن یُنكِرُ بَعۡضَهُۥۚ قُلۡ إِنَّمَاۤ أُمِرۡتُ أَنۡ أَعۡبُدَ ٱللَّهَ وَلَاۤ أُشۡرِكَ بِهِۦۤۚ إِلَیۡهِ أَدۡعُوا۟ وَإِلَیۡهِ مَـَٔابِ\n"
    }
  },
  {
    "id": 1744,
    "surahId": 13,
    "ayahNumber": 37,
    "arabicText": "وَكَذَ ٰ⁠لِكَ أَنزَلۡنَـٰهُ حُكۡمًا عَرَبِیࣰّاۚ وَلَىِٕنِ ٱتَّبَعۡتَ أَهۡوَاۤءَهُم بَعۡدَ مَا جَاۤءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِیࣲّ وَلَا وَاقࣲ\n",
    "translations": {
      "en": "Thus, then, have We bestowed from on high this [divine writ] as an ordinance in the Arabic tongue. And, indeed, if thou shouldst defer to men's likes and dislikes after all the [divine] knowledge that has come unto thee, thou wouldst have none to protect thee from God, and none to shield thee [from Him].",
      "ms": "Dan demikianlah Kami menurunkan Al-Quran sebagai hukum dalam bahasa Arab. Dan demi sesungguhnya, jika engkau (wahai Muhammad) menurut kehendak hawa nafsu mereka sesudah datangnya kepadamu wahyu pengetahuan (tentang kebenaran), maka tiadalah engkau peroleh dari Allah sesuatupun yang dapat mengawal dan memberi perlindungan kepadamu (dari perkara-perkara yang tidak diingini).",
      "id": "Dan demikianlah, Kami telah menurunkan Al Quran itu sebagai peraturan (yang benar) dalam bahasa Arab. Dan seandainya kamu mengikuti hawa nafsu mereka setelah datang pengetahuan kepadamu, maka sekali-kali tidak ada pelindung dan pemelihara bagimu terhadap (siksa) Allah.",
      "ar": "وَكَذَ ٰ⁠لِكَ أَنزَلۡنَـٰهُ حُكۡمًا عَرَبِیࣰّاۚ وَلَىِٕنِ ٱتَّبَعۡتَ أَهۡوَاۤءَهُم بَعۡدَ مَا جَاۤءَكَ مِنَ ٱلۡعِلۡمِ مَا لَكَ مِنَ ٱللَّهِ مِن وَلِیࣲّ وَلَا وَاقࣲ\n"
    }
  },
  {
    "id": 1745,
    "surahId": 13,
    "ayahNumber": 38,
    "arabicText": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلࣰا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَ ٰ⁠جࣰا وَذُرِّیَّةࣰۚ وَمَا كَانَ لِرَسُولٍ أَن یَأۡتِیَ بِـَٔایَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلࣲ كِتَابࣱ\n",
    "translations": {
      "en": "And, truly, We sent forth apostles before thee, and We appointed for them wives and offspring; and it was not given to any apostle to produce a miracle save at God's behest. Every age has had its revelation:",
      "ms": "Dan demi sesungguhnya! Kami telah mengutus Rasul-rasul sebelummu, dan Kami jadikan untuk mereka isteri-isteri dan zuriat keturunan. Dan tiadalah sebarang kuasa bagi seseorang Rasul untuk mendatangkan sesuatu mukjizat melainkan dengan izin Allah. Tiap-tiap satu tempoh dan waktu ada baginya perkara dan hukum yang telah ditentukan oleh \"Suratan Azali\".",
      "id": "Dan sesungguhnya Kami telah mengutus beberapa Rasul sebelum kamu dan Kami memberikan kepada mereka isteri-isteri dan keturunan. Dan tidak ada hak bagi seorang Rasul mendatangkan sesuatu ayat (mukjizat) melainkan dengan izin Allah. Bagi tiap-tiap masa ada Kitab (yang tertentu).",
      "ar": "وَلَقَدۡ أَرۡسَلۡنَا رُسُلࣰا مِّن قَبۡلِكَ وَجَعَلۡنَا لَهُمۡ أَزۡوَ ٰ⁠جࣰا وَذُرِّیَّةࣰۚ وَمَا كَانَ لِرَسُولٍ أَن یَأۡتِیَ بِـَٔایَةٍ إِلَّا بِإِذۡنِ ٱللَّهِۗ لِكُلِّ أَجَلࣲ كِتَابࣱ\n"
    }
  },
  {
    "id": 1746,
    "surahId": 13,
    "ayahNumber": 39,
    "arabicText": "یَمۡحُوا۟ ٱللَّهُ مَا یَشَاۤءُ وَیُثۡبِتُۖ وَعِندَهُۥۤ أُمُّ ٱلۡكِتَـٰبِ\n",
    "translations": {
      "en": "God annuls or confirms whatever He wills [of His earlier messages] -for with Him is the source of all revelation.",
      "ms": "Allah menghapuskan apa jua yang dikehendakiNya dan Ia juga menetapkan apa jua yang dikehendakinya. Dan (ingatlah) pada sisiNya ada \"Ibu segala suratan\".",
      "id": "Allah menghapuskan apa yang Dia kehendaki dan menetapkan (apa yang Dia kehendaki), dan di sisi-Nya-lah terdapat Ummul-Kitab (Lauh mahfuzh).",
      "ar": "یَمۡحُوا۟ ٱللَّهُ مَا یَشَاۤءُ وَیُثۡبِتُۖ وَعِندَهُۥۤ أُمُّ ٱلۡكِتَـٰبِ\n"
    }
  },
  {
    "id": 1747,
    "surahId": 13,
    "ayahNumber": 40,
    "arabicText": "وَإِن مَّا نُرِیَنَّكَ بَعۡضَ ٱلَّذِی نَعِدُهُمۡ أَوۡ نَتَوَفَّیَنَّكَ فَإِنَّمَا عَلَیۡكَ ٱلۡبَلَـٰغُ وَعَلَیۡنَا ٱلۡحِسَابُ\n",
    "translations": {
      "en": "BUT WHETHER We let thee see [in thy lifetime, O Prophet, the fulfilment of] some of what We have promised them, or whether We cause thee to die [before its fulfilment] - thy duty is no more than to deliver the message; and the reckoning is Ours.",
      "ms": "Sama ada Kami perlihatkan kepadamu (wahai Muhammad) sebahagian dari azab yang Kami janjikan untuk mereka (yang ingkar) atau kami wafatkanmu sebelum melihatnya maka tidaklah menjadi hal kerana tanggunganmu hanyalah menyampaikan hukum-hukum yang kami turunkan kepadamu; dan urusan Kami menghitung dan membalas amal mereka.",
      "id": "Dan jika Kami perlihatkan kepadamu sebahagian (siksa) yang Kami ancamkan kepada mereka atau Kami wafatkan kamu (hal itu tidak penting bagimu) karena sesungguhnya tugasmu hanya menyampaikan saja, sedang Kami-lah yang menghisab amalan mereka.",
      "ar": "وَإِن مَّا نُرِیَنَّكَ بَعۡضَ ٱلَّذِی نَعِدُهُمۡ أَوۡ نَتَوَفَّیَنَّكَ فَإِنَّمَا عَلَیۡكَ ٱلۡبَلَـٰغُ وَعَلَیۡنَا ٱلۡحِسَابُ\n"
    }
  },
  {
    "id": 1748,
    "surahId": 13,
    "ayahNumber": 41,
    "arabicText": "أَوَلَمۡ یَرَوۡا۟ أَنَّا نَأۡتِی ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ یَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِیعُ ٱلۡحِسَابِ\n",
    "translations": {
      "en": "Have, then, they [who deny the truth] never yet seen how We visit the earth [with Our punishment], gradually depriving it of all that is best thereon? For, [when] God judges, there is no power that could repel His judgment: and swift in reckoning is He!",
      "ms": "Mengapa mereka yang kafir itu masih berdegil dan tidak mahu memerhatikan bahawa kekuasaan kami sentiasa menakluk bumi (yang mereka diami) dengan menjadikan dia kurang sedikit demi sedikit dari kebaikannya dan kemuliaannya? Dan (ingatlah) Allah menghukum menurut apa yang dikehendakiNya; tiada sesiapapun yang dapat menghalang hukumNya, dan dia lah juga yang amat cepat hitungan hisabNya.",
      "id": "Dan apakah mereka tidak melihat bahwa sesungguhnya Kami mendatangi daerah-daerah (orang-orang kafir), lalu Kami kurangi daerah-daerah itu (sedikit demi sedikit) dari tepi-tepinya? Dan Allah menetapkan hukum (menurut kehendak-Nya), tidak ada yang dapat menolak ketetapan-Nya; dan Dialah Yang Maha cepat hisab-Nya.",
      "ar": "أَوَلَمۡ یَرَوۡا۟ أَنَّا نَأۡتِی ٱلۡأَرۡضَ نَنقُصُهَا مِنۡ أَطۡرَافِهَاۚ وَٱللَّهُ یَحۡكُمُ لَا مُعَقِّبَ لِحُكۡمِهِۦۚ وَهُوَ سَرِیعُ ٱلۡحِسَابِ\n"
    }
  },
  {
    "id": 1749,
    "surahId": 13,
    "ayahNumber": 42,
    "arabicText": "وَقَدۡ مَكَرَ ٱلَّذِینَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِیعࣰاۖ یَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسࣲۗ وَسَیَعۡلَمُ ٱلۡكُفَّـٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ\n",
    "translations": {
      "en": "Now those who lived before these [sinners] did, too, devise many a blasphemy -but the most subtle devising is that of God, who knows what each human being deserves: and the deniers of the truth will [in time] come to know to whom the future belongs.",
      "ms": "Dan sesungguhnya orang-orang kafir yang sebelum mereka telah melancarkan rancangan jahat (terhadap Nabi-nabi mereka): oleh itu, (janganlah engkau bimbang kerana) bagi Allah jualah kuasa menggagalkan segala jenis rancangan jahat. Ia mengetahui apa yang diusahakan oleh tiap-tiap diri; dan orang-orang yang kafir akan mengetahui bagi siapakah balasan (yang baik dan yang buruk) pada hari akhirat kelak.",
      "id": "Dan sungguh orang-orang kafir yang sebelum mereka (kafir Mekah) telah mengadakan tipu daya, tetapi semua tipu daya itu adalah dalam kekuasaan Allah. Dia mengetahui apa yang diusahakan oleh setiap diri, dan orang-orang kafir akan mengetahui untuk siapa tempat kesudahan (yang baik) itu.",
      "ar": "وَقَدۡ مَكَرَ ٱلَّذِینَ مِن قَبۡلِهِمۡ فَلِلَّهِ ٱلۡمَكۡرُ جَمِیعࣰاۖ یَعۡلَمُ مَا تَكۡسِبُ كُلُّ نَفۡسࣲۗ وَسَیَعۡلَمُ ٱلۡكُفَّـٰرُ لِمَنۡ عُقۡبَى ٱلدَّارِ\n"
    }
  },
  {
    "id": 1750,
    "surahId": 13,
    "ayahNumber": 43,
    "arabicText": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَسۡتَ مُرۡسَلࣰاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِیدَۢا بَیۡنِی وَبَیۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَـٰبِ\n",
    "translations": {
      "en": "And [if] they who are bent on denying the truth say [unto thee, O Prophet], \"Thou hast not been sent [by God]\", say thou: \"None can bear witness between me and you as God does; and [none can bear witness as does] he who truly understands this divine writ.",
      "ms": "Dan orang-orang yang kafir itu berkata: \"Engkau bukanlah seorang Rasul dari Allah\". Katakanlah (kepada mereka): \"Cukuplah Allah menjadi saksi antaraku dengan kamu, dan juga disaksikan oleh orang-orang yang ada ilmu pengetahuan mengenai Kitab Allah\".",
      "id": "Berkatalah orang-orang kafir: \"Kamu bukan seorang yang dijadikan Rasul\". Katakanlah: \"Cukuplah Allah menjadi saksi antaraku dan kamu, dan antara orang yang mempunyai ilmu Al Kitab\".",
      "ar": "وَیَقُولُ ٱلَّذِینَ كَفَرُوا۟ لَسۡتَ مُرۡسَلࣰاۚ قُلۡ كَفَىٰ بِٱللَّهِ شَهِیدَۢا بَیۡنِی وَبَیۡنَكُمۡ وَمَنۡ عِندَهُۥ عِلۡمُ ٱلۡكِتَـٰبِ\n"
    }
  }
]